
ElvCharacterDB = {
	["ConvertKeybindings"] = true,
	["ChatEditHistory"] = {
	},
	["ChatHistoryLog"] = {
		{
			"武器十字25/15敏5伤30伤烈焰冰霜 披风3敏15火炕5全抗70护甲 盾牌7耐 鞋子7耐7敏5精移速 胸甲百血蓝3属性 护腕24治9力9耐9精7智  手套7敏双采 出哈卡BUFF500", -- [1]
			"小脚是豆皮-伊弗斯", -- [2]
			"", -- [3]
			"1. 综合 - 暴风城", -- [4]
			"小脚是豆皮", -- [5]
			"", -- [6]
			1, -- [7]
			1, -- [8]
			"综合 - 暴风城", -- [9]
			0, -- [10]
			19246, -- [11]
			"Player-5300-004FA87C", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cffc69b6d小脚是豆皮|r",
			[51] = 1690218468,
			[50] = "CHAT_MSG_CHANNEL",
		}, -- [1]
		{
			"十字军5伤30法伤15敏25敏寒冰烈焰/护腕24治疗9耐9力9精神7智耐/手套20火焰暗影2威胁15敏7力敏攻速骑乘剥皮采矿草药/胸4 3属性100血蓝/鞋7敏耐5精移速/盾7耐9精披风3敏5抗15火炕自然狡诈潜行=收宝箱", -- [1]
			"清水煮茶-伊弗斯", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"清水煮茶", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19247, -- [11]
			"Player-5300-004DF30A", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cffc69b6d清水煮茶|r",
			[51] = 1690218420,
			[50] = "CHAT_MSG_YELL",
		}, -- [2]
		{
			"武器25敏22智30法55治疗15敏22精神 十字 冰寒灼热伤护腕9耐7智 24治疗 衣服4属性100生命法力3属性鞋子7耐7敏披速度风5抗3敏捷15火抗15自然10暗潜手套30治15敏20火威胁冰7力代冰川血藤野性冥河", -- [1]
			"首席残月-伊弗斯", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"首席残月", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19248, -- [11]
			"Player-5300-004CE740", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cfff48cba首席残月|r",
			[51] = 1690218422,
			[50] = "CHAT_MSG_YELL",
		}, -- [3]
		{
			"武器55治疗十字军22智5伤害15力量15敏20敏捷20精神冰寒灼热/护腕9耐9力量7智24治疗/披风3敏躲闪防御全抗5/手套威胁30治疗7敏捷7力量攻速暗火冰20/胸甲4/3属血蓝100/盾牌7耐9精全/鞋子敏捷7耐7移速", -- [1]
			"青青柠檬-伊弗斯", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"青青柠檬", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19249, -- [11]
			"Player-5300-004B0A47", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cff3fc6ea青青柠檬|r",
			[51] = 1690218423,
			[50] = "CHAT_MSG_YELL",
		}, -- [4]
		{
			"武器25敏22智30法55治疗15敏22精神 十字 冰寒灼热伤护腕9耐7智 24治疗 衣服4属性100生命法力3属性鞋子7耐7敏披速度风5抗3敏捷15火抗15自然10暗潜手套30治15敏20火威胁冰7力代冰川血藤野性之皮", -- [1]
			"小冰棍来咯-伊弗斯", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"小冰棍来咯", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19251, -- [11]
			"Player-5300-004B4495", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cff3fc6ea小冰棍来咯|r",
			[51] = 1690218424,
			[50] = "CHAT_MSG_YELL",
		}, -- [5]
		{
			"头腿附魔 1攻速，20火坑，8力量，需要得MMMM", -- [1]
			"玄甲-伊弗斯", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"玄甲", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19253, -- [11]
			"Player-5300-004D6EFC", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cfffff468玄甲|r",
			[51] = 1690218433,
			[50] = "CHAT_MSG_YELL",
		}, -- [6]
		{
			"猜   1---丨00", -- [1]
			"澳门鱼樂", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"澳门鱼樂", -- [5]
			"DND", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19254, -- [11]
			"Player-5300-0050A0DB", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cfff48cba澳门鱼樂|r",
			[51] = 1690218434,
			[50] = "CHAT_MSG_YELL",
		}, -- [7]
		{
			"55治疗十字军22智5伤害15力量15敏20敏捷20精神冰寒灼热/护腕9耐9力量7智24治疗/披风3敏躲闪防御全抗5/手套威胁30治疗7敏捷7力量攻速暗火冰20/胸甲4/3属血蓝100/盾牌7耐9精全/鞋子敏捷7耐7移速", -- [1]
			"青青柠檬-伊弗斯", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"青青柠檬", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19255, -- [11]
			"Player-5300-004B0A47", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cff3fc6ea青青柠檬|r",
			[51] = 1690218435,
			[50] = "CHAT_MSG_YELL",
		}, -- [8]
		{
			"ЯΟΟI点数  丫达小   来的M我打1进组 ", -- [1]
			"皇冠娱樂", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"皇冠娱樂", -- [5]
			"DND", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19259, -- [11]
			"Player-5300-004F6367", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cffc69b6d皇冠娱樂|r",
			[51] = 1690218441,
			[50] = "CHAT_MSG_YELL",
		}, -- [9]
		{
			"武器55治疗十字军22智5伤害15力量15敏20敏捷20精神冰寒灼热/护腕9耐9力量7智24治疗/披风3敏躲闪防御全抗5/手套威胁30治疗7敏捷7力量攻速暗火冰20/胸甲4/3属血蓝100/盾牌7耐9精全/鞋子敏捷7耐7移速", -- [1]
			"青青柠檬-伊弗斯", -- [2]
			"通用语", -- [3]
			"", -- [4]
			"青青柠檬", -- [5]
			"", -- [6]
			0, -- [7]
			0, -- [8]
			"", -- [9]
			7, -- [10]
			19278, -- [11]
			"Player-5300-004B0A47", -- [12]
			0, -- [13]
			false, -- [14]
			false, -- [15]
			false, -- [16]
			false, -- [17]
			[52] = "|cff3fc6ea青青柠檬|r",
			[51] = 1690218564,
			[50] = "CHAT_MSG_YELL",
		}, -- [10]
	},
}
