
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["TimeLast"] = {
				["TimeHeal"] = 30481.251,
				["OVERALL"] = 30485.252,
				["DamageTaken"] = 30485.252,
				["DeathCount"] = 30485.252,
				["Interrupts"] = 30473.251,
				["RageGain"] = 30478.251,
				["ActiveTime"] = 30485.252,
				["TimeDamage"] = 30485.252,
				["HealingTaken"] = 30481.251,
				["Healing"] = 30481.251,
				["DOT_Time"] = 30485.252,
				["Damage"] = 30485.252,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"HEAL", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"HEAL", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"MISC", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"HEAL", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"MISC", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					13.62, -- [1]
				},
				["Healing"] = {
					2974, -- [1]
				},
				["DamageTaken"] = {
					9901, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["RageGain"] = {
					37, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					43.63, -- [1]
				},
				["TimeDamage"] = {
					30.01, -- [1]
				},
				["HealingTaken"] = {
					2974, -- [1]
				},
				["DOT_Time"] = {
					18, -- [1]
				},
				["Damage"] = {
					11236, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						false, -- [30]
						false, -- [31]
						false, -- [32]
						true, -- [33]
						true, -- [34]
					},
					["Messages"] = {
						"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [1]
						"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -373 (Shadow)", -- [2]
						"特变电工 肉搏 Tomassalek Absorb -805 (805 被吸收) (1)", -- [3]
						"特变电工 拳击 Tomassalek Absorb -36 (36 被吸收) (Physical)", -- [4]
						"特变电工 interrupts Tomassalek 心灵震爆 (拳击)", -- [5]
						"Tomassalek 暗影守卫 特变电工 Hit -365 (Shadow)", -- [6]
						"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [7]
						"特变电工 断筋 Tomassalek Absorb -33 (33 被吸收) (Physical)", -- [8]
						"特变电工 肉搏 Tomassalek Absorb -174 (1)", -- [9]
						"特变电工 肉搏 Tomassalek Hit -250 (174 被吸收) (Physical)", -- [10]
						"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -374 (Shadow)", -- [11]
						"特变电工 重伤 (伤害/跳) Tomassalek Tick -100 (Physical)", -- [12]
						"特变电工 嗜血 Tomassalek Hit -333 (Physical)", -- [13]
						"特变电工 嗜血 特变电工 Hit +20", -- [14]
						"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [15]
						"特变电工 肉搏 Tomassalek Hit -365 (Physical)", -- [16]
						"特变电工 嗜血 特变电工 Hit +20", -- [17]
						"特变电工 重伤 (伤害/跳) Tomassalek Tick -100 (Physical)", -- [18]
						"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -323 (Shadow)", -- [19]
						"特变电工 旋风斩 Tomassalek Hit -358 (Physical)", -- [20]
						"特变电工 嗜血 特变电工 Hit +20", -- [21]
						"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [22]
						"特变电工 肉搏 Tomassalek Hit -371 (Physical)", -- [23]
						"特变电工 嗜血 特变电工 Hit +20", -- [24]
						"特变电工 重伤 (伤害/跳) Tomassalek Tick -100 (Physical)", -- [25]
						"Tomassalek 心灵震爆 特变电工 Hit -1081 (Shadow)", -- [26]
						"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -324 (Shadow)", -- [27]
						"特变电工 嗜血 Tomassalek Absorb -333 (333 被吸收) (Physical)", -- [28]
						"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [29]
						"特变电工 肉搏 Tomassalek Absorb -405 (405 被吸收) (1)", -- [30]
						"特变电工 肉搏 Tomassalek Absorb -22 (1)", -- [31]
						"特变电工 重伤 (伤害/跳) Tomassalek Tick -77 (22 被吸收) (Physical)", -- [32]
						"Tomassalek 精神鞭笞 (伤害/跳) 特变电工 Tick -314 (Shadow)", -- [33]
						"特变电工死亡。", -- [34]
					},
					["DeathAt"] = 30487.252,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["MessageTimes"] = {
						-13.58999999999651, -- [1]
						-12.47299999999814, -- [2]
						-12.25699999999779, -- [3]
						-12.25699999999779, -- [4]
						-12.25699999999779, -- [5]
						-12.07299999999668, -- [6]
						-10.58999999999651, -- [7]
						-10.27299999999741, -- [8]
						-9.539999999997235, -- [9]
						-9.539999999997235, -- [10]
						-9.472999999998137, -- [11]
						-9.222999999998137, -- [12]
						-8.77299999999741, -- [13]
						-8.748999999999796, -- [14]
						-7.589999999996508, -- [15]
						-6.855999999999767, -- [16]
						-6.839999999996508, -- [17]
						-6.222999999998137, -- [18]
						-5.222999999998137, -- [19]
						-5.055999999996857, -- [20]
						-5.03099999999904, -- [21]
						-4.589999999996508, -- [22]
						-4.15599999999904, -- [23]
						-4.139999999999418, -- [24]
						-3.222999999998137, -- [25]
						-2.52299999999741, -- [26]
						-2.238999999997759, -- [27]
						-2.105999999999767, -- [28]
						-1.572999999996682, -- [29]
						-0.6559999999990396, -- [30]
						-0.2229999999981374, -- [31]
						-0.2229999999981374, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["HealthMax"] = {
						7151, -- [1]
						7151, -- [2]
						7151, -- [3]
						7151, -- [4]
						7151, -- [5]
						7151, -- [6]
						7151, -- [7]
						7151, -- [8]
						7151, -- [9]
						7151, -- [10]
						7151, -- [11]
						7151, -- [12]
						7151, -- [13]
						7151, -- [14]
						7151, -- [15]
						7151, -- [16]
						7151, -- [17]
						7151, -- [18]
						7151, -- [19]
						7151, -- [20]
						7151, -- [21]
						7151, -- [22]
						7151, -- [23]
						7151, -- [24]
						7151, -- [25]
						7151, -- [26]
						7151, -- [27]
						7151, -- [28]
						7151, -- [29]
						7151, -- [30]
						7151, -- [31]
						7151, -- [32]
						7151, -- [33]
						6219, -- [34]
					},
					["Health"] = {
						4204, -- [1]
						3965, -- [2]
						3592, -- [3]
						3592, -- [4]
						3592, -- [5]
						3592, -- [6]
						3227, -- [7]
						2988, -- [8]
						2988, -- [9]
						2988, -- [10]
						2988, -- [11]
						2614, -- [12]
						2614, -- [13]
						2614, -- [14]
						2634, -- [15]
						2395, -- [16]
						2395, -- [17]
						2415, -- [18]
						2415, -- [19]
						2092, -- [20]
						2092, -- [21]
						2112, -- [22]
						1873, -- [23]
						1873, -- [24]
						1893, -- [25]
						1893, -- [26]
						812, -- [27]
						488, -- [28]
						488, -- [29]
						249, -- [30]
						249, -- [31]
						249, -- [32]
						249, -- [33]
						0, -- [34]
					},
					["KilledBy"] = "Tomassalek",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"MISC", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"HEAL", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"HEAL", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"HEAL", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"HEAL", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"MISC", -- [34]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "精神鞭笞 (伤害/跳)",
			["LastFightIn"] = 0,
			["type"] = "Self",
			["LastHealTime"] = 30481.551,
			["LastDamageTaken"] = 314,
			["LastEventHealth"] = {
				2614, -- [1]
				2614, -- [2]
				2634, -- [3]
				2395, -- [4]
				2395, -- [5]
				2415, -- [6]
				2415, -- [7]
				2092, -- [8]
				2092, -- [9]
				2112, -- [10]
				1873, -- [11]
				1873, -- [12]
				1893, -- [13]
				1893, -- [14]
				812, -- [15]
				488, -- [16]
				488, -- [17]
				249, -- [18]
				249, -- [19]
				249, -- [20]
				249, -- [21]
				0, -- [22]
				3260, -- [23]
				3260, -- [24]
				3260, -- [25]
				3260, -- [26]
				3280, -- [27]
				3060, -- [28]
				2747, -- [29]
				2595, -- [30]
				2282, -- [31]
				2082, -- [32]
				2082, -- [33]
				1370, -- [34]
				1048, -- [35]
				821, -- [36]
				2562, -- [37]
				4567, -- [38]
				4204, -- [39]
				3965, -- [40]
				3592, -- [41]
				3592, -- [42]
				3592, -- [43]
				3592, -- [44]
				3227, -- [45]
				2988, -- [46]
				2988, -- [47]
				2988, -- [48]
				2988, -- [49]
				2614, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				7151, -- [1]
				7151, -- [2]
				7151, -- [3]
				7151, -- [4]
				7151, -- [5]
				7151, -- [6]
				7151, -- [7]
				7151, -- [8]
				7151, -- [9]
				7151, -- [10]
				7151, -- [11]
				7151, -- [12]
				7151, -- [13]
				7151, -- [14]
				7151, -- [15]
				7151, -- [16]
				7151, -- [17]
				7151, -- [18]
				7151, -- [19]
				7151, -- [20]
				7151, -- [21]
				6219, -- [22]
				6219, -- [23]
				6219, -- [24]
				6219, -- [25]
				6219, -- [26]
				6219, -- [27]
				6219, -- [28]
				6219, -- [29]
				6219, -- [30]
				6219, -- [31]
				6219, -- [32]
				6219, -- [33]
				6219, -- [34]
				6219, -- [35]
				6219, -- [36]
				6219, -- [37]
				7151, -- [38]
				7151, -- [39]
				7151, -- [40]
				7151, -- [41]
				7151, -- [42]
				7151, -- [43]
				7151, -- [44]
				7151, -- [45]
				7151, -- [46]
				7151, -- [47]
				7151, -- [48]
				7151, -- [49]
				7151, -- [50]
			},
			["NextEventNum"] = 23,
			["LastDamageTime"] = 30485.468,
			["LastEvents"] = {
				"特变电工 嗜血 Tomassalek Hit -333 (Physical)", -- [1]
				"特变电工 嗜血 特变电工 Hit +20", -- [2]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [3]
				"特变电工 肉搏 Tomassalek Hit -365 (Physical)", -- [4]
				"特变电工 嗜血 特变电工 Hit +20", -- [5]
				"特变电工 重伤 (伤害/跳) Tomassalek Tick -100 (Physical)", -- [6]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -323 (Shadow)", -- [7]
				"特变电工 旋风斩 Tomassalek Hit -358 (Physical)", -- [8]
				"特变电工 嗜血 特变电工 Hit +20", -- [9]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [10]
				"特变电工 肉搏 Tomassalek Hit -371 (Physical)", -- [11]
				"特变电工 嗜血 特变电工 Hit +20", -- [12]
				"特变电工 重伤 (伤害/跳) Tomassalek Tick -100 (Physical)", -- [13]
				"Tomassalek 心灵震爆 特变电工 Hit -1081 (Shadow)", -- [14]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -324 (Shadow)", -- [15]
				"特变电工 嗜血 Tomassalek Absorb -333 (333 被吸收) (Physical)", -- [16]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [17]
				"特变电工 肉搏 Tomassalek Absorb -405 (405 被吸收) (1)", -- [18]
				"特变电工 肉搏 Tomassalek Absorb -22 (1)", -- [19]
				"特变电工 重伤 (伤害/跳) Tomassalek Tick -77 (22 被吸收) (Physical)", -- [20]
				"Tomassalek 精神鞭笞 (伤害/跳) 特变电工 Tick -314 (Shadow)", -- [21]
				"特变电工死亡。", -- [22]
				"Tomassalek 暗言术：痛 特变电工 Resist (Shadow)", -- [23]
				"特变电工 肉搏 暗一 Dodge (1)", -- [24]
				"特变电工 斩杀 暗一 Hit -1307 (Physical)", -- [25]
				"特变电工 嗜血 特变电工 Hit +20", -- [26]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -220 (Shadow)", -- [27]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -313 (Shadow)", -- [28]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -200 (Shadow)", -- [29]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -313 (Shadow)", -- [30]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -200 (Shadow)", -- [31]
				"特变电工 肉搏 Tomassalek Hit -294 (Physical)", -- [32]
				"抢先登录-老马布兰契 心灵震爆 特变电工 Hit -712 (Shadow)", -- [33]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -322 (Shadow)", -- [34]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -227 (Shadow)", -- [35]
				"特变电工 治疗药水 特变电工 Hit +1741", -- [36]
				"特变电工 生命赐福 特变电工 Hit +1073", -- [37]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -363 (Shadow)", -- [38]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [39]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -373 (Shadow)", -- [40]
				"特变电工 肉搏 Tomassalek Absorb -805 (805 被吸收) (1)", -- [41]
				"特变电工 拳击 Tomassalek Absorb -36 (36 被吸收) (Physical)", -- [42]
				"特变电工 interrupts Tomassalek 心灵震爆 (拳击)", -- [43]
				"Tomassalek 暗影守卫 特变电工 Hit -365 (Shadow)", -- [44]
				"抢先登录-老马布兰契 暗言术：痛 (伤害/跳) 特变电工 Tick -239 (Shadow)", -- [45]
				"特变电工 断筋 Tomassalek Absorb -33 (33 被吸收) (Physical)", -- [46]
				"特变电工 肉搏 Tomassalek Absorb -174 (1)", -- [47]
				"特变电工 肉搏 Tomassalek Hit -250 (174 被吸收) (Physical)", -- [48]
				"Tomassalek 暗言术：痛 (伤害/跳) 特变电工 Tick -374 (Shadow)", -- [49]
				"特变电工 重伤 (伤害/跳) Tomassalek Tick -100 (Physical)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				30476.918, -- [1]
				30476.942, -- [2]
				30478.101, -- [3]
				30478.835, -- [4]
				30478.851, -- [5]
				30479.468, -- [6]
				30480.468, -- [7]
				30480.635, -- [8]
				30480.66, -- [9]
				30481.101, -- [10]
				30481.535, -- [11]
				30481.551, -- [12]
				30482.468, -- [13]
				30483.168, -- [14]
				30483.452, -- [15]
				30483.585, -- [16]
				30484.118, -- [17]
				30485.035, -- [18]
				30485.468, -- [19]
				30485.468, -- [20]
				30485.691, -- [21]
				30485.691, -- [22]
				30456.7, -- [23]
				30456.817, -- [24]
				30456.987, -- [25]
				30456.987, -- [26]
				30458.6, -- [27]
				30461.217, -- [28]
				30461.617, -- [29]
				30464.217, -- [30]
				30464.601, -- [31]
				30466.05, -- [32]
				30466.851, -- [33]
				30467.218, -- [34]
				30467.601, -- [35]
				30467.901, -- [36]
				30468.634, -- [37]
				30470.218, -- [38]
				30472.101, -- [39]
				30473.218, -- [40]
				30473.434, -- [41]
				30473.434, -- [42]
				30473.434, -- [43]
				30473.618, -- [44]
				30475.101, -- [45]
				30475.418, -- [46]
				30476.151, -- [47]
				30476.151, -- [48]
				30476.218, -- [49]
				30476.468, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.73,
								},
								["嗜血"] = {
									["count"] = 11.39,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.62,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["暗一"] = {
									["count"] = 3,
								},
								["Tomassalek"] = {
									["count"] = 12,
								},
								["蒙小菲-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 18,
						},
					},
					["Interrupts"] = 1,
					["InterruptData"] = {
						["Tomassalek"] = {
							["Details"] = {
								["心灵震爆 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeSpent"] = {
						["暗一"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.17,
								},
								["肉搏"] = {
									["count"] = 1.58,
								},
							},
							["amount"] = 7.68,
						},
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.73,
								},
								["嗜血"] = {
									["count"] = 11.39,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.62,
						},
						["Tomassalek"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.57,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.88,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["肉搏"] = {
									["count"] = 8.010000000000002,
								},
							},
							["amount"] = 14.13,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.95,
								},
								["断筋"] = {
									["count"] = 1.2,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.55,
								},
							},
							["amount"] = 8.200000000000001,
						},
					},
					["DamageTaken"] = 9901,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["怒不可遏"] = {
									["count"] = 2,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 37,
						},
					},
					["PartialResist"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 20,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 43.63,
					["DOT_Time"] = 18,
					["ElementTaken"] = {
						["Shadow"] = 7861,
						["Fire"] = 679,
						["Melee"] = 187,
						["Frost"] = 1174,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 11236,
					["HealingTaken"] = 2974,
					["TimeHeal"] = 13.62,
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 160,
								},
								["治疗药水"] = {
									["count"] = 1741,
								},
							},
							["amount"] = 2974,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 160,
								},
								["治疗药水"] = {
									["count"] = 1741,
								},
							},
							["amount"] = 2974,
						},
					},
					["Heals"] = {
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1073,
									["count"] = 1,
									["amount"] = 1073,
								},
							},
							["count"] = 1,
							["amount"] = 1073,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 8,
									["amount"] = 160,
								},
							},
							["count"] = 8,
							["amount"] = 160,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1741,
									["min"] = 1741,
									["count"] = 1,
									["amount"] = 1741,
								},
							},
							["count"] = 1,
							["amount"] = 1741,
						},
					},
					["Healing"] = 2974,
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 21,
								},
							},
							["amount"] = 25,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["暗一"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 187,
								},
							},
							["amount"] = 187,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2684,
								},
								["心灵震爆"] = {
									["count"] = 712,
								},
							},
							["amount"] = 3396,
						},
						["Tomassalek"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1081,
								},
								["暗影守卫"] = {
									["count"] = 365,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2705,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 314,
								},
							},
							["amount"] = 4465,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1174,
								},
								["火焰冲击"] = {
									["count"] = 679,
								},
							},
							["amount"] = 1853,
						},
					},
					["Attacks"] = {
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 36,
									["min"] = 36,
									["count"] = 1,
									["amount"] = 36,
								},
							},
							["count"] = 1,
							["amount"] = 36,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 127,
									["min"] = 77,
									["count"] = 6,
									["amount"] = 586,
								},
							},
							["count"] = 6,
							["amount"] = 586,
						},
						["嗜血"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 333,
									["min"] = 333,
									["count"] = 1,
									["amount"] = 333,
								},
								["Hit"] = {
									["max"] = 430,
									["min"] = 333,
									["count"] = 3,
									["amount"] = 1118,
								},
							},
							["count"] = 4,
							["amount"] = 1451,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 27,
									["min"] = 27,
									["count"] = 1,
									["amount"] = 27,
								},
								["Hit"] = {
									["max"] = 358,
									["min"] = 358,
									["count"] = 1,
									["amount"] = 358,
								},
							},
							["count"] = 2,
							["amount"] = 385,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 61,
									["min"] = 61,
									["count"] = 1,
									["amount"] = 61,
								},
							},
							["count"] = 1,
							["amount"] = 61,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 33,
									["min"] = 33,
									["count"] = 1,
									["amount"] = 33,
								},
								["Crit"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 3,
							["amount"] = 151,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1307,
									["min"] = 1307,
									["count"] = 1,
									["amount"] = 1307,
								},
							},
							["count"] = 1,
							["amount"] = 1307,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1280,
								},
								["Absorb"] = {
									["max"] = 848,
									["min"] = 22,
									["count"] = 5,
									["amount"] = 2254,
								},
								["Crit"] = {
									["max"] = 974,
									["min"] = 891,
									["count"] = 4,
									["amount"] = 3725,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 7259,
						},
					},
					["RageGain"] = 37,
					["DamagedWho"] = {
						["暗一"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 430,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 127,
								},
								["断筋"] = {
									["count"] = 42,
								},
								["拦截昏迷"] = {
									["count"] = 61,
								},
								["斩杀"] = {
									["count"] = 1307,
								},
								["肉搏"] = {
									["count"] = 974,
								},
							},
							["amount"] = 2941,
						},
						["Tomassalek"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 666,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 377,
								},
								["旋风斩"] = {
									["count"] = 358,
								},
								["断筋"] = {
									["count"] = 33,
								},
								["拳击"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 2686,
								},
							},
							["amount"] = 4156,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 355,
								},
								["旋风斩"] = {
									["count"] = 27,
								},
								["断筋"] = {
									["count"] = 76,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 82,
								},
								["肉搏"] = {
									["count"] = 3599,
								},
							},
							["amount"] = 4139,
						},
					},
					["TimeDamage"] = 30.01,
					["TimeDamaging"] = {
						["暗一"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.17,
								},
								["肉搏"] = {
									["count"] = 1.58,
								},
							},
							["amount"] = 7.68,
						},
						["Tomassalek"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.57,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.88,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["肉搏"] = {
									["count"] = 8.010000000000002,
								},
							},
							["amount"] = 14.13,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.95,
								},
								["断筋"] = {
									["count"] = 1.2,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.55,
								},
							},
							["amount"] = 8.200000000000001,
						},
					},
					["ElementDone"] = {
						["Melee"] = 7259,
						["Physical"] = 3977,
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 1384,
						["Physical"] = 1272,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 18,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.73,
								},
								["嗜血"] = {
									["count"] = 11.39,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.62,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["暗一"] = {
									["count"] = 3,
								},
								["Tomassalek"] = {
									["count"] = 12,
								},
								["蒙小菲-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 18,
						},
					},
					["Interrupts"] = 1,
					["InterruptData"] = {
						["Tomassalek"] = {
							["Details"] = {
								["心灵震爆 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeSpent"] = {
						["暗一"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.17,
								},
								["肉搏"] = {
									["count"] = 1.58,
								},
							},
							["amount"] = 7.68,
						},
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.73,
								},
								["嗜血"] = {
									["count"] = 11.39,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.62,
						},
						["Tomassalek"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.57,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.88,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["肉搏"] = {
									["count"] = 8.010000000000002,
								},
							},
							["amount"] = 14.13,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.95,
								},
								["断筋"] = {
									["count"] = 1.2,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.55,
								},
							},
							["amount"] = 8.200000000000001,
						},
					},
					["DamageTaken"] = 9901,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["怒不可遏"] = {
									["count"] = 2,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 37,
						},
					},
					["PartialResist"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 20,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 43.63,
					["DOT_Time"] = 18,
					["ElementTaken"] = {
						["Shadow"] = 7861,
						["Fire"] = 679,
						["Melee"] = 187,
						["Frost"] = 1174,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 11236,
					["HealingTaken"] = 2974,
					["TimeHeal"] = 13.62,
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 160,
								},
								["治疗药水"] = {
									["count"] = 1741,
								},
							},
							["amount"] = 2974,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 160,
								},
								["治疗药水"] = {
									["count"] = 1741,
								},
							},
							["amount"] = 2974,
						},
					},
					["Heals"] = {
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1073,
									["count"] = 1,
									["amount"] = 1073,
								},
							},
							["count"] = 1,
							["amount"] = 1073,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 8,
									["amount"] = 160,
								},
							},
							["count"] = 8,
							["amount"] = 160,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1741,
									["min"] = 1741,
									["count"] = 1,
									["amount"] = 1741,
								},
							},
							["count"] = 1,
							["amount"] = 1741,
						},
					},
					["Healing"] = 2974,
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 21,
								},
							},
							["amount"] = 25,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["暗一"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 187,
								},
							},
							["amount"] = 187,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2684,
								},
								["心灵震爆"] = {
									["count"] = 712,
								},
							},
							["amount"] = 3396,
						},
						["Tomassalek"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1081,
								},
								["暗影守卫"] = {
									["count"] = 365,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2705,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 314,
								},
							},
							["amount"] = 4465,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1174,
								},
								["火焰冲击"] = {
									["count"] = 679,
								},
							},
							["amount"] = 1853,
						},
					},
					["Attacks"] = {
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 36,
									["min"] = 36,
									["count"] = 1,
									["amount"] = 36,
								},
							},
							["count"] = 1,
							["amount"] = 36,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 127,
									["min"] = 77,
									["count"] = 6,
									["amount"] = 586,
								},
							},
							["count"] = 6,
							["amount"] = 586,
						},
						["嗜血"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 333,
									["min"] = 333,
									["count"] = 1,
									["amount"] = 333,
								},
								["Hit"] = {
									["max"] = 430,
									["min"] = 333,
									["count"] = 3,
									["amount"] = 1118,
								},
							},
							["count"] = 4,
							["amount"] = 1451,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 27,
									["min"] = 27,
									["count"] = 1,
									["amount"] = 27,
								},
								["Hit"] = {
									["max"] = 358,
									["min"] = 358,
									["count"] = 1,
									["amount"] = 358,
								},
							},
							["count"] = 2,
							["amount"] = 385,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 61,
									["min"] = 61,
									["count"] = 1,
									["amount"] = 61,
								},
							},
							["count"] = 1,
							["amount"] = 61,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 33,
									["min"] = 33,
									["count"] = 1,
									["amount"] = 33,
								},
								["Crit"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 3,
							["amount"] = 151,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1307,
									["min"] = 1307,
									["count"] = 1,
									["amount"] = 1307,
								},
							},
							["count"] = 1,
							["amount"] = 1307,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1280,
								},
								["Absorb"] = {
									["max"] = 848,
									["min"] = 22,
									["count"] = 5,
									["amount"] = 2254,
								},
								["Crit"] = {
									["max"] = 974,
									["min"] = 891,
									["count"] = 4,
									["amount"] = 3725,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 7259,
						},
					},
					["RageGain"] = 37,
					["DamagedWho"] = {
						["暗一"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 430,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 127,
								},
								["断筋"] = {
									["count"] = 42,
								},
								["拦截昏迷"] = {
									["count"] = 61,
								},
								["斩杀"] = {
									["count"] = 1307,
								},
								["肉搏"] = {
									["count"] = 974,
								},
							},
							["amount"] = 2941,
						},
						["Tomassalek"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 666,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 377,
								},
								["旋风斩"] = {
									["count"] = 358,
								},
								["断筋"] = {
									["count"] = 33,
								},
								["拳击"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 2686,
								},
							},
							["amount"] = 4156,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 355,
								},
								["旋风斩"] = {
									["count"] = 27,
								},
								["断筋"] = {
									["count"] = 76,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 82,
								},
								["肉搏"] = {
									["count"] = 3599,
								},
							},
							["amount"] = 4139,
						},
					},
					["TimeDamage"] = 30.01,
					["TimeDamaging"] = {
						["暗一"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.17,
								},
								["肉搏"] = {
									["count"] = 1.58,
								},
							},
							["amount"] = 7.68,
						},
						["Tomassalek"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.57,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.88,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["肉搏"] = {
									["count"] = 8.010000000000002,
								},
							},
							["amount"] = 14.13,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.95,
								},
								["断筋"] = {
									["count"] = 1.2,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.55,
								},
							},
							["amount"] = 8.200000000000001,
						},
					},
					["ElementDone"] = {
						["Melee"] = 7259,
						["Physical"] = 3977,
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 1384,
						["Physical"] = 1272,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 18,
						},
					},
				},
			},
			["UnitLockout"] = 30437.249,
			["LastActive"] = 30485.252,
		},
		["Cd-老马布兰契"] = {
			["GUID"] = "Player-5447-03615DBD",
			["type"] = "Grouped",
			["TimeLast"] = {
				["OVERALL"] = 30333.261,
				["ManaGain"] = 30333.261,
			},
			["Owner"] = false,
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["TimeWindows"] = {
				["ManaGain"] = {
					685, -- [1]
				},
			},
			["Name"] = "Cd-老马布兰契",
			["LastActive"] = 30333.261,
			["Fights"] = {
				["LastFightData"] = {
					["ManaGain"] = 0,
					["ManaGainedFrom"] = {
						["Cd-老马布兰契"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["Cd-老马布兰契"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ManaGain"] = 685,
					["ManaGainedFrom"] = {
						["Cd-老马布兰契"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 685,
								},
							},
							["amount"] = 685,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["Cd-老马布兰契"] = {
									["count"] = 685,
								},
							},
							["amount"] = 685,
						},
					},
				},
			},
			["level"] = 60,
			["UnitLockout"] = 30333.261,
			["LastFightIn"] = 0,
		},
		["小刀一顿乱扎"] = {
			["GUID"] = "Player-5458-0387ACC7",
			["LastEventHealth"] = {
				3353, -- [1]
			},
			["LastAttackedBy"] = "古德斯尼-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					907, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "火球术",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastDamageTaken"] = 907,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 30494.252,
				["OVERALL"] = 30494.252,
			},
			["NextEventNum"] = 2,
			["LastEventHealthMax"] = {
				3353, -- [1]
			},
			["LastEvents"] = {
				"古德斯尼-逐风者 火球术 小刀一顿乱扎 Hit -907 (Fire)", -- [1]
			},
			["Name"] = "小刀一顿乱扎",
			["LastEventIncoming"] = {
				true, -- [1]
			},
			["LastEventTimes"] = {
				30495.663, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["PartialResist"] = {
						["火球术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["火球术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 907,
								},
							},
							["amount"] = 907,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 907,
					},
					["DamageTaken"] = 907,
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["火球术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["火球术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 907,
								},
							},
							["amount"] = 907,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 907,
					},
					["DamageTaken"] = 907,
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 30494.252,
			["LastActive"] = 30494.252,
		},
		["冰上加点火撒"] = {
			["GUID"] = "Player-5458-02E7925D",
			["LastEventHealth"] = {
				2863, -- [1]
				2767, -- [2]
				2089, -- [3]
				1836, -- [4]
				847, -- [5]
				785, -- [6]
				785, -- [7]
				547, -- [8]
				547, -- [9]
				509, -- [10]
				3440, -- [11]
				3440, -- [12]
				3440, -- [13]
				3440, -- [14]
				3440, -- [15]
			},
			["LastAttackedBy"] = "暗一",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"MISC", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					6.13, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					6.13, -- [1]
				},
				["DamageTaken"] = {
					2417, -- [1]
				},
				["Damage"] = {
					737, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				3440, -- [1]
				3440, -- [2]
				3440, -- [3]
				3440, -- [4]
				3440, -- [5]
				3440, -- [6]
				3440, -- [7]
				3440, -- [8]
				3440, -- [9]
				3440, -- [10]
				3440, -- [11]
				3440, -- [12]
				3440, -- [13]
				3440, -- [14]
				3440, -- [15]
			},
			["LastDamageTaken"] = 54,
			["Owner"] = false,
			["TimeLast"] = {
				["Interrupts"] = 30480.251,
				["ActiveTime"] = 30481.251,
				["TimeDamage"] = 30481.251,
				["OVERALL"] = 30481.251,
				["DamageTaken"] = 30449.25,
				["Damage"] = 30481.251,
			},
			["NextEventNum"] = 16,
			["LastDamageTime"] = 30481.618,
			["LastEvents"] = {
				"暗一 肉搏 冰上加点火撒 Hit -143 (Physical)", -- [1]
				"暗一 伏击 冰上加点火撒 Hit -678 (Physical)", -- [2]
				"暗一 肉搏 冰上加点火撒 Crit -253 (Physical)", -- [3]
				"暗一 刺骨 冰上加点火撒 Crit -989 (Physical)", -- [4]
				"暗一 肉搏 冰上加点火撒 Hit -62 (Physical)", -- [5]
				"暗一 肉搏 冰上加点火撒 Crit -238 (Physical)", -- [6]
				"冰上加点火撒 冰冻 暗一 Immune (Frost)", -- [7]
				"暗一 肉搏 冰上加点火撒 Hit -54 (Physical)", -- [8]
				"冰上加点火撒 冰冻 暗一 Immune (Frost)", -- [9]
				"冰上加点火撒 火焰冲击 暗一 Hit -568 (Fire)", -- [10]
				"冰上加点火撒 魔爆术 蒙小菲-逐风者 Hit -59 (Arcane)", -- [11]
				"冰上加点火撒 魔爆术 暗一 Hit -59 (Arcane)", -- [12]
				"冰上加点火撒 interrupts 蒙小菲-逐风者 变形术 (法术反制)", -- [13]
				"冰上加点火撒 冰霜新星 蒙小菲-逐风者 Hit -25 (Frost)", -- [14]
				"冰上加点火撒 冰霜新星 暗一 Hit -26 (Frost)", -- [15]
			},
			["Name"] = "冰上加点火撒",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
			},
			["LastEventTimes"] = {
				30435.982, -- [1]
				30445.483, -- [2]
				30445.499, -- [3]
				30446.483, -- [4]
				30446.699, -- [5]
				30449.416, -- [6]
				30449.416, -- [7]
				30449.55, -- [8]
				30449.55, -- [9]
				30456.317, -- [10]
				30480.101, -- [11]
				30480.101, -- [12]
				30480.718, -- [13]
				30481.618, -- [14]
				30481.618, -- [15]
			},
			["Fights"] = {
				["LastFightData"] = {
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 2417,
					["PartialResist"] = {
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["伏击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["PartialAbsorb"] = {
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["伏击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 6.13,
					["ElementTaken"] = {
						["Melee"] = 750,
						["Physical"] = 1667,
					},
					["Damage"] = 737,
					["InterruptData"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["变形术 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 1,
					["Attacks"] = {
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 59,
									["min"] = 59,
									["count"] = 2,
									["amount"] = 118,
								},
							},
							["count"] = 2,
							["amount"] = 118,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 26,
									["min"] = 25,
									["count"] = 2,
									["amount"] = 51,
								},
							},
							["count"] = 2,
							["amount"] = 51,
						},
						["冰冻"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 568,
									["min"] = 568,
									["count"] = 1,
									["amount"] = 568,
								},
							},
							["count"] = 1,
							["amount"] = 568,
						},
					},
					["DamagedWho"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 59,
								},
								["冰霜新星"] = {
									["count"] = 25,
								},
							},
							["amount"] = 84,
						},
						["暗一"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 59,
								},
								["冰霜新星"] = {
									["count"] = 26,
								},
								["火焰冲击"] = {
									["count"] = 568,
								},
							},
							["amount"] = 653,
						},
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["TimeDamage"] = 6.13,
					["WhoDamaged"] = {
						["暗一"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 989,
								},
								["伏击"] = {
									["count"] = 678,
								},
								["肉搏"] = {
									["count"] = 750,
								},
							},
							["amount"] = 2417,
						},
					},
					["ElementDone"] = {
						["Fire"] = 568,
						["Frost"] = 51,
						["Arcane"] = 118,
					},
					["TimeSpent"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["暗一"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 1.63,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.13,
						},
					},
					["TimeDamaging"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["暗一"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 1.63,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.13,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 2417,
					["PartialResist"] = {
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["伏击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["PartialAbsorb"] = {
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["伏击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 6.13,
					["ElementTaken"] = {
						["Melee"] = 750,
						["Physical"] = 1667,
					},
					["Damage"] = 737,
					["InterruptData"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["变形术 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 1,
					["Attacks"] = {
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 59,
									["min"] = 59,
									["count"] = 2,
									["amount"] = 118,
								},
							},
							["count"] = 2,
							["amount"] = 118,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 26,
									["min"] = 25,
									["count"] = 2,
									["amount"] = 51,
								},
							},
							["count"] = 2,
							["amount"] = 51,
						},
						["冰冻"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 568,
									["min"] = 568,
									["count"] = 1,
									["amount"] = 568,
								},
							},
							["count"] = 1,
							["amount"] = 568,
						},
					},
					["DamagedWho"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 59,
								},
								["冰霜新星"] = {
									["count"] = 25,
								},
							},
							["amount"] = 84,
						},
						["暗一"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 59,
								},
								["冰霜新星"] = {
									["count"] = 26,
								},
								["火焰冲击"] = {
									["count"] = 568,
								},
							},
							["amount"] = 653,
						},
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["TimeDamage"] = 6.13,
					["WhoDamaged"] = {
						["暗一"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 989,
								},
								["伏击"] = {
									["count"] = 678,
								},
								["肉搏"] = {
									["count"] = 750,
								},
							},
							["amount"] = 2417,
						},
					},
					["ElementDone"] = {
						["Fire"] = 568,
						["Frost"] = 51,
						["Arcane"] = 118,
					},
					["TimeSpent"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["暗一"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 1.63,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.13,
						},
					},
					["TimeDamaging"] = {
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["暗一"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 1.63,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.13,
						},
					},
				},
			},
			["UnitLockout"] = 30446.249,
			["LastActive"] = 30481.251,
		},
		["萌宝赳赳"] = {
			["GUID"] = "Player-5458-030CE7B9",
			["LastEventHealth"] = {
				2730, -- [1]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					177, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastDamageTaken"] = 177,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 30398.247,
				["OVERALL"] = 30398.247,
			},
			["NextEventNum"] = 2,
			["LastEventHealthMax"] = {
				2730, -- [1]
			},
			["LastEvents"] = {
				"Environment Falling 萌宝赳赳 Hit -177 (Physical)", -- [1]
			},
			["Name"] = "萌宝赳赳",
			["LastEventIncoming"] = {
				true, -- [1]
			},
			["LastEventTimes"] = {
				30398.713, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 0,
					},
					["DamageTaken"] = 0,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 177,
								},
							},
							["amount"] = 177,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 177,
					},
					["DamageTaken"] = 177,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 30398.247,
			["LastActive"] = 30398.247,
		},
		["快乐的彪彪-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-03439940",
			["LastEventHealth"] = {
				4137, -- [1]
				4137, -- [2]
				4137, -- [3]
				4137, -- [4]
				4137, -- [5]
				4137, -- [6]
				4137, -- [7]
				3828, -- [8]
				3565, -- [9]
				3259, -- [10]
				3259, -- [11]
				3259, -- [12]
				2954, -- [13]
				2785, -- [14]
				2506, -- [15]
				2192, -- [16]
				2192, -- [17]
				1878, -- [18]
				1878, -- [19]
				1564, -- [20]
			},
			["LastAttackedBy"] = "Tomassalek",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"MISC", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
			},
			["TimeWindows"] = {
				["DOT_Time"] = {
					9, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					12.9, -- [1]
				},
				["TimeDamage"] = {
					12.9, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					2650, -- [1]
				},
				["Damage"] = {
					1481, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastDamageTaken"] = 314,
			["LastEventHealthMax"] = {
				4137, -- [1]
				4137, -- [2]
				4137, -- [3]
				4137, -- [4]
				4137, -- [5]
				4137, -- [6]
				4137, -- [7]
				4137, -- [8]
				4137, -- [9]
				4137, -- [10]
				3517, -- [11]
				3517, -- [12]
				3517, -- [13]
				3517, -- [14]
				3517, -- [15]
				3517, -- [16]
				3517, -- [17]
				3517, -- [18]
				3517, -- [19]
				3517, -- [20]
			},
			["TimeLast"] = {
				["DOT_Time"] = 30484.252,
				["TimeDamage"] = 30484.252,
				["Dispelled"] = 30470.251,
				["ActiveTime"] = 30484.252,
				["Healing"] = 30448.25,
				["OVERALL"] = 30484.252,
				["DamageTaken"] = 30483.252,
				["Damage"] = 30484.252,
			},
			["Owner"] = false,
			["Pet"] = {
				"豹 <快乐的彪彪-火妖鲁西弗隆>", -- [1]
			},
			["NextEventNum"] = 21,
			["LastDamageTime"] = 30484.502,
			["LastEvents"] = {
				"快乐的彪彪-火妖鲁西弗隆 奥术射击 蒙小菲-逐风者 Crit -333 (Arcane)", -- [1]
				"快乐的彪彪-火妖鲁西弗隆 自动射击 蒙小菲-逐风者 Hit -242 (Physical)", -- [2]
				"快乐的彪彪-火妖鲁西弗隆 奥术射击 暗一 Hit -145 (Arcane)", -- [3]
				"快乐的彪彪-火妖鲁西弗隆 自动射击 暗一 Miss (Physical)", -- [4]
				"快乐的彪彪-火妖鲁西弗隆 奥术射击 Tomassalek Hit -145 (Arcane)", -- [5]
				"快乐的彪彪-火妖鲁西弗隆 自动射击 Tomassalek Hit -177 (Physical)", -- [6]
				"Tomassalek 暗影守卫 快乐的彪彪-火妖鲁西弗隆 Hit -309 (Shadow)", -- [7]
				"Tomassalek 暗言术：痛 (伤害/跳) 快乐的彪彪-火妖鲁西弗隆 Tick -305 (Shadow)", -- [8]
				"Tomassalek 暗言术：痛 (伤害/跳) 快乐的彪彪-火妖鲁西弗隆 Tick -306 (Shadow)", -- [9]
				"Tomassalek dispels 快乐的彪彪-火妖鲁西弗隆 真言术：韧 (驱散魔法)", -- [10]
				"快乐的彪彪-火妖鲁西弗隆 奥术射击 抢先登录-老马布兰契 Absorb -145 (145 被吸收) (Arcane)", -- [11]
				"Tomassalek 暗言术：痛 (伤害/跳) 快乐的彪彪-火妖鲁西弗隆 Tick -305 (Shadow)", -- [12]
				"抢先登录-老马布兰契 暗影守卫 快乐的彪彪-火妖鲁西弗隆 Hit -169 (Shadow)", -- [13]
				"Tomassalek 暗言术：痛 (伤害/跳) 快乐的彪彪-火妖鲁西弗隆 Tick -314 (Shadow)", -- [14]
				"Tomassalek 暗言术：痛 (伤害/跳) 快乐的彪彪-火妖鲁西弗隆 Tick -314 (Shadow)", -- [15]
				"快乐的彪彪-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) Tomassalek Tick -98 (Nature)", -- [16]
				"Tomassalek 暗言术：痛 (伤害/跳) 快乐的彪彪-火妖鲁西弗隆 Tick -314 (Shadow)", -- [17]
				"快乐的彪彪-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) Tomassalek Tick -98 (Nature)", -- [18]
				"Tomassalek 暗言术：痛 (伤害/跳) 快乐的彪彪-火妖鲁西弗隆 Tick -314 (Shadow)", -- [19]
				"快乐的彪彪-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) Tomassalek Absorb -98 (98 被吸收) (Nature)", -- [20]
			},
			["Name"] = "快乐的彪彪-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
			},
			["LastEventTimes"] = {
				30441.516, -- [1]
				30441.949, -- [2]
				30454.133, -- [3]
				30456.817, -- [4]
				30460.984, -- [5]
				30461.45, -- [6]
				30463.1, -- [7]
				30466.169, -- [8]
				30469.167, -- [9]
				30470.751, -- [10]
				30471.668, -- [11]
				30472.168, -- [12]
				30473.498, -- [13]
				30475.168, -- [14]
				30478.168, -- [15]
				30478.501, -- [16]
				30481.168, -- [17]
				30481.501, -- [18]
				30484.168, -- [19]
				30484.502, -- [20]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Dispelled"] = 1,
					["TimeSpent"] = {
						["暗一"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Tomassalek"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 6.47,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.43,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.93,
						},
					},
					["DamageTaken"] = 2650,
					["ElementDoneAbsorb"] = {
						["Nature"] = 98,
						["Arcane"] = 145,
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 12.9,
					["ElementTaken"] = {
						["Shadow"] = 2650,
					},
					["DOT_Time"] = 9,
					["Damage"] = 1481,
					["Healing"] = 0,
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tomassalek"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["WhoDispelled"] = {
						["Tomassalek"] = {
							["Details"] = {
								["真言术：韧 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDone"] = {
						["Physical"] = 419,
						["Nature"] = 294,
						["Arcane"] = 768,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["DamagedWho"] = {
						["暗一"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 145,
								},
							},
							["amount"] = 145,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 145,
								},
							},
							["amount"] = 145,
						},
						["Tomassalek"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 294,
								},
								["奥术射击"] = {
									["count"] = 145,
								},
								["自动射击"] = {
									["count"] = 177,
								},
							},
							["amount"] = 616,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 242,
								},
								["奥术射击"] = {
									["count"] = 333,
								},
							},
							["amount"] = 575,
						},
					},
					["TimeDamage"] = 12.9,
					["TimeDamaging"] = {
						["暗一"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Tomassalek"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 6.47,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.43,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.93,
						},
					},
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 98,
									["min"] = 98,
									["count"] = 1,
									["amount"] = 98,
								},
								["Tick"] = {
									["max"] = 98,
									["min"] = 98,
									["count"] = 2,
									["amount"] = 196,
								},
							},
							["count"] = 3,
							["amount"] = 294,
						},
						["奥术射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 145,
									["min"] = 145,
									["count"] = 1,
									["amount"] = 145,
								},
								["Crit"] = {
									["max"] = 333,
									["min"] = 333,
									["count"] = 1,
									["amount"] = 333,
								},
								["Hit"] = {
									["max"] = 145,
									["min"] = 145,
									["count"] = 2,
									["amount"] = 290,
								},
							},
							["count"] = 4,
							["amount"] = 768,
						},
						["自动射击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 242,
									["min"] = 177,
									["count"] = 2,
									["amount"] = 419,
								},
							},
							["count"] = 3,
							["amount"] = 419,
						},
					},
					["WhoDamaged"] = {
						["Tomassalek"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2172,
								},
								["暗影守卫"] = {
									["count"] = 309,
								},
							},
							["amount"] = 2481,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 169,
								},
							},
							["amount"] = 169,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 1,
					["TimeSpent"] = {
						["暗一"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Tomassalek"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 6.47,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.43,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.93,
						},
					},
					["DamageTaken"] = 2650,
					["ElementDoneAbsorb"] = {
						["Nature"] = 98,
						["Arcane"] = 145,
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 12.9,
					["ElementTaken"] = {
						["Shadow"] = 2650,
					},
					["DOT_Time"] = 9,
					["Damage"] = 1481,
					["Healing"] = 0,
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tomassalek"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["WhoDispelled"] = {
						["Tomassalek"] = {
							["Details"] = {
								["真言术：韧 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDone"] = {
						["Physical"] = 419,
						["Nature"] = 294,
						["Arcane"] = 768,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["DamagedWho"] = {
						["暗一"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 145,
								},
							},
							["amount"] = 145,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 145,
								},
							},
							["amount"] = 145,
						},
						["Tomassalek"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 294,
								},
								["奥术射击"] = {
									["count"] = 145,
								},
								["自动射击"] = {
									["count"] = 177,
								},
							},
							["amount"] = 616,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 242,
								},
								["奥术射击"] = {
									["count"] = 333,
								},
							},
							["amount"] = 575,
						},
					},
					["TimeDamage"] = 12.9,
					["TimeDamaging"] = {
						["暗一"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Tomassalek"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 6.47,
						},
						["蒙小菲-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.43,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.93,
						},
					},
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 98,
									["min"] = 98,
									["count"] = 1,
									["amount"] = 98,
								},
								["Tick"] = {
									["max"] = 98,
									["min"] = 98,
									["count"] = 2,
									["amount"] = 196,
								},
							},
							["count"] = 3,
							["amount"] = 294,
						},
						["奥术射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 145,
									["min"] = 145,
									["count"] = 1,
									["amount"] = 145,
								},
								["Crit"] = {
									["max"] = 333,
									["min"] = 333,
									["count"] = 1,
									["amount"] = 333,
								},
								["Hit"] = {
									["max"] = 145,
									["min"] = 145,
									["count"] = 2,
									["amount"] = 290,
								},
							},
							["count"] = 4,
							["amount"] = 768,
						},
						["自动射击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 242,
									["min"] = 177,
									["count"] = 2,
									["amount"] = 419,
								},
							},
							["count"] = 3,
							["amount"] = 419,
						},
					},
					["WhoDamaged"] = {
						["Tomassalek"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2172,
								},
								["暗影守卫"] = {
									["count"] = 309,
								},
							},
							["amount"] = 2481,
						},
						["抢先登录-老马布兰契"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 169,
								},
							},
							["amount"] = 169,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
				},
			},
			["UnitLockout"] = 30453.25,
			["LastActive"] = 30484.252,
		},
		["豹 <快乐的彪彪-火妖鲁西弗隆>"] = {
			["GUID"] = "Pet-0-5427-529-18591-7434-0B0157957C",
			["LastEventHealth"] = {
				3589, -- [1]
				3589, -- [2]
				3589, -- [3]
				3589, -- [4]
				3589, -- [5]
				3589, -- [6]
				3589, -- [7]
				3589, -- [8]
				3589, -- [9]
				3589, -- [10]
				3589, -- [11]
				3589, -- [12]
				3589, -- [13]
				3589, -- [14]
				3589, -- [15]
				3589, -- [16]
				3589, -- [17]
				3589, -- [18]
				3589, -- [19]
				3589, -- [20]
				3589, -- [21]
				3589, -- [22]
				3589, -- [23]
				3589, -- [24]
				3589, -- [25]
				3589, -- [26]
			},
			["LastAttackedBy"] = "Tomassalek",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					18.09, -- [1]
				},
				["Damage"] = {
					1474, -- [1]
				},
				["DamageTaken"] = {
					863, -- [1]
				},
				["ActiveTime"] = {
					18.09, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "豹",
			["level"] = 1,
			["LastDamageAbility"] = "暗影守卫",
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["ownerName"] = "快乐的彪彪-火妖鲁西弗隆",
			["LastDamageTaken"] = 279,
			["TimeLast"] = {
				["ActiveTime"] = 30485.252,
				["TimeDamage"] = 30485.252,
				["OVERALL"] = 30485.252,
				["DamageTaken"] = 30483.252,
				["Damage"] = 30485.252,
			},
			["LastEventHealthMax"] = {
				3589, -- [1]
				3589, -- [2]
				3589, -- [3]
				3589, -- [4]
				3589, -- [5]
				3589, -- [6]
				3589, -- [7]
				3589, -- [8]
				3589, -- [9]
				3589, -- [10]
				3589, -- [11]
				3589, -- [12]
				3589, -- [13]
				3589, -- [14]
				3589, -- [15]
				3589, -- [16]
				3589, -- [17]
				3589, -- [18]
				3589, -- [19]
				3589, -- [20]
				3589, -- [21]
				3589, -- [22]
				3589, -- [23]
				3589, -- [24]
				3589, -- [25]
				3589, -- [26]
			},
			["NextEventNum"] = 27,
			["LastDamageTime"] = 30485.502,
			["LastEvents"] = {
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 暗一 Crit -144 (Physical)", -- [1]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 暗一 Hit -60 (Physical)", -- [2]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 暗一 Hit -74 (Physical)", -- [3]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 暗一 Crit -123 (Physical)", -- [4]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 暗一 Hit -80 (Physical)", -- [5]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 暗一 Miss (Physical)", -- [6]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 暗一 Hit -67 (Physical)", -- [7]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 暗一 Hit -83 (Physical)", -- [8]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 暗一 Crit -142 (Physical)", -- [9]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 暗一 Parry (1)", -- [10]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 暗一 Hit -63 (Physical)", -- [11]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 暗一 Hit -84 (Physical)", -- [12]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 Tomassalek Hit -59 (Physical)", -- [13]
				"Tomassalek 暗影守卫 豹 <快乐的彪彪-火妖鲁西弗隆> Hit -314 (Shadow)", -- [14]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 Tomassalek Hit -46 (Physical)", -- [15]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 Tomassalek Dodge (1)", -- [16]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 Tomassalek Hit -44 (Physical)", -- [17]
				"Tomassalek 暗影守卫 豹 <快乐的彪彪-火妖鲁西弗隆> Hit -270 (Shadow)", -- [18]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 Tomassalek Hit -64 (Physical)", -- [19]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 Tomassalek Hit -53 (Physical)", -- [20]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 Tomassalek Hit -64 (Physical)", -- [21]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 Tomassalek Absorb -51 (51 被吸收) (Physical)", -- [22]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 Tomassalek Absorb -56 (56 被吸收) (1)", -- [23]
				"Tomassalek 暗影守卫 豹 <快乐的彪彪-火妖鲁西弗隆> Hit -279 (Shadow)", -- [24]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 爪击 Tomassalek Absorb -58 (58 被吸收) (Physical)", -- [25]
				"豹 <快乐的彪彪-火妖鲁西弗隆> 肉搏 Tomassalek Hit -59 (Physical)", -- [26]
			},
			["Name"] = "豹",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
			},
			["LastEventTimes"] = {
				30448.983, -- [1]
				30448.983, -- [2]
				30450.65, -- [3]
				30451.166, -- [4]
				30451.8, -- [5]
				30452.767, -- [6]
				30452.95, -- [7]
				30454.117, -- [8]
				30454.4, -- [9]
				30455.283, -- [10]
				30456.017, -- [11]
				30456.417, -- [12]
				30464.601, -- [13]
				30464.817, -- [14]
				30464.917, -- [15]
				30479.485, -- [16]
				30480.301, -- [17]
				30480.468, -- [18]
				30480.985, -- [19]
				30481.918, -- [20]
				30482.502, -- [21]
				30483.552, -- [22]
				30484.002, -- [23]
				30484.185, -- [24]
				30485.168, -- [25]
				30485.502, -- [26]
			},
			["Fights"] = {
				["LastFightData"] = {
					["WhoDamaged"] = {
						["Tomassalek"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 863,
								},
							},
							["amount"] = 863,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["PartialAbsorb"] = {
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["爪击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 58,
									["min"] = 51,
									["count"] = 2,
									["amount"] = 109,
								},
								["Crit"] = {
									["max"] = 142,
									["min"] = 123,
									["count"] = 2,
									["amount"] = 265,
								},
								["Hit"] = {
									["max"] = 63,
									["min"] = 44,
									["count"] = 5,
									["amount"] = 266,
								},
							},
							["count"] = 10,
							["amount"] = 640,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 56,
									["min"] = 56,
									["count"] = 1,
									["amount"] = 56,
								},
								["Hit"] = {
									["max"] = 84,
									["min"] = 59,
									["count"] = 9,
									["amount"] = 634,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 144,
									["min"] = 144,
									["count"] = 1,
									["amount"] = 144,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 834,
						},
					},
					["TimeSpent"] = {
						["Tomassalek"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.29,
								},
								["肉搏"] = {
									["count"] = 5.04,
								},
							},
							["amount"] = 9.33,
						},
						["暗一"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.5,
								},
								["肉搏"] = {
									["count"] = 6.260000000000001,
								},
							},
							["amount"] = 8.76,
						},
					},
					["DamageTaken"] = 863,
					["ElementDoneAbsorb"] = {
						["Melee"] = 56,
						["Physical"] = 109,
					},
					["ElementDone"] = {
						["Melee"] = 834,
						["Physical"] = 640,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 13,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 10,
						},
					},
					["DamagedWho"] = {
						["Tomassalek"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 252,
								},
								["肉搏"] = {
									["count"] = 302,
								},
							},
							["amount"] = 554,
						},
						["暗一"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 388,
								},
								["肉搏"] = {
									["count"] = 532,
								},
							},
							["amount"] = 920,
						},
					},
					["TimeDamage"] = 18.09,
					["TimeDamaging"] = {
						["Tomassalek"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.29,
								},
								["肉搏"] = {
									["count"] = 5.04,
								},
							},
							["amount"] = 9.33,
						},
						["暗一"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.5,
								},
								["肉搏"] = {
									["count"] = 6.260000000000001,
								},
							},
							["amount"] = 8.76,
						},
					},
					["ElementTaken"] = {
						["Shadow"] = 863,
					},
					["ActiveTime"] = 18.09,
					["Damage"] = 1474,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["WhoDamaged"] = {
						["Tomassalek"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 863,
								},
							},
							["amount"] = 863,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["PartialAbsorb"] = {
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["爪击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 58,
									["min"] = 51,
									["count"] = 2,
									["amount"] = 109,
								},
								["Crit"] = {
									["max"] = 142,
									["min"] = 123,
									["count"] = 2,
									["amount"] = 265,
								},
								["Hit"] = {
									["max"] = 63,
									["min"] = 44,
									["count"] = 5,
									["amount"] = 266,
								},
							},
							["count"] = 10,
							["amount"] = 640,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 56,
									["min"] = 56,
									["count"] = 1,
									["amount"] = 56,
								},
								["Hit"] = {
									["max"] = 84,
									["min"] = 59,
									["count"] = 9,
									["amount"] = 634,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 144,
									["min"] = 144,
									["count"] = 1,
									["amount"] = 144,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 834,
						},
					},
					["TimeSpent"] = {
						["Tomassalek"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.29,
								},
								["肉搏"] = {
									["count"] = 5.04,
								},
							},
							["amount"] = 9.33,
						},
						["暗一"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.5,
								},
								["肉搏"] = {
									["count"] = 6.260000000000001,
								},
							},
							["amount"] = 8.76,
						},
					},
					["DamageTaken"] = 863,
					["ElementDoneAbsorb"] = {
						["Melee"] = 56,
						["Physical"] = 109,
					},
					["ElementDone"] = {
						["Melee"] = 834,
						["Physical"] = 640,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 13,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 10,
						},
					},
					["DamagedWho"] = {
						["Tomassalek"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 252,
								},
								["肉搏"] = {
									["count"] = 302,
								},
							},
							["amount"] = 554,
						},
						["暗一"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 388,
								},
								["肉搏"] = {
									["count"] = 532,
								},
							},
							["amount"] = 920,
						},
					},
					["TimeDamage"] = 18.09,
					["TimeDamaging"] = {
						["Tomassalek"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.29,
								},
								["肉搏"] = {
									["count"] = 5.04,
								},
							},
							["amount"] = 9.33,
						},
						["暗一"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.5,
								},
								["肉搏"] = {
									["count"] = 6.260000000000001,
								},
							},
							["amount"] = 8.76,
						},
					},
					["ElementTaken"] = {
						["Shadow"] = 863,
					},
					["ActiveTime"] = 18.09,
					["Damage"] = 1474,
				},
			},
			["UnitLockout"] = 30448.25,
			["LastActive"] = 30485.252,
		},
		["黄皮爬"] = {
			["GUID"] = "Player-5458-035CCFD8",
			["LastEventHealth"] = {
				2737, -- [1]
				1489, -- [2]
				795, -- [3]
				795, -- [4]
			},
			["LastAttackedBy"] = "买家群殴",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					2743, -- [1]
				},
			},
			["enClass"] = "PRIEST",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "自动射击",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastDamageTaken"] = 279,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 30494.252,
				["OVERALL"] = 30494.252,
			},
			["NextEventNum"] = 5,
			["LastEventHealthMax"] = {
				3687, -- [1]
				3687, -- [2]
				3267, -- [3]
				3267, -- [4]
			},
			["LastEvents"] = {
				"加图索 瞄准射击 黄皮爬 Hit -1248 (Physical)", -- [1]
				"加图索 多重射击 黄皮爬 Hit -694 (Physical)", -- [2]
				"买家群殴 多重射击 黄皮爬 Hit -522 (Physical)", -- [3]
				"买家群殴 自动射击 黄皮爬 Hit -279 (Physical)", -- [4]
			},
			["Name"] = "黄皮爬",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
			},
			["LastEventTimes"] = {
				30487.002, -- [1]
				30487.919, -- [2]
				30494.986, -- [3]
				30495.663, -- [4]
			},
			["Fights"] = {
				["LastFightData"] = {
					["PartialResist"] = {
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["买家群殴"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 522,
								},
								["自动射击"] = {
									["count"] = 279,
								},
							},
							["amount"] = 801,
						},
						["加图索"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 1248,
								},
								["多重射击"] = {
									["count"] = 694,
								},
							},
							["amount"] = 1942,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 2743,
					},
					["DamageTaken"] = 2743,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["买家群殴"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 522,
								},
								["自动射击"] = {
									["count"] = 279,
								},
							},
							["amount"] = 801,
						},
						["加图索"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 1248,
								},
								["多重射击"] = {
									["count"] = 694,
								},
							},
							["amount"] = 1942,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 2743,
					},
					["DamageTaken"] = 2743,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
				},
			},
			["UnitLockout"] = 30494.252,
			["LastActive"] = 30494.252,
		},
		["雪山牧民-逐风者"] = {
			["GUID"] = "Player-5451-03232C9B",
			["LastEventHealth"] = {
				56, -- [1]
			},
			["LastAttackedBy"] = "白摆拜佰",
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					44, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "爪击",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastDamageTaken"] = 44,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 30494.252,
				["OVERALL"] = 30494.252,
			},
			["NextEventNum"] = 2,
			["LastEventHealthMax"] = {
				3670, -- [1]
			},
			["LastEvents"] = {
				"白摆拜佰 爪击 雪山牧民-逐风者 Hit -44 (Physical)", -- [1]
			},
			["Name"] = "雪山牧民-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
			},
			["LastEventTimes"] = {
				30494.986, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["PartialResist"] = {
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["白摆拜佰"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 44,
								},
							},
							["amount"] = 44,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 44,
					},
					["DamageTaken"] = 44,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["白摆拜佰"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 44,
								},
							},
							["amount"] = 44,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 44,
					},
					["DamageTaken"] = 44,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 30494.252,
			["LastActive"] = 30494.252,
		},
	},
	["FightNum"] = 1,
	["CombatTimes"] = {
		{
			30435.249, -- [1]
			30495.663, -- [2]
			"21:18:35", -- [3]
			"21:19:34", -- [4]
			"暗一", -- [5]
		}, -- [1]
	},
	["FoughtWho"] = {
	},
}
