
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["加加卜鲁艮-逐风者"] = {
			["GUID"] = "Player-5451-02F38CB4",
			["TimeLast"] = {
				["TimeHeal"] = 44438.591,
				["OVERALL"] = 44439.588,
				["DamageTaken"] = 44439.588,
				["ActiveTime"] = 44438.591,
				["DeathCount"] = 43414.594,
				["RageGain"] = 44438.591,
				["HOT_Time"] = 43411.594,
				["TimeDamage"] = 44438.591,
				["HealingTaken"] = 44438.591,
				["Healing"] = 44438.591,
				["DOT_Time"] = 44437.588,
				["Damage"] = 44438.591,
			},
			["LastAttackedBy"] = "蓝染-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"HEAL", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					9, -- [1]
				},
				["Healing"] = {
					378, -- [1]
				},
				["DamageTaken"] = {
					19380, -- [1]
				},
				["TimeDamage"] = {
					30.9, -- [1]
				},
				["RageGain"] = {
					52, -- [1]
				},
				["HOT_Time"] = {
					15, -- [1]
				},
				["ActiveTime"] = {
					39.90000000000001, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["HealingTaken"] = {
					856, -- [1]
				},
				["DOT_Time"] = {
					24, -- [1]
				},
				["Damage"] = {
					9172, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						false, -- [29]
						false, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
					},
					["Messages"] = {
						"贰公主洛基-火妖鲁西弗隆 愈合 加加卜鲁艮-逐风者 Tick +159", -- [1]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -52 (Physical)", -- [2]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Crit -183 (Physical)", -- [3]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Crit -102 (Physical)", -- [4]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -112 (Physical)", -- [5]
						"贰公主洛基-火妖鲁西弗隆 愈合 加加卜鲁艮-逐风者 Tick +160", -- [6]
						"加加卜鲁艮-逐风者 重伤 (伤害/跳) 秃老亮-黑龙费尔默 Absorb -113 (113 被吸收) (Physical)", -- [7]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Crit -132 (Physical)", -- [8]
						"加加卜鲁艮-逐风者 肉搏 张主任-逐风者 Absorb -184 (1)", -- [9]
						"加加卜鲁艮-逐风者 肉搏 张主任-逐风者 Hit -336 (184 被吸收) (Physical)", -- [10]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Crit -252 (Physical)", -- [11]
						"加加卜鲁艮-逐风者 旋风斩 张主任-逐风者 Hit -431 (Physical)", -- [12]
						"加加卜鲁艮-逐风者 旋风斩 红丶枫-逐风者 Crit -1015 (Physical)", -- [13]
						"加加卜鲁艮-逐风者 旋风斩 秃老亮-黑龙费尔默 Absorb -414 (414 被吸收) (Physical)", -- [14]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Dodge (1)", -- [15]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -91 (Physical)", -- [16]
						"加加卜鲁艮-逐风者 断筋 秃老亮-黑龙费尔默 Absorb -43 (43 被吸收) (Physical)", -- [17]
						"加加卜鲁艮-逐风者 血之狂热 加加卜鲁艮-逐风者 Tick +52", -- [18]
						"贰公主洛基-火妖鲁西弗隆 愈合 加加卜鲁艮-逐风者 Tick +159", -- [19]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -163 (Physical)", -- [20]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -93 (Physical)", -- [21]
						"红丶枫-逐风者 重伤 (伤害/跳) 加加卜鲁艮-逐风者 Tick -34 (Physical)", -- [22]
						"加加卜鲁艮-逐风者 重伤 (伤害/跳) 红丶枫-逐风者 Tick -124 (Physical)", -- [23]
						"加加卜鲁艮-逐风者 断筋 红丶枫-逐风者 Hit -43 (Physical)", -- [24]
						"加加卜鲁艮-逐风者 血之狂热 加加卜鲁艮-逐风者 Tick +52", -- [25]
						"红丶枫-逐风者 嗜血 加加卜鲁艮-逐风者 Hit -314 (Physical)", -- [26]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Crit -165 (Physical)", -- [27]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -147 (Physical)", -- [28]
						"加加卜鲁艮-逐风者 肉搏 秃老亮-黑龙费尔默 Absorb -208 (1)", -- [29]
						"加加卜鲁艮-逐风者 肉搏 秃老亮-黑龙费尔默 Hit -275 (208 被吸收) (Physical)", -- [30]
						"加加卜鲁艮-逐风者 断筋 秃老亮-黑龙费尔默 Crit -94 (Physical)", -- [31]
						"红丶枫-逐风者 斩杀 加加卜鲁艮-逐风者 Crit -2487 (Physical)", -- [32]
						"加加卜鲁艮-逐风者死亡。", -- [33]
						"加加卜鲁艮-逐风者 重伤 (伤害/跳) 红丶枫-逐风者 Tick -124 (Physical)", -- [34]
					},
					["DeathAt"] = 43416.595,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["MessageTimes"] = {
						-10.20100000000093, -- [1]
						-9.16700000000128, -- [2]
						-8.98399999999674, -- [3]
						-7.868000000002212, -- [4]
						-7.633999999998196, -- [5]
						-7.201000000000931, -- [6]
						-7.000999999996566, -- [7]
						-6.584000000002561, -- [8]
						-6.31699999999546, -- [9]
						-6.31699999999546, -- [10]
						-6.266999999999825, -- [11]
						-6.000999999996566, -- [12]
						-6.000999999996566, -- [13]
						-6.000999999996566, -- [14]
						-4.900999999998021, -- [15]
						-4.783999999999651, -- [16]
						-4.417000000001281, -- [17]
						-4.250999999996566, -- [18]
						-4.201000000000931, -- [19]
						-3.500999999996566, -- [20]
						-3.500999999996566, -- [21]
						-3.23399999999674, -- [22]
						-2.94999999999709, -- [23]
						-2.883999999998196, -- [24]
						-2.25, -- [25]
						-2.049999999995634, -- [26]
						-1.834000000002561, -- [27]
						-1.75, -- [28]
						-1.44999999999709, -- [29]
						-1.44999999999709, -- [30]
						-0.3499999999985448, -- [31]
						0, -- [32]
						0, -- [33]
						0.05000000000291038, -- [34]
					},
					["HealthMax"] = {
						5259, -- [1]
						5259, -- [2]
						5259, -- [3]
						5259, -- [4]
						5259, -- [5]
						5259, -- [6]
						5259, -- [7]
						5259, -- [8]
						5259, -- [9]
						5259, -- [10]
						5259, -- [11]
						5259, -- [12]
						5259, -- [13]
						5259, -- [14]
						5259, -- [15]
						5259, -- [16]
						5259, -- [17]
						5259, -- [18]
						5259, -- [19]
						5259, -- [20]
						5259, -- [21]
						5259, -- [22]
						5259, -- [23]
						5259, -- [24]
						5259, -- [25]
						5259, -- [26]
						5259, -- [27]
						5259, -- [28]
						5259, -- [29]
						5259, -- [30]
						5259, -- [31]
						5259, -- [32]
						5259, -- [33]
						5259, -- [34]
					},
					["Health"] = {
						1870, -- [1]
						2029, -- [2]
						1977, -- [3]
						1794, -- [4]
						1692, -- [5]
						1580, -- [6]
						1580, -- [7]
						1740, -- [8]
						1608, -- [9]
						1608, -- [10]
						1608, -- [11]
						1356, -- [12]
						1356, -- [13]
						1356, -- [14]
						1356, -- [15]
						1356, -- [16]
						1265, -- [17]
						1265, -- [18]
						1265, -- [19]
						1476, -- [20]
						1476, -- [21]
						1220, -- [22]
						1186, -- [23]
						1186, -- [24]
						1186, -- [25]
						1186, -- [26]
						924, -- [27]
						924, -- [28]
						612, -- [29]
						612, -- [30]
						612, -- [31]
						612, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["KilledBy"] = "红丶枫-逐风者",
					["MessageType"] = {
						"HEAL", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"HEAL", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"HEAL", -- [18]
						"HEAL", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"HEAL", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"MISC", -- [33]
						"DAMAGE", -- [34]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
					},
					["Messages"] = {
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -55 (Physical)", -- [1]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Crit -210 (Physical)", -- [2]
						"向天歌-黑龙费尔默 冰锥术 加加卜鲁艮-逐风者 Hit -549 (Frost)", -- [3]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Crit -110 (Physical)", -- [4]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -110 (Physical)", -- [5]
						"红丶枫-逐风者 断筋 加加卜鲁艮-逐风者 Hit -26 (Physical)", -- [6]
						"向天歌-黑龙费尔默 火焰冲击 加加卜鲁艮-逐风者 Crit -949 (Fire)", -- [7]
						"加加卜鲁艮-逐风者 破胆怒吼 向天歌-黑龙费尔默 Resist (Physical)", -- [8]
						"加加卜鲁艮-逐风者 破胆怒吼 红丶枫-逐风者 Resist (Physical)", -- [9]
						"红丶枫-逐风者 肉搏 加加卜鲁艮-逐风者 Hit -60 (Physical)", -- [10]
						"红丶枫-逐风者 英勇打击 加加卜鲁艮-逐风者 Hit -206 (Physical)", -- [11]
						"红丶枫-逐风者 撕裂 (伤害/跳) 加加卜鲁艮-逐风者 Tick -31 (Physical)", -- [12]
						"加加卜鲁艮-逐风者 致死打击 红丶枫-逐风者 Hit -494 (Physical)", -- [13]
						"加加卜鲁艮-逐风者 血之狂热 加加卜鲁艮-逐风者 Tick +52", -- [14]
						"加加卜鲁艮-逐风者 肉搏 红丶枫-逐风者 Hit -429 (Physical)", -- [15]
						"红丶枫-逐风者 重伤 (伤害/跳) 加加卜鲁艮-逐风者 Tick -31 (Physical)", -- [16]
						"熊汏-黑龙费尔默 星火术 加加卜鲁艮-逐风者 Hit -779 (Arcane)", -- [17]
						"熊汏-黑龙费尔默 月火术 加加卜鲁艮-逐风者 Hit -304 (Arcane)", -- [18]
						"加加卜鲁艮-逐风者 血之狂热 加加卜鲁艮-逐风者 Tick +53", -- [19]
						"红丶枫-逐风者 撕裂 (伤害/跳) 加加卜鲁艮-逐风者 Tick -31 (Physical)", -- [20]
						"红丶枫-逐风者 重伤 (伤害/跳) 加加卜鲁艮-逐风者 Tick -24 (Physical)", -- [21]
						"熊汏-黑龙费尔默 月火术 加加卜鲁艮-逐风者 Hit -218 (Arcane)", -- [22]
						"向天歌-黑龙费尔默 魔爆术 加加卜鲁艮-逐风者 Hit -246 (Arcane)", -- [23]
						"向天歌-黑龙费尔默 吞噬之影 加加卜鲁艮-逐风者 Hit -90 (Shadow)", -- [24]
						"加加卜鲁艮-逐风者 血之狂热 加加卜鲁艮-逐风者 Tick +52", -- [25]
						"熊汏-黑龙费尔默 月火术 (伤害/跳) 加加卜鲁艮-逐风者 Tick -131 (Arcane)", -- [26]
						"红丶枫-逐风者 撕裂 (伤害/跳) 加加卜鲁艮-逐风者 Tick -26 (Physical)", -- [27]
						"熊汏-黑龙费尔默 月火术 加加卜鲁艮-逐风者 Hit -246 (Arcane)", -- [28]
						"红丶枫-逐风者 重伤 (伤害/跳) 加加卜鲁艮-逐风者 Tick -25 (Physical)", -- [29]
						"熊汏-黑龙费尔默 月火术 加加卜鲁艮-逐风者 Hit -245 (Arcane)", -- [30]
						"熊汏-黑龙费尔默 月火术 (伤害/跳) 加加卜鲁艮-逐风者 Tick -130 (Arcane)", -- [31]
						"红丶枫-逐风者 撕裂 (伤害/跳) 加加卜鲁艮-逐风者 Tick -26 (Physical)", -- [32]
						"熊汏-黑龙费尔默 月火术 加加卜鲁艮-逐风者 Hit -277 (Arcane)", -- [33]
						"加加卜鲁艮-逐风者死亡。", -- [34]
					},
					["DeathAt"] = 43017.587,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["MessageTimes"] = {
						-12.43400000000111, -- [1]
						-12.25100000000384, -- [2]
						-12.25100000000384, -- [3]
						-11.10100000000239, -- [4]
						-10.9010000000053, -- [5]
						-10.88400000000547, -- [6]
						-10.75100000000384, -- [7]
						-10.55099999999948, -- [8]
						-10.55099999999948, -- [9]
						-9.817000000002736, -- [10]
						-9.516999999999825, -- [11]
						-9.367000000005646, -- [12]
						-8.78399999999965, -- [13]
						-8.75, -- [14]
						-8.55000000000291, -- [15]
						-8.067000000002736, -- [16]
						-7.450000000004366, -- [17]
						-7.450000000004366, -- [18]
						-6.734000000004016, -- [19]
						-6.367000000005646, -- [20]
						-5.067000000002736, -- [21]
						-4.846000000005006, -- [22]
						-4.783999999999651, -- [23]
						-4.766999999999825, -- [24]
						-4.734000000004016, -- [25]
						-4.450000000004366, -- [26]
						-3.384000000005472, -- [27]
						-3.334000000002561, -- [28]
						-2.067000000002736, -- [29]
						-1.833000000005995, -- [30]
						-1.450000000004366, -- [31]
						-0.3830000000016298, -- [32]
						-0.01699999999982538, -- [33]
						0, -- [34]
					},
					["HealthMax"] = {
						5259, -- [1]
						5259, -- [2]
						5259, -- [3]
						5259, -- [4]
						5259, -- [5]
						5259, -- [6]
						5259, -- [7]
						5259, -- [8]
						5259, -- [9]
						5259, -- [10]
						5259, -- [11]
						5259, -- [12]
						5259, -- [13]
						5259, -- [14]
						5259, -- [15]
						5259, -- [16]
						5259, -- [17]
						5259, -- [18]
						5259, -- [19]
						5259, -- [20]
						5259, -- [21]
						5259, -- [22]
						5259, -- [23]
						5259, -- [24]
						5259, -- [25]
						5259, -- [26]
						5259, -- [27]
						5259, -- [28]
						5259, -- [29]
						5259, -- [30]
						5259, -- [31]
						5259, -- [32]
						5259, -- [33]
						5259, -- [34]
					},
					["Health"] = {
						4893, -- [1]
						4838, -- [2]
						4838, -- [3]
						4079, -- [4]
						3969, -- [5]
						3969, -- [6]
						3833, -- [7]
						2884, -- [8]
						2884, -- [9]
						2884, -- [10]
						2824, -- [11]
						2618, -- [12]
						2587, -- [13]
						2587, -- [14]
						2639, -- [15]
						2639, -- [16]
						2608, -- [17]
						2608, -- [18]
						1525, -- [19]
						1578, -- [20]
						1547, -- [21]
						1523, -- [22]
						1523, -- [23]
						1059, -- [24]
						1059, -- [25]
						1021, -- [26]
						890, -- [27]
						864, -- [28]
						618, -- [29]
						593, -- [30]
						348, -- [31]
						218, -- [32]
						192, -- [33]
						0, -- [34]
					},
					["KilledBy"] = "熊汏-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"HEAL", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"HEAL", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"HEAL", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"MISC", -- [34]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 13,
			["type"] = "Grouped",
			["LastHealTime"] = 44438.682,
			["LastEventHealth"] = {
				3959, -- [1]
				3681, -- [2]
				3435, -- [3]
				3435, -- [4]
				3435, -- [5]
				2067, -- [6]
				1797, -- [7]
				5259, -- [8]
				5259, -- [9]
				5259, -- [10]
				2245, -- [11]
				1998, -- [12]
				1810, -- [13]
				1563, -- [14]
				5259, -- [15]
				5259, -- [16]
				5259, -- [17]
				3700, -- [18]
				3700, -- [19]
				3444, -- [20]
				3444, -- [21]
				3444, -- [22]
				3444, -- [23]
				5259, -- [24]
				3987, -- [25]
				3987, -- [26]
				3886, -- [27]
				3631, -- [28]
				3631, -- [29]
				3530, -- [30]
				2767, -- [31]
				2503, -- [32]
				2402, -- [33]
				2402, -- [34]
				1891, -- [35]
				1620, -- [36]
				1380, -- [37]
				1380, -- [38]
				1380, -- [39]
				1380, -- [40]
				869, -- [41]
				869, -- [42]
				448, -- [43]
				5259, -- [44]
				5076, -- [45]
				4843, -- [46]
				4843, -- [47]
				4749, -- [48]
				4749, -- [49]
				4222, -- [50]
			},
			["LastDamageTaken"] = 248,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				5259, -- [1]
				5259, -- [2]
				5259, -- [3]
				5259, -- [4]
				5259, -- [5]
				5259, -- [6]
				5259, -- [7]
				5259, -- [8]
				5259, -- [9]
				5259, -- [10]
				5259, -- [11]
				5259, -- [12]
				5259, -- [13]
				5259, -- [14]
				5259, -- [15]
				5259, -- [16]
				5259, -- [17]
				5259, -- [18]
				5259, -- [19]
				5259, -- [20]
				5259, -- [21]
				5259, -- [22]
				5259, -- [23]
				5259, -- [24]
				5259, -- [25]
				5259, -- [26]
				5259, -- [27]
				5259, -- [28]
				5259, -- [29]
				5259, -- [30]
				5259, -- [31]
				5259, -- [32]
				5259, -- [33]
				5259, -- [34]
				5259, -- [35]
				5259, -- [36]
				5259, -- [37]
				5259, -- [38]
				5259, -- [39]
				5259, -- [40]
				5259, -- [41]
				5259, -- [42]
				5259, -- [43]
				5259, -- [44]
				5259, -- [45]
				5259, -- [46]
				5259, -- [47]
				5259, -- [48]
				5259, -- [49]
				5259, -- [50]
			},
			["NextEventNum"] = 25,
			["LastDamageTime"] = 44438.682,
			["LastEvents"] = {
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -278 (Shadow)", -- [1]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -246 (Shadow)", -- [2]
				"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 加加卜鲁艮-逐风者 Tick -271 (Shadow)", -- [3]
				"炽天使-黑龙费尔默 火焰冲击 加加卜鲁艮-逐风者 Crit -855 (Fire)", -- [4]
				"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 加加卜鲁艮-逐风者 Tick -242 (Shadow)", -- [5]
				"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 加加卜鲁艮-逐风者 Tick -270 (Shadow)", -- [6]
				"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 加加卜鲁艮-逐风者 Tick -249 (Shadow)", -- [7]
				"加加卜鲁艮-逐风者 撕裂 (伤害/跳) 耍下-黑龙费尔默 Absorb -24 (24 被吸收) (Physical)", -- [8]
				"加加卜鲁艮-逐风者 撕裂 (伤害/跳) 耍下-黑龙费尔默 Absorb -24 (24 被吸收) (Physical)", -- [9]
				"加加卜鲁艮-逐风者 撕裂 (伤害/跳) 耍下-黑龙费尔默 Absorb -24 (24 被吸收) (Physical)", -- [10]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -247 (Shadow)", -- [11]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -278 (Shadow)", -- [12]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -247 (Shadow)", -- [13]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -278 (Shadow)", -- [14]
				"加加卜鲁艮-逐风者 冲锋击昏 蓝染-黑龙费尔默 Resist (Physical)", -- [15]
				"加加卜鲁艮-逐风者 肉搏 蓝染-黑龙费尔默 Hit -402 (Physical)", -- [16]
				"加加卜鲁艮-逐风者 肉搏 蓝染-黑龙费尔默 Absorb -419 (419 被吸收) (1)", -- [17]
				"加加卜鲁艮-逐风者 致死打击 欧尛-火妖鲁西弗隆 Hit -462 (Physical)", -- [18]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -256 (Shadow)", -- [19]
				"加加卜鲁艮-逐风者 撕裂 (伤害/跳) 欧尛-火妖鲁西弗隆 Tick -29 (Physical)", -- [20]
				"加加卜鲁艮-逐风者 神圣力量 加加卜鲁艮-逐风者 Hit +117", -- [21]
				"加加卜鲁艮-逐风者 肉搏 欧尛-火妖鲁西弗隆 Hit -403 (Physical)", -- [22]
				"欧尛-火妖鲁西弗隆 冰冻 加加卜鲁艮-逐风者 Resist (Frost)", -- [23]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -248 (Shadow)", -- [24]
				"加加卜鲁艮-逐风者 肉搏 蓝染-黑龙费尔默 Crit -717 (Physical)", -- [25]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 加加卜鲁艮-逐风者 Tick -101 (Nature)", -- [26]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -255 (Shadow)", -- [27]
				"加加卜鲁艮-逐风者 斩杀 蓝染-黑龙费尔默 Hit -1387 (Physical)", -- [28]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 加加卜鲁艮-逐风者 Tick -101 (Nature)", -- [29]
				"耍下-黑龙费尔默 心灵震爆 加加卜鲁艮-逐风者 Hit -763 (Shadow)", -- [30]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -264 (Shadow)", -- [31]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 加加卜鲁艮-逐风者 Tick -101 (Nature)", -- [32]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -271 (Shadow)", -- [33]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -240 (Shadow)", -- [34]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -271 (Shadow)", -- [35]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -240 (Shadow)", -- [36]
				"加加卜鲁艮-逐风者 肉搏 炽天使-黑龙费尔默 Hit -436 (Physical)", -- [37]
				"加加卜鲁艮-逐风者 断筋 炽天使-黑龙费尔默 Crit -89 (Physical)", -- [38]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -271 (Shadow)", -- [39]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -240 (Shadow)", -- [40]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -270 (Shadow)", -- [41]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -240 (Shadow)", -- [42]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -240 (Shadow)", -- [43]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -227 (Shadow)", -- [44]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 加加卜鲁艮-逐风者 Tick -233 (Shadow)", -- [45]
				"炽天使-黑龙费尔默 冰霜新星 加加卜鲁艮-逐风者 Hit -94 (Frost)", -- [46]
				"加加卜鲁艮-逐风者 肉搏 耍下-黑龙费尔默 Absorb -290 (290 被吸收) (1)", -- [47]
				"加加卜鲁艮-逐风者 断筋 耍下-黑龙费尔默 Absorb -26 (26 被吸收) (Physical)", -- [48]
				"炽天使-黑龙费尔默 冰锥术 加加卜鲁艮-逐风者 Hit -527 (Frost)", -- [49]
				"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 加加卜鲁艮-逐风者 Tick -263 (Shadow)", -- [50]
			},
			["Name"] = "加加卜鲁艮-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				44347.117, -- [1]
				44347.533, -- [2]
				44347.75, -- [3]
				44347.95, -- [4]
				44348.05, -- [5]
				44348.733, -- [6]
				44349.05, -- [7]
				44361.718, -- [8]
				44364.718, -- [9]
				44367.718, -- [10]
				44381.485, -- [11]
				44382.519, -- [12]
				44384.502, -- [13]
				44385.519, -- [14]
				44417.587, -- [15]
				44418.104, -- [16]
				44422.921, -- [17]
				44436.605, -- [18]
				44437.272, -- [19]
				44438.105, -- [20]
				44438.682, -- [21]
				44438.682, -- [22]
				44438.703, -- [23]
				44440.272, -- [24]
				44239.41, -- [25]
				44239.91, -- [26]
				44240.66, -- [27]
				44242.077, -- [28]
				44242.929, -- [29]
				44243.16, -- [30]
				44243.661, -- [31]
				44245.911, -- [32]
				44246.661, -- [33]
				44246.744, -- [34]
				44249.661, -- [35]
				44249.778, -- [36]
				44250.461, -- [37]
				44250.461, -- [38]
				44252.661, -- [39]
				44252.778, -- [40]
				44255.661, -- [41]
				44255.745, -- [42]
				44258.745, -- [43]
				44341.533, -- [44]
				44344.533, -- [45]
				44344.93300000001, -- [46]
				44345.016, -- [47]
				44345.116, -- [48]
				44346.45, -- [49]
				44346.733, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["耍下-黑龙费尔默"] = {
									["count"] = 6,
								},
								["欧尛-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1554,
					["RageGainedFrom"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 1554,
					},
					["DOT_Time"] = 9,
					["Damage"] = 1763,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 419,
						["Physical"] = 48,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 1224,
						["Physical"] = 539,
					},
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 462,
								},
								["肉搏"] = {
									["count"] = 403,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 29,
								},
							},
							["amount"] = 894,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 821,
								},
							},
							["amount"] = 821,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 48,
								},
							},
							["amount"] = 48,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 494,
								},
							},
							["amount"] = 494,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1060,
								},
							},
							["amount"] = 1060,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["加加卜鲁艮-逐风者"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["HealedWho"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 117,
								},
							},
							["amount"] = 117,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.58,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.58,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.52,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 117,
									["min"] = 117,
									["count"] = 1,
									["amount"] = 117,
								},
							},
							["count"] = 1,
							["amount"] = 117,
						},
					},
					["WhoHealed"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 117,
								},
							},
							["amount"] = 117,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 11.6,
					["Healing"] = 117,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 462,
									["min"] = 462,
									["count"] = 1,
									["amount"] = 462,
								},
							},
							["count"] = 1,
							["amount"] = 462,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 419,
									["min"] = 419,
									["count"] = 1,
									["amount"] = 419,
								},
								["Hit"] = {
									["max"] = 403,
									["min"] = 402,
									["count"] = 2,
									["amount"] = 805,
								},
							},
							["count"] = 3,
							["amount"] = 1224,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
								["Absorb"] = {
									["max"] = 24,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 48,
								},
							},
							["count"] = 3,
							["amount"] = 77,
						},
					},
					["HealingTaken"] = 117,
					["RageGain"] = 2,
					["TimeDamage"] = 10.1,
					["TimeDamaging"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.58,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.58,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.52,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["血之狂热"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 9,
						},
					},
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["耍下-黑龙费尔默"] = {
									["count"] = 9,
								},
								["欧尛-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["红丶枫-逐风者"] = {
									["count"] = 6,
								},
								["秃老亮-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 1101,
						["Physical"] = 668,
					},
					["DOT_Time"] = 24,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 17,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 28,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 30,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["DamageTaken"] = 19380,
					["RageGainedFrom"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 30,
								},
								["怒不可遏"] = {
									["count"] = 2,
								},
								["血性狂暴"] = {
									["count"] = 20,
								},
							},
							["amount"] = 52,
						},
					},
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 23,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["星火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["吞噬之影"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["星火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["吞噬之影"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 39.90000000000001,
					["HealingTaken"] = 856,
					["ElementTaken"] = {
						["Physical"] = 3288,
						["Melee"] = 2037,
						["Arcane"] = 2576,
						["Frost"] = 1170,
						["Fire"] = 1804,
						["Shadow"] = 8000,
						["Nature"] = 505,
					},
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["加加卜鲁艮-逐风者"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["怒不可遏"] = {
							["Details"] = {
								["加加卜鲁艮-逐风者"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["血性狂暴"] = {
							["Details"] = {
								["加加卜鲁艮-逐风者"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["Damage"] = 9172,
					["WhoHealed"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 117,
								},
								["血之狂热"] = {
									["count"] = 261,
								},
							},
							["amount"] = 378,
						},
						["贰公主洛基-火妖鲁西弗隆"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 478,
								},
							},
							["amount"] = 478,
						},
					},
					["TimeHeal"] = 9,
					["HealedWho"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 117,
								},
								["血之狂热"] = {
									["count"] = 261,
								},
							},
							["amount"] = 378,
						},
					},
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 117,
									["min"] = 117,
									["count"] = 1,
									["amount"] = 117,
								},
							},
							["count"] = 1,
							["amount"] = 117,
						},
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 53,
									["min"] = 52,
									["count"] = 5,
									["amount"] = 261,
								},
							},
							["count"] = 5,
							["amount"] = 261,
						},
					},
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["加加卜鲁艮-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Healing"] = 378,
					["HOT_Time"] = 15,
					["DamagedWho"] = {
						["张主任-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 431,
								},
								["肉搏"] = {
									["count"] = 520,
								},
							},
							["amount"] = 951,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 462,
								},
								["肉搏"] = {
									["count"] = 403,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 29,
								},
							},
							["amount"] = 894,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 26,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 72,
								},
								["肉搏"] = {
									["count"] = 290,
								},
							},
							["amount"] = 388,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 494,
								},
								["旋风斩"] = {
									["count"] = 1015,
								},
								["断筋"] = {
									["count"] = 43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 248,
								},
								["肉搏"] = {
									["count"] = 429,
								},
							},
							["amount"] = 2229,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 89,
								},
								["肉搏"] = {
									["count"] = 436,
								},
							},
							["amount"] = 525,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1387,
								},
								["肉搏"] = {
									["count"] = 1538,
								},
							},
							["amount"] = 2925,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 483,
								},
								["断筋"] = {
									["count"] = 137,
								},
								["旋风斩"] = {
									["count"] = 414,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 226,
								},
							},
							["amount"] = 1260,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 494,
									["min"] = 462,
									["count"] = 2,
									["amount"] = 956,
								},
							},
							["count"] = 2,
							["amount"] = 956,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 124,
									["min"] = 113,
									["count"] = 3,
									["amount"] = 361,
								},
								["Absorb"] = {
									["max"] = 113,
									["min"] = 113,
									["count"] = 1,
									["amount"] = 113,
								},
							},
							["count"] = 4,
							["amount"] = 474,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 414,
									["min"] = 414,
									["count"] = 1,
									["amount"] = 414,
								},
								["Crit"] = {
									["max"] = 1015,
									["min"] = 1015,
									["count"] = 1,
									["amount"] = 1015,
								},
								["Hit"] = {
									["max"] = 431,
									["min"] = 431,
									["count"] = 1,
									["amount"] = 431,
								},
							},
							["count"] = 3,
							["amount"] = 1860,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
								["Absorb"] = {
									["max"] = 24,
									["min"] = 24,
									["count"] = 3,
									["amount"] = 72,
								},
							},
							["count"] = 4,
							["amount"] = 101,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 43,
									["min"] = 26,
									["count"] = 2,
									["amount"] = 69,
								},
								["Crit"] = {
									["max"] = 94,
									["min"] = 89,
									["count"] = 2,
									["amount"] = 183,
								},
								["Hit"] = {
									["max"] = 43,
									["min"] = 43,
									["count"] = 1,
									["amount"] = 43,
								},
							},
							["count"] = 5,
							["amount"] = 295,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1387,
									["min"] = 1387,
									["count"] = 1,
									["amount"] = 1387,
								},
							},
							["count"] = 1,
							["amount"] = 1387,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 419,
									["min"] = 184,
									["count"] = 4,
									["amount"] = 1101,
								},
								["Crit"] = {
									["max"] = 717,
									["min"] = 717,
									["count"] = 1,
									["amount"] = 717,
								},
								["Hit"] = {
									["max"] = 436,
									["min"] = 275,
									["count"] = 6,
									["amount"] = 2281,
								},
							},
							["count"] = 11,
							["amount"] = 4099,
						},
					},
					["RageGain"] = 52,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 11,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 22,
						},
					},
					["TimeDamage"] = 30.9,
					["WhoDamaged"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["星火术"] = {
									["count"] = 779,
								},
								["月火术"] = {
									["count"] = 1290,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 261,
								},
							},
							["amount"] = 2330,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 763,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2400,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 491,
								},
							},
							["amount"] = 3654,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 246,
								},
								["吞噬之影"] = {
									["count"] = 90,
								},
								["火焰冲击"] = {
									["count"] = 949,
								},
								["冰锥术"] = {
									["count"] = 549,
								},
							},
							["amount"] = 1834,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 114,
								},
								["英勇打击"] = {
									["count"] = 206,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 114,
								},
								["嗜血"] = {
									["count"] = 314,
								},
								["断筋"] = {
									["count"] = 26,
								},
								["斩杀"] = {
									["count"] = 2487,
								},
								["肉搏"] = {
									["count"] = 2037,
								},
							},
							["amount"] = 5298,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 855,
								},
								["冰锥术"] = {
									["count"] = 527,
								},
								["冰霜新星"] = {
									["count"] = 94,
								},
							},
							["amount"] = 1476,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 505,
								},
							},
							["amount"] = 505,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3452,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 804,
								},
							},
							["amount"] = 4256,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
					},
					["ElementDone"] = {
						["Melee"] = 4099,
						["Physical"] = 5073,
					},
					["TimeSpent"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["血之狂热"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 9,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.58,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.58,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 1,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.87,
								},
								["肉搏"] = {
									["count"] = 0.23,
								},
							},
							["amount"] = 3.67,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.1,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.1,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.52,
								},
							},
							["amount"] = 6.52,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.6,
								},
								["肉搏"] = {
									["count"] = 1.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.029999999999999,
						},
					},
					["TimeDamaging"] = {
						["张主任-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 1,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.58,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.58,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.87,
								},
								["肉搏"] = {
									["count"] = 0.23,
								},
							},
							["amount"] = 3.67,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.1,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.1,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.52,
								},
							},
							["amount"] = 6.52,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.6,
								},
								["肉搏"] = {
									["count"] = 1.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.029999999999999,
						},
					},
				},
			},
			["UnitLockout"] = 43615.591,
			["LastActive"] = 44439.588,
		},
		["特变电工"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
					},
					["Messages"] = {
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -281 (Shadow)", -- [1]
						"蓝染-黑龙费尔默 心灵震爆 特变电工 Hit -913 (Shadow)", -- [2]
						"狩望者-黑龙费尔默 自动射击 特变电工 Crit -518 (Physical)", -- [3]
						"狩望者-黑龙费尔默 烈焰弹 特变电工 Crit -101 (Fire)", -- [4]
						"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -289 (Shadow)", -- [5]
						"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -289 (Shadow)", -- [6]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -298 (Shadow)", -- [7]
						"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -289 (Shadow)", -- [8]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -242 (Physical)", -- [9]
						"狩望者-黑龙费尔默 烈焰弹 特变电工 Hit -38 (Fire)", -- [10]
						"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -297 (Shadow)", -- [11]
						"特变电工 破胆怒吼 蓝染-黑龙费尔默 Resist (Physical)", -- [12]
						"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -297 (Shadow)", -- [13]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -306 (Shadow)", -- [14]
						"狩望者-黑龙费尔默 自动射击 特变电工 Crit -600 (Physical)", -- [15]
						"特变电工死亡。", -- [16]
					},
					["DeathAt"] = 44200.591,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
					},
					["MessageTimes"] = {
						-6.315999999998894, -- [1]
						-6.315999999998894, -- [2]
						-5.44999999999709, -- [3]
						-5.432000000000699, -- [4]
						-5.23399999999674, -- [5]
						-4.23399999999674, -- [6]
						-3.334000000002561, -- [7]
						-3.23399999999674, -- [8]
						-2.766999999999825, -- [9]
						-2.766999999999825, -- [10]
						-2, -- [11]
						-2, -- [12]
						-1.016999999999825, -- [13]
						-0.3169999999954598, -- [14]
						-0.03399999999965075, -- [15]
						0, -- [16]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
					},
					["Health"] = {
						4632, -- [1]
						4632, -- [2]
						3438, -- [3]
						3438, -- [4]
						2819, -- [5]
						2530, -- [6]
						2241, -- [7]
						1943, -- [8]
						1654, -- [9]
						1412, -- [10]
						1374, -- [11]
						1077, -- [12]
						1077, -- [13]
						780, -- [14]
						474, -- [15]
						0, -- [16]
					},
					["KilledBy"] = "狩望者-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"MISC", -- [16]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
					},
					["Messages"] = {
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -222 (Physical)", -- [1]
						"特变电工 肉搏 蓝染-黑龙费尔默 Absorb -256 (1)", -- [2]
						"特变电工 肉搏 蓝染-黑龙费尔默 Hit -56 (256 被吸收) (Physical)", -- [3]
						"特变电工 肉搏 耍下-黑龙费尔默 Hit -364 (Physical)", -- [4]
						"特变电工 断筋 耍下-黑龙费尔默 Hit -33 (Physical)", -- [5]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -249 (Shadow)", -- [6]
						"狩望者-黑龙费尔默 自动射击 特变电工 Crit -566 (Physical)", -- [7]
						"特变电工 拳击 耍下-黑龙费尔默 Absorb -92 (92 被吸收) (Physical)", -- [8]
						"特变电工 interrupts 耍下-黑龙费尔默 心灵震爆 (拳击)", -- [9]
						"特变电工 肉搏 耍下-黑龙费尔默 Absorb -476 (476 被吸收) (1)", -- [10]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -250 (Shadow)", -- [11]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -219 (Physical)", -- [12]
						"特变电工 重伤 (伤害/跳) 耍下-黑龙费尔默 Absorb -101 (101 被吸收) (Physical)", -- [13]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -223 (Physical)", -- [14]
						"狩望者-黑龙费尔默 烈焰弹 特变电工 Hit -37 (11 被抵抗) (Fire)", -- [15]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -250 (Shadow)", -- [16]
						"特变电工 肉搏 耍下-黑龙费尔默 Dodge (1)", -- [17]
						"特变电工 旋风斩 耍下-黑龙费尔默 Absorb -367 (367 被吸收) (Physical)", -- [18]
						"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -229 (Shadow)", -- [19]
						"特变电工 肉搏 耍下-黑龙费尔默 Absorb -69 (1)", -- [20]
						"特变电工 压制 耍下-黑龙费尔默 Crit -790 (69 被吸收) (Physical)", -- [21]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -231 (Physical)", -- [22]
						"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -229 (Shadow)", -- [23]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -233 (Shadow)", -- [24]
						"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 特变电工 Tick -229 (Shadow)", -- [25]
						"特变电工死亡。", -- [26]
						"特变电工 重伤 (伤害/跳) 耍下-黑龙费尔默 Tick -101 (Physical)", -- [27]
					},
					["DeathAt"] = 44151.589,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["MessageTimes"] = {
						-14.80299999999988, -- [1]
						-14.60299999999552, -- [2]
						-14.60299999999552, -- [3]
						-10.80299999999988, -- [4]
						-10.70299999999406, -- [5]
						-9.786000000000058, -- [6]
						-9.235999999997148, -- [7]
						-7.352999999995518, -- [8]
						-7.352999999995518, -- [9]
						-7.002999999996973, -- [10]
						-6.769999999996799, -- [11]
						-6.618999999998778, -- [12]
						-4.318999999995867, -- [13]
						-3.885999999998603, -- [14]
						-3.868999999998778, -- [15]
						-3.768999999992957, -- [16]
						-3.202999999994063, -- [17]
						-3.001999999993132, -- [18]
						-2.036000000000058, -- [19]
						-1.502999999996973, -- [20]
						-1.502999999996973, -- [21]
						-1.252999999996973, -- [22]
						-1.036000000000058, -- [23]
						-0.7860000000000582, -- [24]
						-0.01899999999295687, -- [25]
						0, -- [26]
						1.531000000002678, -- [27]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
					},
					["Health"] = {
						3151, -- [1]
						2929, -- [2]
						2929, -- [3]
						2929, -- [4]
						2929, -- [5]
						2929, -- [6]
						2680, -- [7]
						2114, -- [8]
						2114, -- [9]
						2114, -- [10]
						2114, -- [11]
						1864, -- [12]
						1645, -- [13]
						1645, -- [14]
						1645, -- [15]
						1385, -- [16]
						1135, -- [17]
						1135, -- [18]
						1135, -- [19]
						906, -- [20]
						906, -- [21]
						906, -- [22]
						675, -- [23]
						446, -- [24]
						213, -- [25]
						0, -- [26]
						1, -- [27]
					},
					["KilledBy"] = "耍下-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"MISC", -- [26]
						"DAMAGE", -- [27]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
					},
					["Messages"] = {
						"丧尸暴龙-逐风者 肉搏 特变电工 Hit -59 (Physical)", -- [1]
						"炽天使-黑龙费尔默 冰锥术 特变电工 Hit -592 (Frost)", -- [2]
						"丧尸暴龙-逐风者 出血 特变电工 Hit -204 (Physical)", -- [3]
						"丧尸暴龙-逐风者 出血 特变电工 Crit -432 (Physical)", -- [4]
						"丧尸暴龙-逐风者 肉搏 特变电工 Hit -58 (Physical)", -- [5]
						"丧尸暴龙-逐风者 肉搏 特变电工 Crit -392 (Physical)", -- [6]
						"丧尸暴龙-逐风者 肉搏 特变电工 Hit -60 (Physical)", -- [7]
						"丧尸暴龙-逐风者 出血 特变电工 Hit -193 (Physical)", -- [8]
						"丧尸暴龙-逐风者 肉搏 特变电工 Hit -174 (Physical)", -- [9]
						"像疯一样离去-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -179 (Shadow)", -- [10]
						"像疯一样离去-火妖鲁西弗隆 心灵震爆 特变电工 Hit -648 (Shadow)", -- [11]
						"炽天使-黑龙费尔默 魔爆术 特变电工 Hit -321 (Arcane)", -- [12]
						"像疯一样离去-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -179 (Shadow)", -- [13]
						"像疯一样离去-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 特变电工 Tick -133 (Shadow)", -- [14]
						"特变电工 破胆怒吼 像疯一样离去-火妖鲁西弗隆 Resist (Physical)", -- [15]
						"特变电工 破胆怒吼 炽天使-黑龙费尔默 Immune (Physical)", -- [16]
						"像疯一样离去-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -178 (Shadow)", -- [17]
						"特变电工 肉搏 像疯一样离去-火妖鲁西弗隆 Hit -521 (Physical)", -- [18]
						"像疯一样离去-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 特变电工 Tick -133 (Shadow)", -- [19]
						"炽天使-黑龙费尔默 冰锥术 特变电工 Hit -602 (Frost)", -- [20]
						"特变电工 致死打击 丧尸暴龙-逐风者 Crit -1408 (Physical)", -- [21]
						"像疯一样离去-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -178 (Shadow)", -- [22]
						"像疯一样离去-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 特变电工 Tick -133 (Shadow)", -- [23]
						"特变电工 斩杀 丧尸暴龙-逐风者 Hit -987 (Physical)", -- [24]
						"炽天使-黑龙费尔默 冰霜新星 特变电工 Hit -101 (Frost)", -- [25]
						"特变电工死亡。", -- [26]
					},
					["DeathAt"] = 43921.592,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
					},
					["MessageTimes"] = {
						-14.96800000000076, -- [1]
						-14.95100000000093, -- [2]
						-14.83400000000256, -- [3]
						-13.71800000000076, -- [4]
						-13.18400000000111, -- [5]
						-13.08400000000256, -- [6]
						-11.38400000000547, -- [7]
						-11.31700000000274, -- [8]
						-11.30100000000675, -- [9]
						-11.10100000000239, -- [10]
						-11.10100000000239, -- [11]
						-8.217000000004191, -- [12]
						-8.101000000002387, -- [13]
						-7.167000000001281, -- [14]
						-6.167000000001281, -- [15]
						-6.167000000001281, -- [16]
						-5.117000000005646, -- [17]
						-4.516999999999825, -- [18]
						-4.150000000001455, -- [19]
						-3.05000000000291, -- [20]
						-2.634000000005472, -- [21]
						-2.117000000005646, -- [22]
						-1.167000000001281, -- [23]
						-1.113000000004831, -- [24]
						-0.03300000000308501, -- [25]
						0, -- [26]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
					},
					["Health"] = {
						4867, -- [1]
						4808, -- [2]
						4216, -- [3]
						4012, -- [4]
						3580, -- [5]
						3522, -- [6]
						3130, -- [7]
						3070, -- [8]
						3070, -- [9]
						2703, -- [10]
						2703, -- [11]
						1876, -- [12]
						1555, -- [13]
						1376, -- [14]
						1243, -- [15]
						1243, -- [16]
						1243, -- [17]
						1065, -- [18]
						1065, -- [19]
						932, -- [20]
						330, -- [21]
						330, -- [22]
						152, -- [23]
						19, -- [24]
						19, -- [25]
						0, -- [26]
					},
					["KilledBy"] = "炽天使-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"MISC", -- [26]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
					},
					["Messages"] = {
						"特变电工 肉搏 秃老亮-黑龙费尔默 Absorb -753 (753 被吸收) (1)", -- [1]
						"秃老亮-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -211 (Shadow)", -- [2]
						"特变电工 重伤 (伤害/跳) 秃老亮-黑龙费尔默 Absorb -86 (86 被吸收) (Physical)", -- [3]
						"秃老亮-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -211 (Shadow)", -- [4]
						"秃老亮-黑龙费尔默 神圣新星 特变电工 Hit -298 (Holy)", -- [5]
						"特变电工 肉搏 秃老亮-黑龙费尔默 Absorb -235 (1)", -- [6]
						"特变电工 肉搏 秃老亮-黑龙费尔默 Crit -626 (235 被吸收) (Physical)", -- [7]
						"特变电工 致死打击 秃老亮-黑龙费尔默 Crit -1185 (Physical)", -- [8]
						"秃老亮-黑龙费尔默 神圣新星 特变电工 Hit -289 (Holy)", -- [9]
						"秃老亮-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -211 (Shadow)", -- [10]
						"秃老亮-黑龙费尔默 神圣新星 特变电工 Hit -273 (Holy)", -- [11]
						"特变电工 重伤 (伤害/跳) 秃老亮-黑龙费尔默 Tick -86 (Physical)", -- [12]
						"秃老亮-黑龙费尔默 神圣新星 特变电工 Hit -279 (Holy)", -- [13]
						"特变电工 肉搏 秃老亮-黑龙费尔默 Crit -831 (Physical)", -- [14]
						"特变电工 旋风斩 秃老亮-黑龙费尔默 Crit -850 (Physical)", -- [15]
						"向天歌-黑龙费尔默 寒冰箭 特变电工 Hit -888 (Frost)", -- [16]
						"秃老亮-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -211 (Shadow)", -- [17]
						"秃老亮-黑龙费尔默 神圣新星 特变电工 Hit -288 (Holy)", -- [18]
						"特变电工 致死打击 秃老亮-黑龙费尔默 Crit -1174 (Physical)", -- [19]
						"向天歌-黑龙费尔默 寒冰箭 特变电工 Hit -871 (Frost)", -- [20]
						"特变电工死亡。", -- [21]
					},
					["DeathAt"] = 43870.589,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
					},
					["MessageTimes"] = {
						-10.85100000000239, -- [1]
						-10.76800000000367, -- [2]
						-7.834000000002561, -- [3]
						-7.768000000003667, -- [4]
						-7.768000000003667, -- [5]
						-7.051000000006752, -- [6]
						-7.051000000006752, -- [7]
						-6.884000000005472, -- [8]
						-6.016999999999825, -- [9]
						-4.766999999999825, -- [10]
						-4.501000000003842, -- [11]
						-3.867000000005646, -- [12]
						-3.001000000003842, -- [13]
						-2.734000000004016, -- [14]
						-2.234000000004016, -- [15]
						-2.234000000004016, -- [16]
						-1.766999999999825, -- [17]
						-1.317000000002736, -- [18]
						-0.05000000000291038, -- [19]
						0, -- [20]
						0, -- [21]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
					},
					["Health"] = {
						3297, -- [1]
						3297, -- [2]
						3086, -- [3]
						3086, -- [4]
						2875, -- [5]
						2577, -- [6]
						2577, -- [7]
						2577, -- [8]
						2577, -- [9]
						2288, -- [10]
						2077, -- [11]
						1804, -- [12]
						1804, -- [13]
						1525, -- [14]
						1525, -- [15]
						1525, -- [16]
						637, -- [17]
						426, -- [18]
						138, -- [19]
						138, -- [20]
						0, -- [21]
					},
					["KilledBy"] = "向天歌-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"MISC", -- [21]
					},
				}, -- [4]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
					},
					["Messages"] = {
						"特变电工 断筋 张主任-逐风者 Hit -37 (Physical)", -- [1]
						"特变电工 肉搏 张主任-逐风者 Hit -377 (Physical)", -- [2]
						"特变电工 旋风斩 张主任-逐风者 Hit -412 (Physical)", -- [3]
						"张主任-逐风者 冰霜新星 特变电工 Resist (Frost)", -- [4]
						"特变电工 肉搏 张主任-逐风者 Crit -750 (Physical)", -- [5]
						"特变电工 断筋 张主任-逐风者 Hit -37 (Physical)", -- [6]
						"张主任-逐风者 冰锥术 特变电工 Hit -555 (Frost)", -- [7]
						"张主任-逐风者 冲击波 特变电工 Hit -607 (Fire)", -- [8]
						"特变电工死亡。", -- [9]
						"特变电工 重伤 (伤害/跳) 张主任-逐风者 Tick -76 (Physical)", -- [10]
					},
					["DeathAt"] = 43781.584,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
					},
					["MessageTimes"] = {
						-8.23399999999674, -- [1]
						-7.633999999998196, -- [2]
						-5.966999999996915, -- [3]
						-3.049999999995634, -- [4]
						-2.882999999994354, -- [5]
						-2.733000000000175, -- [6]
						-1.532999999995809, -- [7]
						-0.03299999999580905, -- [8]
						0, -- [9]
						0.1560000000026776, -- [10]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
					},
					["Health"] = {
						1044, -- [1]
						1044, -- [2]
						1044, -- [3]
						1044, -- [4]
						1044, -- [5]
						1044, -- [6]
						1044, -- [7]
						489, -- [8]
						0, -- [9]
						0, -- [10]
					},
					["KilledBy"] = "张主任-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
						"DAMAGE", -- [10]
					},
				}, -- [5]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
					},
					["Messages"] = {
						"特变电工 肉搏 熊汏-黑龙费尔默 Hit -364 (Physical)", -- [1]
						"熊汏-黑龙费尔默 荆棘术 特变电工 Hit -18 (Nature)", -- [2]
						"特变电工 断筋 熊汏-黑龙费尔默 Crit -82 (Physical)", -- [3]
						"熊汏-黑龙费尔默 荆棘术 特变电工 Hit -18 (Nature)", -- [4]
						"特变电工 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -76 (Physical)", -- [5]
						"特变电工 肉搏 贴身施法 Immune (1)", -- [6]
						"熊汏-黑龙费尔默 纠缠根须 特变电工 Resist (Nature)", -- [7]
						"特变电工 拦截昏迷 熊汏-黑龙费尔默 Hit -33 (Physical)", -- [8]
						"特变电工 断筋 熊汏-黑龙费尔默 Hit -24 (Physical)", -- [9]
						"熊汏-黑龙费尔默 荆棘术 特变电工 Hit -20 (Nature)", -- [10]
						"特变电工 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -75 (Physical)", -- [11]
						"特变电工 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -76 (Physical)", -- [12]
						"熊汏-黑龙费尔默 月火术 特变电工 Hit -321 (Arcane)", -- [13]
						"特变电工 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -76 (Physical)", -- [14]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -212 (Physical)", -- [15]
						"狩望者-黑龙费尔默 烈焰弹 特变电工 Hit -50 (Fire)", -- [16]
						"狩望者-黑龙费尔默 多重射击 特变电工 Crit -865 (Physical)", -- [17]
						"贴身施法 冰锥术 特变电工 Hit -599 (Frost)", -- [18]
						"贴身施法 寒冰箭 特变电工 Hit -767 (Frost)", -- [19]
						"鬼武者 肉搏 特变电工 Hit -52 (Physical)", -- [20]
						"鬼武者 爪击 特变电工 Hit -50 (Physical)", -- [21]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [22]
						"特变电工 肉搏 贴身施法 Absorb -175 (1)", -- [23]
						"特变电工 肉搏 贴身施法 Hit -339 (175 被吸收) (Physical)", -- [24]
						"特变电工 致死打击 贴身施法 Hit -671 (Physical)", -- [25]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -233 (Physical)", -- [26]
						"狩望者-黑龙费尔默 烈焰弹 特变电工 Hit -47 (Fire)", -- [27]
						"熊汏-黑龙费尔默 月火术 (伤害/跳) 特变电工 Tick -159 (Arcane)", -- [28]
						"鬼武者 肉搏 特变电工 Hit -51 (Physical)", -- [29]
						"贴身施法 火焰冲击 特变电工 Hit -626 (Fire)", -- [30]
						"特变电工死亡。", -- [31]
					},
					["DeathAt"] = 43476.582,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
					},
					["MessageTimes"] = {
						-14.87399999999616, -- [1]
						-14.85699999999633, -- [2]
						-14.7899999999936, -- [3]
						-14.77199999999721, -- [4]
						-11.75699999999779, -- [5]
						-11.07299999999668, -- [6]
						-9.972999999998137, -- [7]
						-9.822999999996682, -- [8]
						-8.855999999999767, -- [9]
						-8.855999999999767, -- [10]
						-8.755999999993946, -- [11]
						-5.755999999993946, -- [12]
						-3.488999999994121, -- [13]
						-2.755999999993946, -- [14]
						-2.738999999994121, -- [15]
						-2.722999999998137, -- [16]
						-2.072999999996682, -- [17]
						-1.538999999997031, -- [18]
						-1.505999999993946, -- [19]
						-1.488999999994121, -- [20]
						-1.172999999995227, -- [21]
						-1.155999999995402, -- [22]
						-0.5889999999999418, -- [23]
						-0.5889999999999418, -- [24]
						-0.5889999999999418, -- [25]
						-0.5720000000001164, -- [26]
						-0.5559999999968568, -- [27]
						-0.4719999999942957, -- [28]
						-0.172999999995227, -- [29]
						-0.02299999999377178, -- [30]
						0, -- [31]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
					},
					["Health"] = {
						4130, -- [1]
						4130, -- [2]
						4112, -- [3]
						4112, -- [4]
						4094, -- [5]
						4094, -- [6]
						4094, -- [7]
						4094, -- [8]
						4094, -- [9]
						4094, -- [10]
						4074, -- [11]
						4074, -- [12]
						4074, -- [13]
						3753, -- [14]
						3753, -- [15]
						3541, -- [16]
						3491, -- [17]
						2626, -- [18]
						2027, -- [19]
						1260, -- [20]
						1208, -- [21]
						1158, -- [22]
						1047, -- [23]
						1047, -- [24]
						1047, -- [25]
						1047, -- [26]
						814, -- [27]
						767, -- [28]
						608, -- [29]
						557, -- [30]
						0, -- [31]
					},
					["KilledBy"] = "贴身施法",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"MISC", -- [31]
					},
				}, -- [6]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
					},
					["Messages"] = {
						"特变电工 肉搏 秃老亮-黑龙费尔默 Absorb -331 (331 被吸收) (1)", -- [1]
						"红丶枫-逐风者 肉搏 特变电工 Crit -335 (Physical)", -- [2]
						"红丶枫-逐风者 肉搏 特变电工 Parry (1)", -- [3]
						"特变电工 肉搏 秃老亮-黑龙费尔默 Miss (1)", -- [4]
						"秃老亮-黑龙费尔默 神圣新星 特变电工 Hit -243 (Holy)", -- [5]
						"红丶枫-逐风者 重伤 (伤害/跳) 特变电工 Tick -53 (Physical)", -- [6]
						"特变电工 斩杀 秃老亮-黑龙费尔默 Crit -1360 (Physical)", -- [7]
						"张主任-逐风者 冰霜新星 特变电工 Hit -26 (Frost)", -- [8]
						"特变电工 肉搏 张主任-逐风者 Dodge (1)", -- [9]
						"特变电工 断筋 张主任-逐风者 Hit -50 (Physical)", -- [10]
						"红丶枫-逐风者 重伤 (伤害/跳) 特变电工 Tick -53 (Physical)", -- [11]
						"张主任-逐风者 冰锥术 特变电工 Crit -1140 (Frost)", -- [12]
						"特变电工 致死打击 张主任-逐风者 Crit -1498 (Physical)", -- [13]
						"红丶枫-逐风者 重伤 (伤害/跳) 特变电工 Tick -53 (Physical)", -- [14]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -249 (Shadow)", -- [15]
						"耍下-黑龙费尔默 心灵震爆 特变电工 Hit -844 (Shadow)", -- [16]
						"红丶枫-逐风者 重伤 (伤害/跳) 特变电工 Tick -53 (Physical)", -- [17]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -257 (Shadow)", -- [18]
						"特变电工死亡。", -- [19]
					},
					["DeathAt"] = 43428.595,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
					},
					["MessageTimes"] = {
						-14.79999999999563, -- [1]
						-12.26699999999983, -- [2]
						-12.26699999999983, -- [3]
						-11.5, -- [4]
						-10.98300000000018, -- [5]
						-9.25, -- [6]
						-9.14999999999418, -- [7]
						-8.132999999994354, -- [8]
						-7.69999999999709, -- [9]
						-7.36699999999837, -- [10]
						-6.25, -- [11]
						-6.06699999999546, -- [12]
						-5.849999999998545, -- [13]
						-3.233000000000175, -- [14]
						-3.015999999995984, -- [15]
						-3.015999999995984, -- [16]
						-0.25, -- [17]
						0, -- [18]
						0, -- [19]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
					},
					["Health"] = {
						3480, -- [1]
						3480, -- [2]
						3480, -- [3]
						3145, -- [4]
						3145, -- [5]
						2902, -- [6]
						2849, -- [7]
						2849, -- [8]
						2823, -- [9]
						2823, -- [10]
						2823, -- [11]
						2770, -- [12]
						1630, -- [13]
						1630, -- [14]
						1577, -- [15]
						1577, -- [16]
						147, -- [17]
						94, -- [18]
						0, -- [19]
					},
					["KilledBy"] = "耍下-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"MISC", -- [19]
					},
				}, -- [7]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						false, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						false, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						false, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						false, -- [36]
						false, -- [37]
						true, -- [38]
						false, -- [39]
						true, -- [40]
						true, -- [41]
					},
					["Messages"] = {
						"特变电工 铁皮手雷 炽天使-黑龙费尔默 Resist (Fire)", -- [1]
						"特变电工 重伤 (伤害/跳) 炽天使-黑龙费尔默 Absorb -76 (76 被吸收) (Physical)", -- [2]
						"炽天使-黑龙费尔默 火焰冲击 特变电工 Hit -674 (Fire)", -- [3]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -309 (Physical)", -- [4]
						"狩望者-黑龙费尔默 烈焰弹 特变电工 Hit -65 (Fire)", -- [5]
						"特变电工 重伤 (伤害/跳) 炽天使-黑龙费尔默 Absorb -76 (76 被吸收) (Physical)", -- [6]
						"特变电工 肉搏 炽天使-黑龙费尔默 Absorb -387 (1)", -- [7]
						"特变电工 肉搏 炽天使-黑龙费尔默 Hit -2 (387 被吸收) (Physical)", -- [8]
						"鬼武者 肉搏 特变电工 Hit -54 (Physical)", -- [9]
						"鬼武者 爪击 特变电工 Hit -44 (Physical)", -- [10]
						"特变电工 荆棘术 鬼武者 Hit -18 (Nature)", -- [11]
						"特变电工 荆棘术 鬼武者 Hit -18 (Nature)", -- [12]
						"特变电工 致死打击 炽天使-黑龙费尔默 Hit -495 (Physical)", -- [13]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -144 (Nature)", -- [14]
						"鬼武者 肉搏 特变电工 Hit -53 (Physical)", -- [15]
						"特变电工 荆棘术 鬼武者 Hit -18 (Nature)", -- [16]
						"特变电工 重伤 (伤害/跳) 炽天使-黑龙费尔默 Tick -76 (Physical)", -- [17]
						"鬼武者 爪击 特变电工 Hit -40 (Physical)", -- [18]
						"狩望者-黑龙费尔默 多重射击 特变电工 Crit -1189 (Physical)", -- [19]
						"特变电工 荆棘术 鬼武者 Hit -18 (Nature)", -- [20]
						"特变电工 拦截昏迷 炽天使-黑龙费尔默 Immune (Physical)", -- [21]
						"鬼武者 肉搏 特变电工 Hit -51 (Physical)", -- [22]
						"特变电工 荆棘术 鬼武者 Resist (Nature)", -- [23]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -335 (Physical)", -- [24]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -145 (Nature)", -- [25]
						"特变电工 肉搏 炽天使-黑龙费尔默 Immune (1)", -- [26]
						"鬼武者 爪击 特变电工 Hit -44 (Physical)", -- [27]
						"特变电工 荆棘术 鬼武者 Hit -18 (Nature)", -- [28]
						"鬼武者 肉搏 特变电工 Parry (1)", -- [29]
						"鬼武者 肉搏 特变电工 Dodge (1)", -- [30]
						"鬼武者 爪击 特变电工 Hit -50 (Physical)", -- [31]
						"特变电工 荆棘术 鬼武者 Hit -18 (Nature)", -- [32]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -145 (Nature)", -- [33]
						"炽天使-黑龙费尔默 冰锥术 特变电工 Hit -577 (Frost)", -- [34]
						"狩望者-黑龙费尔默 奥术射击 特变电工 Hit -283 (Arcane)", -- [35]
						"特变电工 肉搏 炽天使-黑龙费尔默 Hit -453 (Physical)", -- [36]
						"特变电工 致死打击 炽天使-黑龙费尔默 Hit -632 (Physical)", -- [37]
						"鬼武者 肉搏 特变电工 Hit -53 (Physical)", -- [38]
						"特变电工 荆棘术 鬼武者 Hit -18 (Nature)", -- [39]
						"狩望者-黑龙费尔默 自动射击 特变电工 Hit -351 (Physical)", -- [40]
						"特变电工死亡。", -- [41]
					},
					["DeathAt"] = 43147.595,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
					},
					["MessageTimes"] = {
						-12.68400000000111, -- [1]
						-11.96800000000076, -- [2]
						-11.75100000000384, -- [3]
						-9.300999999999476, -- [4]
						-9.300999999999476, -- [5]
						-9.001000000003842, -- [6]
						-8.351000000002387, -- [7]
						-8.351000000002387, -- [8]
						-7.61699999999837, -- [9]
						-7.61699999999837, -- [10]
						-7.601000000002387, -- [11]
						-7.601000000002387, -- [12]
						-7.516999999999825, -- [13]
						-6.783999999999651, -- [14]
						-6.300999999999476, -- [15]
						-6.300999999999476, -- [16]
						-6.001000000003842, -- [17]
						-6.001000000003842, -- [18]
						-5.98399999999674, -- [19]
						-5.98399999999674, -- [20]
						-5.334000000002561, -- [21]
						-5.016999999999825, -- [22]
						-5.001000000003842, -- [23]
						-4.19999999999709, -- [24]
						-3.783999999999651, -- [25]
						-3.23399999999674, -- [26]
						-2.766999999999825, -- [27]
						-2.766999999999825, -- [28]
						-2.69999999999709, -- [29]
						-1.400000000001455, -- [30]
						-1.150000000001455, -- [31]
						-1.133999999998196, -- [32]
						-0.7839999999996508, -- [33]
						-0.5829999999987194, -- [34]
						-0.3839999999981956, -- [35]
						-0.1500000000014552, -- [36]
						-0.1500000000014552, -- [37]
						-0.08400000000256114, -- [38]
						-0.08400000000256114, -- [39]
						0, -- [40]
						0, -- [41]
					},
					["HealthMax"] = {
						5669, -- [1]
						5669, -- [2]
						5669, -- [3]
						5669, -- [4]
						5669, -- [5]
						5669, -- [6]
						5669, -- [7]
						5669, -- [8]
						5669, -- [9]
						5669, -- [10]
						5669, -- [11]
						5669, -- [12]
						5669, -- [13]
						5669, -- [14]
						5669, -- [15]
						5669, -- [16]
						5669, -- [17]
						5669, -- [18]
						5669, -- [19]
						5669, -- [20]
						5669, -- [21]
						5669, -- [22]
						5669, -- [23]
						5669, -- [24]
						5669, -- [25]
						5669, -- [26]
						5669, -- [27]
						5669, -- [28]
						5669, -- [29]
						5669, -- [30]
						5669, -- [31]
						5669, -- [32]
						5669, -- [33]
						5669, -- [34]
						5669, -- [35]
						5669, -- [36]
						5669, -- [37]
						5669, -- [38]
						5669, -- [39]
						5669, -- [40]
						4969, -- [41]
					},
					["Health"] = {
						4533, -- [1]
						4533, -- [2]
						4533, -- [3]
						3859, -- [4]
						3550, -- [5]
						3485, -- [6]
						3485, -- [7]
						3485, -- [8]
						3485, -- [9]
						3485, -- [10]
						3485, -- [11]
						3485, -- [12]
						3387, -- [13]
						3387, -- [14]
						3243, -- [15]
						3243, -- [16]
						3190, -- [17]
						3190, -- [18]
						3190, -- [19]
						1961, -- [20]
						1961, -- [21]
						1961, -- [22]
						1961, -- [23]
						1910, -- [24]
						1575, -- [25]
						1430, -- [26]
						1430, -- [27]
						1386, -- [28]
						1386, -- [29]
						1386, -- [30]
						1386, -- [31]
						1336, -- [32]
						1336, -- [33]
						1191, -- [34]
						614, -- [35]
						331, -- [36]
						331, -- [37]
						331, -- [38]
						331, -- [39]
						278, -- [40]
						0, -- [41]
					},
					["KilledBy"] = "狩望者-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"MISC", -- [41]
					},
				}, -- [8]
			},
			["LastEventHealth"] = {
				1250, -- [1]
				2722, -- [2]
				2385, -- [3]
				2257, -- [4]
				2257, -- [5]
				2257, -- [6]
				2257, -- [7]
				2257, -- [8]
				2137, -- [9]
				2137, -- [10]
				2137, -- [11]
				2137, -- [12]
				2137, -- [13]
				2137, -- [14]
				2082, -- [15]
				1909, -- [16]
				1005, -- [17]
				1005, -- [18]
				823, -- [19]
				823, -- [20]
				823, -- [21]
				1073, -- [22]
				1371, -- [23]
				1621, -- [24]
				1919, -- [25]
				2169, -- [26]
				2467, -- [27]
				4969, -- [28]
				3957, -- [29]
				3800, -- [30]
				3647, -- [31]
				3397, -- [32]
				3155, -- [33]
				3155, -- [34]
				3155, -- [35]
				2912, -- [36]
				3779, -- [37]
				3497, -- [38]
				3312, -- [39]
				3056, -- [40]
				3056, -- [41]
				3056, -- [42]
				2358, -- [43]
				2358, -- [44]
				2077, -- [45]
				2077, -- [46]
				1796, -- [47]
				1796, -- [48]
				1523, -- [49]
				1250, -- [50]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"HEAL", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"HEAL", -- [21]
				"HEAL", -- [22]
				"HEAL", -- [23]
				"HEAL", -- [24]
				"HEAL", -- [25]
				"HEAL", -- [26]
				"HEAL", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					23.36, -- [1]
				},
				["TimeDamage"] = {
					301.9099999999999, -- [1]
				},
				["GTFOEvents"] = {
					1, -- [1]
				},
				["Healing"] = {
					9210, -- [1]
				},
				["DamageTaken"] = {
					66108, -- [1]
				},
				["DeathCount"] = {
					8, -- [1]
				},
				["Interrupts"] = {
					4, -- [1]
				},
				["RageGain"] = {
					794, -- [1]
				},
				["HOT_Time"] = {
					39, -- [1]
				},
				["ActiveTime"] = {
					325.2699999999999, -- [1]
				},
				["HealingTaken"] = {
					11255, -- [1]
				},
				["GTFOEventDamage"] = {
					0, -- [1]
				},
				["DOT_Time"] = {
					156, -- [1]
				},
				["Damage"] = {
					96368, -- [1]
				},
			},
			["LastHealTime"] = 44429.438,
			["LastDamageTaken"] = 12,
			["level"] = 60,
			["LastDamageAbility"] = "Fire",
			["LastFightIn"] = 14,
			["GUID"] = "Player-5458-02F6D2A3",
			["type"] = "Self",
			["TimeLast"] = {
				["TimeHeal"] = 44428.588,
				["ActiveTime"] = 44428.588,
				["GTFOEvents"] = 43902.591,
				["HealingTaken"] = 44428.588,
				["OVERALL"] = 44488.592,
				["DamageTaken"] = 44488.592,
				["Interrupts"] = 44142.588,
				["DeathCount"] = 44198.591,
				["RageGain"] = 44405.586,
				["HOT_Time"] = 44428.588,
				["TimeDamage"] = 44417.587,
				["Healing"] = 44428.588,
				["GTFOEventDamage"] = 43902.591,
				["DOT_Time"] = 44417.587,
				["Damage"] = 44417.587,
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4969, -- [1]
				4969, -- [2]
				4969, -- [3]
				4969, -- [4]
				4969, -- [5]
				4969, -- [6]
				4969, -- [7]
				4969, -- [8]
				4969, -- [9]
				4969, -- [10]
				4969, -- [11]
				4969, -- [12]
				4969, -- [13]
				4969, -- [14]
				4969, -- [15]
				4969, -- [16]
				4969, -- [17]
				4969, -- [18]
				4969, -- [19]
				4969, -- [20]
				4969, -- [21]
				4969, -- [22]
				4969, -- [23]
				4969, -- [24]
				4969, -- [25]
				4969, -- [26]
				4969, -- [27]
				4969, -- [28]
				4969, -- [29]
				4969, -- [30]
				4969, -- [31]
				4969, -- [32]
				4969, -- [33]
				4969, -- [34]
				4969, -- [35]
				4969, -- [36]
				4969, -- [37]
				4969, -- [38]
				4969, -- [39]
				4969, -- [40]
				4969, -- [41]
				4969, -- [42]
				4969, -- [43]
				4969, -- [44]
				4969, -- [45]
				4969, -- [46]
				4969, -- [47]
				4969, -- [48]
				4969, -- [49]
				4969, -- [50]
			},
			["NextEventNum"] = 29,
			["LastDamageTime"] = 44418.09,
			["LastEvents"] = {
				"特变电工 治疗药水 特变电工 Hit +1472", -- [1]
				"特变电工 斩杀 雷滴呱呱-黑龙费尔默 Immune (Physical)", -- [2]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -273 (Shadow)", -- [3]
				"特变电工 肉搏 丧尸暴龙-逐风者 Hit -434 (Physical)", -- [4]
				"特变电工 断筋 丧尸暴龙-逐风者 Hit -37 (Physical)", -- [5]
				"丧尸暴龙-逐风者 肉搏 特变电工 Parry (1)", -- [6]
				"特变电工 肉搏 丧尸暴龙-逐风者 Dodge (1)", -- [7]
				"丧尸暴龙-逐风者 肉搏 特变电工 Crit -120 (Physical)", -- [8]
				"特变电工 压制 丧尸暴龙-逐风者 Crit -1266 (Physical)", -- [9]
				"丧尸暴龙-逐风者 肉搏 特变电工 Parry (1)", -- [10]
				"特变电工 肉搏 丧尸暴龙-逐风者 Hit -549 (Physical)", -- [11]
				"丧尸暴龙-逐风者 肉搏 特变电工 Miss (1)", -- [12]
				"特变电工 重伤 (伤害/跳) 丧尸暴龙-逐风者 Tick -133 (Physical)", -- [13]
				"丧尸暴龙-逐风者 肉搏 特变电工 Hit -55 (Physical)", -- [14]
				"丧尸暴龙-逐风者 肉搏 特变电工 Hit -173 (Physical)", -- [15]
				"丧尸暴龙-逐风者 刺骨 特变电工 Crit -904 (Physical)", -- [16]
				"丧尸暴龙-逐风者 肉搏 特变电工 Miss (1)", -- [17]
				"丧尸暴龙-逐风者 出血 特变电工 Hit -182 (Physical)", -- [18]
				"特变电工 重伤 (伤害/跳) 丧尸暴龙-逐风者 Tick -134 (Physical)", -- [19]
				"特变电工 斩杀 丧尸暴龙-逐风者 Hit -1184 (Physical)", -- [20]
				"特变电工 急救 特变电工 Tick +250", -- [21]
				"特变电工 急救 特变电工 Tick +250", -- [22]
				"特变电工 急救 特变电工 Tick +250", -- [23]
				"特变电工 急救 特变电工 Tick +250", -- [24]
				"特变电工 急救 特变电工 Tick +250", -- [25]
				"特变电工 急救 特变电工 Tick +250", -- [26]
				"特变电工 急救 特变电工 Tick +250", -- [27]
				"Environment Fire 特变电工 Hit -12 (Fire)", -- [28]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -205 (Shadow)", -- [29]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -249 (Shadow)", -- [30]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -250 (Shadow)", -- [31]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -242 (Shadow)", -- [32]
				"特变电工 断筋 欧尛-火妖鲁西弗隆 Crit -80 (Physical)", -- [33]
				"特变电工 肉搏 欧尛-火妖鲁西弗隆 Crit -867 (Physical)", -- [34]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -243 (Shadow)", -- [35]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -242 (Shadow)", -- [36]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -282 (Shadow)", -- [37]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -281 (Shadow)", -- [38]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -256 (Shadow)", -- [39]
				"特变电工 断筋 雷滴呱呱-黑龙费尔默 Hit -42 (Physical)", -- [40]
				"特变电工 肉搏 雷滴呱呱-黑龙费尔默 Hit -466 (Physical)", -- [41]
				"雷滴呱呱-黑龙费尔默 火焰冲击 特变电工 Hit -698 (Fire)", -- [42]
				"特变电工 旋风斩 雷滴呱呱-黑龙费尔默 Hit -495 (Physical)", -- [43]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -281 (Shadow)", -- [44]
				"特变电工 肉搏 雷滴呱呱-黑龙费尔默 Immune (1)", -- [45]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -281 (Shadow)", -- [46]
				"特变电工 肉搏 雷滴呱呱-黑龙费尔默 Immune (1)", -- [47]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -273 (Shadow)", -- [48]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 特变电工 Tick -273 (Shadow)", -- [49]
				"特变电工 肉搏 雷滴呱呱-黑龙费尔默 Immune (1)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["Name"] = "特变电工",
			["LastEventTimes"] = {
				44387.202, -- [1]
				44387.791, -- [2]
				44389.402, -- [3]
				44408.554, -- [4]
				44408.704, -- [5]
				44410.42, -- [6]
				44411.187, -- [7]
				44411.32, -- [8]
				44411.92, -- [9]
				44412.42, -- [10]
				44413.503, -- [11]
				44414.42, -- [12]
				44414.954, -- [13]
				44414.954, -- [14]
				44416.439, -- [15]
				44416.587, -- [16]
				44416.754, -- [17]
				44417.587, -- [18]
				44417.954, -- [19]
				44418.09, -- [20]
				44423.454, -- [21]
				44424.438, -- [22]
				44425.438, -- [23]
				44426.438, -- [24]
				44427.438, -- [25]
				44428.438, -- [26]
				44429.438, -- [27]
				44488.991, -- [28]
				44301.614, -- [29]
				44304.614, -- [30]
				44307.614, -- [31]
				44310.614, -- [32]
				44311.098, -- [33]
				44312.114, -- [34]
				44313.615, -- [35]
				44316.615, -- [36]
				44368.401, -- [37]
				44371.401, -- [38]
				44374.401, -- [39]
				44375.618, -- [40]
				44375.718, -- [41]
				44377.068, -- [42]
				44377.118, -- [43]
				44377.401, -- [44]
				44379.518, -- [45]
				44380.385, -- [46]
				44383.335, -- [47]
				44383.402, -- [48]
				44386.385, -- [49]
				44387.135, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["丧尸暴龙-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4332,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 42,
								},
							},
							["amount"] = 62,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 8,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 21,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 8,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 1086,
						["Shadow"] = 2200,
						["Melee"] = 348,
						["Fire"] = 698,
					},
					["DOT_Time"] = 6,
					["Damage"] = 4740,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 8.98,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 1449,
						["Physical"] = 3291,
					},
					["PartialAbsorb"] = {
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1266,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 267,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["斩杀"] = {
									["count"] = 1184,
								},
								["肉搏"] = {
									["count"] = 983,
								},
							},
							["amount"] = 3737,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 42,
								},
								["旋风斩"] = {
									["count"] = 495,
								},
								["肉搏"] = {
									["count"] = 466,
								},
							},
							["amount"] = 1003,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 904,
								},
								["出血"] = {
									["count"] = 182,
								},
								["肉搏"] = {
									["count"] = 348,
								},
							},
							["amount"] = 1434,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2200,
								},
							},
							["amount"] = 2200,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 698,
								},
							},
							["amount"] = 698,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 7.48,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.98,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 42,
								},
							},
							["amount"] = 42,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1750,
								},
								["治疗药水"] = {
									["count"] = 1472,
								},
							},
							["amount"] = 3222,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 0.73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.95,
								},
								["断筋"] = {
									["count"] = 0.15,
								},
								["斩杀"] = {
									["count"] = 0.14,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 8.47,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 7.48,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.98,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.4,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.66,
								},
								["肉搏"] = {
									["count"] = 4.6,
								},
							},
							["amount"] = 8.16,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 7,
									["amount"] = 1750,
								},
							},
							["count"] = 7,
							["amount"] = 1750,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1472,
									["min"] = 1472,
									["count"] = 1,
									["amount"] = 1472,
								},
							},
							["count"] = 1,
							["amount"] = 1472,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1750,
								},
								["治疗药水"] = {
									["count"] = 1472,
								},
							},
							["amount"] = 3222,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 25.61,
					["Healing"] = 3222,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1266,
									["min"] = 1266,
									["count"] = 1,
									["amount"] = 1266,
								},
							},
							["count"] = 1,
							["amount"] = 1266,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 495,
									["min"] = 495,
									["count"] = 1,
									["amount"] = 495,
								},
							},
							["count"] = 1,
							["amount"] = 495,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 134,
									["min"] = 133,
									["count"] = 2,
									["amount"] = 267,
								},
							},
							["count"] = 2,
							["amount"] = 267,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 37,
									["count"] = 2,
									["amount"] = 79,
								},
							},
							["count"] = 2,
							["amount"] = 79,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1184,
									["min"] = 1184,
									["count"] = 1,
									["amount"] = 1184,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 1184,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 549,
									["min"] = 434,
									["count"] = 3,
									["amount"] = 1449,
								},
							},
							["count"] = 7,
							["amount"] = 1449,
						},
					},
					["HealingTaken"] = 3222,
					["RageGain"] = 62,
					["TimeDamage"] = 16.63,
					["TimeDamaging"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 0.73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.95,
								},
								["断筋"] = {
									["count"] = 0.15,
								},
								["斩杀"] = {
									["count"] = 0.14,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 8.47,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.4,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.66,
								},
								["肉搏"] = {
									["count"] = 4.6,
								},
							},
							["amount"] = 8.16,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["Fire"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Fire"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Fire"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["狩望者-黑龙费尔默"] = {
									["count"] = 3,
								},
								["丧尸暴龙-逐风者"] = {
									["count"] = 18,
								},
								["张主任-逐风者"] = {
									["count"] = 3,
								},
								["耍下-黑龙费尔默"] = {
									["count"] = 15,
								},
								["向天歌-黑龙费尔默"] = {
									["count"] = 12,
								},
								["雷滴呱呱-黑龙费尔默"] = {
									["count"] = 9,
								},
								["炽天使-黑龙费尔默"] = {
									["count"] = 36,
								},
								["熊汏-黑龙费尔默"] = {
									["count"] = 15,
								},
								["红丶枫-逐风者"] = {
									["count"] = 12,
								},
								["秃老亮-黑龙费尔默"] = {
									["count"] = 33,
								},
							},
							["amount"] = 156,
						},
					},
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 26,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Tick"] = {
									["count"] = 13,
								},
							},
							["amount"] = 48,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 27,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Parry"] = {
									["count"] = 8,
								},
							},
							["amount"] = 59,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 17,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 52,
								},
							},
							["amount"] = 55,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 20,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 27,
								},
							},
							["amount"] = 32,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 20,
								},
							},
							["amount"] = 30,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 359,
								},
								["急救"] = {
									["count"] = 3250,
								},
								["治疗药水"] = {
									["count"] = 5601,
								},
							},
							["amount"] = 9210,
						},
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 8303,
						["Physical"] = 3297,
					},
					["DeathCount"] = 8,
					["HOT_Time"] = 39,
					["ElementTaken"] = {
						["Holy"] = 3080,
						["Physical"] = 12940,
						["Melee"] = 4505,
						["Arcane"] = 5183,
						["Shadow"] = 14794,
						["Fire"] = 8673,
						["Frost"] = 14825,
						["Nature"] = 2108,
					},
					["DOT_Time"] = 156,
					["Damage"] = 96368,
					["TimeHeal"] = 23.36,
					["ElementDone"] = {
						["Physical"] = 51390,
						["Melee"] = 44852,
						["Nature"] = 126,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 27,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Resist"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 79,
								},
								["Tick"] = {
									["count"] = 41,
								},
								["Crit"] = {
									["count"] = 28,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 189,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 28,
								},
								["Hit"] = {
									["count"] = 57,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 19,
								},
								["Immune"] = {
									["count"] = 6,
								},
							},
							["amount"] = 114,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
					},
					["WhoDamaged"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 59,
								},
							},
							["amount"] = 59,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 904,
								},
								["出血"] = {
									["count"] = 2206,
								},
								["肉搏"] = {
									["count"] = 1835,
								},
							},
							["amount"] = 4945,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 159,
								},
								["月火术"] = {
									["count"] = 321,
								},
								["荆棘术"] = {
									["count"] = 365,
								},
							},
							["amount"] = 845,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 105,
								},
								["魔爆术"] = {
									["count"] = 662,
								},
								["射击"] = {
									["count"] = 93,
								},
								["奥术飞弹"] = {
									["count"] = 568,
								},
								["火焰冲击"] = {
									["count"] = 2658,
								},
							},
							["amount"] = 4086,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 500,
								},
								["魔爆术"] = {
									["count"] = 321,
								},
								["寒冰箭"] = {
									["count"] = 73,
								},
								["冰锥术"] = {
									["count"] = 5058,
								},
								["火焰冲击"] = {
									["count"] = 1945,
								},
							},
							["amount"] = 7897,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 913,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 4956,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1461,
								},
							},
							["amount"] = 7330,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 3080,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 844,
								},
							},
							["amount"] = 3924,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1135,
								},
								["奥术射击"] = {
									["count"] = 283,
								},
								["烈焰弹"] = {
									["count"] = 338,
								},
								["自动射击"] = {
									["count"] = 4261,
								},
								["多重射击"] = {
									["count"] = 2054,
								},
								["肉搏"] = {
									["count"] = 131,
								},
							},
							["amount"] = 8202,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 608,
								},
							},
							["amount"] = 608,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2797,
								},
								["Fire"] = {
									["count"] = 12,
								},
							},
							["amount"] = 2809,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 648,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 714,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 399,
								},
							},
							["amount"] = 1761,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 2245,
								},
								["寒冰箭"] = {
									["count"] = 1759,
								},
								["冰锥术"] = {
									["count"] = 2252,
								},
								["火焰冲击"] = {
									["count"] = 1293,
								},
							},
							["amount"] = 7549,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 490,
								},
								["肉搏"] = {
									["count"] = 2225,
								},
							},
							["amount"] = 2715,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 26,
								},
								["冲击波"] = {
									["count"] = 607,
								},
								["冰锥术"] = {
									["count"] = 2196,
								},
								["火焰冲击"] = {
									["count"] = 584,
								},
							},
							["amount"] = 3413,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 844,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3328,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 687,
								},
							},
							["amount"] = 4859,
						},
						["贴身施法"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 193,
								},
								["魔爆术"] = {
									["count"] = 624,
								},
								["寒冰箭"] = {
									["count"] = 767,
								},
								["火焰冲击"] = {
									["count"] = 1236,
								},
								["冰锥术"] = {
									["count"] = 1744,
								},
							},
							["amount"] = 4564,
						},
						["鬼武者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 228,
								},
								["肉搏"] = {
									["count"] = 314,
								},
							},
							["amount"] = 542,
						},
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 4.5,
								},
								["急救"] = {
									["count"] = 13.98,
								},
								["治疗药水"] = {
									["count"] = 4.88,
								},
							},
							["amount"] = 23.36,
						},
					},
					["PartialResist"] = {
						["Fire"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["纠缠根须"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
						["烈焰弹"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 11,
									["min"] = 11,
									["count"] = 1,
									["amount"] = 11,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 6,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 41,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 41,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 59,
						},
					},
					["PartialAbsorb"] = {
						["Fire"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["纠缠根须"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["烈焰弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 41,
									["amount"] = 0,
								},
							},
							["count"] = 41,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 59,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 325.2699999999999,
					["ElementTakenResist"] = {
						["Fire"] = 11,
					},
					["DamageTaken"] = 66108,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 248,
								},
							},
							["amount"] = 248,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 546,
								},
							},
							["amount"] = 546,
						},
					},
					["InterruptData"] = {
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["精神控制 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["变形术 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["GTFOEvents"] = 1,
					["Heals"] = {
						["战士的决心"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 128,
									["min"] = 113,
									["count"] = 3,
									["amount"] = 359,
								},
							},
							["count"] = 3,
							["amount"] = 359,
						},
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 13,
									["amount"] = 3250,
								},
							},
							["count"] = 13,
							["amount"] = 3250,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1517,
									["min"] = 1186,
									["count"] = 4,
									["amount"] = 5601,
								},
							},
							["count"] = 4,
							["amount"] = 5601,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 39,
								},
							},
							["amount"] = 39,
						},
					},
					["Interrupts"] = 4,
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 4.5,
								},
								["急救"] = {
									["count"] = 13.98,
								},
								["治疗药水"] = {
									["count"] = 4.88,
								},
							},
							["amount"] = 23.36,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.42,
								},
								["压制"] = {
									["count"] = 0.73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6.93,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.94,
								},
								["斩杀"] = {
									["count"] = 3.62,
								},
								["肉搏"] = {
									["count"] = 11.69,
								},
							},
							["amount"] = 30.83,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 6.1,
								},
								["旋风斩"] = {
									["count"] = 2.58,
								},
								["拦截昏迷"] = {
									["count"] = 4.25,
								},
								["断筋"] = {
									["count"] = 2.6,
								},
								["斩杀"] = {
									["count"] = 0.45,
								},
								["肉搏"] = {
									["count"] = 10.73,
								},
							},
							["amount"] = 26.71,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.85,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.61,
								},
								["旋风斩"] = {
									["count"] = 2.9,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.15,
								},
								["肉搏"] = {
									["count"] = 11.37,
								},
							},
							["amount"] = 24.38,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.65,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 16.02,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.68,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.07,
								},
								["旋风斩"] = {
									["count"] = 2.45,
								},
								["锤击昏迷效果"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 6.17,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.65,
								},
							},
							["amount"] = 44.21,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.58,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 14.32,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 4.99,
								},
								["斩杀"] = {
									["count"] = 3.4,
								},
								["肉搏"] = {
									["count"] = 20.34,
								},
							},
							["amount"] = 50.13000000000001,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 3.75,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.18,
								},
								["拦截昏迷"] = {
									["count"] = 3.92,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.75,
								},
							},
							["amount"] = 8.35,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3.85,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.27,
								},
							},
							["amount"] = 6.619999999999999,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.83,
								},
								["致死打击"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 12.1,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.84,
								},
								["拳击"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.77,
								},
								["拦截昏迷"] = {
									["count"] = 2.63,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 16.95,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.87,
								},
								["压制"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.24,
								},
								["断筋"] = {
									["count"] = 4.37,
								},
								["旋风斩"] = {
									["count"] = 1.18,
								},
								["肉搏"] = {
									["count"] = 7.3,
								},
							},
							["amount"] = 19.24,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["旋风斩"] = {
									["count"] = 0.2,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.18,
								},
								["肉搏"] = {
									["count"] = 4.99,
								},
							},
							["amount"] = 17.47,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.72,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 5.45,
								},
								["拦截昏迷"] = {
									["count"] = 1.33,
								},
								["肉搏"] = {
									["count"] = 5.8,
								},
							},
							["amount"] = 18.3,
						},
						["贴身施法"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.18,
								},
								["断筋"] = {
									["count"] = 3.02,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 8.18,
								},
							},
							["amount"] = 12.88,
						},
						["鬼武者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 2.63,
								},
								["荆棘术"] = {
									["count"] = 4.36,
								},
							},
							["amount"] = 6.99,
						},
					},
					["Healing"] = 9210,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["+暴风雪"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 248,
								},
								["冲锋"] = {
									["count"] = 546,
								},
							},
							["amount"] = 794,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 461,
									["min"] = 461,
									["count"] = 1,
									["amount"] = 461,
								},
								["Crit"] = {
									["max"] = 1498,
									["min"] = 1051,
									["count"] = 7,
									["amount"] = 8868,
								},
								["Hit"] = {
									["max"] = 671,
									["min"] = 16,
									["count"] = 17,
									["amount"] = 8727,
								},
							},
							["count"] = 26,
							["amount"] = 18056,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1266,
									["min"] = 625,
									["count"] = 4,
									["amount"] = 3673,
								},
							},
							["count"] = 4,
							["amount"] = 3673,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 134,
									["min"] = 61,
									["count"] = 41,
									["amount"] = 3487,
								},
								["Absorb"] = {
									["max"] = 101,
									["min"] = 75,
									["count"] = 11,
									["amount"] = 870,
								},
							},
							["count"] = 52,
							["amount"] = 4357,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 92,
									["min"] = 83,
									["count"] = 2,
									["amount"] = 175,
								},
								["Crit"] = {
									["max"] = 78,
									["min"] = 78,
									["count"] = 1,
									["amount"] = 78,
								},
								["Hit"] = {
									["max"] = 47,
									["min"] = 43,
									["count"] = 2,
									["amount"] = 90,
								},
							},
							["count"] = 5,
							["amount"] = 343,
						},
						["荆棘术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 18,
									["min"] = 18,
									["count"] = 7,
									["amount"] = 126,
								},
							},
							["count"] = 8,
							["amount"] = 126,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 60,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 113,
								},
								["Hit"] = {
									["max"] = 71,
									["min"] = 33,
									["count"] = 11,
									["amount"] = 541,
								},
							},
							["count"] = 15,
							["amount"] = 654,
						},
						["昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 367,
									["min"] = 367,
									["count"] = 1,
									["amount"] = 367,
								},
								["Crit"] = {
									["max"] = 850,
									["min"] = 627,
									["count"] = 4,
									["amount"] = 2979,
								},
								["Hit"] = {
									["max"] = 495,
									["min"] = 242,
									["count"] = 12,
									["amount"] = 4317,
								},
							},
							["count"] = 18,
							["amount"] = 7663,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 83,
									["min"] = 14,
									["count"] = 10,
									["amount"] = 451,
								},
								["Crit"] = {
									["max"] = 94,
									["min"] = 76,
									["count"] = 7,
									["amount"] = 580,
								},
								["Hit"] = {
									["max"] = 50,
									["min"] = 24,
									["count"] = 26,
									["amount"] = 945,
								},
							},
							["count"] = 44,
							["amount"] = 1976,
						},
						["斩杀"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1360,
									["min"] = 983,
									["count"] = 5,
									["amount"] = 6133,
								},
								["Hit"] = {
									["max"] = 1184,
									["min"] = 467,
									["count"] = 11,
									["amount"] = 8535,
								},
							},
							["count"] = 18,
							["amount"] = 14668,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 753,
									["min"] = 6,
									["count"] = 28,
									["amount"] = 9163,
								},
								["Hit"] = {
									["max"] = 569,
									["min"] = 2,
									["count"] = 57,
									["amount"] = 21708,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1055,
									["min"] = 169,
									["count"] = 19,
									["amount"] = 13981,
								},
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 114,
							["amount"] = 44852,
						},
					},
					["RageGain"] = 794,
					["HealingTaken"] = 11255,
					["TimeDamage"] = 301.9099999999999,
					["TimeDamaging"] = {
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["旋风斩"] = {
									["count"] = 0.2,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.18,
								},
								["肉搏"] = {
									["count"] = 4.99,
								},
							},
							["amount"] = 17.47,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3.85,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.27,
								},
							},
							["amount"] = 6.619999999999999,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 3.75,
						},
						["鬼武者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 2.63,
								},
								["荆棘术"] = {
									["count"] = 4.36,
								},
							},
							["amount"] = 6.99,
						},
						["贴身施法"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.18,
								},
								["断筋"] = {
									["count"] = 3.02,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 8.18,
								},
							},
							["amount"] = 12.88,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.72,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 5.45,
								},
								["拦截昏迷"] = {
									["count"] = 1.33,
								},
								["肉搏"] = {
									["count"] = 5.8,
								},
							},
							["amount"] = 18.3,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.18,
								},
								["拦截昏迷"] = {
									["count"] = 3.92,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.75,
								},
							},
							["amount"] = 8.35,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.85,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.61,
								},
								["旋风斩"] = {
									["count"] = 2.9,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.15,
								},
								["肉搏"] = {
									["count"] = 11.37,
								},
							},
							["amount"] = 24.38,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 6.1,
								},
								["旋风斩"] = {
									["count"] = 2.58,
								},
								["拦截昏迷"] = {
									["count"] = 4.25,
								},
								["断筋"] = {
									["count"] = 2.6,
								},
								["斩杀"] = {
									["count"] = 0.45,
								},
								["肉搏"] = {
									["count"] = 10.73,
								},
							},
							["amount"] = 26.71,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.83,
								},
								["致死打击"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 12.1,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.84,
								},
								["拳击"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.77,
								},
								["拦截昏迷"] = {
									["count"] = 2.63,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 16.95,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.87,
								},
								["压制"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.24,
								},
								["断筋"] = {
									["count"] = 4.37,
								},
								["旋风斩"] = {
									["count"] = 1.18,
								},
								["肉搏"] = {
									["count"] = 7.3,
								},
							},
							["amount"] = 19.24,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.65,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 16.02,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.68,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.07,
								},
								["旋风斩"] = {
									["count"] = 2.45,
								},
								["锤击昏迷效果"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 6.17,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.65,
								},
							},
							["amount"] = 44.21,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.42,
								},
								["压制"] = {
									["count"] = 0.73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6.93,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.94,
								},
								["斩杀"] = {
									["count"] = 3.62,
								},
								["肉搏"] = {
									["count"] = 11.69,
								},
							},
							["amount"] = 30.83,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.58,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 14.32,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 4.99,
								},
								["斩杀"] = {
									["count"] = 3.4,
								},
								["肉搏"] = {
									["count"] = 20.34,
								},
							},
							["amount"] = 50.13000000000001,
						},
					},
					["GTFOEventDamage"] = 0,
					["WhoHealed"] = {
						["夏光年"] = {
							["Details"] = {
								["治疗之触"] = {
									["count"] = 2045,
								},
							},
							["amount"] = 2045,
						},
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 359,
								},
								["急救"] = {
									["count"] = 3250,
								},
								["治疗药水"] = {
									["count"] = 5601,
								},
							},
							["amount"] = 9210,
						},
					},
					["DamagedWho"] = {
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 33,
								},
								["压制"] = {
									["count"] = 790,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 503,
								},
								["旋风斩"] = {
									["count"] = 367,
								},
								["拳击"] = {
									["count"] = 92,
								},
								["斩杀"] = {
									["count"] = 502,
								},
								["肉搏"] = {
									["count"] = 1483,
								},
							},
							["amount"] = 3770,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 152,
								},
								["拦截昏迷"] = {
									["count"] = 50,
								},
								["肉搏"] = {
									["count"] = 1631,
								},
							},
							["amount"] = 1833,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 76,
								},
								["断筋"] = {
									["count"] = 31,
								},
								["旋风斩"] = {
									["count"] = 627,
								},
								["肉搏"] = {
									["count"] = 927,
								},
							},
							["amount"] = 1661,
						},
						["鬼武者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 526,
								},
								["荆棘术"] = {
									["count"] = 126,
								},
							},
							["amount"] = 652,
						},
						["贴身施法"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1691,
								},
								["断筋"] = {
									["count"] = 90,
								},
								["斩杀"] = {
									["count"] = 1332,
								},
								["肉搏"] = {
									["count"] = 2137,
								},
							},
							["amount"] = 5250,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1953,
								},
								["旋风斩"] = {
									["count"] = 412,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 76,
								},
								["断筋"] = {
									["count"] = 235,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 2687,
								},
							},
							["amount"] = 5412,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 30,
								},
								["拦截昏迷"] = {
									["count"] = 77,
								},
								["斩杀"] = {
									["count"] = 983,
								},
								["肉搏"] = {
									["count"] = 951,
								},
							},
							["amount"] = 2041,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 567,
								},
								["压制"] = {
									["count"] = 625,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 225,
								},
								["拳击"] = {
									["count"] = 47,
								},
								["旋风斩"] = {
									["count"] = 910,
								},
								["断筋"] = {
									["count"] = 42,
								},
								["拦截昏迷"] = {
									["count"] = 71,
								},
								["斩杀"] = {
									["count"] = 766,
								},
								["肉搏"] = {
									["count"] = 3189,
								},
							},
							["amount"] = 6442,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 384,
								},
								["旋风斩"] = {
									["count"] = 946,
								},
								["拦截昏迷"] = {
									["count"] = 126,
								},
								["断筋"] = {
									["count"] = 234,
								},
								["斩杀"] = {
									["count"] = 1819,
								},
								["肉搏"] = {
									["count"] = 3405,
								},
							},
							["amount"] = 6914,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 550,
								},
								["断筋"] = {
									["count"] = 123,
								},
								["肉搏"] = {
									["count"] = 2762,
								},
							},
							["amount"] = 3435,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1198,
								},
								["拳击"] = {
									["count"] = 43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 302,
								},
								["拦截昏迷"] = {
									["count"] = 106,
								},
								["断筋"] = {
									["count"] = 118,
								},
								["斩杀"] = {
									["count"] = 810,
								},
								["肉搏"] = {
									["count"] = 1338,
								},
							},
							["amount"] = 3915,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2111,
								},
								["压制"] = {
									["count"] = 992,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 373,
								},
								["断筋"] = {
									["count"] = 94,
								},
								["旋风斩"] = {
									["count"] = 716,
								},
								["肉搏"] = {
									["count"] = 3624,
								},
							},
							["amount"] = 7910,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3209,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 952,
								},
								["拦截昏迷"] = {
									["count"] = 65,
								},
								["旋风斩"] = {
									["count"] = 1111,
								},
								["拳击"] = {
									["count"] = 83,
								},
								["断筋"] = {
									["count"] = 235,
								},
								["斩杀"] = {
									["count"] = 1822,
								},
								["肉搏"] = {
									["count"] = 6211,
								},
							},
							["amount"] = 13688,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3579,
								},
								["压制"] = {
									["count"] = 1266,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 611,
								},
								["拦截昏迷"] = {
									["count"] = 50,
								},
								["断筋"] = {
									["count"] = 234,
								},
								["斩杀"] = {
									["count"] = 3307,
								},
								["肉搏"] = {
									["count"] = 5123,
								},
							},
							["amount"] = 14170,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 312,
								},
							},
							["amount"] = 312,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 4396,
								},
								["拳击"] = {
									["count"] = 78,
								},
								["旋风斩"] = {
									["count"] = 850,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 855,
								},
								["拦截昏迷"] = {
									["count"] = 60,
								},
								["断筋"] = {
									["count"] = 325,
								},
								["斩杀"] = {
									["count"] = 3327,
								},
								["肉搏"] = {
									["count"] = 9072,
								},
							},
							["amount"] = 18963,
						},
					},
				},
			},
			["UnitLockout"] = 43001.587,
			["LastActive"] = 44488.592,
		},
		["维度冰火-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02EDFFC1",
			["LastEventHealth"] = {
				3020, -- [1]
				3020, -- [2]
				3020, -- [3]
				3020, -- [4]
				3020, -- [5]
				3020, -- [6]
				3020, -- [7]
				3020, -- [8]
				3020, -- [9]
				3020, -- [10]
				3020, -- [11]
				3020, -- [12]
				3020, -- [13]
				3020, -- [14]
				3020, -- [15]
				3020, -- [16]
				3020, -- [17]
				3020, -- [18]
				3020, -- [19]
				3020, -- [20]
				2930, -- [21]
				2930, -- [22]
				2930, -- [23]
				2948, -- [24]
				2965, -- [25]
				2965, -- [26]
				3020, -- [27]
				3020, -- [28]
				3020, -- [29]
				2973, -- [30]
				2973, -- [31]
				2425, -- [32]
				2425, -- [33]
				2023, -- [34]
				2023, -- [35]
				2023, -- [36]
				2023, -- [37]
				2023, -- [38]
				3020, -- [39]
				3020, -- [40]
				3020, -- [41]
				3020, -- [42]
				3020, -- [43]
				3020, -- [44]
			},
			["LastAttackedBy"] = "炽天使-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"MISC", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
			},
			["TimeWindows"] = {
				["Absorbs"] = {
					1226, -- [1]
				},
				["TimeHeal"] = {
					6, -- [1]
				},
				["HealingTaken"] = {
					1226, -- [1]
				},
				["ActiveTime"] = {
					45.52, -- [1]
				},
				["TimeDamage"] = {
					39.52, -- [1]
				},
				["ManaGain"] = {
					1784, -- [1]
				},
				["DamageTaken"] = {
					2416, -- [1]
				},
				["Damage"] = {
					13503, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "火焰冲击",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastDamageTaken"] = 505,
			["LastHealTime"] = 43033.922,
			["TimeLast"] = {
				["TimeHeal"] = 43033.588,
				["OVERALL"] = 44100.586,
				["DamageTaken"] = 43969.595,
				["Absorbs"] = 43033.588,
				["HealingTaken"] = 43033.588,
				["ActiveTime"] = 44100.586,
				["ManaGain"] = 43031.588,
				["TimeDamage"] = 44100.586,
				["Damage"] = 44100.586,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3020, -- [1]
				3020, -- [2]
				3020, -- [3]
				3020, -- [4]
				3020, -- [5]
				3020, -- [6]
				3020, -- [7]
				3020, -- [8]
				3020, -- [9]
				3020, -- [10]
				3020, -- [11]
				3020, -- [12]
				3020, -- [13]
				3020, -- [14]
				3020, -- [15]
				3020, -- [16]
				3020, -- [17]
				3020, -- [18]
				3020, -- [19]
				3020, -- [20]
				3020, -- [21]
				3020, -- [22]
				3020, -- [23]
				3020, -- [24]
				3020, -- [25]
				3020, -- [26]
				3020, -- [27]
				3020, -- [28]
				3020, -- [29]
				3020, -- [30]
				3020, -- [31]
				3020, -- [32]
				3020, -- [33]
				3020, -- [34]
				3020, -- [35]
				3020, -- [36]
				3020, -- [37]
				3020, -- [38]
				3020, -- [39]
				3020, -- [40]
				3020, -- [41]
				3020, -- [42]
				3020, -- [43]
				3020, -- [44]
			},
			["NextEventNum"] = 45,
			["LastDamageTime"] = 44100.736,
			["LastEvents"] = {
				"维度冰火-火妖鲁西弗隆 寒冰箭 向天歌-黑龙费尔默 Absorb -680 (680 被吸收) (Frost)", -- [1]
				"维度冰火-火妖鲁西弗隆 奥术飞弹 向天歌-黑龙费尔默 Absorb -243 (243 被吸收) (Arcane)", -- [2]
				"维度冰火-火妖鲁西弗隆 奥术飞弹 向天歌-黑龙费尔默 Absorb -242 (242 被吸收) (Arcane)", -- [3]
				"维度冰火-火妖鲁西弗隆 肉搏 向天歌-黑龙费尔默 Absorb -210 (1)", -- [4]
				"维度冰火-火妖鲁西弗隆 奥术飞弹 向天歌-黑龙费尔默 Hit -32 (210 被吸收) (Arcane)", -- [5]
				"维度冰火-火妖鲁西弗隆 奥术飞弹 向天歌-黑龙费尔默 Hit -242 (Arcane)", -- [6]
				"维度冰火-火妖鲁西弗隆 冰霜新星 红丶枫-逐风者 Hit -94 (Frost)", -- [7]
				"维度冰火-火妖鲁西弗隆 冰霜新星 向天歌-黑龙费尔默 Hit -93 (Frost)", -- [8]
				"向天歌-黑龙费尔默 魔爆术 维度冰火-火妖鲁西弗隆 Absorb -267 (267 被吸收) (Arcane)", -- [9]
				"维度冰火-火妖鲁西弗隆 魔爆术 红丶枫-逐风者 Crit -466 (Arcane)", -- [10]
				"维度冰火-火妖鲁西弗隆 魔爆术 向天歌-黑龙费尔默 Hit -293 (Arcane)", -- [11]
				"向天歌-黑龙费尔默 魔爆术 维度冰火-火妖鲁西弗隆 Absorb -398 (398 被吸收) (Arcane)", -- [12]
				"维度冰火-火妖鲁西弗隆 冰锥术 红丶枫-逐风者 Crit -1091 (Frost)", -- [13]
				"维度冰火-火妖鲁西弗隆 冰锥术 向天歌-黑龙费尔默 Hit -542 (Frost)", -- [14]
				"维度冰火-火妖鲁西弗隆 魔爆术 向天歌-黑龙费尔默 Immune (Arcane)", -- [15]
				"维度冰火-火妖鲁西弗隆 魔爆术 红丶枫-逐风者 Crit -456 (Arcane)", -- [16]
				"维度冰火-火妖鲁西弗隆 魔爆术 向天歌-黑龙费尔默 Immune (Arcane)", -- [17]
				"维度冰火-火妖鲁西弗隆 寒冰箭 向天歌-黑龙费尔默 Immune (Frost)", -- [18]
				"维度冰火-火妖鲁西弗隆 火焰冲击 向天歌-黑龙费尔默 Hit -581 (Fire)", -- [19]
				"贴身施法 冰霜新星 维度冰火-火妖鲁西弗隆 Hit -90 (Frost)", -- [20]
				"贴身施法 魔爆术 维度冰火-火妖鲁西弗隆 Absorb -286 (286 被吸收) (Arcane)", -- [21]
				"维度冰火-火妖鲁西弗隆 冰锥术 贴身施法 Absorb -528 (528 被吸收) (Frost)", -- [22]
				"贴身施法 魔爆术 维度冰火-火妖鲁西弗隆 Absorb -275 (275 被吸收) (Arcane)", -- [23]
				"维度冰火-火妖鲁西弗隆 寒冰箭 鄂尔多斯奶妈-黑龙费尔默 Hit -659 (Frost)", -- [24]
				"维度冰火-火妖鲁西弗隆 寒冰箭 贴身施法 Hit -687 (Frost)", -- [25]
				"维度冰火-火妖鲁西弗隆 火焰冲击 贴身施法 Hit -581 (Fire)", -- [26]
				"维度冰火-火妖鲁西弗隆 冰霜新星 贴身施法 Absorb -92 (92 被吸收) (Frost)", -- [27]
				"维度冰火-火妖鲁西弗隆 冰锥术 贴身施法 Hit -558 (Frost)", -- [28]
				"炽天使-黑龙费尔默 寒冰箭 维度冰火-火妖鲁西弗隆 Hit -47 (Frost)", -- [29]
				"炽天使-黑龙费尔默 interrupts 维度冰火-火妖鲁西弗隆 变形术 (法术反制)", -- [30]
				"炽天使-黑龙费尔默 冰锥术 维度冰火-火妖鲁西弗隆 Hit -548 (Frost)", -- [31]
				"维度冰火-火妖鲁西弗隆 冰霜新星 炽天使-黑龙费尔默 Hit -88 (Frost)", -- [32]
				"炽天使-黑龙费尔默 火焰冲击 维度冰火-火妖鲁西弗隆 Hit -505 (Fire)", -- [33]
				"维度冰火-火妖鲁西弗隆 肉搏 像疯一样离去-火妖鲁西弗隆 Absorb -726 (1)", -- [34]
				"维度冰火-火妖鲁西弗隆 火焰冲击 像疯一样离去-火妖鲁西弗隆 Crit -146 (726 被吸收) (Fire)", -- [35]
				"维度冰火-火妖鲁西弗隆 魔爆术 炽天使-黑龙费尔默 Hit -284 (Arcane)", -- [36]
				"维度冰火-火妖鲁西弗隆 魔爆术 像疯一样离去-火妖鲁西弗隆 Hit -298 (Arcane)", -- [37]
				"维度冰火-火妖鲁西弗隆 冰锥术 炽天使-黑龙费尔默 Hit -523 (Frost)", -- [38]
				"维度冰火-火妖鲁西弗隆 冰锥术 丧尸暴龙-逐风者 Crit -1133 (Frost)", -- [39]
				"维度冰火-火妖鲁西弗隆 火焰冲击 丧尸暴龙-逐风者 Hit -583 (Fire)", -- [40]
				"维度冰火-火妖鲁西弗隆 魔爆术 丧尸暴龙-逐风者 Crit -450 (Arcane)", -- [41]
				"维度冰火-火妖鲁西弗隆 魔爆术 像疯一样离去-火妖鲁西弗隆 Absorb -291 (291 被吸收) (Arcane)", -- [42]
				"维度冰火-火妖鲁西弗隆 魔爆术 像疯一样离去-火妖鲁西弗隆 Resist (Arcane)", -- [43]
				"维度冰火-火妖鲁西弗隆 火焰冲击 像疯一样离去-火妖鲁西弗隆 Hit -611 (Fire)", -- [44]
			},
			["Name"] = "维度冰火-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				false, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
			},
			["LastEventTimes"] = {
				43003.337, -- [1]
				43004.853, -- [2]
				43005.954, -- [3]
				43007.087, -- [4]
				43007.087, -- [5]
				43008.237, -- [6]
				43010.937, -- [7]
				43010.937, -- [8]
				43011.02, -- [9]
				43012.437, -- [10]
				43012.437, -- [11]
				43012.637, -- [12]
				43017.304, -- [13]
				43017.304, -- [14]
				43018.921, -- [15]
				43018.921, -- [16]
				43020.438, -- [17]
				43024.771, -- [18]
				43025.738, -- [19]
				43025.788, -- [20]
				43030.638, -- [21]
				43033.822, -- [22]
				43033.922, -- [23]
				43041.789, -- [24]
				43048.922, -- [25]
				43049.589, -- [26]
				43581.256, -- [27]
				43582.756, -- [28]
				43963.228, -- [29]
				43967.811, -- [30]
				43968.828, -- [31]
				43969.361, -- [32]
				43970.361, -- [33]
				43995.48, -- [34]
				43995.48, -- [35]
				43998.063, -- [36]
				43998.063, -- [37]
				43999.997, -- [38]
				44091.202, -- [39]
				44092.735, -- [40]
				44094.235, -- [41]
				44096.935, -- [42]
				44098.886, -- [43]
				44100.736, -- [44]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["维度冰火-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 3.75,
								},
								["魔爆术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 1.13,
								},
							},
							["amount"] = 11.85,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["贴身施法"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.67,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.67,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["维度冰火-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["HealedWho"] = {
						["维度冰火-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1226,
								},
							},
							["amount"] = 1226,
						},
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 1300,
						["Fire"] = 726,
						["Arcane"] = 986,
					},
					["Absorbs"] = 1226,
					["ManaGained"] = {
						["恢复法力"] = {
							["Details"] = {
								["维度冰火-火妖鲁西弗隆"] = {
									["count"] = 702,
								},
							},
							["amount"] = 702,
						},
						["补充法力"] = {
							["Details"] = {
								["维度冰火-火妖鲁西弗隆"] = {
									["count"] = 1082,
								},
							},
							["amount"] = 1082,
						},
					},
					["ElementTakenAbsorb"] = {
						["Arcane"] = 1226,
					},
					["ActiveTime"] = 45.52,
					["ManaGainedFrom"] = {
						["维度冰火-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复法力"] = {
									["count"] = 702,
								},
								["补充法力"] = {
									["count"] = 1082,
								},
							},
							["amount"] = 1784,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 685,
						["Fire"] = 505,
						["Arcane"] = 1226,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 2,
								},
							},
							["amount"] = 14,
						},
					},
					["Damage"] = 13503,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 398,
									["min"] = 267,
									["count"] = 4,
									["amount"] = 1226,
								},
							},
							["count"] = 4,
							["amount"] = 1226,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 398,
									["min"] = 267,
									["count"] = 4,
									["amount"] = 1226,
								},
							},
							["count"] = 4,
							["amount"] = 1226,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["贴身施法"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 561,
								},
								["冰霜新星"] = {
									["count"] = 90,
								},
							},
							["amount"] = 651,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 665,
								},
							},
							["amount"] = 665,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 47,
								},
								["火焰冲击"] = {
									["count"] = 505,
								},
								["冰锥术"] = {
									["count"] = 548,
								},
							},
							["amount"] = 1100,
						},
					},
					["DamageTaken"] = 2416,
					["WhoHealed"] = {
						["维度冰火-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1226,
								},
							},
							["amount"] = 1226,
						},
					},
					["TimeHeal"] = 6,
					["Attacks"] = {
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 146,
									["min"] = 146,
									["count"] = 1,
									["amount"] = 146,
								},
								["Hit"] = {
									["max"] = 611,
									["min"] = 581,
									["count"] = 4,
									["amount"] = 2356,
								},
							},
							["count"] = 5,
							["amount"] = 2502,
						},
						["冰锥术"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 528,
									["min"] = 528,
									["count"] = 1,
									["amount"] = 528,
								},
								["Crit"] = {
									["max"] = 1133,
									["min"] = 1091,
									["count"] = 2,
									["amount"] = 2224,
								},
								["Hit"] = {
									["max"] = 558,
									["min"] = 523,
									["count"] = 3,
									["amount"] = 1623,
								},
							},
							["count"] = 6,
							["amount"] = 4375,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 242,
									["min"] = 32,
									["count"] = 2,
									["amount"] = 274,
								},
								["Absorb"] = {
									["max"] = 243,
									["min"] = 242,
									["count"] = 2,
									["amount"] = 485,
								},
							},
							["count"] = 4,
							["amount"] = 759,
						},
						["魔爆术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 298,
									["min"] = 284,
									["count"] = 3,
									["amount"] = 875,
								},
								["Crit"] = {
									["max"] = 466,
									["min"] = 450,
									["count"] = 3,
									["amount"] = 1372,
								},
								["Absorb"] = {
									["max"] = 291,
									["min"] = 291,
									["count"] = 1,
									["amount"] = 291,
								},
							},
							["count"] = 10,
							["amount"] = 2538,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 680,
									["min"] = 680,
									["count"] = 1,
									["amount"] = 680,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 687,
									["min"] = 659,
									["count"] = 2,
									["amount"] = 1346,
								},
							},
							["count"] = 4,
							["amount"] = 2026,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
								["Hit"] = {
									["max"] = 94,
									["min"] = 88,
									["count"] = 3,
									["amount"] = 275,
								},
							},
							["count"] = 4,
							["amount"] = 367,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 726,
									["min"] = 210,
									["count"] = 2,
									["amount"] = 936,
								},
							},
							["count"] = 2,
							["amount"] = 936,
						},
					},
					["HealingTaken"] = 1226,
					["DamagedWho"] = {
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 589,
								},
								["火焰冲击"] = {
									["count"] = 757,
								},
								["肉搏"] = {
									["count"] = 726,
								},
							},
							["amount"] = 2072,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 581,
								},
								["冰锥术"] = {
									["count"] = 542,
								},
								["奥术飞弹"] = {
									["count"] = 759,
								},
								["魔爆术"] = {
									["count"] = 293,
								},
								["寒冰箭"] = {
									["count"] = 680,
								},
								["冰霜新星"] = {
									["count"] = 93,
								},
								["肉搏"] = {
									["count"] = 210,
								},
							},
							["amount"] = 3158,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 922,
								},
								["冰锥术"] = {
									["count"] = 1091,
								},
								["冰霜新星"] = {
									["count"] = 94,
								},
							},
							["amount"] = 2107,
						},
						["贴身施法"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 92,
								},
								["寒冰箭"] = {
									["count"] = 687,
								},
								["火焰冲击"] = {
									["count"] = 581,
								},
								["冰锥术"] = {
									["count"] = 1086,
								},
							},
							["amount"] = 2446,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 450,
								},
								["火焰冲击"] = {
									["count"] = 583,
								},
								["冰锥术"] = {
									["count"] = 1133,
								},
							},
							["amount"] = 2166,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 659,
								},
							},
							["amount"] = 659,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 284,
								},
								["冰锥术"] = {
									["count"] = 523,
								},
								["冰霜新星"] = {
									["count"] = 88,
								},
							},
							["amount"] = 895,
						},
					},
					["TimeDamage"] = 39.52,
					["TimeDamaging"] = {
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 3.75,
								},
								["魔爆术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 1.13,
								},
							},
							["amount"] = 11.85,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["贴身施法"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.67,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.67,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ManaGain"] = 1784,
					["ElementDone"] = {
						["Fire"] = 2502,
						["Frost"] = 6768,
						["Melee"] = 936,
						["Arcane"] = 3297,
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["维度冰火-火妖鲁西弗隆"] = {
									["max"] = 398,
									["min"] = 267,
									["count"] = 4,
									["amount"] = 1226,
								},
							},
							["count"] = 4,
							["amount"] = 1226,
						},
					},
				},
			},
			["UnitLockout"] = 43580.589,
			["LastActive"] = 44100.586,
		},
		["阿蛮达-老马布兰契"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
					},
					["Messages"] = {
						"阿蛮达-老马布兰契 肉搏 蓝染-黑龙费尔默 Absorb -257 (1)", -- [1]
						"阿蛮达-老马布兰契 肉搏 蓝染-黑龙费尔默 Crit -53 (257 被吸收) (Physical)", -- [2]
						"阿蛮达-老马布兰契 挥击 蓝染-黑龙费尔默 Hit -64 (Physical)", -- [3]
						"欧尛-火妖鲁西弗隆 寒冰箭 阿蛮达-老马布兰契 Hit -677 (Frost)", -- [4]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -226 (Shadow)", -- [5]
						"阿蛮达-老马布兰契 肉搏 蓝染-黑龙费尔默 Crit -345 (Physical)", -- [6]
						"欧尛-火妖鲁西弗隆 寒冰箭 阿蛮达-老马布兰契 Hit -674 (Frost)", -- [7]
						"欧尛-火妖鲁西弗隆 火焰冲击 阿蛮达-老马布兰契 Crit -898 (Fire)", -- [8]
						"阿蛮达-老马布兰契 槌击 蓝染-黑龙费尔默 Crit -582 (Physical)", -- [9]
						"欧尛-火妖鲁西弗隆 冰锥术 阿蛮达-老马布兰契 Hit -416 (Frost)", -- [10]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -227 (Shadow)", -- [11]
						"阿蛮达-老马布兰契死亡。", -- [12]
					},
					["DeathAt"] = 44417.587,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["MessageTimes"] = {
						-6.86699999999837, -- [1]
						-6.86699999999837, -- [2]
						-6.61699999999837, -- [3]
						-5.966999999996915, -- [4]
						-4.917000000001281, -- [5]
						-4.38300000000163, -- [6]
						-3.366000000001804, -- [7]
						-1.75, -- [8]
						-0.6160000000018044, -- [9]
						-0.25, -- [10]
						-0.03300000000308501, -- [11]
						0, -- [12]
					},
					["HealthMax"] = {
						5743, -- [1]
						5743, -- [2]
						5743, -- [3]
						5743, -- [4]
						3993, -- [5]
						3993, -- [6]
						3993, -- [7]
						3993, -- [8]
						5743, -- [9]
						5743, -- [10]
						3993, -- [11]
						3993, -- [12]
					},
					["Health"] = {
						3706, -- [1]
						3706, -- [2]
						3706, -- [3]
						3706, -- [4]
						2160, -- [5]
						1934, -- [6]
						1934, -- [7]
						1260, -- [8]
						520, -- [9]
						520, -- [10]
						73, -- [11]
						0, -- [12]
					},
					["KilledBy"] = "耍下-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
					},
					["Messages"] = {
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -233 (Shadow)", -- [1]
						"耍下-黑龙费尔默 心灵震爆 阿蛮达-老马布兰契 Hit -786 (Shadow)", -- [2]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -271 (Shadow)", -- [3]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [4]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -270 (Shadow)", -- [5]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [6]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [7]
						"阿蛮达-老马布兰契 回春术 阿蛮达-老马布兰契 Tick +189", -- [8]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -270 (Shadow)", -- [9]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [10]
						"阿蛮达-老马布兰契 回春术 阿蛮达-老马布兰契 Tick +189", -- [11]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -271 (Shadow)", -- [12]
						"阿蛮达-老马布兰契死亡。", -- [13]
					},
					["DeathAt"] = 44358.584,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["MessageTimes"] = {
						-14.30000000000291, -- [1]
						-13.81700000000274, -- [2]
						-12.03399999999965, -- [3]
						-11.31700000000274, -- [4]
						-9.03399999999965, -- [5]
						-8.30000000000291, -- [6]
						-5.317000000002736, -- [7]
						-4.116000000001804, -- [8]
						-3.033000000003085, -- [9]
						-2.315999999998894, -- [10]
						-1.099999999998545, -- [11]
						-0.01600000000325963, -- [12]
						0, -- [13]
					},
					["HealthMax"] = {
						3993, -- [1]
						3993, -- [2]
						3993, -- [3]
						3993, -- [4]
						3993, -- [5]
						3993, -- [6]
						3993, -- [7]
						3993, -- [8]
						3993, -- [9]
						3993, -- [10]
						3993, -- [11]
						3993, -- [12]
						3993, -- [13]
					},
					["Health"] = {
						2865, -- [1]
						2632, -- [2]
						1846, -- [3]
						1575, -- [4]
						1335, -- [5]
						1065, -- [6]
						590, -- [7]
						350, -- [8]
						557, -- [9]
						287, -- [10]
						65, -- [11]
						254, -- [12]
						0, -- [13]
					},
					["KilledBy"] = "蓝染-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"HEAL", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"HEAL", -- [11]
						"DAMAGE", -- [12]
						"MISC", -- [13]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
					},
					["Messages"] = {
						"欧尛-火妖鲁西弗隆 冰锥术 阿蛮达-老马布兰契 Hit -412 (Frost)", -- [1]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 阿蛮达-老马布兰契 Tick -101 (Nature)", -- [2]
						"鬼武者 肉搏 阿蛮达-老马布兰契 Hit -38 (Physical)", -- [3]
						"鬼武者 爪击 阿蛮达-老马布兰契 Dodge (Physical)", -- [4]
						"欧尛-火妖鲁西弗隆 火焰冲击 阿蛮达-老马布兰契 Hit -546 (Fire)", -- [5]
						"鬼武者 肉搏 阿蛮达-老马布兰契 Hit -38 (Physical)", -- [6]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -263 (Shadow)", -- [7]
						"阿蛮达-老马布兰契 野性冲锋效果 部落军旗 Immune (Physical)", -- [8]
						"耍下-黑龙费尔默 心灵震爆 阿蛮达-老马布兰契 Crit -1205 (Shadow)", -- [9]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [10]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 阿蛮达-老马布兰契 Tick -101 (Nature)", -- [11]
						"阿蛮达-老马布兰契 肉搏 部落军旗 Crit -557 (Physical)", -- [12]
						"阿蛮达-老马布兰契 挥击 部落军旗 Crit -218 (Physical)", -- [13]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -271 (Shadow)", -- [14]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [15]
						"阿蛮达-老马布兰契 挥击 鬼武者 Hit -61 (Physical)", -- [16]
						"阿蛮达-老马布兰契 挥击 部落军旗 Hit -110 (Physical)", -- [17]
						"阿蛮达-老马布兰契 槌击 部落军旗 Hit -453 (Physical)", -- [18]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 阿蛮达-老马布兰契 Tick -101 (Nature)", -- [19]
						"鬼武者 爪击 阿蛮达-老马布兰契 Dodge (Physical)", -- [20]
						"鬼武者 肉搏 阿蛮达-老马布兰契 Hit -43 (Physical)", -- [21]
						"欧尛-火妖鲁西弗隆 寒冰箭 阿蛮达-老马布兰契 Hit -684 (Frost)", -- [22]
						"阿蛮达-老马布兰契 挥击 鬼武者 Crit -114 (Physical)", -- [23]
						"阿蛮达-老马布兰契 挥击 部落军旗 Hit -109 (Physical)", -- [24]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -271 (Shadow)", -- [25]
						"鬼武者 爪击 阿蛮达-老马布兰契 Hit -30 (Physical)", -- [26]
						"鬼武者 肉搏 阿蛮达-老马布兰契 Hit -44 (Physical)", -- [27]
						"阿蛮达-老马布兰契 槌击 部落军旗 Crit -933 (Physical)", -- [28]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [29]
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 阿蛮达-老马布兰契 Tick -100 (Nature)", -- [30]
						"鬼武者 肉搏 阿蛮达-老马布兰契 Hit -35 (Physical)", -- [31]
						"鬼武者 爪击 阿蛮达-老马布兰契 Dodge (Physical)", -- [32]
						"鬼武者 肉搏 阿蛮达-老马布兰契 Hit -34 (Physical)", -- [33]
						"阿蛮达-老马布兰契死亡。", -- [34]
					},
					["DeathAt"] = 44197.591,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["MessageTimes"] = {
						-10.81700000000274, -- [1]
						-10.46700000000419, -- [2]
						-10.08400000000256, -- [3]
						-9.967000000004191, -- [4]
						-9.317000000002736, -- [5]
						-8.78399999999965, -- [6]
						-8.766999999999825, -- [7]
						-8.084000000002561, -- [8]
						-7.783999999999651, -- [9]
						-7.766999999999825, -- [10]
						-7.450000000004366, -- [11]
						-7.067000000002736, -- [12]
						-6.75, -- [13]
						-5.766999999999825, -- [14]
						-4.766999999999825, -- [15]
						-4.650000000001455, -- [16]
						-4.650000000001455, -- [17]
						-4.599999999998545, -- [18]
						-4.467000000004191, -- [19]
						-4.30000000000291, -- [20]
						-3.950000000004366, -- [21]
						-3.932999999997264, -- [22]
						-3.13300000000163, -- [23]
						-3.13300000000163, -- [24]
						-2.766999999999825, -- [25]
						-2.682999999997264, -- [26]
						-2.63300000000163, -- [27]
						-2.11699999999837, -- [28]
						-1.766999999999825, -- [29]
						-1.467000000004191, -- [30]
						-1.332999999998719, -- [31]
						-1.05000000000291, -- [32]
						-0.03300000000308501, -- [33]
						0, -- [34]
					},
					["HealthMax"] = {
						5743, -- [1]
						5743, -- [2]
						5743, -- [3]
						5743, -- [4]
						5743, -- [5]
						5743, -- [6]
						5743, -- [7]
						5743, -- [8]
						5743, -- [9]
						5743, -- [10]
						5743, -- [11]
						5743, -- [12]
						5743, -- [13]
						5743, -- [14]
						5743, -- [15]
						5743, -- [16]
						5743, -- [17]
						5743, -- [18]
						5743, -- [19]
						5743, -- [20]
						5743, -- [21]
						5743, -- [22]
						5743, -- [23]
						5743, -- [24]
						5743, -- [25]
						5743, -- [26]
						5743, -- [27]
						5743, -- [28]
						5743, -- [29]
						5743, -- [30]
						5743, -- [31]
						5743, -- [32]
						5743, -- [33]
						3993, -- [34]
					},
					["Health"] = {
						5009, -- [1]
						4597, -- [2]
						4496, -- [3]
						4458, -- [4]
						4458, -- [5]
						3912, -- [6]
						3912, -- [7]
						3611, -- [8]
						3611, -- [9]
						3611, -- [10]
						2166, -- [11]
						2065, -- [12]
						2065, -- [13]
						2065, -- [14]
						1794, -- [15]
						1554, -- [16]
						1554, -- [17]
						1554, -- [18]
						1554, -- [19]
						1554, -- [20]
						1453, -- [21]
						1453, -- [22]
						726, -- [23]
						726, -- [24]
						726, -- [25]
						455, -- [26]
						455, -- [27]
						381, -- [28]
						381, -- [29]
						141, -- [30]
						41, -- [31]
						6, -- [32]
						6, -- [33]
						0, -- [34]
					},
					["KilledBy"] = "鬼武者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"MISC", -- [34]
					},
				}, -- [3]
			},
			["LastEventHealth"] = {
				1934, -- [1]
				1260, -- [2]
				520, -- [3]
				520, -- [4]
				73, -- [5]
				0, -- [6]
				2892, -- [7]
				2892, -- [8]
				3081, -- [9]
				4431, -- [10]
				4620, -- [11]
				4620, -- [12]
				4809, -- [13]
				4809, -- [14]
				4809, -- [15]
				3136, -- [16]
				3136, -- [17]
				3136, -- [18]
				3136, -- [19]
				2236, -- [20]
				1837, -- [21]
				1837, -- [22]
				1837, -- [23]
				1837, -- [24]
				1808, -- [25]
				1808, -- [26]
				1808, -- [27]
				1220, -- [28]
				1220, -- [29]
				1274, -- [30]
				3128, -- [31]
				2865, -- [32]
				2632, -- [33]
				1846, -- [34]
				1575, -- [35]
				1335, -- [36]
				1065, -- [37]
				590, -- [38]
				350, -- [39]
				557, -- [40]
				287, -- [41]
				65, -- [42]
				254, -- [43]
				0, -- [44]
				3706, -- [45]
				3706, -- [46]
				3706, -- [47]
				3706, -- [48]
				2160, -- [49]
				1934, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"MISC", -- [6]
				"HEAL", -- [7]
				"HEAL", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"DAMAGE", -- [15]
				"MISC", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"HEAL", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"HEAL", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"HEAL", -- [42]
				"DAMAGE", -- [43]
				"MISC", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					11.34, -- [1]
				},
				["Overhealing"] = {
					189, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["Healing"] = {
					1890, -- [1]
				},
				["DamageTaken"] = {
					18622, -- [1]
				},
				["ActiveTime"] = {
					66.86000000000001, -- [1]
				},
				["EnergyGain"] = {
					200, -- [1]
				},
				["RageGain"] = {
					165, -- [1]
				},
				["HOT_Time"] = {
					33, -- [1]
				},
				["TimeDamage"] = {
					55.52, -- [1]
				},
				["Interrupts"] = {
					3, -- [1]
				},
				["HealingTaken"] = {
					756, -- [1]
				},
				["DOT_Time"] = {
					6, -- [1]
				},
				["Damage"] = {
					11822, -- [1]
				},
			},
			["LastHealTime"] = 44279.812,
			["LastDamageTaken"] = 227,
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 13,
			["GUID"] = "Player-5447-02FE9879",
			["type"] = "Grouped",
			["TimeLast"] = {
				["TimeHeal"] = 44279.596,
				["Overhealing"] = 44282.596,
				["DeathCount"] = 44415.587,
				["ActiveTime"] = 44414.587,
				["OVERALL"] = 44415.587,
				["DamageTaken"] = 44415.587,
				["Interrupts"] = 44299.597,
				["EnergyGain"] = 44304.581,
				["RageGain"] = 44414.587,
				["HOT_Time"] = 44282.596,
				["TimeDamage"] = 44414.587,
				["HealingTaken"] = 44273.596,
				["Healing"] = 44279.596,
				["DOT_Time"] = 44097.585,
				["Damage"] = 44414.587,
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3993, -- [1]
				3993, -- [2]
				5743, -- [3]
				5743, -- [4]
				3993, -- [5]
				3993, -- [6]
				3993, -- [7]
				3993, -- [8]
				3993, -- [9]
				5743, -- [10]
				5743, -- [11]
				5743, -- [12]
				5743, -- [13]
				5743, -- [14]
				5743, -- [15]
				5743, -- [16]
				5743, -- [17]
				5743, -- [18]
				5743, -- [19]
				3993, -- [20]
				3993, -- [21]
				3993, -- [22]
				3993, -- [23]
				3993, -- [24]
				3993, -- [25]
				3993, -- [26]
				3993, -- [27]
				3993, -- [28]
				3993, -- [29]
				3993, -- [30]
				3993, -- [31]
				3993, -- [32]
				3993, -- [33]
				3993, -- [34]
				3993, -- [35]
				3993, -- [36]
				3993, -- [37]
				3993, -- [38]
				3993, -- [39]
				3993, -- [40]
				3993, -- [41]
				3993, -- [42]
				3993, -- [43]
				3993, -- [44]
				5743, -- [45]
				5743, -- [46]
				5743, -- [47]
				5743, -- [48]
				3993, -- [49]
				3993, -- [50]
			},
			["NextEventNum"] = 7,
			["LastDamageTime"] = 44415.354,
			["LastEvents"] = {
				"欧尛-火妖鲁西弗隆 寒冰箭 阿蛮达-老马布兰契 Hit -674 (Frost)", -- [1]
				"欧尛-火妖鲁西弗隆 火焰冲击 阿蛮达-老马布兰契 Crit -898 (Fire)", -- [2]
				"阿蛮达-老马布兰契 槌击 蓝染-黑龙费尔默 Crit -582 (Physical)", -- [3]
				"欧尛-火妖鲁西弗隆 冰锥术 阿蛮达-老马布兰契 Hit -416 (Frost)", -- [4]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -227 (Shadow)", -- [5]
				"阿蛮达-老马布兰契死亡。", -- [6]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189", -- [7]
				"阿蛮达-老马布兰契 回春术 阿蛮达-老马布兰契 Tick +189", -- [8]
				"阿蛮达-老马布兰契 回春术 艾芮丝丶影舞 Tick +189", -- [9]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189", -- [10]
				"阿蛮达-老马布兰契 回春术 艾芮丝丶影舞 Tick +189", -- [11]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189", -- [12]
				"阿蛮达-老马布兰契 肉搏 欧尛-火妖鲁西弗隆 Immune (1)", -- [13]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189 (189 过量治疗)", -- [14]
				"欧尛-火妖鲁西弗隆 冰霜新星 阿蛮达-老马布兰契 Hit -28 (Frost)", -- [15]
				"阿蛮达-老马布兰契 interrupts 欧尛-火妖鲁西弗隆 寒冰箭 (野性冲锋效果)", -- [16]
				"阿蛮达-老马布兰契 肉搏 欧尛-火妖鲁西弗隆 Crit -294 (Physical)", -- [17]
				"欧尛-火妖鲁西弗隆 冰冻 阿蛮达-老马布兰契 Resist (Frost)", -- [18]
				"阿蛮达-老马布兰契 挥击 欧尛-火妖鲁西弗隆 Hit -84 (Physical)", -- [19]
				"欧尛-火妖鲁西弗隆 冰锥术 阿蛮达-老马布兰契 Hit -417 (Frost)", -- [20]
				"阿蛮达-老马布兰契 肉搏 欧尛-火妖鲁西弗隆 Absorb -106 (106 被吸收) (1)", -- [21]
				"阿蛮达-老马布兰契 爪击 欧尛-火妖鲁西弗隆 Absorb -244 (244 被吸收) (Physical)", -- [22]
				"阿蛮达-老马布兰契 肉搏 欧尛-火妖鲁西弗隆 Absorb -97 (97 被吸收) (1)", -- [23]
				"欧尛-火妖鲁西弗隆 冰霜新星 阿蛮达-老马布兰契 Hit -29 (Frost)", -- [24]
				"阿蛮达-老马布兰契 爪击 欧尛-火妖鲁西弗隆 Absorb -238 (238 被吸收) (Physical)", -- [25]
				"阿蛮达-老马布兰契 肉搏 欧尛-火妖鲁西弗隆 Absorb -102 (102 被吸收) (1)", -- [26]
				"欧尛-火妖鲁西弗隆 火焰冲击 阿蛮达-老马布兰契 Hit -588 (Fire)", -- [27]
				"阿蛮达-老马布兰契 肉搏 欧尛-火妖鲁西弗隆 Absorb -60 (1)", -- [28]
				"阿蛮达-老马布兰契 肉搏 欧尛-火妖鲁西弗隆 Crit -146 (60 被吸收) (Physical)", -- [29]
				"阿蛮达-老马布兰契 治疗之触 阿蛮达-老马布兰契 Hit +1964", -- [30]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -263 (Shadow)", -- [31]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -233 (Shadow)", -- [32]
				"耍下-黑龙费尔默 心灵震爆 阿蛮达-老马布兰契 Hit -786 (Shadow)", -- [33]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -271 (Shadow)", -- [34]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [35]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -270 (Shadow)", -- [36]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [37]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [38]
				"阿蛮达-老马布兰契 回春术 阿蛮达-老马布兰契 Tick +189", -- [39]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -270 (Shadow)", -- [40]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -240 (Shadow)", -- [41]
				"阿蛮达-老马布兰契 回春术 阿蛮达-老马布兰契 Tick +189", -- [42]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -271 (Shadow)", -- [43]
				"阿蛮达-老马布兰契死亡。", -- [44]
				"阿蛮达-老马布兰契 肉搏 蓝染-黑龙费尔默 Absorb -257 (1)", -- [45]
				"阿蛮达-老马布兰契 肉搏 蓝染-黑龙费尔默 Crit -53 (257 被吸收) (Physical)", -- [46]
				"阿蛮达-老马布兰契 挥击 蓝染-黑龙费尔默 Hit -64 (Physical)", -- [47]
				"欧尛-火妖鲁西弗隆 寒冰箭 阿蛮达-老马布兰契 Hit -677 (Frost)", -- [48]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 阿蛮达-老马布兰契 Tick -226 (Shadow)", -- [49]
				"阿蛮达-老马布兰契 肉搏 蓝染-黑龙费尔默 Crit -345 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["Name"] = "阿蛮达-老马布兰契",
			["LastEventTimes"] = {
				44412.604, -- [1]
				44414.22, -- [2]
				44415.354, -- [3]
				44415.72, -- [4]
				44415.937, -- [5]
				44415.97, -- [6]
				44273.796, -- [7]
				44274.196, -- [8]
				44274.696, -- [9]
				44276.796, -- [10]
				44277.712, -- [11]
				44279.812, -- [12]
				44282.129, -- [13]
				44282.796, -- [14]
				44283.529, -- [15]
				44299.93, -- [16]
				44300.436, -- [17]
				44300.947, -- [18]
				44300.947, -- [19]
				44306.464, -- [20]
				44306.581, -- [21]
				44306.731, -- [22]
				44307.814, -- [23]
				44308.531, -- [24]
				44309.048, -- [25]
				44309.564, -- [26]
				44310.448, -- [27]
				44310.814, -- [28]
				44310.814, -- [29]
				44322.848, -- [30]
				44341.866, -- [31]
				44342.6, -- [32]
				44343.083, -- [33]
				44344.866, -- [34]
				44345.583, -- [35]
				44347.866, -- [36]
				44348.6, -- [37]
				44351.583, -- [38]
				44352.784, -- [39]
				44353.867, -- [40]
				44354.584, -- [41]
				44355.8, -- [42]
				44356.884, -- [43]
				44356.9, -- [44]
				44409.103, -- [45]
				44409.103, -- [46]
				44409.353, -- [47]
				44410.003, -- [48]
				44411.053, -- [49]
				44411.587, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3118,
					["RageGainedFrom"] = {
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["原始狂怒"] = {
									["count"] = 10,
								},
								["激怒"] = {
									["count"] = 10,
								},
							},
							["amount"] = 20,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 453,
						["Fire"] = 898,
						["Frost"] = 1767,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1301,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 257,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 655,
						["Physical"] = 646,
					},
					["PartialAbsorb"] = {
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 64,
								},
								["槌击"] = {
									["count"] = 582,
								},
								["肉搏"] = {
									["count"] = 655,
								},
							},
							["amount"] = 1301,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1351,
								},
								["冰锥术"] = {
									["count"] = 416,
								},
								["火焰冲击"] = {
									["count"] = 898,
								},
							},
							["amount"] = 2665,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 453,
								},
							},
							["amount"] = 453,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["原始狂怒"] = {
							["Details"] = {
								["阿蛮达-老马布兰契"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
						["激怒"] = {
							["Details"] = {
								["阿蛮达-老马布兰契"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.25,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.75,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 4.75,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["挥击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 64,
									["min"] = 64,
									["count"] = 1,
									["amount"] = 64,
								},
							},
							["count"] = 1,
							["amount"] = 64,
						},
						["槌击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 582,
									["min"] = 582,
									["count"] = 1,
									["amount"] = 582,
								},
							},
							["count"] = 1,
							["amount"] = 582,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 345,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 398,
								},
								["Absorb"] = {
									["max"] = 257,
									["min"] = 257,
									["count"] = 1,
									["amount"] = 257,
								},
							},
							["count"] = 3,
							["amount"] = 655,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 20,
					["TimeDamage"] = 4.75,
					["TimeDamaging"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.25,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.75,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["血袭 (伤害/跳)"] = {
							["Details"] = {
								["像疯一样离去-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.51,
								},
								["爪击"] = {
									["count"] = 1.38,
								},
								["肉搏"] = {
									["count"] = 7.35,
								},
							},
							["amount"] = 9.24,
						},
						["贴身施法"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.5,
								},
								["肉搏"] = {
									["count"] = 3.35,
								},
							},
							["amount"] = 5.85,
						},
						["Seery"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["部落军旗"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.32,
								},
								["槌击"] = {
									["count"] = 1.07,
								},
								["野性冲锋效果"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.02,
								},
							},
							["amount"] = 3.91,
						},
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 4.9,
								},
							},
							["amount"] = 4.9,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["挥击"] = {
									["count"] = 1.1,
								},
								["血袭 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["爪击"] = {
									["count"] = 2.31,
								},
								["肉搏"] = {
									["count"] = 5.229999999999999,
								},
							},
							["amount"] = 12.12,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.7,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["爪击"] = {
									["count"] = 1.12,
								},
							},
							["amount"] = 3.32,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["肉搏 (正义之手)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.02,
								},
							},
							["amount"] = 4.52,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.13,
								},
								["肉搏"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 2.81,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.85,
								},
								["肉搏"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 4.53,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.25,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6.25,
						},
						["鬼武者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 2.97,
								},
							},
							["amount"] = 2.97,
						},
					},
					["DamageTaken"] = 18622,
					["ElementDoneAbsorb"] = {
						["Melee"] = 1432,
						["Physical"] = 785,
					},
					["DeathCount"] = 3,
					["HOT_Time"] = 33,
					["ElementTaken"] = {
						["Frost"] = 7337,
						["Melee"] = 232,
						["Arcane"] = 1318,
						["Physical"] = 501,
						["Fire"] = 2032,
						["Shadow"] = 6709,
						["Nature"] = 493,
					},
					["HOTs"] = {
						["回春术"] = {
							["Details"] = {
								["艾芮丝丶影舞"] = {
									["count"] = 9,
								},
								["Seery"] = {
									["count"] = 12,
								},
								["阿蛮达-老马布兰契"] = {
									["count"] = 12,
								},
							},
							["amount"] = 33,
						},
					},
					["Damage"] = 11822,
					["TimeHeal"] = 11.34,
					["ElementDone"] = {
						["Melee"] = 5419,
						["Physical"] = 6403,
					},
					["DamagedWho"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 84,
								},
								["爪击"] = {
									["count"] = 482,
								},
								["肉搏"] = {
									["count"] = 805,
								},
							},
							["amount"] = 1371,
						},
						["贴身施法"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 248,
								},
								["肉搏"] = {
									["count"] = 374,
								},
							},
							["amount"] = 622,
						},
						["部落军旗"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 437,
								},
								["槌击"] = {
									["count"] = 1386,
								},
								["肉搏"] = {
									["count"] = 557,
								},
							},
							["amount"] = 2380,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 795,
								},
								["肉搏"] = {
									["count"] = 192,
								},
							},
							["amount"] = 987,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 426,
								},
								["挥击"] = {
									["count"] = 266,
								},
								["血袭 (伤害/跳)"] = {
									["count"] = 55,
								},
								["爪击"] = {
									["count"] = 606,
								},
								["肉搏"] = {
									["count"] = 1280,
								},
							},
							["amount"] = 2633,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 174,
								},
								["肉搏"] = {
									["count"] = 405,
								},
							},
							["amount"] = 579,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 212,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 146,
								},
								["肉搏"] = {
									["count"] = 554,
								},
							},
							["amount"] = 912,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 265,
								},
								["肉搏"] = {
									["count"] = 315,
								},
							},
							["amount"] = 580,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 64,
								},
								["槌击"] = {
									["count"] = 582,
								},
								["肉搏"] = {
									["count"] = 937,
								},
							},
							["amount"] = 1583,
						},
						["鬼武者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 175,
								},
							},
							["amount"] = 175,
						},
					},
					["WhoDamaged"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 57,
								},
								["寒冰箭"] = {
									["count"] = 2035,
								},
								["火焰冲击"] = {
									["count"] = 2032,
								},
								["冰锥术"] = {
									["count"] = 1245,
								},
							},
							["amount"] = 5369,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 403,
								},
							},
							["amount"] = 403,
						},
						["贴身施法"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 759,
								},
								["冰锥术"] = {
									["count"] = 552,
								},
								["冰霜新星"] = {
									["count"] = 191,
								},
							},
							["amount"] = 1502,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 77,
								},
							},
							["amount"] = 77,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 559,
								},
								["冰锥术"] = {
									["count"] = 1047,
								},
							},
							["amount"] = 1606,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 471,
								},
							},
							["amount"] = 471,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 216,
								},
								["冰锥术"] = {
									["count"] = 1994,
								},
							},
							["amount"] = 2210,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1991,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2366,
								},
							},
							["amount"] = 4357,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 125,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2150,
								},
							},
							["amount"] = 2275,
						},
						["鬼武者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 30,
								},
								["肉搏"] = {
									["count"] = 232,
								},
							},
							["amount"] = 262,
						},
					},
					["EnergyGainedFrom"] = {
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["ElementDoneBlock"] = {
						["Physical"] = 6,
					},
					["TimeHealing"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["Seery"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 4.9,
								},
							},
							["amount"] = 4.9,
						},
					},
					["OverHeals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 189,
									["min"] = 189,
									["count"] = 1,
									["amount"] = 189,
								},
							},
							["count"] = 1,
							["amount"] = 189,
						},
					},
					["EnergyGain"] = 200,
					["PartialAbsorb"] = {
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["深冬之寒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 66.86000000000001,
					["Overhealing"] = 189,
					["DOT_Time"] = 6,
					["InterruptData"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭 (野性冲锋效果)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["惩击 (野性冲锋效果)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Interrupts"] = 3,
					["Heals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 189,
									["min"] = 189,
									["count"] = 10,
									["amount"] = 1890,
								},
							},
							["count"] = 10,
							["amount"] = 1890,
						},
					},
					["HealingTaken"] = 756,
					["EnergyGained"] = {
						["激怒"] = {
							["Details"] = {
								["阿蛮达-老马布兰契"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
					},
					["WhoHealed"] = {
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 756,
								},
							},
							["amount"] = 756,
						},
					},
					["Healing"] = 1890,
					["HealedWho"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
						["Seery"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 756,
								},
							},
							["amount"] = 756,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 19,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 18,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 22,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 10,
						},
					},
					["Attacks"] = {
						["槌击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 933,
									["min"] = 582,
									["count"] = 2,
									["amount"] = 1515,
								},
								["Hit"] = {
									["max"] = 453,
									["min"] = 426,
									["count"] = 2,
									["amount"] = 879,
								},
							},
							["count"] = 4,
							["amount"] = 2394,
						},
						["爪击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 265,
									["min"] = 161,
									["count"] = 3,
									["amount"] = 630,
								},
								["Absorb"] = {
									["max"] = 248,
									["min"] = 238,
									["count"] = 3,
									["amount"] = 730,
								},
								["Crit"] = {
									["max"] = 402,
									["min"] = 314,
									["count"] = 3,
									["amount"] = 1036,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 2396,
						},
						["血袭 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 28,
									["min"] = 27,
									["count"] = 2,
									["amount"] = 55,
								},
							},
							["count"] = 2,
							["amount"] = 55,
						},
						["挥击"] = {
							["Details"] = {
								["Crit (被格挡)"] = {
									["max"] = 114,
									["min"] = 114,
									["count"] = 1,
									["amount"] = 114,
								},
								["Crit"] = {
									["max"] = 218,
									["min"] = 143,
									["count"] = 3,
									["amount"] = 529,
								},
								["Hit"] = {
									["max"] = 110,
									["min"] = 61,
									["count"] = 9,
									["amount"] = 769,
								},
							},
							["count"] = 13,
							["amount"] = 1412,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 146,
									["min"] = 146,
									["count"] = 1,
									["amount"] = 146,
								},
							},
							["count"] = 1,
							["amount"] = 146,
						},
						["野性冲锋效果"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 200,
									["min"] = 61,
									["count"] = 9,
									["amount"] = 1022,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 557,
									["min"] = 53,
									["count"] = 10,
									["amount"] = 2965,
								},
								["Absorb"] = {
									["max"] = 282,
									["min"] = 60,
									["count"] = 11,
									["amount"] = 1432,
								},
							},
							["count"] = 33,
							["amount"] = 5419,
						},
					},
					["RageGain"] = 165,
					["RageGainedFrom"] = {
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["原始狂怒"] = {
									["count"] = 65,
								},
								["激怒"] = {
									["count"] = 100,
								},
							},
							["amount"] = 165,
						},
					},
					["TimeDamage"] = 55.52,
					["TimeDamaging"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.51,
								},
								["爪击"] = {
									["count"] = 1.38,
								},
								["肉搏"] = {
									["count"] = 7.35,
								},
							},
							["amount"] = 9.24,
						},
						["贴身施法"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.5,
								},
								["肉搏"] = {
									["count"] = 3.35,
								},
							},
							["amount"] = 5.85,
						},
						["部落军旗"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.32,
								},
								["槌击"] = {
									["count"] = 1.07,
								},
								["野性冲锋效果"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.02,
								},
							},
							["amount"] = 3.91,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.85,
								},
								["肉搏"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 4.53,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["挥击"] = {
									["count"] = 1.1,
								},
								["血袭 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["爪击"] = {
									["count"] = 2.31,
								},
								["肉搏"] = {
									["count"] = 5.229999999999999,
								},
							},
							["amount"] = 12.12,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.7,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["爪击"] = {
									["count"] = 1.12,
								},
							},
							["amount"] = 3.32,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["肉搏 (正义之手)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.02,
								},
							},
							["amount"] = 4.52,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.13,
								},
								["肉搏"] = {
									["count"] = 2.68,
								},
							},
							["amount"] = 2.81,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.25,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6.25,
						},
						["鬼武者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 2.97,
								},
							},
							["amount"] = 2.97,
						},
					},
					["PartialResist"] = {
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["深冬之寒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 18,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["RageGained"] = {
						["原始狂怒"] = {
							["Details"] = {
								["阿蛮达-老马布兰契"] = {
									["count"] = 65,
								},
							},
							["amount"] = 65,
						},
						["激怒"] = {
							["Details"] = {
								["阿蛮达-老马布兰契"] = {
									["count"] = 100,
								},
							},
							["amount"] = 100,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 10,
								},
								["Absorb"] = {
									["count"] = 11,
								},
							},
							["amount"] = 33,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 15,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 33,
						},
					},
				},
			},
			["UnitLockout"] = 43572.588,
			["LastActive"] = 44415.587,
		},
		["狼 <开火-黑龙费尔默>"] = {
			["GUID"] = "Pet-0-5429-529-14055-2681-03012E2F4D",
			["LastEventHealth"] = {
				3152, -- [1]
				3152, -- [2]
				3152, -- [3]
				3152, -- [4]
				3152, -- [5]
				3152, -- [6]
				3152, -- [7]
				3152, -- [8]
				3152, -- [9]
				3152, -- [10]
				3152, -- [11]
				3152, -- [12]
				3152, -- [13]
				3152, -- [14]
				3152, -- [15]
				3152, -- [16]
				3105, -- [17]
				3105, -- [18]
				3105, -- [19]
				3015, -- [20]
				3152, -- [21]
			},
			["LastAttackedBy"] = "狩望者-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					20.42, -- [1]
				},
				["Damage"] = {
					1530, -- [1]
				},
				["DamageTaken"] = {
					1116, -- [1]
				},
				["ActiveTime"] = {
					20.42, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "狼",
			["level"] = 1,
			["LastDamageAbility"] = "多重射击",
			["LastFightIn"] = 3,
			["type"] = "Pet",
			["ownerName"] = "开火-黑龙费尔默",
			["LastDamageTaken"] = 477,
			["TimeLast"] = {
				["ActiveTime"] = 43201.581,
				["TimeDamage"] = 43201.581,
				["OVERALL"] = 43498.583,
				["DamageTaken"] = 43498.583,
				["Damage"] = 43201.581,
			},
			["LastEventHealthMax"] = {
				3152, -- [1]
				3152, -- [2]
				3152, -- [3]
				3152, -- [4]
				3152, -- [5]
				3152, -- [6]
				3152, -- [7]
				3152, -- [8]
				3152, -- [9]
				3152, -- [10]
				3152, -- [11]
				3152, -- [12]
				3152, -- [13]
				3152, -- [14]
				3152, -- [15]
				3152, -- [16]
				3152, -- [17]
				3152, -- [18]
				3152, -- [19]
				3152, -- [20]
				3152, -- [21]
			},
			["NextEventNum"] = 22,
			["LastDamageTime"] = 43201.748,
			["LastEvents"] = {
				"贴身施法 冰霜新星 狼 <开火-黑龙费尔默> Resist (Frost)", -- [1]
				"狼 <开火-黑龙费尔默> 肉搏 贴身施法 Absorb -100 (100 被吸收) (1)", -- [2]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Absorb -138 (138 被吸收) (1)", -- [3]
				"狼 <开火-黑龙费尔默> 撕咬 秃老亮-黑龙费尔默 Hit -165 (Physical)", -- [4]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Hit -72 (Physical)", -- [5]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Hit -79 (Physical)", -- [6]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Hit -72 (Physical)", -- [7]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Hit -90 (Physical)", -- [8]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Hit -100 (Physical)", -- [9]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Hit -94 (Physical)", -- [10]
				"狼 <开火-黑龙费尔默> 撕咬 秃老亮-黑龙费尔默 Hit -108 (Physical)", -- [11]
				"狼 <开火-黑龙费尔默> 肉搏 秃老亮-黑龙费尔默 Hit -86 (Physical)", -- [12]
				"秃老亮-黑龙费尔默 肉搏 狼 <开火-黑龙费尔默> Dodge (1)", -- [13]
				"秃老亮-黑龙费尔默 惩击 狼 <开火-黑龙费尔默> Hit -502 (Holy)", -- [14]
				"狼 <开火-黑龙费尔默> 肉搏 贴身施法 Absorb -114 (114 被吸收) (1)", -- [15]
				"贴身施法 肉搏 狼 <开火-黑龙费尔默> Hit -47 (Physical)", -- [16]
				"狼 <开火-黑龙费尔默> 肉搏 贴身施法 Hit -125 (Physical)", -- [17]
				"狼 <开火-黑龙费尔默> 肉搏 贴身施法 Hit -76 (Physical)", -- [18]
				"贴身施法 冰霜新星 狼 <开火-黑龙费尔默> Hit -90 (Frost)", -- [19]
				"狼 <开火-黑龙费尔默> 肉搏 丧尸暴龙-逐风者 Hit -111 (Physical)", -- [20]
				"狩望者-黑龙费尔默 多重射击 狼 <开火-黑龙费尔默> Hit -477 (Physical)", -- [21]
			},
			["Name"] = "狼",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
			},
			["LastEventTimes"] = {
				43003.37, -- [1]
				43003.52, -- [2]
				43017.287, -- [3]
				43030.221, -- [4]
				43030.921, -- [5]
				43032.638, -- [6]
				43034.338, -- [7]
				43036.038, -- [8]
				43037.739, -- [9]
				43039.439, -- [10]
				43040.755, -- [11]
				43041.155, -- [12]
				43042.122, -- [13]
				43044.172, -- [14]
				43184.247, -- [15]
				43185.03, -- [16]
				43188.047, -- [17]
				43190.364, -- [18]
				43190.464, -- [19]
				43201.748, -- [20]
				43498.85, -- [21]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["贴身施法"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 2.82,
								},
								["肉搏"] = {
									["count"] = 10.1,
								},
							},
							["amount"] = 12.92,
						},
					},
					["WhoDamaged"] = {
						["贴身施法"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 90,
								},
								["肉搏"] = {
									["count"] = 47,
								},
							},
							["amount"] = 137,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 477,
								},
							},
							["amount"] = 477,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["惩击"] = {
									["count"] = 502,
								},
							},
							["amount"] = 502,
						},
					},
					["DamagedWho"] = {
						["贴身施法"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 415,
								},
							},
							["amount"] = 415,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 111,
								},
							},
							["amount"] = 111,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 273,
								},
								["肉搏"] = {
									["count"] = 731,
								},
							},
							["amount"] = 1004,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 10,
								},
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 13,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1257,
						["Physical"] = 273,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 1116,
					["ElementDoneAbsorb"] = {
						["Melee"] = 352,
					},
					["PartialResist"] = {
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["惩击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 165,
									["min"] = 108,
									["count"] = 2,
									["amount"] = 273,
								},
							},
							["count"] = 2,
							["amount"] = 273,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 125,
									["min"] = 72,
									["count"] = 10,
									["amount"] = 905,
								},
								["Absorb"] = {
									["max"] = 138,
									["min"] = 100,
									["count"] = 3,
									["amount"] = 352,
								},
							},
							["count"] = 13,
							["amount"] = 1257,
						},
					},
					["PartialAbsorb"] = {
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["惩击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 20.42,
					["TimeDamaging"] = {
						["贴身施法"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 2.82,
								},
								["肉搏"] = {
									["count"] = 10.1,
								},
							},
							["amount"] = 12.92,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 477,
						["Holy"] = 502,
						["Melee"] = 47,
						["Frost"] = 90,
					},
					["ActiveTime"] = 20.42,
					["Damage"] = 1530,
				},
			},
			["UnitLockout"] = 43002.587,
			["LastActive"] = 43498.583,
		},
		["贰公主洛基-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-0321F52A",
			["LastEventHealth"] = {
				418, -- [1]
				418, -- [2]
				0, -- [3]
				0, -- [4]
				1, -- [5]
				1, -- [6]
				1, -- [7]
				1, -- [8]
				3543, -- [9]
				3543, -- [10]
				3543, -- [11]
				3543, -- [12]
				3543, -- [13]
				3543, -- [14]
				3050, -- [15]
				2873, -- [16]
				2873, -- [17]
				2873, -- [18]
				2873, -- [19]
				2128, -- [20]
				2128, -- [21]
				2128, -- [22]
				2366, -- [23]
				1819, -- [24]
				1819, -- [25]
				1819, -- [26]
				1819, -- [27]
				1819, -- [28]
				2056, -- [29]
				2056, -- [30]
				2056, -- [31]
				2293, -- [32]
				2318, -- [33]
				2368, -- [34]
				2980, -- [35]
				2276, -- [36]
				2276, -- [37]
				2276, -- [38]
				2276, -- [39]
				2276, -- [40]
				1722, -- [41]
				1722, -- [42]
				1022, -- [43]
				1022, -- [44]
				1022, -- [45]
				1022, -- [46]
				1022, -- [47]
				1260, -- [48]
				1084, -- [49]
				418, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"MISC", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"HEAL", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"HEAL", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"HEAL", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"HEAL", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					9.24, -- [1]
				},
				["Healing"] = {
					1428, -- [1]
				},
				["DamageTaken"] = {
					3886, -- [1]
				},
				["Overhealing"] = {
					475, -- [1]
				},
				["EnergyGain"] = {
					40, -- [1]
				},
				["HealingTaken"] = {
					950, -- [1]
				},
				["HOT_Time"] = {
					27, -- [1]
				},
				["TimeDamage"] = {
					45.62, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					54.85999999999999, -- [1]
				},
				["DOT_Time"] = {
					93, -- [1]
				},
				["Damage"] = {
					6016, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						false, -- [21]
					},
					["Messages"] = {
						"贴身施法 寒冰箭 贰公主洛基-火妖鲁西弗隆 Hit -704 (Frost)", -- [1]
						"贰公主洛基-火妖鲁西弗隆 纠缠根须 (伤害/跳) 向天歌-黑龙费尔默 Tick -33 (Nature)", -- [2]
						"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 向天歌-黑龙费尔默 Absorb -70 (70 被吸收) (Nature)", -- [3]
						"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 向天歌-黑龙费尔默 Absorb -134 (134 被吸收) (Arcane)", -- [4]
						"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 贴身施法 Absorb -134 (134 被吸收) (Arcane)", -- [5]
						"贴身施法 火焰冲击 贰公主洛基-火妖鲁西弗隆 Hit -554 (Fire)", -- [6]
						"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Absorb -69 (69 被吸收) (Nature)", -- [7]
						"贴身施法 寒冰箭 贰公主洛基-火妖鲁西弗隆 Hit -700 (Frost)", -- [8]
						"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 向天歌-黑龙费尔默 Absorb -70 (70 被吸收) (Nature)", -- [9]
						"贰公主洛基-火妖鲁西弗隆 纠缠根须 (伤害/跳) 向天歌-黑龙费尔默 Absorb -34 (34 被吸收) (Nature)", -- [10]
						"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Tick -70 (Nature)", -- [11]
						"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 贴身施法 Tick -133 (Arcane)", -- [12]
						"贰公主洛基-火妖鲁西弗隆 回春术 贰公主洛基-火妖鲁西弗隆 Tick +238", -- [13]
						"贴身施法 冰霜新星 贰公主洛基-火妖鲁西弗隆 Crit -176 (Frost)", -- [14]
						"向天歌-黑龙费尔默 寒冰箭 贰公主洛基-火妖鲁西弗隆 Hit -666 (Frost)", -- [15]
						"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Tick -70 (Nature)", -- [16]
						"贰公主洛基-火妖鲁西弗隆 纠缠根须 (伤害/跳) 向天歌-黑龙费尔默 Absorb -33 (33 被吸收) (Nature)", -- [17]
						"贴身施法 冰锥术 贰公主洛基-火妖鲁西弗隆 Hit -539 (Frost)", -- [18]
						"贰公主洛基-火妖鲁西弗隆死亡。", -- [19]
						"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 贴身施法 Tick -134 (Arcane)", -- [20]
						"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Tick -70 (Nature)", -- [21]
					},
					["DeathAt"] = 43558.587,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
					},
					["MessageTimes"] = {
						-6.782999999995809, -- [1]
						-6.25, -- [2]
						-5.349999999998545, -- [3]
						-4.86699999999837, -- [4]
						-4.799999999995634, -- [5]
						-4.532999999995809, -- [6]
						-4.315999999998894, -- [7]
						-4.265999999995984, -- [8]
						-3.366000000001804, -- [9]
						-3.233000000000175, -- [10]
						-2.315999999998894, -- [11]
						-1.815999999998894, -- [12]
						-1.765999999995984, -- [13]
						-1.515999999995984, -- [14]
						-0.5720000000001164, -- [15]
						-0.3159999999988941, -- [16]
						-0.25, -- [17]
						0, -- [18]
						0, -- [19]
						1.184000000001106, -- [20]
						1.701000000000931, -- [21]
					},
					["HealthMax"] = {
						3543, -- [1]
						3543, -- [2]
						3543, -- [3]
						3543, -- [4]
						3543, -- [5]
						3543, -- [6]
						3543, -- [7]
						3543, -- [8]
						3543, -- [9]
						3543, -- [10]
						3543, -- [11]
						3543, -- [12]
						3543, -- [13]
						3543, -- [14]
						3543, -- [15]
						3543, -- [16]
						3543, -- [17]
						3543, -- [18]
						3423, -- [19]
						3423, -- [20]
						3423, -- [21]
					},
					["Health"] = {
						2980, -- [1]
						2276, -- [2]
						2276, -- [3]
						2276, -- [4]
						2276, -- [5]
						2276, -- [6]
						1722, -- [7]
						1722, -- [8]
						1022, -- [9]
						1022, -- [10]
						1022, -- [11]
						1022, -- [12]
						1022, -- [13]
						1260, -- [14]
						1084, -- [15]
						418, -- [16]
						418, -- [17]
						418, -- [18]
						0, -- [19]
						0, -- [20]
						1, -- [21]
					},
					["KilledBy"] = "贴身施法",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"MISC", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "冰锥术",
			["LastFightIn"] = 4,
			["type"] = "Grouped",
			["LastDamageTaken"] = 539,
			["LastHealTime"] = 43555.054,
			["TimeLast"] = {
				["TimeHeal"] = 43554.587,
				["DeathCount"] = 43556.587,
				["OVERALL"] = 43654.593,
				["DamageTaken"] = 43556.587,
				["Overhealing"] = 43601.59,
				["EnergyGain"] = 43654.593,
				["HealingTaken"] = 43554.587,
				["HOT_Time"] = 43601.59,
				["TimeDamage"] = 43646.593,
				["Healing"] = 43554.587,
				["ActiveTime"] = 43646.593,
				["DOT_Time"] = 43646.593,
				["Damage"] = 43646.593,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3543, -- [1]
				3543, -- [2]
				3423, -- [3]
				3423, -- [4]
				3423, -- [5]
				3423, -- [6]
				3423, -- [7]
				3423, -- [8]
				3543, -- [9]
				3543, -- [10]
				3543, -- [11]
				3543, -- [12]
				3543, -- [13]
				3543, -- [14]
				4783, -- [15]
				4783, -- [16]
				4783, -- [17]
				4783, -- [18]
				4783, -- [19]
				3543, -- [20]
				3543, -- [21]
				3543, -- [22]
				3543, -- [23]
				3543, -- [24]
				3543, -- [25]
				3543, -- [26]
				3543, -- [27]
				3543, -- [28]
				3543, -- [29]
				3543, -- [30]
				3543, -- [31]
				3543, -- [32]
				3543, -- [33]
				3543, -- [34]
				3543, -- [35]
				3543, -- [36]
				3543, -- [37]
				3543, -- [38]
				3543, -- [39]
				3543, -- [40]
				3543, -- [41]
				3543, -- [42]
				3543, -- [43]
				3543, -- [44]
				3543, -- [45]
				3543, -- [46]
				3543, -- [47]
				3543, -- [48]
				3543, -- [49]
				3543, -- [50]
			},
			["NextEventNum"] = 15,
			["LastDamageTime"] = 43647.06,
			["LastEvents"] = {
				"贰公主洛基-火妖鲁西弗隆 纠缠根须 (伤害/跳) 向天歌-黑龙费尔默 Absorb -33 (33 被吸收) (Nature)", -- [1]
				"贴身施法 冰锥术 贰公主洛基-火妖鲁西弗隆 Hit -539 (Frost)", -- [2]
				"贰公主洛基-火妖鲁西弗隆死亡。", -- [3]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 贴身施法 Tick -134 (Arcane)", -- [4]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Tick -70 (Nature)", -- [5]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Tick -70 (Nature)", -- [6]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 贴身施法 Absorb -133 (133 被吸收) (Arcane)", -- [7]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Absorb -70 (70 被吸收) (Nature)", -- [8]
				"贰公主洛基-火妖鲁西弗隆 回春术 贰公主洛基-火妖鲁西弗隆 Tick +237 (237 过量治疗)", -- [9]
				"贰公主洛基-火妖鲁西弗隆 回春术 贰公主洛基-火妖鲁西弗隆 Tick +238 (238 过量治疗)", -- [10]
				"贰公主洛基-火妖鲁西弗隆 月火术 熊汏-黑龙费尔默 Hit -277 (Arcane)", -- [11]
				"贰公主洛基-火妖鲁西弗隆 虫群 熊汏-黑龙费尔默 Resist (Nature)", -- [12]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 熊汏-黑龙费尔默 Tick -134 (Arcane)", -- [13]
				"贰公主洛基-火妖鲁西弗隆 虫群 熊汏-黑龙费尔默 Resist (Nature)", -- [14]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 张主任-逐风者 Tick -101 (33 被抵抗) (Arcane)", -- [15]
				"贰公主洛基-火妖鲁西弗隆 肉搏 向天歌-黑龙费尔默 Hit -158 (Physical)", -- [16]
				"向天歌-黑龙费尔默 冰冻 贰公主洛基-火妖鲁西弗隆 Resist (Frost)", -- [17]
				"贰公主洛基-火妖鲁西弗隆 愈合 加加卜鲁艮-逐风者 Tick +159", -- [18]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 向天歌-黑龙费尔默 Tick -134 (Arcane)", -- [19]
				"贰公主洛基-火妖鲁西弗隆 月火术 向天歌-黑龙费尔默 Hit -269 (Arcane)", -- [20]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 张主任-逐风者 Tick -134 (Arcane)", -- [21]
				"贰公主洛基-火妖鲁西弗隆 回春术 贰公主洛基-火妖鲁西弗隆 Tick +238", -- [22]
				"向天歌-黑龙费尔默 火焰冲击 贰公主洛基-火妖鲁西弗隆 Hit -547 (Fire)", -- [23]
				"贰公主洛基-火妖鲁西弗隆 愈合 加加卜鲁艮-逐风者 Tick +160", -- [24]
				"贰公主洛基-火妖鲁西弗隆 月火术 向天歌-黑龙费尔默 Crit -464 (Arcane)", -- [25]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 张主任-逐风者 Tick -134 (Arcane)", -- [26]
				"贰公主洛基-火妖鲁西弗隆 月火术 张主任-逐风者 Hit -194 (65 被抵抗) (Arcane)", -- [27]
				"贰公主洛基-火妖鲁西弗隆 回春术 贰公主洛基-火妖鲁西弗隆 Tick +237", -- [28]
				"贰公主洛基-火妖鲁西弗隆 愈合 加加卜鲁艮-逐风者 Tick +159", -- [29]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 张主任-逐风者 Tick -134 (Arcane)", -- [30]
				"贰公主洛基-火妖鲁西弗隆 回春术 贰公主洛基-火妖鲁西弗隆 Tick +237", -- [31]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 张主任-逐风者 Tick -133 (Arcane)", -- [32]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 张主任-逐风者 Tick -133 (Arcane)", -- [33]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 张主任-逐风者 Tick -134 (Arcane)", -- [34]
				"贴身施法 寒冰箭 贰公主洛基-火妖鲁西弗隆 Hit -704 (Frost)", -- [35]
				"贰公主洛基-火妖鲁西弗隆 纠缠根须 (伤害/跳) 向天歌-黑龙费尔默 Tick -33 (Nature)", -- [36]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 向天歌-黑龙费尔默 Absorb -70 (70 被吸收) (Nature)", -- [37]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 向天歌-黑龙费尔默 Absorb -134 (134 被吸收) (Arcane)", -- [38]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 贴身施法 Absorb -134 (134 被吸收) (Arcane)", -- [39]
				"贴身施法 火焰冲击 贰公主洛基-火妖鲁西弗隆 Hit -554 (Fire)", -- [40]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Absorb -69 (69 被吸收) (Nature)", -- [41]
				"贴身施法 寒冰箭 贰公主洛基-火妖鲁西弗隆 Hit -700 (Frost)", -- [42]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 向天歌-黑龙费尔默 Absorb -70 (70 被吸收) (Nature)", -- [43]
				"贰公主洛基-火妖鲁西弗隆 纠缠根须 (伤害/跳) 向天歌-黑龙费尔默 Absorb -34 (34 被吸收) (Nature)", -- [44]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Tick -70 (Nature)", -- [45]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 贴身施法 Tick -133 (Arcane)", -- [46]
				"贰公主洛基-火妖鲁西弗隆 回春术 贰公主洛基-火妖鲁西弗隆 Tick +238", -- [47]
				"贴身施法 冰霜新星 贰公主洛基-火妖鲁西弗隆 Crit -176 (Frost)", -- [48]
				"向天歌-黑龙费尔默 寒冰箭 贰公主洛基-火妖鲁西弗隆 Hit -666 (Frost)", -- [49]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 贴身施法 Tick -70 (Nature)", -- [50]
			},
			["Name"] = "贰公主洛基-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				43556.57, -- [1]
				43556.82, -- [2]
				43556.82, -- [3]
				43558.004, -- [4]
				43558.521, -- [5]
				43560.521, -- [6]
				43561.004, -- [7]
				43562.504, -- [8]
				43598.69, -- [9]
				43601.69, -- [10]
				43644.026, -- [11]
				43645.51, -- [12]
				43647.026, -- [13]
				43647.06, -- [14]
				43403.394, -- [15]
				43403.727, -- [16]
				43404.11, -- [17]
				43404.477, -- [18]
				43405.105, -- [19]
				43406.277, -- [20]
				43406.41, -- [21]
				43406.61, -- [22]
				43406.696, -- [23]
				43407.477, -- [24]
				43407.794, -- [25]
				43409.394, -- [26]
				43409.494, -- [27]
				43409.611, -- [28]
				43410.477, -- [29]
				43412.494, -- [30]
				43412.628, -- [31]
				43415.511, -- [32]
				43418.496, -- [33]
				43421.495, -- [34]
				43550.037, -- [35]
				43550.57, -- [36]
				43551.47, -- [37]
				43551.953, -- [38]
				43552.02, -- [39]
				43552.287, -- [40]
				43552.504, -- [41]
				43552.554, -- [42]
				43553.454, -- [43]
				43553.587, -- [44]
				43554.504, -- [45]
				43555.004, -- [46]
				43555.054, -- [47]
				43555.304, -- [48]
				43556.248, -- [49]
				43556.504, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["向天歌-黑龙费尔默"] = {
									["count"] = 9,
								},
								["雷滴呱呱-黑龙费尔默"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["向天歌-黑龙费尔默"] = {
									["count"] = 6,
								},
								["贴身施法"] = {
									["count"] = 18,
								},
							},
							["amount"] = 24,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["熊汏-黑龙费尔默"] = {
									["count"] = 6,
								},
								["向天歌-黑龙费尔默"] = {
									["count"] = 6,
								},
								["雷滴呱呱-黑龙费尔默"] = {
									["count"] = 9,
								},
								["贴身施法"] = {
									["count"] = 15,
								},
								["张主任-逐风者"] = {
									["count"] = 21,
								},
							},
							["amount"] = 57,
						},
					},
					["ElementDoneResist"] = {
						["Arcane"] = 98,
						["Nature"] = 76,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["WhoHealed"] = {
						["贰公主洛基-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 950,
								},
							},
							["amount"] = 950,
						},
					},
					["ElementDoneAbsorb"] = {
						["Arcane"] = 401,
						["Nature"] = 346,
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 27,
					["ElementTaken"] = {
						["Frost"] = 2785,
						["Fire"] = 1101,
					},
					["HOTs"] = {
						["回春术"] = {
							["Details"] = {
								["贰公主洛基-火妖鲁西弗隆"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["愈合"] = {
							["Details"] = {
								["加加卜鲁艮-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["Damage"] = 6016,
					["TimeHeal"] = 9.24,
					["ElementDone"] = {
						["Nature"] = 918,
						["Melee"] = 158,
						["Arcane"] = 4940,
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 17,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 16,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 28,
						},
					},
					["WhoDamaged"] = {
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 666,
								},
								["火焰冲击"] = {
									["count"] = 547,
								},
							},
							["amount"] = 1213,
						},
						["贴身施法"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 539,
								},
								["寒冰箭"] = {
									["count"] = 1404,
								},
								["冰霜新星"] = {
									["count"] = 176,
								},
								["火焰冲击"] = {
									["count"] = 554,
								},
							},
							["amount"] = 2673,
						},
					},
					["EnergyGainedFrom"] = {
						["贰公主洛基-火妖鲁西弗隆"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
					},
					["TimeHealing"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 3.24,
								},
							},
							["amount"] = 3.24,
						},
						["贰公主洛基-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["OverHeals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 238,
									["min"] = 237,
									["count"] = 2,
									["amount"] = 475,
								},
							},
							["count"] = 2,
							["amount"] = 475,
						},
					},
					["PartialResist"] = {
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 54.85999999999999,
					["Heals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 238,
									["min"] = 237,
									["count"] = 4,
									["amount"] = 950,
								},
							},
							["count"] = 4,
							["amount"] = 950,
						},
						["愈合"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 160,
									["min"] = 159,
									["count"] = 3,
									["amount"] = 478,
								},
							},
							["count"] = 3,
							["amount"] = 478,
						},
					},
					["EnergyGained"] = {
						["激怒"] = {
							["Details"] = {
								["贰公主洛基-火妖鲁西弗隆"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
					},
					["EnergyGain"] = 40,
					["Healing"] = 1428,
					["TimeSpent"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["虫群"] = {
									["count"] = 1.51,
								},
								["月火术"] = {
									["count"] = 1.72,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.23,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 1.85,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 1.7,
								},
								["月火术"] = {
									["count"] = 2.55,
								},
								["肉搏"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 8.290000000000001,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 1.5,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 0.62,
								},
								["虫群"] = {
									["count"] = 0.88,
								},
								["月火术"] = {
									["count"] = 3,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.37,
								},
							},
							["amount"] = 9.37,
						},
						["贴身施法"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 0.57,
								},
								["虫群 (伤害/跳)"] = {
									["count"] = 6.42,
								},
								["月火术"] = {
									["count"] = 1.53,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.98,
								},
							},
							["amount"] = 12.5,
						},
						["贰公主洛基-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 3.24,
								},
							},
							["amount"] = 3.24,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 0.1,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 9.129999999999999,
								},
							},
							["amount"] = 9.23,
						},
					},
					["HealedWho"] = {
						["加加卜鲁艮-逐风者"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 478,
								},
							},
							["amount"] = 478,
						},
						["贰公主洛基-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 950,
								},
							},
							["amount"] = 950,
						},
					},
					["Attacks"] = {
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 70,
									["min"] = 70,
									["count"] = 4,
									["amount"] = 280,
								},
								["Absorb"] = {
									["max"] = 70,
									["min"] = 69,
									["count"] = 4,
									["amount"] = 279,
								},
							},
							["count"] = 8,
							["amount"] = 559,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 158,
									["min"] = 158,
									["count"] = 1,
									["amount"] = 158,
								},
							},
							["count"] = 1,
							["amount"] = 158,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 34,
									["min"] = 33,
									["count"] = 2,
									["amount"] = 67,
								},
								["Tick"] = {
									["max"] = 33,
									["min"] = 30,
									["count"] = 2,
									["amount"] = 63,
								},
							},
							["count"] = 4,
							["amount"] = 130,
						},
						["愤怒"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 229,
									["min"] = 229,
									["count"] = 1,
									["amount"] = 229,
								},
							},
							["count"] = 2,
							["amount"] = 229,
						},
						["虫群"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 496,
									["min"] = 464,
									["count"] = 2,
									["amount"] = 960,
								},
								["Hit"] = {
									["max"] = 283,
									["min"] = 194,
									["count"] = 6,
									["amount"] = 1520,
								},
							},
							["count"] = 9,
							["amount"] = 2480,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 134,
									["min"] = 133,
									["count"] = 3,
									["amount"] = 401,
								},
								["Tick"] = {
									["max"] = 134,
									["min"] = 101,
									["count"] = 16,
									["amount"] = 2059,
								},
							},
							["count"] = 19,
							["amount"] = 2460,
						},
					},
					["HealingTaken"] = 950,
					["Overhealing"] = 475,
					["TimeDamage"] = 45.62,
					["TimeDamaging"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["虫群"] = {
									["count"] = 1.51,
								},
								["月火术"] = {
									["count"] = 1.72,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.23,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 1.85,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 1.7,
								},
								["月火术"] = {
									["count"] = 2.55,
								},
								["肉搏"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 8.290000000000001,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 1.5,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 0.62,
								},
								["虫群"] = {
									["count"] = 0.88,
								},
								["月火术"] = {
									["count"] = 3,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.37,
								},
							},
							["amount"] = 9.37,
						},
						["贴身施法"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 0.57,
								},
								["虫群 (伤害/跳)"] = {
									["count"] = 6.42,
								},
								["月火术"] = {
									["count"] = 1.53,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.98,
								},
							},
							["amount"] = 12.5,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 0.1,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 9.129999999999999,
								},
							},
							["amount"] = 9.23,
						},
					},
					["DOT_Time"] = 93,
					["DamageTaken"] = 3886,
					["DamagedWho"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 560,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 268,
								},
							},
							["amount"] = 828,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 140,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 268,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 100,
								},
								["月火术"] = {
									["count"] = 733,
								},
								["肉搏"] = {
									["count"] = 158,
								},
							},
							["amount"] = 1399,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 229,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 30,
								},
								["月火术"] = {
									["count"] = 276,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 365,
								},
							},
							["amount"] = 900,
						},
						["贴身施法"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 419,
								},
								["月火术"] = {
									["count"] = 717,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 656,
								},
							},
							["amount"] = 1792,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 194,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 903,
								},
							},
							["amount"] = 1097,
						},
					},
				},
			},
			["UnitLockout"] = 43559.588,
			["LastActive"] = 43654.593,
		},
		["闪现冲脸很骚-逐风者"] = {
			["GUID"] = "Player-5451-030E2571",
			["LastEventHealth"] = {
				2180, -- [1]
				2180, -- [2]
				2180, -- [3]
				2180, -- [4]
				2180, -- [5]
				2180, -- [6]
				2180, -- [7]
			},
			["LastAttackedBy"] = "炽天使-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
			},
			["TimeWindows"] = {
				["Absorbs"] = {
					611, -- [1]
				},
				["TimeHeal"] = {
					3, -- [1]
				},
				["ActiveTime"] = {
					7.5, -- [1]
				},
				["TimeDamage"] = {
					4.5, -- [1]
				},
				["HealingTaken"] = {
					611, -- [1]
				},
				["DamageTaken"] = {
					611, -- [1]
				},
				["Damage"] = {
					377, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 8,
			["type"] = "Grouped",
			["LastDamageTaken"] = 88,
			["LastHealTime"] = 43919.559,
			["TimeLast"] = {
				["Absorbs"] = 43918.592,
				["TimeHeal"] = 43918.592,
				["TimeDamage"] = 43917.592,
				["ActiveTime"] = 43918.592,
				["HealingTaken"] = 43918.592,
				["OVERALL"] = 43918.592,
				["DamageTaken"] = 43918.592,
				["Damage"] = 43917.592,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2180, -- [1]
				2180, -- [2]
				2180, -- [3]
				2180, -- [4]
				2180, -- [5]
				2180, -- [6]
				2180, -- [7]
			},
			["NextEventNum"] = 8,
			["LastDamageTime"] = 43918.575,
			["LastEvents"] = {
				"闪现冲脸很骚-逐风者 冰霜新星 鬼武者 Hit -30 (Frost)", -- [1]
				"闪现冲脸很骚-逐风者 冰霜新星 狩望者-黑龙费尔默 Hit -35 (Frost)", -- [2]
				"闪现冲脸很骚-逐风者 冰霜新星 炽天使-黑龙费尔默 Immune (Frost)", -- [3]
				"闪现冲脸很骚-逐风者 冰霜新星 丧尸暴龙-逐风者 Hit -30 (Frost)", -- [4]
				"炽天使-黑龙费尔默 冰锥术 闪现冲脸很骚-逐风者 Absorb -523 (523 被吸收) (Frost)", -- [5]
				"闪现冲脸很骚-逐风者 魔爆术 炽天使-黑龙费尔默 Absorb -282 (282 被吸收) (Arcane)", -- [6]
				"炽天使-黑龙费尔默 冰霜新星 闪现冲脸很骚-逐风者 Absorb -88 (88 被吸收) (Frost)", -- [7]
			},
			["Name"] = "闪现冲脸很骚-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
			},
			["LastEventTimes"] = {
				43530.219, -- [1]
				43530.219, -- [2]
				43915.242, -- [3]
				43915.242, -- [4]
				43916.542, -- [5]
				43918.575, -- [6]
				43919.559, -- [7]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["闪现冲脸很骚-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeSpent"] = {
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["闪现冲脸很骚-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["鬼武者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["HealedWho"] = {
						["闪现冲脸很骚-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 611,
								},
							},
							["amount"] = 611,
						},
					},
					["ElementDoneAbsorb"] = {
						["Arcane"] = 282,
					},
					["Absorbs"] = 611,
					["ElementTakenAbsorb"] = {
						["Frost"] = 611,
					},
					["ActiveTime"] = 7.5,
					["ElementTaken"] = {
						["Frost"] = 611,
					},
					["Damage"] = 377,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 523,
									["min"] = 88,
									["count"] = 2,
									["amount"] = 611,
								},
							},
							["count"] = 2,
							["amount"] = 611,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 88,
									["min"] = 88,
									["count"] = 1,
									["amount"] = 88,
								},
							},
							["count"] = 1,
							["amount"] = 88,
						},
						["冰锥术"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 523,
									["min"] = 523,
									["count"] = 1,
									["amount"] = 523,
								},
							},
							["count"] = 1,
							["amount"] = 523,
						},
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 88,
								},
								["冰锥术"] = {
									["count"] = 523,
								},
							},
							["amount"] = 611,
						},
					},
					["DamageTaken"] = 611,
					["WhoHealed"] = {
						["闪现冲脸很骚-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 611,
								},
							},
							["amount"] = 611,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
					["Attacks"] = {
						["魔爆术"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 282,
									["min"] = 282,
									["count"] = 1,
									["amount"] = 282,
								},
							},
							["count"] = 1,
							["amount"] = 282,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 35,
									["min"] = 30,
									["count"] = 3,
									["amount"] = 95,
								},
							},
							["count"] = 4,
							["amount"] = 95,
						},
					},
					["HealingTaken"] = 611,
					["DamagedWho"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 282,
								},
							},
							["amount"] = 282,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 35,
								},
							},
							["amount"] = 35,
						},
						["鬼武者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["TimeDamage"] = 4.5,
					["TimeDamaging"] = {
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["鬼武者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["TimeHeal"] = 3,
					["ElementDone"] = {
						["Arcane"] = 282,
						["Frost"] = 95,
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["闪现冲脸很骚-逐风者"] = {
									["max"] = 523,
									["min"] = 88,
									["count"] = 2,
									["amount"] = 611,
								},
							},
							["count"] = 2,
							["amount"] = 611,
						},
					},
				},
			},
			["UnitLockout"] = 43914.592,
			["LastActive"] = 43918.592,
		},
		["刺客信條"] = {
			["GUID"] = "Player-5458-02F1761B",
			["LastEventHealth"] = {
				3625, -- [1]
				3625, -- [2]
				3625, -- [3]
				3625, -- [4]
				3339, -- [5]
				3339, -- [6]
				3339, -- [7]
				3339, -- [8]
				3339, -- [9]
				3339, -- [10]
				3339, -- [11]
				2809, -- [12]
				2809, -- [13]
				2809, -- [14]
			},
			["LastAttackedBy"] = "炽天使-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					25, -- [1]
				},
				["ActiveTime"] = {
					9.79, -- [1]
				},
				["TimeDamage"] = {
					9.79, -- [1]
				},
				["DamageTaken"] = {
					909, -- [1]
				},
				["Damage"] = {
					2033, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 8,
			["type"] = "Grouped",
			["LastDamageTaken"] = 93,
			["TimeLast"] = {
				["EnergyGain"] = 43916.592,
				["ActiveTime"] = 43917.592,
				["TimeDamage"] = 43917.592,
				["OVERALL"] = 43918.592,
				["DamageTaken"] = 43918.592,
				["Damage"] = 43917.592,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4063, -- [1]
				4063, -- [2]
				4063, -- [3]
				4063, -- [4]
				4063, -- [5]
				4063, -- [6]
				4063, -- [7]
				4063, -- [8]
				4063, -- [9]
				4063, -- [10]
				4063, -- [11]
				4063, -- [12]
				4063, -- [13]
				4063, -- [14]
			},
			["NextEventNum"] = 15,
			["LastDamageTime"] = 43917.775,
			["LastEvents"] = {
				"刺客信條 肉搏 丧尸暴龙-逐风者 Hit -212 (Physical)", -- [1]
				"刺客信條 出血 炽天使-黑龙费尔默 Crit -503 (Physical)", -- [2]
				"刺客信條 肉搏 炽天使-黑龙费尔默 Crit -166 (Physical)", -- [3]
				"炽天使-黑龙费尔默 魔爆术 刺客信條 Hit -286 (Arcane)", -- [4]
				"刺客信條 出血 丧尸暴龙-逐风者 Hit -197 (Physical)", -- [5]
				"刺客信條 肉搏 丧尸暴龙-逐风者 Miss (1)", -- [6]
				"刺客信條 肉搏 丧尸暴龙-逐风者 Crit -146 (Physical)", -- [7]
				"刺客信條 出血 丧尸暴龙-逐风者 Hit -217 (Physical)", -- [8]
				"刺客信條 肉搏 丧尸暴龙-逐风者 Hit -65 (Physical)", -- [9]
				"刺客信條 肉搏 丧尸暴龙-逐风者 Hit -243 (Physical)", -- [10]
				"炽天使-黑龙费尔默 冰锥术 刺客信條 Hit -530 (Frost)", -- [11]
				"刺客信條 出血 丧尸暴龙-逐风者 Hit -208 (Physical)", -- [12]
				"刺客信條 肉搏 丧尸暴龙-逐风者 Hit -76 (Physical)", -- [13]
				"炽天使-黑龙费尔默 冰霜新星 刺客信條 Hit -93 (Frost)", -- [14]
			},
			["Name"] = "刺客信條",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
			},
			["LastEventTimes"] = {
				43909.408, -- [1]
				43910.375, -- [2]
				43910.875, -- [3]
				43911.375, -- [4]
				43911.841, -- [5]
				43912.725, -- [6]
				43913.175, -- [7]
				43914.758, -- [8]
				43915.475, -- [9]
				43916.375, -- [10]
				43916.542, -- [11]
				43917.758, -- [12]
				43917.775, -- [13]
				43919.559, -- [14]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 3.85,
								},
								["肉搏"] = {
									["count"] = 4.47,
								},
							},
							["amount"] = 8.32,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 1.47,
						},
					},
					["DamageTaken"] = 909,
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 9.79,
					["ElementTaken"] = {
						["Frost"] = 623,
						["Arcane"] = 286,
					},
					["Damage"] = 2033,
					["EnergyGained"] = {
						["无情打击效果"] = {
							["Details"] = {
								["刺客信條"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["Attacks"] = {
						["出血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 503,
									["min"] = 503,
									["count"] = 1,
									["amount"] = 503,
								},
								["Hit"] = {
									["max"] = 217,
									["min"] = 197,
									["count"] = 3,
									["amount"] = 622,
								},
							},
							["count"] = 4,
							["amount"] = 1125,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 166,
									["min"] = 146,
									["count"] = 2,
									["amount"] = 312,
								},
								["Hit"] = {
									["max"] = 243,
									["min"] = 65,
									["count"] = 4,
									["amount"] = 596,
								},
							},
							["count"] = 7,
							["amount"] = 908,
						},
					},
					["EnergyGain"] = 25,
					["ElementDone"] = {
						["Melee"] = 908,
						["Physical"] = 1125,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 622,
								},
								["肉搏"] = {
									["count"] = 742,
								},
							},
							["amount"] = 1364,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 503,
								},
								["肉搏"] = {
									["count"] = 166,
								},
							},
							["amount"] = 669,
						},
					},
					["TimeDamage"] = 9.79,
					["TimeDamaging"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 3.85,
								},
								["肉搏"] = {
									["count"] = 4.47,
								},
							},
							["amount"] = 8.32,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 1.47,
						},
					},
					["EnergyGainedFrom"] = {
						["刺客信條"] = {
							["Details"] = {
								["无情打击效果"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["WhoDamaged"] = {
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 286,
								},
								["冰霜新星"] = {
									["count"] = 93,
								},
								["冰锥术"] = {
									["count"] = 530,
								},
							},
							["amount"] = 909,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
				},
			},
			["UnitLockout"] = 43908.591,
			["LastActive"] = 43918.592,
		},
		["Playerofxamb-黑龙费尔默"] = {
			["GUID"] = "Player-5450-02F46A9A",
			["LastEventHealth"] = {
				1646, -- [1]
				1484, -- [2]
				1484, -- [3]
				3043, -- [4]
				3043, -- [5]
				3043, -- [6]
				3043, -- [7]
				2821, -- [8]
				2550, -- [9]
				2550, -- [10]
				2550, -- [11]
				3043, -- [12]
				3043, -- [13]
				3043, -- [14]
				3043, -- [15]
				3043, -- [16]
				3043, -- [17]
				2842, -- [18]
				2842, -- [19]
				2842, -- [20]
				2842, -- [21]
				1781, -- [22]
				1237, -- [23]
				1150, -- [24]
				562, -- [25]
				562, -- [26]
				562, -- [27]
				562, -- [28]
				1279, -- [29]
				2228, -- [30]
				2228, -- [31]
				2228, -- [32]
				2210, -- [33]
				2192, -- [34]
				2192, -- [35]
				2192, -- [36]
				2174, -- [37]
				2174, -- [38]
				2156, -- [39]
				2156, -- [40]
				2156, -- [41]
				2138, -- [42]
				2138, -- [43]
				2138, -- [44]
				2138, -- [45]
				2138, -- [46]
				2102, -- [47]
				2102, -- [48]
				2084, -- [49]
				2084, -- [50]
			},
			["LastAttackedBy"] = "像疯一样离去-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Healing"] = {
					717, -- [1]
				},
				["DamageTaken"] = {
					2923, -- [1]
				},
				["EnergyGain"] = {
					25, -- [1]
				},
				["HealingTaken"] = {
					717, -- [1]
				},
				["TimeDamage"] = {
					21.45, -- [1]
				},
				["ActiveTime"] = {
					22.95, -- [1]
				},
				["DOT_Time"] = {
					3, -- [1]
				},
				["Damage"] = {
					3973, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 9,
			["type"] = "Grouped",
			["LastHealTime"] = 43583.489,
			["LastDamageTaken"] = 163,
			["TimeLast"] = {
				["TimeHeal"] = 43582.589,
				["OVERALL"] = 43996.582,
				["DamageTaken"] = 43996.582,
				["EnergyGain"] = 43645.593,
				["HealingTaken"] = 43582.589,
				["TimeDamage"] = 43994.596,
				["ActiveTime"] = 43994.596,
				["Healing"] = 43582.589,
				["DOT_Time"] = 43994.596,
				["Damage"] = 43994.596,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3043, -- [1]
				3043, -- [2]
				3043, -- [3]
				3043, -- [4]
				3043, -- [5]
				3043, -- [6]
				3043, -- [7]
				3043, -- [8]
				3043, -- [9]
				3043, -- [10]
				3043, -- [11]
				3043, -- [12]
				3043, -- [13]
				3043, -- [14]
				3043, -- [15]
				3043, -- [16]
				3043, -- [17]
				3043, -- [18]
				3043, -- [19]
				3043, -- [20]
				3043, -- [21]
				3043, -- [22]
				3043, -- [23]
				3043, -- [24]
				3043, -- [25]
				3043, -- [26]
				3043, -- [27]
				3043, -- [28]
				3043, -- [29]
				3043, -- [30]
				3043, -- [31]
				3043, -- [32]
				3043, -- [33]
				3043, -- [34]
				3043, -- [35]
				3043, -- [36]
				3043, -- [37]
				3043, -- [38]
				3043, -- [39]
				3043, -- [40]
				3043, -- [41]
				3043, -- [42]
				3043, -- [43]
				3043, -- [44]
				3043, -- [45]
				3043, -- [46]
				3043, -- [47]
				3043, -- [48]
				3043, -- [49]
				3043, -- [50]
			},
			["NextEventNum"] = 4,
			["LastDamageTime"] = 43995.296,
			["LastEvents"] = {
				"像疯一样离去-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Playerofxamb-黑龙费尔默 Tick -162 (Shadow)", -- [1]
				"Playerofxamb-黑龙费尔默 割裂 (伤害/跳) 像疯一样离去-火妖鲁西弗隆 Absorb -83 (83 被吸收) (Physical)", -- [2]
				"像疯一样离去-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Playerofxamb-黑龙费尔默 Tick -163 (Shadow)", -- [3]
				"Playerofxamb-黑龙费尔默 刺骨 向天歌-黑龙费尔默 Immune (Physical)", -- [4]
				"Playerofxamb-黑龙费尔默 肉搏 向天歌-黑龙费尔默 Immune (1)", -- [5]
				"Playerofxamb-黑龙费尔默 肉搏 向天歌-黑龙费尔默 Immune (1)", -- [6]
				"贴身施法 火焰冲击 Playerofxamb-黑龙费尔默 Hit -539 (Fire)", -- [7]
				"贴身施法 魔爆术 Playerofxamb-黑龙费尔默 Hit -271 (Arcane)", -- [8]
				"Playerofxamb-黑龙费尔默 肉搏 贴身施法 Miss (1)", -- [9]
				"Playerofxamb-黑龙费尔默 出血 贴身施法 Hit -94 (Physical)", -- [10]
				"贴身施法 冰霜新星 Playerofxamb-黑龙费尔默 Hit -93 (Frost)", -- [11]
				"贴身施法 冰霜新星 Playerofxamb-黑龙费尔默 Hit -87 (Frost)", -- [12]
				"Playerofxamb-黑龙费尔默 伏击 红丶枫-逐风者 Crit -910 (Physical)", -- [13]
				"Playerofxamb-黑龙费尔默 肉搏 红丶枫-逐风者 Hit -80 (Physical)", -- [14]
				"Playerofxamb-黑龙费尔默 刺骨 红丶枫-逐风者 Hit -173 (Physical)", -- [15]
				"Playerofxamb-黑龙费尔默 肉搏 红丶枫-逐风者 Hit -62 (Physical)", -- [16]
				"秃老亮-黑龙费尔默 神圣新星 Playerofxamb-黑龙费尔默 Hit -201 (Holy)", -- [17]
				"Playerofxamb-黑龙费尔默 肉搏 秃老亮-黑龙费尔默 Hit -81 (Physical)", -- [18]
				"Playerofxamb-黑龙费尔默 出血 秃老亮-黑龙费尔默 Hit -71 (Physical)", -- [19]
				"Playerofxamb-黑龙费尔默 速效毒药 III 秃老亮-黑龙费尔默 Hit -40 (13 被抵抗) (Nature)", -- [20]
				"张主任-逐风者 冰霜新星 Playerofxamb-黑龙费尔默 Hit -26 (Frost)", -- [21]
				"贴身施法 冰锥术 Playerofxamb-黑龙费尔默 Hit -544 (Frost)", -- [22]
				"贴身施法 冰霜新星 Playerofxamb-黑龙费尔默 Hit -87 (Frost)", -- [23]
				"贴身施法 火焰冲击 Playerofxamb-黑龙费尔默 Hit -588 (Fire)", -- [24]
				"Playerofxamb-黑龙费尔默 出血 贴身施法 Hit -110 (Physical)", -- [25]
				"Playerofxamb-黑龙费尔默 肉搏 贴身施法 Hit -109 (Physical)", -- [26]
				"Playerofxamb-黑龙费尔默 肉搏 贴身施法 Hit -124 (Physical)", -- [27]
				"Playerofxamb-黑龙费尔默 治疗药水 Playerofxamb-黑龙费尔默 Hit +717", -- [28]
				"Playerofxamb-黑龙费尔默 出血 贴身施法 Hit -104 (Physical)", -- [29]
				"Playerofxamb-黑龙费尔默 伏击 熊汏-黑龙费尔默 Hit -336 (Physical)", -- [30]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [31]
				"Playerofxamb-黑龙费尔默 肉搏 熊汏-黑龙费尔默 Hit -67 (Physical)", -- [32]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [33]
				"Playerofxamb-黑龙费尔默 出血 熊汏-黑龙费尔默 Hit -113 (Physical)", -- [34]
				"Playerofxamb-黑龙费尔默 速效毒药 III 熊汏-黑龙费尔默 Hit -59 (Nature)", -- [35]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [36]
				"Playerofxamb-黑龙费尔默 肉搏 熊汏-黑龙费尔默 Hit -95 (Physical)", -- [37]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [38]
				"Playerofxamb-黑龙费尔默 肉搏 熊汏-黑龙费尔默 Hit -110 (Physical)", -- [39]
				"Playerofxamb-黑龙费尔默 闪电箭 熊汏-黑龙费尔默 Hit -14 (Nature)", -- [40]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [41]
				"Playerofxamb-黑龙费尔默 速效毒药 III 熊汏-黑龙费尔默 Hit -56 (Nature)", -- [42]
				"Playerofxamb-黑龙费尔默 肉搏 熊汏-黑龙费尔默 Hit -107 (Physical)", -- [43]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [44]
				"Playerofxamb-黑龙费尔默 鬼魅攻击 熊汏-黑龙费尔默 Hit -129 (Physical)", -- [45]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [46]
				"Playerofxamb-黑龙费尔默 肉搏 熊汏-黑龙费尔默 Crit -204 (Physical)", -- [47]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [48]
				"Playerofxamb-黑龙费尔默 肉搏 熊汏-黑龙费尔默 Hit -102 (Physical)", -- [49]
				"熊汏-黑龙费尔默 荆棘术 Playerofxamb-黑龙费尔默 Hit -18 (Nature)", -- [50]
			},
			["Name"] = "Playerofxamb-黑龙费尔默",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				43994.596, -- [1]
				43995.296, -- [2]
				43997.58, -- [3]
				43019.204, -- [4]
				43020.088, -- [5]
				43021.238, -- [6]
				43023.321, -- [7]
				43045.706, -- [8]
				43046.739, -- [9]
				43046.739, -- [10]
				43047.206, -- [11]
				43190.464, -- [12]
				43413.994, -- [13]
				43413.994, -- [14]
				43415.011, -- [15]
				43415.394, -- [16]
				43416.295, -- [17]
				43417.361, -- [18]
				43417.361, -- [19]
				43417.361, -- [20]
				43419.145, -- [21]
				43575.288, -- [22]
				43576.855, -- [23]
				43579.189, -- [24]
				43582.489, -- [25]
				43582.739, -- [26]
				43582.906, -- [27]
				43583.489, -- [28]
				43583.856, -- [29]
				43643.293, -- [30]
				43643.309, -- [31]
				43643.326, -- [32]
				43643.343, -- [33]
				43644.309, -- [34]
				43644.309, -- [35]
				43644.309, -- [36]
				43644.697, -- [37]
				43644.697, -- [38]
				43645.043, -- [39]
				43645.043, -- [40]
				43645.059, -- [41]
				43645.609, -- [42]
				43646.743, -- [43]
				43646.76, -- [44]
				43646.876, -- [45]
				43646.876, -- [46]
				43647.393, -- [47]
				43647.41, -- [48]
				43648.443, -- [49]
				43648.46, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["Playerofxamb-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DOTs"] = {
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["像疯一样离去-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDoneResist"] = {
						["Nature"] = 13,
					},
					["TimeSpent"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["鬼魅攻击"] = {
									["count"] = 0.13,
								},
								["出血"] = {
									["count"] = 0.98,
								},
								["速效毒药 III"] = {
									["count"] = 0.57,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.47,
								},
							},
							["amount"] = 6.65,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.95,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.08,
								},
							},
							["amount"] = 4.529999999999999,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 1.02,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 2.9,
						},
						["贴身施法"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 2.45,
								},
								["肉搏"] = {
									["count"] = 1.92,
								},
							},
							["amount"] = 4.37,
						},
						["Playerofxamb-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 2923,
					["ElementDoneAbsorb"] = {
						["Physical"] = 83,
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 22.95,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 837,
						["Arcane"] = 271,
						["Shadow"] = 325,
						["Fire"] = 1127,
						["Holy"] = 201,
						["Nature"] = 162,
					},
					["DOT_Time"] = 3,
					["Damage"] = 3973,
					["Attacks"] = {
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
						["鬼魅攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 129,
									["min"] = 129,
									["count"] = 1,
									["amount"] = 129,
								},
							},
							["count"] = 1,
							["amount"] = 129,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 59,
									["min"] = 40,
									["count"] = 3,
									["amount"] = 155,
								},
							},
							["count"] = 3,
							["amount"] = 155,
						},
						["出血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 113,
									["min"] = 71,
									["count"] = 5,
									["amount"] = 492,
								},
							},
							["count"] = 5,
							["amount"] = 492,
						},
						["闪电箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 14,
									["min"] = 14,
									["count"] = 2,
									["amount"] = 28,
								},
							},
							["count"] = 2,
							["amount"] = 28,
						},
						["刺骨"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 173,
									["min"] = 173,
									["count"] = 1,
									["amount"] = 173,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 173,
						},
						["伏击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 910,
									["min"] = 910,
									["count"] = 1,
									["amount"] = 910,
								},
								["Hit"] = {
									["max"] = 526,
									["min"] = 336,
									["count"] = 2,
									["amount"] = 862,
								},
							},
							["count"] = 3,
							["amount"] = 1772,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 124,
									["min"] = 62,
									["count"] = 10,
									["amount"] = 937,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 204,
									["min"] = 204,
									["count"] = 1,
									["amount"] = 204,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 1141,
						},
					},
					["TimeHeal"] = 1.5,
					["EnergyGain"] = 25,
					["EnergyGained"] = {
						["无情打击效果"] = {
							["Details"] = {
								["Playerofxamb-黑龙费尔默"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["WhoHealed"] = {
						["Playerofxamb-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 717,
								},
							},
							["amount"] = 717,
						},
					},
					["Healing"] = 717,
					["HealedWho"] = {
						["Playerofxamb-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 717,
								},
							},
							["amount"] = 717,
						},
					},
					["Heals"] = {
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 717,
									["min"] = 717,
									["count"] = 1,
									["amount"] = 717,
								},
							},
							["count"] = 1,
							["amount"] = 717,
						},
					},
					["ElementDone"] = {
						["Physical"] = 2649,
						["Melee"] = 1141,
						["Nature"] = 183,
					},
					["HealingTaken"] = 717,
					["DamagedWho"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["鬼魅攻击"] = {
									["count"] = 129,
								},
								["出血"] = {
									["count"] = 113,
								},
								["闪电箭"] = {
									["count"] = 14,
								},
								["速效毒药 III"] = {
									["count"] = 115,
								},
								["伏击"] = {
									["count"] = 336,
								},
								["肉搏"] = {
									["count"] = 685,
								},
							},
							["amount"] = 1392,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 83,
								},
							},
							["amount"] = 83,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 526,
								},
								["闪电箭"] = {
									["count"] = 14,
								},
							},
							["amount"] = 540,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 173,
								},
								["伏击"] = {
									["count"] = 910,
								},
								["肉搏"] = {
									["count"] = 142,
								},
							},
							["amount"] = 1225,
						},
						["贴身施法"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 308,
								},
								["肉搏"] = {
									["count"] = 233,
								},
							},
							["amount"] = 541,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["速效毒药 III"] = {
									["count"] = 40,
								},
								["出血"] = {
									["count"] = 71,
								},
								["肉搏"] = {
									["count"] = 81,
								},
							},
							["amount"] = 192,
						},
					},
					["TimeDamage"] = 21.45,
					["TimeDamaging"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["鬼魅攻击"] = {
									["count"] = 0.13,
								},
								["出血"] = {
									["count"] = 0.98,
								},
								["速效毒药 III"] = {
									["count"] = 0.57,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.47,
								},
							},
							["amount"] = 6.65,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.95,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.08,
								},
							},
							["amount"] = 4.529999999999999,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 1.02,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 2.9,
						},
						["贴身施法"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 2.45,
								},
								["肉搏"] = {
									["count"] = 1.92,
								},
							},
							["amount"] = 4.37,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["EnergyGainedFrom"] = {
						["Playerofxamb-黑龙费尔默"] = {
							["Details"] = {
								["无情打击效果"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["WhoDamaged"] = {
						["张主任-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 325,
								},
							},
							["amount"] = 325,
						},
						["贴身施法"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 271,
								},
								["冰锥术"] = {
									["count"] = 544,
								},
								["冰霜新星"] = {
									["count"] = 267,
								},
								["火焰冲击"] = {
									["count"] = 1127,
								},
							},
							["amount"] = 2209,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 162,
								},
							},
							["amount"] = 162,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 201,
								},
							},
							["amount"] = 201,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 12,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 10,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 15,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
				},
			},
			["UnitLockout"] = 43574.588,
			["LastActive"] = 43996.582,
		},
		["开火-黑龙费尔默"] = {
			["GUID"] = "Player-5450-02FC1205",
			["LastEventHealth"] = {
				4034, -- [1]
				4034, -- [2]
				4034, -- [3]
				4034, -- [4]
				4034, -- [5]
				4034, -- [6]
				4034, -- [7]
				4034, -- [8]
				3192, -- [9]
				3192, -- [10]
				3192, -- [11]
				3709, -- [12]
				3709, -- [13]
				3563, -- [14]
				3563, -- [15]
				3563, -- [16]
				2908, -- [17]
				2908, -- [18]
				2908, -- [19]
				2908, -- [20]
				2706, -- [21]
				2706, -- [22]
				2055, -- [23]
				1827, -- [24]
				1827, -- [25]
				1595, -- [26]
				1595, -- [27]
				1595, -- [28]
				1697, -- [29]
				4034, -- [30]
				4034, -- [31]
				4034, -- [32]
				4034, -- [33]
				2139, -- [34]
				2139, -- [35]
				1846, -- [36]
				1846, -- [37]
				979, -- [38]
				0, -- [39]
				637, -- [40]
				492, -- [41]
				0, -- [42]
				3902, -- [43]
				2117, -- [44]
				1886, -- [45]
				1781, -- [46]
				1835, -- [47]
				1675, -- [48]
				1675, -- [49]
				1515, -- [50]
			},
			["LastAttackedBy"] = "贴身施法",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"MISC", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["ManaGain"] = {
					1458, -- [1]
				},
				["ActiveTime"] = {
					36.83, -- [1]
				},
				["TimeDamage"] = {
					36.83, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					6141, -- [1]
				},
				["Damage"] = {
					11462, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
					},
					["Messages"] = {
						"开火-黑龙费尔默 自动射击 贴身施法 Hit -364 (Physical)", -- [1]
						"熊汏-黑龙费尔默 月火术 开火-黑龙费尔默 Hit -293 (Arcane)", -- [2]
						"狩望者-黑龙费尔默 多重射击 开火-黑龙费尔默 Hit -519 (Physical)", -- [3]
						"狩望者-黑龙费尔默 自动射击 开火-黑龙费尔默 Hit -348 (Physical)", -- [4]
						"狩望者-黑龙费尔默 烈焰弹 开火-黑龙费尔默 Crit -113 (Fire)", -- [5]
						"狩望者-黑龙费尔默 奥术射击 开火-黑龙费尔默 Hit -257 (Arcane)", -- [6]
						"熊汏-黑龙费尔默 月火术 (伤害/跳) 开火-黑龙费尔默 Tick -145 (Arcane)", -- [7]
						"狩望者-黑龙费尔默 自动射击 开火-黑龙费尔默 Crit -721 (Physical)", -- [8]
						"开火-黑龙费尔默死亡。", -- [9]
					},
					["DeathAt"] = 43503.583,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["MessageTimes"] = {
						-3.266999999999825, -- [1]
						-3.083999999995285, -- [2]
						-2.81699999999546, -- [3]
						-2.666999999994005, -- [4]
						-2.666999999994005, -- [5]
						-0.7339999999967404, -- [6]
						-0.0669999999954598, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["HealthMax"] = {
						4034, -- [1]
						4034, -- [2]
						4034, -- [3]
						4034, -- [4]
						4034, -- [5]
						4034, -- [6]
						4034, -- [7]
						4034, -- [8]
						3902, -- [9]
					},
					["Health"] = {
						2139, -- [1]
						2139, -- [2]
						1846, -- [3]
						1846, -- [4]
						979, -- [5]
						0, -- [6]
						637, -- [7]
						492, -- [8]
						0, -- [9]
					},
					["KilledBy"] = "狩望者-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "火焰冲击",
			["LastFightIn"] = 8,
			["type"] = "Grouped",
			["LastDamageTaken"] = 842,
			["LastEventHealthMax"] = {
				4034, -- [1]
				4034, -- [2]
				4034, -- [3]
				4034, -- [4]
				4034, -- [5]
				4034, -- [6]
				4034, -- [7]
				4034, -- [8]
				4034, -- [9]
				4034, -- [10]
				4034, -- [11]
				3902, -- [12]
				3902, -- [13]
				3902, -- [14]
				3902, -- [15]
				3902, -- [16]
				3902, -- [17]
				3902, -- [18]
				3902, -- [19]
				3902, -- [20]
				3902, -- [21]
				3902, -- [22]
				3902, -- [23]
				3902, -- [24]
				3902, -- [25]
				3902, -- [26]
				3902, -- [27]
				3902, -- [28]
				3902, -- [29]
				4034, -- [30]
				4034, -- [31]
				4034, -- [32]
				4034, -- [33]
				4034, -- [34]
				4034, -- [35]
				4034, -- [36]
				4034, -- [37]
				4034, -- [38]
				4034, -- [39]
				4034, -- [40]
				4034, -- [41]
				3902, -- [42]
				3902, -- [43]
				3902, -- [44]
				3902, -- [45]
				3902, -- [46]
				4034, -- [47]
				4034, -- [48]
				4034, -- [49]
				4034, -- [50]
			},
			["TimeLast"] = {
				["ManaGain"] = 43193.581,
				["DeathCount"] = 43501.583,
				["TimeDamage"] = 43918.592,
				["ActiveTime"] = 43918.592,
				["Healing"] = 43002.587,
				["OVERALL"] = 43918.592,
				["DamageTaken"] = 43917.592,
				["Damage"] = 43918.592,
			},
			["Owner"] = false,
			["Pet"] = {
				"狼 <开火-黑龙费尔默>", -- [1]
			},
			["NextEventNum"] = 12,
			["LastDamageTime"] = 43919.175,
			["LastEvents"] = {
				"开火-黑龙费尔默 多重射击 像疯一样离去-火妖鲁西弗隆 Hit -538 (Physical)", -- [1]
				"开火-黑龙费尔默 多重射击 炽天使-黑龙费尔默 Crit -1123 (Physical)", -- [2]
				"开火-黑龙费尔默 多重射击 丧尸暴龙-逐风者 Hit -458 (Physical)", -- [3]
				"开火-黑龙费尔默 自动射击 炽天使-黑龙费尔默 Hit -343 (Physical)", -- [4]
				"开火-黑龙费尔默 奥术射击 像疯一样离去-火妖鲁西弗隆 Hit -198 (Arcane)", -- [5]
				"开火-黑龙费尔默 自动射击 像疯一样离去-火妖鲁西弗隆 Hit -378 (Physical)", -- [6]
				"开火-黑龙费尔默 驱散射击 贴身施法 Absorb -167 (167 被吸收) (Physical)", -- [7]
				"贴身施法 火焰冲击 开火-黑龙费尔默 Crit -842 (Fire)", -- [8]
				"开火-黑龙费尔默 奥术射击 炽天使-黑龙费尔默 Absorb -379 (379 被吸收) (Arcane)", -- [9]
				"开火-黑龙费尔默 肉搏 炽天使-黑龙费尔默 Absorb -189 (1)", -- [10]
				"开火-黑龙费尔默 自动射击 炽天使-黑龙费尔默 Hit -135 (189 被吸收) (Physical)", -- [11]
				"熊汏-黑龙费尔默 荆棘术 开火-黑龙费尔默 Hit -19 (Nature)", -- [12]
				"熊汏-黑龙费尔默 肉搏 开火-黑龙费尔默 Hit -127 (Physical)", -- [13]
				"开火-黑龙费尔默 自动射击 贴身施法 Hit -432 (Physical)", -- [14]
				"开火-黑龙费尔默 多重射击 贴身施法 Immune (Physical)", -- [15]
				"开火-黑龙费尔默 自动射击 贴身施法 Immune (Physical)", -- [16]
				"开火-黑龙费尔默 自动射击 鄂尔多斯奶妈-黑龙费尔默 Hit -260 (Physical)", -- [17]
				"开火-黑龙费尔默 肉搏 贴身施法 Absorb -150 (1)", -- [18]
				"开火-黑龙费尔默 自动射击 贴身施法 Hit -180 (150 被吸收) (Physical)", -- [19]
				"丧尸暴龙-逐风者 肉搏 开火-黑龙费尔默 Hit -202 (Physical)", -- [20]
				"丧尸暴龙-逐风者 肉搏 开火-黑龙费尔默 Crit -140 (Physical)", -- [21]
				"丧尸暴龙-逐风者 出血 开火-黑龙费尔默 Crit -511 (Physical)", -- [22]
				"丧尸暴龙-逐风者 出血 开火-黑龙费尔默 Hit -228 (Physical)", -- [23]
				"丧尸暴龙-逐风者 肉搏 开火-黑龙费尔默 Miss (1)", -- [24]
				"丧尸暴龙-逐风者 肉搏 开火-黑龙费尔默 Hit -232 (Physical)", -- [25]
				"开火-黑龙费尔默 驱散射击 丧尸暴龙-逐风者 Hit -152 (Physical)", -- [26]
				"开火-黑龙费尔默 多重射击 丧尸暴龙-逐风者 Hit -444 (Physical)", -- [27]
				"开火-黑龙费尔默 自动射击 丧尸暴龙-逐风者 Hit -329 (Physical)", -- [28]
				"开火-黑龙费尔默 自动射击 蓝染-黑龙费尔默 Hit -254 (Physical)", -- [29]
				"开火-黑龙费尔默 自动射击 炽天使-黑龙费尔默 Hit -360 (Physical)", -- [30]
				"开火-黑龙费尔默 多重射击 炽天使-黑龙费尔默 Hit -475 (Physical)", -- [31]
				"开火-黑龙费尔默 自动射击 炽天使-黑龙费尔默 Hit -357 (Physical)", -- [32]
				"开火-黑龙费尔默 奥术射击 蓝染-黑龙费尔默 Absorb -198 (198 被吸收) (Arcane)", -- [33]
				"开火-黑龙费尔默 自动射击 贴身施法 Hit -364 (Physical)", -- [34]
				"熊汏-黑龙费尔默 月火术 开火-黑龙费尔默 Hit -293 (Arcane)", -- [35]
				"狩望者-黑龙费尔默 多重射击 开火-黑龙费尔默 Hit -519 (Physical)", -- [36]
				"狩望者-黑龙费尔默 自动射击 开火-黑龙费尔默 Hit -348 (Physical)", -- [37]
				"狩望者-黑龙费尔默 烈焰弹 开火-黑龙费尔默 Crit -113 (Fire)", -- [38]
				"狩望者-黑龙费尔默 奥术射击 开火-黑龙费尔默 Hit -257 (Arcane)", -- [39]
				"熊汏-黑龙费尔默 月火术 (伤害/跳) 开火-黑龙费尔默 Tick -145 (Arcane)", -- [40]
				"狩望者-黑龙费尔默 自动射击 开火-黑龙费尔默 Crit -721 (Physical)", -- [41]
				"开火-黑龙费尔默死亡。", -- [42]
				"开火-黑龙费尔默 多重射击 耍下-黑龙费尔默 Hit -498 (Physical)", -- [43]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 开火-黑龙费尔默 Tick -257 (Shadow)", -- [44]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 开火-黑龙费尔默 Tick -257 (Shadow)", -- [45]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 开火-黑龙费尔默 Tick -233 (Shadow)", -- [46]
				"熊汏-黑龙费尔默 月火术 (伤害/跳) 开火-黑龙费尔默 Tick -160 (Arcane)", -- [47]
				"开火-黑龙费尔默 奥术射击 熊汏-黑龙费尔默 Hit -193 (64 被抵抗) (Arcane)", -- [48]
				"熊汏-黑龙费尔默 月火术 (伤害/跳) 开火-黑龙费尔默 Tick -160 (Arcane)", -- [49]
				"熊汏-黑龙费尔默 月火术 (伤害/跳) 开火-黑龙费尔默 Tick -159 (Arcane)", -- [50]
			},
			["Name"] = "开火-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				43910.791, -- [1]
				43910.825, -- [2]
				43910.891, -- [3]
				43910.941, -- [4]
				43912.425, -- [5]
				43913.875, -- [6]
				43915.208, -- [7]
				43918.392, -- [8]
				43918.642, -- [9]
				43919.175, -- [10]
				43919.175, -- [11]
				43042.039, -- [12]
				43042.156, -- [13]
				43049.939, -- [14]
				43052.206, -- [15]
				43052.389, -- [16]
				43180.597, -- [17]
				43187.964, -- [18]
				43187.964, -- [19]
				43188.964, -- [20]
				43189.88, -- [21]
				43189.914, -- [22]
				43190.914, -- [23]
				43191.681, -- [24]
				43191.781, -- [25]
				43193.014, -- [26]
				43201.065, -- [27]
				43201.264, -- [28]
				43226.649, -- [29]
				43371.908, -- [30]
				43373.575, -- [31]
				43374.775, -- [32]
				43381.659, -- [33]
				43498.35, -- [34]
				43498.533, -- [35]
				43498.8, -- [36]
				43498.95, -- [37]
				43498.95, -- [38]
				43500.883, -- [39]
				43501.55, -- [40]
				43501.617, -- [41]
				43501.617, -- [42]
				43571.505, -- [43]
				43593.773, -- [44]
				43596.773, -- [45]
				43599.773, -- [46]
				43641.443, -- [47]
				43643.559, -- [48]
				43644.443, -- [49]
				43647.443, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneResist"] = {
						["Arcane"] = 64,
					},
					["TimeSpent"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["摔绊"] = {
									["count"] = 0.18,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 4.810000000000001,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 2.98,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 2.95,
								},
							},
							["amount"] = 7.430000000000001,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 2.75,
								},
								["多重射击"] = {
									["count"] = 1.53,
								},
								["肉搏"] = {
									["count"] = 0.53,
								},
							},
							["amount"] = 6.310000000000001,
						},
						["贴身施法"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.18,
								},
								["驱散射击"] = {
									["count"] = 2.83,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.01,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.2,
								},
								["多重射击"] = {
									["count"] = 1.57,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.27,
						},
					},
					["DamageTaken"] = 6141,
					["ElementDoneAbsorb"] = {
						["Arcane"] = 577,
						["Physical"] = 2219,
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["烈焰弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["ManaGained"] = {
						["恢复法力"] = {
							["Details"] = {
								["开火-黑龙费尔默"] = {
									["count"] = 1458,
								},
							},
							["amount"] = 1458,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["烈焰弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 36.83,
					["ElementTaken"] = {
						["Frost"] = 199,
						["Melee"] = 701,
						["Arcane"] = 1174,
						["Shadow"] = 747,
						["Fire"] = 955,
						["Physical"] = 2327,
						["Nature"] = 38,
					},
					["Damage"] = 11462,
					["DeathCount"] = 1,
					["Healing"] = 0,
					["ManaGainedFrom"] = {
						["开火-黑龙费尔默"] = {
							["Details"] = {
								["恢复法力"] = {
									["count"] = 1458,
								},
							},
							["amount"] = 1458,
						},
					},
					["Attacks"] = {
						["奥术射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 379,
									["min"] = 198,
									["count"] = 2,
									["amount"] = 577,
								},
								["Hit"] = {
									["max"] = 198,
									["min"] = 193,
									["count"] = 3,
									["amount"] = 589,
								},
							},
							["count"] = 5,
							["amount"] = 1166,
						},
						["多重射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1123,
									["min"] = 1123,
									["count"] = 1,
									["amount"] = 1123,
								},
								["Hit"] = {
									["max"] = 538,
									["min"] = 303,
									["count"] = 6,
									["amount"] = 2716,
								},
							},
							["count"] = 8,
							["amount"] = 3839,
						},
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 36,
									["min"] = 36,
									["count"] = 1,
									["amount"] = 36,
								},
							},
							["count"] = 1,
							["amount"] = 36,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 726,
									["min"] = 726,
									["count"] = 1,
									["amount"] = 726,
								},
							},
							["count"] = 1,
							["amount"] = 726,
						},
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 314,
									["min"] = 314,
									["count"] = 1,
									["amount"] = 314,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 432,
									["min"] = 135,
									["count"] = 12,
									["amount"] = 3817,
								},
							},
							["count"] = 14,
							["amount"] = 4131,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 152,
									["min"] = 152,
									["count"] = 1,
									["amount"] = 152,
								},
								["Absorb"] = {
									["max"] = 566,
									["min"] = 167,
									["count"] = 2,
									["amount"] = 733,
								},
							},
							["count"] = 3,
							["amount"] = 885,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 233,
									["min"] = 233,
									["count"] = 1,
									["amount"] = 233,
								},
								["Absorb"] = {
									["max"] = 189,
									["min"] = 107,
									["count"] = 3,
									["amount"] = 446,
								},
							},
							["count"] = 4,
							["amount"] = 679,
						},
					},
					["ElementDone"] = {
						["Physical"] = 9617,
						["Melee"] = 679,
						["Arcane"] = 1166,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamagedWho"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 193,
								},
								["摔绊"] = {
									["count"] = 36,
								},
								["多重射击"] = {
									["count"] = 303,
								},
								["自动射击"] = {
									["count"] = 314,
								},
								["瞄准射击"] = {
									["count"] = 726,
								},
								["肉搏"] = {
									["count"] = 340,
								},
							},
							["amount"] = 1912,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 396,
								},
								["多重射击"] = {
									["count"] = 538,
								},
								["自动射击"] = {
									["count"] = 803,
								},
							},
							["amount"] = 1737,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 498,
								},
							},
							["amount"] = 498,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 379,
								},
								["自动射击"] = {
									["count"] = 1195,
								},
								["多重射击"] = {
									["count"] = 1598,
								},
								["肉搏"] = {
									["count"] = 189,
								},
							},
							["amount"] = 3361,
						},
						["贴身施法"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 976,
								},
								["驱散射击"] = {
									["count"] = 733,
								},
								["肉搏"] = {
									["count"] = 150,
								},
							},
							["amount"] = 1859,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 198,
								},
								["自动射击"] = {
									["count"] = 254,
								},
							},
							["amount"] = 452,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 260,
								},
							},
							["amount"] = 260,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 329,
								},
								["多重射击"] = {
									["count"] = 902,
								},
								["驱散射击"] = {
									["count"] = 152,
								},
							},
							["amount"] = 1383,
						},
					},
					["TimeDamage"] = 36.83,
					["TimeDamaging"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["摔绊"] = {
									["count"] = 0.18,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 4.810000000000001,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 2.98,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 2.95,
								},
							},
							["amount"] = 7.430000000000001,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 2.75,
								},
								["多重射击"] = {
									["count"] = 1.53,
								},
								["肉搏"] = {
									["count"] = 0.53,
								},
							},
							["amount"] = 6.310000000000001,
						},
						["贴身施法"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.18,
								},
								["驱散射击"] = {
									["count"] = 2.83,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.01,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.2,
								},
								["多重射击"] = {
									["count"] = 1.57,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.27,
						},
					},
					["ManaGain"] = 1458,
					["WhoDamaged"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 624,
								},
								["肉搏"] = {
									["count"] = 127,
								},
								["月火术"] = {
									["count"] = 293,
								},
								["荆棘术"] = {
									["count"] = 38,
								},
							},
							["amount"] = 1082,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["烈焰弹"] = {
									["count"] = 113,
								},
								["自动射击"] = {
									["count"] = 1069,
								},
								["多重射击"] = {
									["count"] = 519,
								},
								["奥术射击"] = {
									["count"] = 257,
								},
							},
							["amount"] = 1958,
						},
						["贴身施法"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 842,
								},
								["冰霜新星"] = {
									["count"] = 199,
								},
							},
							["amount"] = 1041,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 747,
								},
							},
							["amount"] = 747,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 739,
								},
								["肉搏"] = {
									["count"] = 574,
								},
							},
							["amount"] = 1313,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 20,
								},
							},
							["amount"] = 27,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
					},
				},
			},
			["UnitLockout"] = 43570.588,
			["LastActive"] = 43918.592,
		},
		["艾芮丝丶影舞"] = {
			["GUID"] = "Player-5458-02FCC17D",
			["LastEventHealth"] = {
				1197, -- [1]
				2327, -- [2]
				2327, -- [3]
				2080, -- [4]
				2080, -- [5]
				1833, -- [6]
				1614, -- [7]
				1202, -- [8]
				1202, -- [9]
				1202, -- [10]
				1202, -- [11]
				3563, -- [12]
				3563, -- [13]
				3563, -- [14]
				3563, -- [15]
				3563, -- [16]
				3563, -- [17]
				3563, -- [18]
				3563, -- [19]
				3563, -- [20]
				3563, -- [21]
				3563, -- [22]
				3563, -- [23]
				3563, -- [24]
				3563, -- [25]
				3563, -- [26]
				3563, -- [27]
				3563, -- [28]
				2877, -- [29]
				2650, -- [30]
				2650, -- [31]
				2650, -- [32]
				2423, -- [33]
				2252, -- [34]
				2207, -- [35]
				2162, -- [36]
				2307, -- [37]
				2459, -- [38]
				2422, -- [39]
				2793, -- [40]
				3039, -- [41]
				2415, -- [42]
				2173, -- [43]
				1931, -- [44]
				1685, -- [45]
				1443, -- [46]
				1443, -- [47]
				1197, -- [48]
				1197, -- [49]
				1197, -- [50]
			},
			["LastAttackedBy"] = "耍下-黑龙费尔默",
			["LastEventType"] = {
				"HEAL", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"HEAL", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					25, -- [1]
				},
				["HealingTaken"] = {
					1697, -- [1]
				},
				["TimeDamage"] = {
					20.8, -- [1]
				},
				["ActiveTime"] = {
					22.3, -- [1]
				},
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Healing"] = {
					1130, -- [1]
				},
				["DamageTaken"] = {
					7016, -- [1]
				},
				["Damage"] = {
					7922, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "艾芮丝丶影舞",
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 13,
			["type"] = "Ungrouped",
			["LastHealTime"] = 44416.458,
			["LastEventHealthMax"] = {
				3563, -- [1]
				3563, -- [2]
				3563, -- [3]
				3563, -- [4]
				3563, -- [5]
				3563, -- [6]
				3563, -- [7]
				3563, -- [8]
				3563, -- [9]
				3563, -- [10]
				3563, -- [11]
				3563, -- [12]
				3563, -- [13]
				3563, -- [14]
				3563, -- [15]
				3563, -- [16]
				3563, -- [17]
				3563, -- [18]
				3563, -- [19]
				3563, -- [20]
				3563, -- [21]
				3563, -- [22]
				3563, -- [23]
				3563, -- [24]
				3563, -- [25]
				3563, -- [26]
				3563, -- [27]
				3563, -- [28]
				3563, -- [29]
				3563, -- [30]
				3563, -- [31]
				3563, -- [32]
				3563, -- [33]
				3563, -- [34]
				3563, -- [35]
				3563, -- [36]
				3563, -- [37]
				3563, -- [38]
				3563, -- [39]
				3563, -- [40]
				3563, -- [41]
				3563, -- [42]
				3563, -- [43]
				3563, -- [44]
				3563, -- [45]
				3563, -- [46]
				3563, -- [47]
				3563, -- [48]
				3563, -- [49]
				3563, -- [50]
			},
			["LastDamageTaken"] = 220,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 44415.587,
				["OVERALL"] = 44437.588,
				["DamageTaken"] = 44425.588,
				["EnergyGain"] = 44208.592,
				["HealingTaken"] = 44415.587,
				["TimeDamage"] = 44437.588,
				["Healing"] = 44415.587,
				["ActiveTime"] = 44437.588,
				["Damage"] = 44437.588,
			},
			["NextEventNum"] = 12,
			["LastDamageTime"] = 44437.955,
			["LastEvents"] = {
				"艾芮丝丶影舞 治疗药膏 艾芮丝丶影舞 Hit +1130", -- [1]
				"艾芮丝丶影舞 刺骨 丧尸暴龙-逐风者 Hit -206 (Physical)", -- [2]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -247 (Shadow)", -- [3]
				"艾芮丝丶影舞 肉搏 丧尸暴龙-逐风者 Crit -78 (Physical)", -- [4]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -247 (Shadow)", -- [5]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -247 (Shadow)", -- [6]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -220 (Shadow)", -- [7]
				"艾芮丝丶影舞 肉搏 欧尛-火妖鲁西弗隆 Hit -35 (Physical)", -- [8]
				"艾芮丝丶影舞 刺骨 欧尛-火妖鲁西弗隆 Hit -225 (Physical)", -- [9]
				"艾芮丝丶影舞 肉搏 欧尛-火妖鲁西弗隆 Hit -94 (Physical)", -- [10]
				"艾芮丝丶影舞 肉搏 欧尛-火妖鲁西弗隆 Hit -33 (Physical)", -- [11]
				"艾芮丝丶影舞 背刺 欧尛-火妖鲁西弗隆 Crit -1244 (Physical)", -- [12]
				"艾芮丝丶影舞 肉搏 欧尛-火妖鲁西弗隆 Hit -183 (Physical)", -- [13]
				"欧尛-火妖鲁西弗隆 冰霜新星 艾芮丝丶影舞 Hit -31 (Frost)", -- [14]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Miss (1)", -- [15]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Hit -67 (Physical)", -- [16]
				"艾芮丝丶影舞 背刺 炽天使-黑龙费尔默 Crit -1248 (Physical)", -- [17]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Miss (1)", -- [18]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Absorb -181 (181 被吸收) (1)", -- [19]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Absorb -257 (1)", -- [20]
				"艾芮丝丶影舞 刺骨 炽天使-黑龙费尔默 Crit -1758 (257 被吸收) (Physical)", -- [21]
				"艾芮丝丶影舞 伏击 狩望者-黑龙费尔默 Hit -566 (Physical)", -- [22]
				"艾芮丝丶影舞 肉搏 狩望者-黑龙费尔默 Miss (1)", -- [23]
				"艾芮丝丶影舞 肉搏 狩望者-黑龙费尔默 Hit -52 (Physical)", -- [24]
				"艾芮丝丶影舞 刺骨 狩望者-黑龙费尔默 Hit -271 (Physical)", -- [25]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Crit -335 (Physical)", -- [26]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Miss (1)", -- [27]
				"炽天使-黑龙费尔默 冰锥术 艾芮丝丶影舞 Hit -686 (Frost)", -- [28]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -227 (Shadow)", -- [29]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Hit -186 (Physical)", -- [30]
				"艾芮丝丶影舞 肉搏 炽天使-黑龙费尔默 Miss (1)", -- [31]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -227 (Shadow)", -- [32]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -227 (Shadow)", -- [33]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -227 (Shadow)", -- [34]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -227 (Shadow)", -- [35]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -220 (Shadow)", -- [36]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -220 (Shadow)", -- [37]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -220 (Shadow)", -- [38]
				"阿蛮达-老马布兰契 回春术 艾芮丝丶影舞 Tick +189", -- [39]
				"阿蛮达-老马布兰契 回春术 艾芮丝丶影舞 Tick +189", -- [40]
				"阿蛮达-老马布兰契 回春术 艾芮丝丶影舞 Tick +189", -- [41]
				"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 艾芮丝丶影舞 Tick -242 (Shadow)", -- [42]
				"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 艾芮丝丶影舞 Tick -242 (Shadow)", -- [43]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -246 (Shadow)", -- [44]
				"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 艾芮丝丶影舞 Tick -242 (Shadow)", -- [45]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 艾芮丝丶影舞 Tick -246 (Shadow)", -- [46]
				"艾芮丝丶影舞 背刺 丧尸暴龙-逐风者 Hit -410 (Physical)", -- [47]
				"艾芮丝丶影舞 肉搏 丧尸暴龙-逐风者 Crit -236 (Physical)", -- [48]
				"艾芮丝丶影舞 肉搏 丧尸暴龙-逐风者 Hit -32 (Physical)", -- [49]
				"艾芮丝丶影舞 肉搏 丧尸暴龙-逐风者 Crit -225 (Physical)", -- [50]
			},
			["Name"] = "艾芮丝丶影舞",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				44416.458, -- [1]
				44416.954, -- [2]
				44417.237, -- [3]
				44417.87, -- [4]
				44420.254, -- [5]
				44423.254, -- [6]
				44426.254, -- [7]
				44436.605, -- [8]
				44437.255, -- [9]
				44437.855, -- [10]
				44437.955, -- [11]
				44174.373, -- [12]
				44174.423, -- [13]
				44174.423, -- [14]
				44203.225, -- [15]
				44204.175, -- [16]
				44204.192, -- [17]
				44209.109, -- [18]
				44209.192, -- [19]
				44209.225, -- [20]
				44209.225, -- [21]
				44241.81, -- [22]
				44241.844, -- [23]
				44242.544, -- [24]
				44242.81, -- [25]
				44244.394, -- [26]
				44244.594, -- [27]
				44249.778, -- [28]
				44249.778, -- [29]
				44249.844, -- [30]
				44250.044, -- [31]
				44252.778, -- [32]
				44255.761, -- [33]
				44258.761, -- [34]
				44261.762, -- [35]
				44264.762, -- [36]
				44267.762, -- [37]
				44270.779, -- [38]
				44271.696, -- [39]
				44274.696, -- [40]
				44277.712, -- [41]
				44410.17, -- [42]
				44411.187, -- [43]
				44411.237, -- [44]
				44412.17, -- [45]
				44414.237, -- [46]
				44414.454, -- [47]
				44414.487, -- [48]
				44415.187, -- [49]
				44416.304, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2179,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 2179,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1574,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 733,
						["Physical"] = 841,
					},
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 206,
								},
								["背刺"] = {
									["count"] = 410,
								},
								["肉搏"] = {
									["count"] = 571,
								},
							},
							["amount"] = 1187,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 225,
								},
								["肉搏"] = {
									["count"] = 162,
								},
							},
							["amount"] = 387,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1453,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 726,
								},
							},
							["amount"] = 2179,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1130,
								},
							},
							["amount"] = 1130,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.65,
								},
								["肉搏"] = {
									["count"] = 2.2,
								},
							},
							["amount"] = 2.85,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.65,
								},
								["背刺"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 4.92,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["治疗药膏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1130,
									["min"] = 1130,
									["count"] = 1,
									["amount"] = 1130,
								},
							},
							["count"] = 1,
							["amount"] = 1130,
						},
					},
					["WhoHealed"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1130,
								},
							},
							["amount"] = 1130,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 9.27,
					["Healing"] = 1130,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["刺骨"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 225,
									["min"] = 206,
									["count"] = 2,
									["amount"] = 431,
								},
							},
							["count"] = 2,
							["amount"] = 431,
						},
						["背刺"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 410,
									["min"] = 410,
									["count"] = 1,
									["amount"] = 410,
								},
							},
							["count"] = 1,
							["amount"] = 410,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 236,
									["min"] = 78,
									["count"] = 3,
									["amount"] = 539,
								},
								["Hit"] = {
									["max"] = 94,
									["min"] = 32,
									["count"] = 4,
									["amount"] = 194,
								},
							},
							["count"] = 7,
							["amount"] = 733,
						},
					},
					["HealingTaken"] = 1130,
					["RageGain"] = 0,
					["TimeDamage"] = 7.77,
					["TimeDamaging"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.65,
								},
								["背刺"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 4.92,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.65,
								},
								["肉搏"] = {
									["count"] = 2.2,
								},
							},
							["amount"] = 2.85,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["DamageTaken"] = 7016,
					["ElementDoneAbsorb"] = {
						["Melee"] = 181,
						["Physical"] = 257,
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 22,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 22.3,
					["ElementTaken"] = {
						["Physical"] = 299,
						["Frost"] = 717,
						["Shadow"] = 6000,
					},
					["HealedWho"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1130,
								},
							},
							["amount"] = 1130,
						},
					},
					["Damage"] = 7922,
					["Heals"] = {
						["治疗药膏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1130,
									["min"] = 1130,
									["count"] = 1,
									["amount"] = 1130,
								},
							},
							["count"] = 1,
							["amount"] = 1130,
						},
					},
					["TimeHeal"] = 1.5,
					["WhoHealed"] = {
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1130,
								},
							},
							["amount"] = 1130,
						},
					},
					["EnergyGained"] = {
						["无情打击效果"] = {
							["Details"] = {
								["艾芮丝丶影舞"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["Attacks"] = {
						["致残毒药"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1248,
									["min"] = 1244,
									["count"] = 2,
									["amount"] = 2492,
								},
								["Hit"] = {
									["max"] = 410,
									["min"] = 410,
									["count"] = 1,
									["amount"] = 410,
								},
							},
							["count"] = 3,
							["amount"] = 2902,
						},
						["偷袭"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1758,
									["min"] = 1758,
									["count"] = 1,
									["amount"] = 1758,
								},
								["Hit"] = {
									["max"] = 271,
									["min"] = 206,
									["count"] = 3,
									["amount"] = 702,
								},
							},
							["count"] = 4,
							["amount"] = 2460,
						},
						["伏击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 566,
									["min"] = 566,
									["count"] = 1,
									["amount"] = 566,
								},
							},
							["count"] = 1,
							["amount"] = 566,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 257,
									["min"] = 181,
									["count"] = 2,
									["amount"] = 438,
								},
								["Crit"] = {
									["max"] = 335,
									["min"] = 78,
									["count"] = 4,
									["amount"] = 874,
								},
								["Hit"] = {
									["max"] = 186,
									["min"] = 32,
									["count"] = 8,
									["amount"] = 682,
								},
							},
							["count"] = 19,
							["amount"] = 1994,
						},
					},
					["Healing"] = 1130,
					["DamagedWho"] = {
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 1758,
								},
								["背刺"] = {
									["count"] = 1248,
								},
								["肉搏"] = {
									["count"] = 1026,
								},
							},
							["amount"] = 4032,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 225,
								},
								["背刺"] = {
									["count"] = 1244,
								},
								["肉搏"] = {
									["count"] = 345,
								},
							},
							["amount"] = 1814,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 271,
								},
								["伏击"] = {
									["count"] = 566,
								},
								["肉搏"] = {
									["count"] = 52,
								},
							},
							["amount"] = 889,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 206,
								},
								["背刺"] = {
									["count"] = 410,
								},
								["肉搏"] = {
									["count"] = 571,
								},
							},
							["amount"] = 1187,
						},
					},
					["EnergyGain"] = 25,
					["ElementDone"] = {
						["Melee"] = 1994,
						["Physical"] = 5928,
					},
					["HealingTaken"] = 1697,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 5,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 19,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 20.8,
					["WhoDamaged"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 31,
								},
							},
							["amount"] = 31,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 299,
								},
							},
							["amount"] = 299,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 686,
								},
							},
							["amount"] = 686,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2026,
								},
							},
							["amount"] = 2026,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3248,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 726,
								},
							},
							["amount"] = 3974,
						},
					},
					["EnergyGainedFrom"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["无情打击效果"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["TimeSpent"] = {
						["艾芮丝丶影舞"] = {
							["Details"] = {
								["治疗药膏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致残毒药"] = {
									["count"] = 1.5,
								},
								["刺骨"] = {
									["count"] = 0.65,
								},
								["偷袭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.25,
								},
							},
							["amount"] = 5.9,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.27,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.73,
								},
							},
							["amount"] = 2.5,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.65,
								},
								["背刺"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 4.92,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 7.460000000000001,
								},
							},
							["amount"] = 7.48,
						},
					},
					["TimeDamaging"] = {
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 7.460000000000001,
								},
							},
							["amount"] = 7.48,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["致残毒药"] = {
									["count"] = 1.5,
								},
								["刺骨"] = {
									["count"] = 0.65,
								},
								["偷袭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.25,
								},
							},
							["amount"] = 5.9,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.27,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.73,
								},
							},
							["amount"] = 2.5,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.65,
								},
								["背刺"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 4.92,
						},
					},
				},
			},
			["UnitLockout"] = 44130.587,
			["LastActive"] = 44437.588,
		},
		["Seery"] = {
			["GUID"] = "Player-5458-0306166F",
			["LastEventHealth"] = {
				2986, -- [1]
				3008, -- [2]
				3197, -- [3]
				3197, -- [4]
				3197, -- [5]
				3197, -- [6]
				3197, -- [7]
				3197, -- [8]
				3197, -- [9]
				3197, -- [10]
				3197, -- [11]
				3197, -- [12]
				2904, -- [13]
				2671, -- [14]
				2671, -- [15]
				2291, -- [16]
				2291, -- [17]
				2291, -- [18]
				2291, -- [19]
				2291, -- [20]
				2291, -- [21]
				2291, -- [22]
				2291, -- [23]
				2291, -- [24]
				2291, -- [25]
				2291, -- [26]
				2291, -- [27]
				2291, -- [28]
				2291, -- [29]
				2291, -- [30]
				2065, -- [31]
				1838, -- [32]
				1838, -- [33]
				1611, -- [34]
				3197, -- [35]
				3197, -- [36]
				3197, -- [37]
				3197, -- [38]
				3197, -- [39]
				3197, -- [40]
				3197, -- [41]
				3197, -- [42]
				3197, -- [43]
				3197, -- [44]
				2563, -- [45]
				2563, -- [46]
				2563, -- [47]
				2586, -- [48]
				2586, -- [49]
				2775, -- [50]
			},
			["LastAttackedBy"] = "耍下-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"HEAL", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["DOT_Time"] = {
					6, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["HealingTaken"] = {
					567, -- [1]
				},
				["ActiveTime"] = {
					48.33000000000001, -- [1]
				},
				["TimeDamage"] = {
					48.33000000000001, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					9552, -- [1]
				},
				["Damage"] = {
					17175, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
					},
					["Messages"] = {
						"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) Seery Tick -101 (Nature)", -- [1]
						"Seery 多重射击 蓝染-黑龙费尔默 Absorb -850 (850 被吸收) (Physical)", -- [2]
						"Seery 多重射击 耍下-黑龙费尔默 Crit -1039 (Physical)", -- [3]
						"Seery 多重射击 狩望者-黑龙费尔默 Absorb -414 (414 被吸收) (Physical)", -- [4]
						"Seery 自动射击 狩望者-黑龙费尔默 Absorb -273 (273 被吸收) (Physical)", -- [5]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) Seery Tick -263 (Shadow)", -- [6]
						"蓝染-黑龙费尔默 心灵震爆 Seery Hit -853 (Shadow)", -- [7]
						"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) Seery Tick -240 (Shadow)", -- [8]
						"耍下-黑龙费尔默 心灵震爆 Seery Hit -811 (Shadow)", -- [9]
						"Seery死亡。", -- [10]
					},
					["DeathAt"] = 44137.588,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
					},
					["MessageTimes"] = {
						-6.450000000004366, -- [1]
						-3.082999999998719, -- [2]
						-3.05000000000291, -- [3]
						-2.966000000000349, -- [4]
						-2.80000000000291, -- [5]
						-1.616000000001804, -- [6]
						-0.09999999999854481, -- [7]
						-0.01600000000325963, -- [8]
						-0.01600000000325963, -- [9]
						0, -- [10]
					},
					["HealthMax"] = {
						3197, -- [1]
						3197, -- [2]
						3197, -- [3]
						3197, -- [4]
						3197, -- [5]
						3197, -- [6]
						3197, -- [7]
						3197, -- [8]
						3197, -- [9]
						3197, -- [10]
					},
					["Health"] = {
						1698, -- [1]
						1619, -- [2]
						1619, -- [3]
						1619, -- [4]
						1619, -- [5]
						1619, -- [6]
						1356, -- [7]
						1356, -- [8]
						1356, -- [9]
						0, -- [10]
					},
					["KilledBy"] = "耍下-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"MISC", -- [10]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
					},
					["Messages"] = {
						"红丶枫-逐风者 拦截昏迷 Seery Hit -43 (Physical)", -- [1]
						"红丶枫-逐风者 肉搏 Seery Hit -75 (Physical)", -- [2]
						"向天歌-黑龙费尔默 火焰冲击 Seery Crit -840 (Fire)", -- [3]
						"红丶枫-逐风者 肉搏 Seery Crit -143 (Physical)", -- [4]
						"红丶枫-逐风者 肉搏 Seery Crit -145 (Physical)", -- [5]
						"红丶枫-逐风者 肉搏 Seery Crit -142 (Physical)", -- [6]
						"向天歌-黑龙费尔默 冰锥术 Seery Crit -1081 (Frost)", -- [7]
						"红丶枫-逐风者 肉搏 Seery Crit -154 (Physical)", -- [8]
						"红丶枫-逐风者 肉搏 Seery Miss (1)", -- [9]
						"红丶枫-逐风者 肉搏 Seery Crit -125 (Physical)", -- [10]
						"红丶枫-逐风者 嗜血 Seery Hit -222 (Physical)", -- [11]
						"向天歌-黑龙费尔默 冰霜新星 Seery Hit -26 (Frost)", -- [12]
						"向天歌-黑龙费尔默 冰锥术 Seery Crit -1018 (Frost)", -- [13]
						"Seery死亡。", -- [14]
					},
					["DeathAt"] = 43746.582,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
					},
					["MessageTimes"] = {
						-7.218000000000757, -- [1]
						-6.134000000005472, -- [2]
						-6.084000000002561, -- [3]
						-5.984000000004016, -- [4]
						-4.817000000002736, -- [5]
						-4.467000000004191, -- [6]
						-3.617000000005646, -- [7]
						-3.533999999999651, -- [8]
						-2.951000000000931, -- [9]
						-2.251000000003842, -- [10]
						-2.201000000000931, -- [11]
						-1.533999999999651, -- [12]
						-0.01699999999982538, -- [13]
						0, -- [14]
					},
					["HealthMax"] = {
						3197, -- [1]
						3197, -- [2]
						3197, -- [3]
						3197, -- [4]
						3197, -- [5]
						3197, -- [6]
						3197, -- [7]
						3197, -- [8]
						3197, -- [9]
						3197, -- [10]
						3197, -- [11]
						3197, -- [12]
						3197, -- [13]
						3197, -- [14]
					},
					["Health"] = {
						3197, -- [1]
						3154, -- [2]
						3154, -- [3]
						2239, -- [4]
						2096, -- [5]
						1951, -- [6]
						1809, -- [7]
						1809, -- [8]
						574, -- [9]
						574, -- [10]
						449, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
					},
					["KilledBy"] = "向天歌-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"MISC", -- [14]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 13,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				3197, -- [1]
				3197, -- [2]
				3197, -- [3]
				3197, -- [4]
				3197, -- [5]
				3197, -- [6]
				3197, -- [7]
				3197, -- [8]
				3197, -- [9]
				3197, -- [10]
				3197, -- [11]
				3197, -- [12]
				3197, -- [13]
				3197, -- [14]
				3197, -- [15]
				3197, -- [16]
				3197, -- [17]
				3197, -- [18]
				3197, -- [19]
				3197, -- [20]
				3197, -- [21]
				3197, -- [22]
				3197, -- [23]
				3197, -- [24]
				3197, -- [25]
				3197, -- [26]
				3197, -- [27]
				3197, -- [28]
				3197, -- [29]
				3197, -- [30]
				3197, -- [31]
				3197, -- [32]
				3197, -- [33]
				3197, -- [34]
				3197, -- [35]
				3197, -- [36]
				3197, -- [37]
				3197, -- [38]
				3197, -- [39]
				3197, -- [40]
				3197, -- [41]
				3197, -- [42]
				3197, -- [43]
				3197, -- [44]
				3197, -- [45]
				3197, -- [46]
				3197, -- [47]
				3197, -- [48]
				3197, -- [49]
				3197, -- [50]
			},
			["LastDamageTaken"] = 227,
			["TimeLast"] = {
				["OVERALL"] = 44439.588,
				["DamageTaken"] = 44439.588,
				["DeathCount"] = 44135.588,
				["ActiveTime"] = 44437.588,
				["TimeDamage"] = 44437.588,
				["HealingTaken"] = 44279.596,
				["Healing"] = 43733.581,
				["DOT_Time"] = 44416.587,
				["Damage"] = 44437.588,
			},
			["Owner"] = false,
			["Pet"] = {
				"肥肥 <Seery>", -- [1]
			},
			["NextEventNum"] = 36,
			["LastDamageTime"] = 44438.322,
			["LastEvents"] = {
				"Seery 猎人印记 欧尛-火妖鲁西弗隆 Immune (Arcane)", -- [1]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189", -- [2]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189 (189 过量治疗)", -- [3]
				"Seery 多重射击 雷滴呱呱-黑龙费尔默 Hit -447 (Physical)", -- [4]
				"Seery 自动射击 雷滴呱呱-黑龙费尔默 Hit -392 (Physical)", -- [5]
				"Seery 自动射击 雷滴呱呱-黑龙费尔默 Immune (Physical)", -- [6]
				"Seery 自动射击 雷滴呱呱-黑龙费尔默 Immune (Physical)", -- [7]
				"Seery 瞄准射击 雷滴呱呱-黑龙费尔默 Immune (Physical)", -- [8]
				"Seery 自动射击 雷滴呱呱-黑龙费尔默 Immune (Physical)", -- [9]
				"丧尸暴龙-逐风者 肉搏 Seery Miss (1)", -- [10]
				"丧尸暴龙-逐风者 肉搏 Seery Hit -68 (Physical)", -- [11]
				"丧尸暴龙-逐风者 出血 Seery Hit -225 (Physical)", -- [12]
				"丧尸暴龙-逐风者 出血 Seery Hit -233 (Physical)", -- [13]
				"丧尸暴龙-逐风者 肉搏 Seery Crit -144 (Physical)", -- [14]
				"丧尸暴龙-逐风者 肉搏 Seery Hit -236 (Physical)", -- [15]
				"Seery 驱散射击 丧尸暴龙-逐风者 Hit -167 (Physical)", -- [16]
				"Seery 自动射击 耍下-黑龙费尔默 Hit -246 (Physical)", -- [17]
				"Seery 毒蛇钉刺 (伤害/跳) 丧尸暴龙-逐风者 Tick -100 (Nature)", -- [18]
				"Seery 毒蛇钉刺 (伤害/跳) 丧尸暴龙-逐风者 Tick -100 (Nature)", -- [19]
				"Seery 瞄准射击 耍下-黑龙费尔默 Hit -619 (Physical)", -- [20]
				"Seery 自动射击 耍下-黑龙费尔默 Hit -246 (Physical)", -- [21]
				"Seery 多重射击 耍下-黑龙费尔默 Hit -373 (Physical)", -- [22]
				"Seery 自动射击 耍下-黑龙费尔默 Hit -257 (Physical)", -- [23]
				"Seery 自动射击 耍下-黑龙费尔默 Hit -262 (Physical)", -- [24]
				"Seery 自动射击 耍下-黑龙费尔默 Hit -254 (Physical)", -- [25]
				"Seery 自动射击 耍下-黑龙费尔默 Hit -263 (Physical)", -- [26]
				"Seery 自动射击 耍下-黑龙费尔默 Crit -630 (Physical)", -- [27]
				"Seery 自动射击 耍下-黑龙费尔默 Crit -626 (Physical)", -- [28]
				"Seery 自动射击 蓝染-黑龙费尔默 Hit -396 (Physical)", -- [29]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) Seery Tick -226 (Shadow)", -- [30]
				"Seery 自动射击 蓝染-黑龙费尔默 Hit -437 (Physical)", -- [31]
				"Seery 自动射击 蓝染-黑龙费尔默 Hit -427 (Physical)", -- [32]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) Seery Tick -227 (Shadow)", -- [33]
				"Seery 自动射击 蓝染-黑龙费尔默 Crit -1034 (Physical)", -- [34]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) Seery Tick -227 (Shadow)", -- [35]
				"Seery 多重射击 炽天使-黑龙费尔默 Absorb -501 (501 被吸收) (Physical)", -- [36]
				"Seery 肉搏 欧尛-火妖鲁西弗隆 Absorb -505 (1)", -- [37]
				"Seery 多重射击 欧尛-火妖鲁西弗隆 Crit -618 (505 被吸收) (Physical)", -- [38]
				"Seery 肉搏 炽天使-黑龙费尔默 Absorb -349 (1)", -- [39]
				"Seery 驱散射击 炽天使-黑龙费尔默 Crit -46 (349 被吸收) (Physical)", -- [40]
				"Seery 自动射击 蓝染-黑龙费尔默 Absorb -350 (350 被吸收) (Physical)", -- [41]
				"Seery 多重射击 蓝染-黑龙费尔默 Absorb -480 (480 被吸收) (Physical)", -- [42]
				"Seery 自动射击 狩望者-黑龙费尔默 Crit -699 (Physical)", -- [43]
				"狩望者-黑龙费尔默 自动射击 Seery Crit -634 (Physical)", -- [44]
				"Seery 自动射击 狩望者-黑龙费尔默 Hit -295 (Physical)", -- [45]
				"Seery 驱散射击 炽天使-黑龙费尔默 Hit -186 (Physical)", -- [46]
				"Seery 自动射击 炽天使-黑龙费尔默 Hit -373 (Physical)", -- [47]
				"Seery 自动射击 欧尛-火妖鲁西弗隆 Absorb -357 (357 被吸收) (Physical)", -- [48]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189", -- [49]
				"阿蛮达-老马布兰契 回春术 Seery Tick +189", -- [50]
			},
			["Name"] = "Seery",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				44278.529, -- [1]
				44279.812, -- [2]
				44282.796, -- [3]
				44379.068, -- [4]
				44379.202, -- [5]
				44383.302, -- [6]
				44385.368, -- [7]
				44388.535, -- [8]
				44388.872, -- [9]
				44401.92, -- [10]
				44402.836, -- [11]
				44402.87, -- [12]
				44403.87, -- [13]
				44404.636, -- [14]
				44404.72, -- [15]
				44407.32, -- [16]
				44413.32, -- [17]
				44414.22, -- [18]
				44417.221, -- [19]
				44417.554, -- [20]
				44418.187, -- [21]
				44418.22, -- [22]
				44420.187, -- [23]
				44422.104, -- [24]
				44423.654, -- [25]
				44425.171, -- [26]
				44427.171, -- [27]
				44428.588, -- [28]
				44430.771, -- [29]
				44431.038, -- [30]
				44433.155, -- [31]
				44436.038, -- [32]
				44437.038, -- [33]
				44438.322, -- [34]
				44440.038, -- [35]
				44188.008, -- [36]
				44188.041, -- [37]
				44188.041, -- [38]
				44189.141, -- [39]
				44189.141, -- [40]
				44232.577, -- [41]
				44233.293, -- [42]
				44238.127, -- [43]
				44239.627, -- [44]
				44240.96, -- [45]
				44246.561, -- [46]
				44250.011, -- [47]
				44271.546, -- [48]
				44273.796, -- [49]
				44276.796, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["丧尸暴龙-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1586,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 458,
						["Melee"] = 448,
						["Shadow"] = 680,
					},
					["DOT_Time"] = 6,
					["Damage"] = 7276,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Nature"] = 200,
						["Physical"] = 7076,
					},
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 167,
								},
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 200,
								},
							},
							["amount"] = 367,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2294,
								},
							},
							["amount"] = 2294,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2784,
								},
								["瞄准射击"] = {
									["count"] = 619,
								},
								["多重射击"] = {
									["count"] = 373,
								},
							},
							["amount"] = 3776,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 447,
								},
								["自动射击"] = {
									["count"] = 392,
								},
							},
							["amount"] = 839,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 458,
								},
								["肉搏"] = {
									["count"] = 448,
								},
							},
							["amount"] = 906,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 680,
								},
							},
							["amount"] = 680,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.4,
								},
							},
							["amount"] = 3.9,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 11.05,
								},
								["瞄准射击"] = {
									["count"] = 0.33,
								},
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 11.41,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.47,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.47,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 27.78,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 100,
									["min"] = 100,
									["count"] = 2,
									["amount"] = 200,
								},
							},
							["count"] = 2,
							["amount"] = 200,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 167,
									["min"] = 167,
									["count"] = 1,
									["amount"] = 167,
								},
							},
							["count"] = 1,
							["amount"] = 167,
						},
						["自动射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1034,
									["min"] = 626,
									["count"] = 3,
									["amount"] = 2290,
								},
								["Hit"] = {
									["max"] = 437,
									["min"] = 246,
									["count"] = 10,
									["amount"] = 3180,
								},
							},
							["count"] = 16,
							["amount"] = 5470,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 619,
									["min"] = 619,
									["count"] = 1,
									["amount"] = 619,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 619,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 447,
									["min"] = 373,
									["count"] = 2,
									["amount"] = 820,
								},
							},
							["count"] = 2,
							["amount"] = 820,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 27.78,
					["TimeDamaging"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.4,
								},
							},
							["amount"] = 3.9,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 11.05,
								},
								["瞄准射击"] = {
									["count"] = 0.33,
								},
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 11.41,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.47,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.47,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["丧尸暴龙-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.4,
								},
							},
							["amount"] = 3.9,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3,
								},
								["猎人印记"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 4.53,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.35,
								},
								["自动射击"] = {
									["count"] = 5.99,
								},
							},
							["amount"] = 7.34,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.47,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.47,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 1.1,
								},
							},
							["amount"] = 4.38,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 11.05,
								},
								["多重射击"] = {
									["count"] = 0.06,
								},
								["瞄准射击"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 11.44,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 2.22,
								},
								["自动射击"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 9.719999999999999,
						},
						["鬼武者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 0.55,
						},
					},
					["DamageTaken"] = 9552,
					["ElementDoneAbsorb"] = {
						["Physical"] = 4421,
					},
					["PartialResist"] = {
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 48.33000000000001,
					["ElementTaken"] = {
						["Physical"] = 2150,
						["Melee"] = 1232,
						["Arcane"] = 257,
						["Shadow"] = 2847,
						["Fire"] = 840,
						["Frost"] = 2125,
						["Nature"] = 101,
					},
					["DOT_Time"] = 6,
					["Damage"] = 17175,
					["Healing"] = 0,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoHealed"] = {
						["阿蛮达-老马布兰契"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
					},
					["ElementDone"] = {
						["Physical"] = 16121,
						["Melee"] = 854,
						["Nature"] = 200,
					},
					["HealingTaken"] = 567,
					["DamagedWho"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 167,
								},
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 200,
								},
							},
							["amount"] = 367,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 699,
								},
								["多重射击"] = {
									["count"] = 618,
								},
								["肉搏"] = {
									["count"] = 505,
								},
							},
							["amount"] = 1822,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 858,
								},
								["自动射击"] = {
									["count"] = 1904,
								},
							},
							["amount"] = 2762,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 447,
								},
								["自动射击"] = {
									["count"] = 392,
								},
							},
							["amount"] = 839,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 232,
								},
								["自动射击"] = {
									["count"] = 373,
								},
								["多重射击"] = {
									["count"] = 501,
								},
								["肉搏"] = {
									["count"] = 349,
								},
							},
							["amount"] = 1455,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2784,
								},
								["多重射击"] = {
									["count"] = 1412,
								},
								["瞄准射击"] = {
									["count"] = 619,
								},
							},
							["amount"] = 4815,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1330,
								},
								["自动射击"] = {
									["count"] = 2644,
								},
							},
							["amount"] = 3974,
						},
						["鬼武者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1141,
								},
							},
							["amount"] = 1141,
						},
					},
					["TimeDamage"] = 48.33000000000001,
					["TimeDamaging"] = {
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.4,
								},
							},
							["amount"] = 3.9,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3,
								},
								["猎人印记"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 4.53,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.35,
								},
								["自动射击"] = {
									["count"] = 5.99,
								},
							},
							["amount"] = 7.34,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.47,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.47,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 1.1,
								},
							},
							["amount"] = 4.38,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 11.05,
								},
								["多重射击"] = {
									["count"] = 0.06,
								},
								["瞄准射击"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 11.44,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 2.22,
								},
								["自动射击"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 9.719999999999999,
						},
						["鬼武者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 0.55,
						},
					},
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 100,
									["min"] = 100,
									["count"] = 2,
									["amount"] = 200,
								},
							},
							["count"] = 2,
							["amount"] = 200,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 619,
									["min"] = 619,
									["count"] = 1,
									["amount"] = 619,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 619,
						},
						["猎人印记"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 46,
									["min"] = 46,
									["count"] = 1,
									["amount"] = 46,
								},
								["Hit"] = {
									["max"] = 186,
									["min"] = 167,
									["count"] = 2,
									["amount"] = 353,
								},
							},
							["count"] = 3,
							["amount"] = 399,
						},
						["自动射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 357,
									["min"] = 273,
									["count"] = 4,
									["amount"] = 1322,
								},
								["Crit"] = {
									["max"] = 1034,
									["min"] = 626,
									["count"] = 4,
									["amount"] = 2989,
								},
								["Hit"] = {
									["max"] = 437,
									["min"] = 246,
									["count"] = 14,
									["amount"] = 4485,
								},
							},
							["count"] = 25,
							["amount"] = 8796,
						},
						["多重射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 850,
									["min"] = 414,
									["count"] = 4,
									["amount"] = 2245,
								},
								["Crit"] = {
									["max"] = 1039,
									["min"] = 618,
									["count"] = 3,
									["amount"] = 2443,
								},
								["Hit"] = {
									["max"] = 447,
									["min"] = 355,
									["count"] = 4,
									["amount"] = 1619,
								},
							},
							["count"] = 11,
							["amount"] = 6307,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 505,
									["min"] = 349,
									["count"] = 2,
									["amount"] = 854,
								},
							},
							["count"] = 2,
							["amount"] = 854,
						},
					},
					["WhoDamaged"] = {
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["奥术射击"] = {
									["count"] = 257,
								},
								["多重射击"] = {
									["count"] = 478,
								},
								["自动射击"] = {
									["count"] = 949,
								},
							},
							["amount"] = 1785,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 43,
								},
								["嗜血"] = {
									["count"] = 222,
								},
								["肉搏"] = {
									["count"] = 784,
								},
							},
							["amount"] = 1049,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 458,
								},
								["肉搏"] = {
									["count"] = 448,
								},
							},
							["amount"] = 906,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 920,
								},
								["心灵震爆"] = {
									["count"] = 811,
								},
							},
							["amount"] = 1731,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 263,
								},
								["心灵震爆"] = {
									["count"] = 853,
								},
							},
							["amount"] = 1116,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 26,
								},
								["冰锥术"] = {
									["count"] = 2099,
								},
								["火焰冲击"] = {
									["count"] = 840,
								},
							},
							["amount"] = 2965,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 21,
								},
							},
							["amount"] = 41,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 43737.581,
			["LastActive"] = 44439.588,
		},
		["肥肥 <Seery>"] = {
			["GUID"] = "Pet-0-5427-529-22399-10741-0501263CEE",
			["LastEventHealth"] = {
				1820, -- [1]
				1820, -- [2]
				1820, -- [3]
				1820, -- [4]
				1820, -- [5]
				1820, -- [6]
				1310, -- [7]
				1283, -- [8]
				2991, -- [9]
				2991, -- [10]
				2991, -- [11]
				2991, -- [12]
				2991, -- [13]
				2964, -- [14]
				2964, -- [15]
				2991, -- [16]
				2991, -- [17]
				2991, -- [18]
				2991, -- [19]
				2991, -- [20]
				2991, -- [21]
				2991, -- [22]
				2588, -- [23]
			},
			["LastAttackedBy"] = "欧尛-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					17.52, -- [1]
				},
				["Damage"] = {
					1570, -- [1]
				},
				["DamageTaken"] = {
					967, -- [1]
				},
				["ActiveTime"] = {
					17.52, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "肥肥",
			["level"] = 1,
			["LastDamageAbility"] = "冰锥术",
			["LastFightIn"] = 13,
			["type"] = "Pet",
			["ownerName"] = "Seery",
			["LastDamageTaken"] = 403,
			["TimeLast"] = {
				["ActiveTime"] = 44388.586,
				["TimeDamage"] = 44388.586,
				["OVERALL"] = 44415.587,
				["DamageTaken"] = 44415.587,
				["Damage"] = 44388.586,
			},
			["LastEventHealthMax"] = {
				2991, -- [1]
				2991, -- [2]
				2991, -- [3]
				2991, -- [4]
				2991, -- [5]
				2991, -- [6]
				2991, -- [7]
				2991, -- [8]
				2991, -- [9]
				2991, -- [10]
				2991, -- [11]
				2991, -- [12]
				2991, -- [13]
				2991, -- [14]
				2991, -- [15]
				2991, -- [16]
				2991, -- [17]
				2991, -- [18]
				2991, -- [19]
				2991, -- [20]
				2991, -- [21]
				2991, -- [22]
				2991, -- [23]
			},
			["NextEventNum"] = 24,
			["LastDamageTime"] = 44389.452,
			["LastEvents"] = {
				"肥肥 <Seery> 肉搏 红丶枫-逐风者 Hit -119 (Physical)", -- [1]
				"肥肥 <Seery> 撕咬 红丶枫-逐风者 Hit -83 (Physical)", -- [2]
				"肥肥 <Seery> 肉搏 红丶枫-逐风者 Hit -115 (Physical)", -- [3]
				"肥肥 <Seery> 肉搏 红丶枫-逐风者 Hit -120 (Physical)", -- [4]
				"肥肥 <Seery> 肉搏 红丶枫-逐风者 Hit -126 (Physical)", -- [5]
				"向天歌-黑龙费尔默 冰锥术 肥肥 <Seery> Hit -510 (Frost)", -- [6]
				"向天歌-黑龙费尔默 冰霜新星 肥肥 <Seery> Hit -27 (Frost)", -- [7]
				"向天歌-黑龙费尔默 冰锥术 肥肥 <Seery> Resist (Frost)", -- [8]
				"肥肥 <Seery> 肉搏 欧尛-火妖鲁西弗隆 Hit -100 (Physical)", -- [9]
				"欧尛-火妖鲁西弗隆 冰冻 肥肥 <Seery> Resist (Frost)", -- [10]
				"肥肥 <Seery> 撕咬 欧尛-火妖鲁西弗隆 Hit -89 (Physical)", -- [11]
				"肥肥 <Seery> 肉搏 欧尛-火妖鲁西弗隆 Miss (1)", -- [12]
				"欧尛-火妖鲁西弗隆 冰霜新星 肥肥 <Seery> Hit -27 (Frost)", -- [13]
				"肥肥 <Seery> 肉搏 欧尛-火妖鲁西弗隆 Hit -85 (Physical)", -- [14]
				"肥肥 <Seery> 撕咬 欧尛-火妖鲁西弗隆 Hit -105 (Physical)", -- [15]
				"肥肥 <Seery> 肉搏 狩望者-黑龙费尔默 Hit -83 (Physical)", -- [16]
				"肥肥 <Seery> 肉搏 雷滴呱呱-黑龙费尔默 Hit -121 (Physical)", -- [17]
				"肥肥 <Seery> 撕咬 雷滴呱呱-黑龙费尔默 Hit -107 (Physical)", -- [18]
				"肥肥 <Seery> 肉搏 雷滴呱呱-黑龙费尔默 Hit -109 (Physical)", -- [19]
				"肥肥 <Seery> 肉搏 雷滴呱呱-黑龙费尔默 Hit -108 (Physical)", -- [20]
				"肥肥 <Seery> 撕咬 雷滴呱呱-黑龙费尔默 Hit -100 (Physical)", -- [21]
				"欧尛-火妖鲁西弗隆 冰锥术 肥肥 <Seery> Hit -403 (Frost)", -- [22]
				"欧尛-火妖鲁西弗隆 深冬之寒 肥肥 <Seery> Resist (Frost)", -- [23]
			},
			["Name"] = "肥肥",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
			},
			["LastEventTimes"] = {
				43734.148, -- [1]
				43734.465, -- [2]
				43736.148, -- [3]
				43738.165, -- [4]
				43740.181, -- [5]
				43741.882, -- [6]
				43743.965, -- [7]
				43745.467, -- [8]
				44170.79, -- [9]
				44170.79, -- [10]
				44170.79, -- [11]
				44173.29, -- [12]
				44174.423, -- [13]
				44198.041, -- [14]
				44198.358, -- [15]
				44242.894, -- [16]
				44376.468, -- [17]
				44378.085, -- [18]
				44378.468, -- [19]
				44389.452, -- [20]
				44389.452, -- [21]
				44415.72, -- [22]
				44415.737, -- [23]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 403,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 403,
					},
					["DOT_Time"] = 0,
					["Damage"] = 545,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 338,
						["Physical"] = 207,
					},
					["PartialAbsorb"] = {
						["深冬之寒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 207,
								},
								["肉搏"] = {
									["count"] = 338,
								},
							},
							["amount"] = 545,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 403,
								},
							},
							["amount"] = 403,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["深冬之寒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.38,
								},
							},
							["amount"] = 4.88,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 4.88,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 107,
									["min"] = 100,
									["count"] = 2,
									["amount"] = 207,
								},
							},
							["count"] = 2,
							["amount"] = 207,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 121,
									["min"] = 108,
									["count"] = 3,
									["amount"] = 338,
								},
							},
							["count"] = 3,
							["amount"] = 338,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 4.88,
					["TimeDamaging"] = {
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.38,
								},
							},
							["amount"] = 4.88,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["深冬之寒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["深冬之寒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 107,
									["min"] = 83,
									["count"] = 5,
									["amount"] = 484,
								},
							},
							["count"] = 5,
							["amount"] = 484,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 126,
									["min"] = 83,
									["count"] = 10,
									["amount"] = 1086,
								},
							},
							["count"] = 11,
							["amount"] = 1086,
						},
					},
					["TimeSpent"] = {
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.38,
								},
							},
							["amount"] = 4.88,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.82,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6.32,
						},
					},
					["DamageTaken"] = 967,
					["WhoDamaged"] = {
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 27,
								},
								["冰锥术"] = {
									["count"] = 510,
								},
							},
							["amount"] = 537,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 403,
								},
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 430,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1086,
						["Physical"] = 484,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 11,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["DamagedWho"] = {
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 207,
								},
								["肉搏"] = {
									["count"] = 338,
								},
							},
							["amount"] = 545,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 194,
								},
								["肉搏"] = {
									["count"] = 185,
								},
							},
							["amount"] = 379,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 83,
								},
							},
							["amount"] = 83,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 83,
								},
								["肉搏"] = {
									["count"] = 480,
								},
							},
							["amount"] = 563,
						},
					},
					["TimeDamage"] = 17.52,
					["TimeDamaging"] = {
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.38,
								},
							},
							["amount"] = 4.88,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.82,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6.32,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 967,
					},
					["ActiveTime"] = 17.52,
					["Damage"] = 1570,
				},
			},
			["UnitLockout"] = 43733.581,
			["LastActive"] = 44415.587,
		},
		["滨崎歩"] = {
			["GUID"] = "Player-5458-02F23AFF",
			["LastEventHealth"] = {
				2447, -- [1]
				2447, -- [2]
				1, -- [3]
				1, -- [4]
				1, -- [5]
				1, -- [6]
				1, -- [7]
				1, -- [8]
				1, -- [9]
				1, -- [10]
				1, -- [11]
				1, -- [12]
				3999, -- [13]
				3999, -- [14]
				3999, -- [15]
				3440, -- [16]
				3440, -- [17]
				3440, -- [18]
				3440, -- [19]
				3440, -- [20]
				3874, -- [21]
				3874, -- [22]
				3874, -- [23]
				3874, -- [24]
				3874, -- [25]
				3874, -- [26]
				3874, -- [27]
				3874, -- [28]
				3874, -- [29]
				3874, -- [30]
				3874, -- [31]
				3874, -- [32]
				3874, -- [33]
				1, -- [34]
				1, -- [35]
				1, -- [36]
				1, -- [37]
				1, -- [38]
				1, -- [39]
				1, -- [40]
				1, -- [41]
				3999, -- [42]
				3999, -- [43]
				3999, -- [44]
				3913, -- [45]
				3364, -- [46]
				2762, -- [47]
				2762, -- [48]
				2762, -- [49]
				2762, -- [50]
			},
			["LastAttackedBy"] = "耍下-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Healing"] = {
					92, -- [1]
				},
				["DamageTaken"] = {
					3026, -- [1]
				},
				["HealingTaken"] = {
					92, -- [1]
				},
				["ActiveTime"] = {
					59.27, -- [1]
				},
				["TimeDamage"] = {
					57.77, -- [1]
				},
				["RageGain"] = {
					128, -- [1]
				},
				["DOT_Time"] = {
					105, -- [1]
				},
				["Damage"] = {
					5395, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "精神鞭笞 (伤害/跳)",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastDamageTaken"] = 222,
			["LastHealTime"] = 43734.498,
			["TimeLast"] = {
				["TimeHeal"] = 43733.581,
				["OVERALL"] = 44298.597,
				["DamageTaken"] = 44287.596,
				["RageGain"] = 44298.597,
				["ActiveTime"] = 44292.597,
				["TimeDamage"] = 44292.597,
				["HealingTaken"] = 43733.581,
				["Healing"] = 43733.581,
				["DOT_Time"] = 44290.597,
				["Damage"] = 44292.597,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3999, -- [1]
				3999, -- [2]
				3999, -- [3]
				3999, -- [4]
				3999, -- [5]
				3999, -- [6]
				3999, -- [7]
				3999, -- [8]
				3999, -- [9]
				3999, -- [10]
				3999, -- [11]
				3999, -- [12]
				3999, -- [13]
				3999, -- [14]
				3999, -- [15]
				3999, -- [16]
				3999, -- [17]
				3999, -- [18]
				3999, -- [19]
				3999, -- [20]
				3999, -- [21]
				3999, -- [22]
				3999, -- [23]
				3999, -- [24]
				3999, -- [25]
				3999, -- [26]
				3999, -- [27]
				3999, -- [28]
				3999, -- [29]
				3999, -- [30]
				3999, -- [31]
				3999, -- [32]
				3999, -- [33]
				3999, -- [34]
				3999, -- [35]
				3999, -- [36]
				3999, -- [37]
				3999, -- [38]
				3999, -- [39]
				3999, -- [40]
				3999, -- [41]
				3999, -- [42]
				3999, -- [43]
				3999, -- [44]
				3999, -- [45]
				3999, -- [46]
				3999, -- [47]
				3999, -- [48]
				3999, -- [49]
				3999, -- [50]
			},
			["NextEventNum"] = 21,
			["LastDamageTime"] = 44292.647,
			["LastEvents"] = {
				"滨崎歩 肉搏 炽天使-黑龙费尔默 Absorb -303 (303 被吸收) (1)", -- [1]
				"滨崎歩 撕裂 (伤害/跳) 炽天使-黑龙费尔默 Absorb -28 (28 被吸收) (Physical)", -- [2]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Absorb -24 (24 被吸收) (Physical)", -- [3]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Absorb -47 (47 被吸收) (Physical)", -- [4]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Absorb -24 (24 被吸收) (Physical)", -- [5]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Absorb -47 (47 被吸收) (Physical)", -- [6]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Absorb -24 (24 被吸收) (Physical)", -- [7]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Absorb -47 (47 被吸收) (Physical)", -- [8]
				"滨崎歩 肉搏 蓝染-黑龙费尔默 Absorb -16 (1)", -- [9]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -8 (16 被吸收) (Physical)", -- [10]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -47 (Physical)", -- [11]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -25 (Physical)", -- [12]
				"滨崎歩 肉搏 耍下-黑龙费尔默 Absorb -192 (192 被吸收) (1)", -- [13]
				"滨崎歩 撕裂 (伤害/跳) 耍下-黑龙费尔默 Absorb -24 (24 被吸收) (Physical)", -- [14]
				"耍下-黑龙费尔默 精神鞭笞 (伤害/跳) 滨崎歩 Tick -222 (Shadow)", -- [15]
				"滨崎歩 肉搏 耍下-黑龙费尔默 Absorb -30 (1)", -- [16]
				"滨崎歩 拳击 耍下-黑龙费尔默 Crit -28 (30 被吸收) (Physical)", -- [17]
				"滨崎歩 肉搏 耍下-黑龙费尔默 Hit -191 (Physical)", -- [18]
				"滨崎歩 撕裂 (伤害/跳) 耍下-黑龙费尔默 Tick -25 (Physical)", -- [19]
				"滨崎歩 斩杀 耍下-黑龙费尔默 Hit -403 (Physical)", -- [20]
				"滨崎歩 重伤 (伤害/跳) 狩望者-黑龙费尔默 Tick -53 (Physical)", -- [21]
				"滨崎歩 肉搏 蓝染-黑龙费尔默 Hit -222 (Physical)", -- [22]
				"滨崎歩 撕裂 (伤害/跳) 狩望者-黑龙费尔默 Tick -28 (Physical)", -- [23]
				"滨崎歩 重伤 (伤害/跳) 狩望者-黑龙费尔默 Tick -52 (Physical)", -- [24]
				"滨崎歩 断筋 蓝染-黑龙费尔默 Crit -58 (Physical)", -- [25]
				"滨崎歩 撕裂 (伤害/跳) 狩望者-黑龙费尔默 Tick -28 (Physical)", -- [26]
				"滨崎歩 重伤 (伤害/跳) 狩望者-黑龙费尔默 Tick -53 (Physical)", -- [27]
				"滨崎歩 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -44 (Physical)", -- [28]
				"滨崎歩 肉搏 狩望者-黑龙费尔默 Miss (1)", -- [29]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -24 (Physical)", -- [30]
				"滨崎歩 撕裂 (伤害/跳) 狩望者-黑龙费尔默 Tick -29 (Physical)", -- [31]
				"滨崎歩 重伤 (伤害/跳) 狩望者-黑龙费尔默 Tick -53 (Physical)", -- [32]
				"滨崎歩 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -45 (Physical)", -- [33]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -45 (Physical)", -- [34]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -45 (Physical)", -- [35]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -46 (Physical)", -- [36]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -46 (Physical)", -- [37]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -45 (Physical)", -- [38]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -46 (Physical)", -- [39]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -45 (Physical)", -- [40]
				"滨崎歩 撕裂 (伤害/跳) 蓝染-黑龙费尔默 Tick -46 (Physical)", -- [41]
				"滨崎歩 肉搏 炽天使-黑龙费尔默 Hit -270 (Physical)", -- [42]
				"滨崎歩 断筋 炽天使-黑龙费尔默 Hit -37 (Physical)", -- [43]
				"炽天使-黑龙费尔默 冰霜新星 滨崎歩 Hit -86 (Frost)", -- [44]
				"炽天使-黑龙费尔默 冰锥术 滨崎歩 Hit -549 (Frost)", -- [45]
				"炽天使-黑龙费尔默 火焰冲击 滨崎歩 Hit -602 (Fire)", -- [46]
				"滨崎歩 撕裂 (伤害/跳) 炽天使-黑龙费尔默 Tick -28 (Physical)", -- [47]
				"滨崎歩 撕裂 (伤害/跳) 炽天使-黑龙费尔默 Absorb -29 (29 被吸收) (Physical)", -- [48]
				"炽天使-黑龙费尔默 魔爆术 滨崎歩 Hit -315 (Arcane)", -- [49]
				"滨崎歩 拦截昏迷 炽天使-黑龙费尔默 Absorb -52 (52 被吸收) (Physical)", -- [50]
			},
			["Name"] = "滨崎歩",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				44208.059, -- [1]
				44208.775, -- [2]
				44230.01, -- [3]
				44232.71, -- [4]
				44232.993, -- [5]
				44235.727, -- [6]
				44235.993, -- [7]
				44238.71, -- [8]
				44238.994, -- [9]
				44238.994, -- [10]
				44241.71, -- [11]
				44242.01, -- [12]
				44286.546, -- [13]
				44288.13, -- [14]
				44288.596, -- [15]
				44289.796, -- [16]
				44289.796, -- [17]
				44290.147, -- [18]
				44291.13, -- [19]
				44292.647, -- [20]
				44139.688, -- [21]
				44142.188, -- [22]
				44142.555, -- [23]
				44142.688, -- [24]
				44142.729, -- [25]
				44145.555, -- [26]
				44145.688, -- [27]
				44145.738, -- [28]
				44146.805, -- [29]
				44147.338, -- [30]
				44148.55800000001, -- [31]
				44148.688, -- [32]
				44148.755, -- [33]
				44166.44, -- [34]
				44169.44, -- [35]
				44172.44, -- [36]
				44175.44, -- [37]
				44178.44, -- [38]
				44181.44, -- [39]
				44184.457, -- [40]
				44187.441, -- [41]
				44198.158, -- [42]
				44198.258, -- [43]
				44198.525, -- [44]
				44200.025, -- [45]
				44201.525, -- [46]
				44202.758, -- [47]
				44205.775, -- [48]
				44207.325, -- [49]
				44207.458, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["滨崎歩"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["狩望者-黑龙费尔默"] = {
									["count"] = 12,
								},
								["蓝染-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 18,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["狩望者-黑龙费尔默"] = {
									["count"] = 12,
								},
								["红丶枫-逐风者"] = {
									["count"] = 6,
								},
								["炽天使-黑龙费尔默"] = {
									["count"] = 9,
								},
								["蓝染-黑龙费尔默"] = {
									["count"] = 54,
								},
								["耍下-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 87,
						},
					},
					["TimeSpent"] = {
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.52,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 4.59,
								},
								["肉搏"] = {
									["count"] = 2.57,
								},
							},
							["amount"] = 7.68,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 2.48,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.35,
								},
							},
							["amount"] = 7.33,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.82,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 3.62,
								},
							},
							["amount"] = 7.020000000000001,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 3.72,
								},
								["肉搏"] = {
									["count"] = 2.1,
								},
							},
							["amount"] = 7.419999999999999,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["惩戒痛击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 20.88,
								},
								["断筋"] = {
									["count"] = 0.04,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 1.78,
								},
							},
							["amount"] = 22.82,
						},
						["滨崎歩"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["HealedWho"] = {
						["滨崎歩"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 92,
								},
							},
							["amount"] = 92,
						},
					},
					["RageGainedFrom"] = {
						["滨崎歩"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 40,
								},
								["怒不可遏"] = {
									["count"] = 4,
								},
								["冲锋"] = {
									["count"] = 84,
								},
							},
							["amount"] = 128,
						},
					},
					["PartialResist"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 59.27,
					["ElementDoneAbsorb"] = {
						["Melee"] = 885,
						["Physical"] = 392,
					},
					["ElementTaken"] = {
						["Physical"] = 125,
						["Arcane"] = 917,
						["Fire"] = 602,
						["Shadow"] = 222,
						["Frost"] = 1160,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["滨崎歩"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
						["怒不可遏"] = {
							["Details"] = {
								["滨崎歩"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["冲锋"] = {
							["Details"] = {
								["滨崎歩"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
					},
					["Damage"] = 5395,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeHeal"] = 1.5,
					["WhoDamaged"] = {
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 315,
								},
								["火焰冲击"] = {
									["count"] = 602,
								},
								["冰锥术"] = {
									["count"] = 549,
								},
								["冰霜新星"] = {
									["count"] = 86,
								},
							},
							["amount"] = 1552,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 222,
								},
							},
							["amount"] = 222,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 125,
								},
							},
							["amount"] = 125,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 602,
								},
								["冰锥术"] = {
									["count"] = 525,
								},
							},
							["amount"] = 1127,
						},
					},
					["DamageTaken"] = 3026,
					["DOT_Time"] = 105,
					["Healing"] = 92,
					["HealingTaken"] = 92,
					["WhoHealed"] = {
						["滨崎歩"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 92,
								},
							},
							["amount"] = 92,
						},
					},
					["Attacks"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 47,
									["min"] = 24,
									["count"] = 9,
									["amount"] = 294,
								},
								["Tick"] = {
									["max"] = 47,
									["min"] = 8,
									["count"] = 20,
									["amount"] = 696,
								},
							},
							["count"] = 29,
							["amount"] = 990,
						},
						["拳击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 52,
									["min"] = 52,
									["count"] = 1,
									["amount"] = 52,
								},
								["Hit"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 2,
							["amount"] = 96,
						},
						["惩戒痛击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 80,
									["min"] = 80,
									["count"] = 1,
									["amount"] = 80,
								},
							},
							["count"] = 1,
							["amount"] = 80,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 53,
									["min"] = 44,
									["count"] = 6,
									["amount"] = 300,
								},
							},
							["count"] = 6,
							["amount"] = 300,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 58,
									["min"] = 58,
									["count"] = 1,
									["amount"] = 58,
								},
								["Hit"] = {
									["max"] = 37,
									["min"] = 31,
									["count"] = 2,
									["amount"] = 68,
								},
							},
							["count"] = 3,
							["amount"] = 126,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 403,
									["min"] = 403,
									["count"] = 1,
									["amount"] = 403,
								},
							},
							["count"] = 1,
							["amount"] = 403,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 429,
									["min"] = 191,
									["count"] = 8,
									["amount"] = 2374,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 67,
									["min"] = 67,
									["count"] = 1,
									["amount"] = 67,
								},
								["Absorb"] = {
									["max"] = 390,
									["min"] = 16,
									["count"] = 5,
									["amount"] = 931,
								},
							},
							["count"] = 16,
							["amount"] = 3372,
						},
					},
					["RageGain"] = 128,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 8,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 16,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Absorb"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 26,
								},
							},
							["amount"] = 44,
						},
					},
					["TimeDamage"] = 57.77,
					["TimeDamaging"] = {
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 2.48,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.35,
								},
							},
							["amount"] = 7.33,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 3.72,
								},
								["肉搏"] = {
									["count"] = 2.1,
								},
							},
							["amount"] = 7.419999999999999,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.82,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 3.62,
								},
							},
							["amount"] = 7.020000000000001,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.52,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 4.59,
								},
								["肉搏"] = {
									["count"] = 2.57,
								},
							},
							["amount"] = 7.68,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 20.88,
								},
								["断筋"] = {
									["count"] = 0.04,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 1.78,
								},
							},
							["amount"] = 22.82,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["惩戒痛击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
					},
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
							},
							["count"] = 1,
							["amount"] = 92,
						},
					},
					["DamagedWho"] = {
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 49,
								},
								["拳击"] = {
									["count"] = 28,
								},
								["斩杀"] = {
									["count"] = 403,
								},
								["肉搏"] = {
									["count"] = 413,
								},
							},
							["amount"] = 893,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 211,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 113,
								},
								["肉搏"] = {
									["count"] = 457,
								},
							},
							["amount"] = 781,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 62,
								},
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["断筋"] = {
									["count"] = 31,
								},
								["肉搏"] = {
									["count"] = 977,
								},
							},
							["amount"] = 1114,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 285,
								},
							},
							["amount"] = 285,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 52,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 85,
								},
								["肉搏"] = {
									["count"] = 573,
								},
							},
							["amount"] = 747,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 681,
								},
								["断筋"] = {
									["count"] = 58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 89,
								},
								["肉搏"] = {
									["count"] = 238,
								},
							},
							["amount"] = 1066,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["惩戒痛击"] = {
									["count"] = 80,
								},
								["肉搏"] = {
									["count"] = 429,
								},
							},
							["amount"] = 509,
						},
					},
					["ElementDone"] = {
						["Melee"] = 3372,
						["Physical"] = 2023,
					},
				},
			},
			["UnitLockout"] = 43725.581,
			["LastActive"] = 44298.597,
		},
		["明定国是诏"] = {
			["GUID"] = "Player-5458-02F679B7",
			["TimeLast"] = {
				["TimeHeal"] = 43753.582,
				["Overhealing"] = 43565.588,
				["DeathCount"] = 43213.582,
				["OVERALL"] = 43918.592,
				["DamageTaken"] = 43918.592,
				["HealingTaken"] = 43753.582,
				["Healing"] = 43753.582,
				["RageGain"] = 43916.592,
				["HOT_Time"] = 43565.588,
				["Interrupts"] = 43027.588,
				["TimeDamage"] = 43916.592,
				["ActiveTime"] = 43916.592,
				["DOT_Time"] = 43725.581,
				["Damage"] = 43916.592,
			},
			["LastAttackedBy"] = "炽天使-黑龙费尔默",
			["LastEventType"] = {
				"MISC", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"HEAL", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"HEAL", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					9, -- [1]
				},
				["Overhealing"] = {
					58, -- [1]
				},
				["Healing"] = {
					172, -- [1]
				},
				["DamageTaken"] = {
					9679, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["HealingTaken"] = {
					172, -- [1]
				},
				["RageGain"] = {
					255, -- [1]
				},
				["HOT_Time"] = {
					15, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					72.34, -- [1]
				},
				["TimeDamage"] = {
					63.34000000000001, -- [1]
				},
				["DOT_Time"] = {
					36, -- [1]
				},
				["Damage"] = {
					8992, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
					},
					["Messages"] = {
						"明定国是诏 拦截昏迷 熊汏-黑龙费尔默 Hit -20 (Physical)", -- [1]
						"明定国是诏 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -51 (Physical)", -- [2]
						"明定国是诏 肉搏 熊汏-黑龙费尔默 Hit -273 (Physical)", -- [3]
						"明定国是诏 嗜血 明定国是诏 Hit +20", -- [4]
						"熊汏-黑龙费尔默 荆棘术 明定国是诏 Hit -20 (Nature)", -- [5]
						"熊汏-黑龙费尔默 月火术 (伤害/跳) 明定国是诏 Tick -160 (Arcane)", -- [6]
						"明定国是诏 刺耳怒吼 熊汏-黑龙费尔默 Resist (Physical)", -- [7]
						"明定国是诏 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -51 (Physical)", -- [8]
						"熊汏-黑龙费尔默 月火术 明定国是诏 Hit -305 (Arcane)", -- [9]
						"明定国是诏 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -51 (Physical)", -- [10]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 明定国是诏 Tick -281 (Shadow)", -- [11]
						"明定国是诏 肉搏 熊汏-黑龙费尔默 Hit -262 (Physical)", -- [12]
						"熊汏-黑龙费尔默 荆棘术 明定国是诏 Hit -20 (Nature)", -- [13]
						"熊汏-黑龙费尔默 月火术 (伤害/跳) 明定国是诏 Tick -159 (Arcane)", -- [14]
						"蓝染-黑龙费尔默 心灵震爆 明定国是诏 Hit -912 (Shadow)", -- [15]
						"明定国是诏 重伤 (伤害/跳) 熊汏-黑龙费尔默 Tick -50 (Physical)", -- [16]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 明定国是诏 Tick -289 (Shadow)", -- [17]
						"熊汏-黑龙费尔默 月火术 (伤害/跳) 明定国是诏 Tick -159 (Arcane)", -- [18]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 明定国是诏 Tick -298 (Shadow)", -- [19]
						"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 明定国是诏 Tick -289 (Shadow)", -- [20]
						"明定国是诏死亡。", -- [21]
					},
					["DeathAt"] = 43215.582,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
					},
					["MessageTimes"] = {
						-13.26699999999983, -- [1]
						-12.98399999999674, -- [2]
						-11.40000000000146, -- [3]
						-11.40000000000146, -- [4]
						-11.40000000000146, -- [5]
						-11.1339999999982, -- [6]
						-10.96699999999692, -- [7]
						-9.966999999996915, -- [8]
						-8.599999999998545, -- [9]
						-6.966999999996915, -- [10]
						-6.216999999996915, -- [11]
						-5.849999999998545, -- [12]
						-5.832999999998719, -- [13]
						-5.63300000000163, -- [14]
						-4.650000000001455, -- [15]
						-3.983000000000175, -- [16]
						-3.233000000000175, -- [17]
						-2.63300000000163, -- [18]
						-0.2330000000001746, -- [19]
						-0.01599999999598367, -- [20]
						0, -- [21]
					},
					["HealthMax"] = {
						3819, -- [1]
						3819, -- [2]
						3819, -- [3]
						3819, -- [4]
						3819, -- [5]
						3819, -- [6]
						3819, -- [7]
						3819, -- [8]
						3819, -- [9]
						3819, -- [10]
						3819, -- [11]
						3819, -- [12]
						3819, -- [13]
						3819, -- [14]
						3819, -- [15]
						3819, -- [16]
						3819, -- [17]
						3819, -- [18]
						3819, -- [19]
						3819, -- [20]
						3819, -- [21]
					},
					["Health"] = {
						2685, -- [1]
						2685, -- [2]
						2685, -- [3]
						2685, -- [4]
						2685, -- [5]
						2685, -- [6]
						2525, -- [7]
						2525, -- [8]
						2525, -- [9]
						2220, -- [10]
						2220, -- [11]
						1939, -- [12]
						1939, -- [13]
						1939, -- [14]
						1760, -- [15]
						848, -- [16]
						848, -- [17]
						559, -- [18]
						400, -- [19]
						400, -- [20]
						0, -- [21]
					},
					["KilledBy"] = "蓝染-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"HEAL", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"MISC", -- [21]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 8,
			["type"] = "Grouped",
			["LastHealTime"] = 43754.216,
			["LastDamageTaken"] = 94,
			["LastEventHealth"] = {
				0, -- [1]
				3603, -- [2]
				3603, -- [3]
				3603, -- [4]
				3603, -- [5]
				3819, -- [6]
				3819, -- [7]
				3537, -- [8]
				3688, -- [9]
				3688, -- [10]
				3819, -- [11]
				3819, -- [12]
				3569, -- [13]
				3017, -- [14]
				3017, -- [15]
				3017, -- [16]
				2768, -- [17]
				3819, -- [18]
				3819, -- [19]
				3819, -- [20]
				3819, -- [21]
				3763, -- [22]
				3801, -- [23]
				3801, -- [24]
				3819, -- [25]
				3819, -- [26]
				3819, -- [27]
				3819, -- [28]
				3819, -- [29]
				3819, -- [30]
				3819, -- [31]
				3819, -- [32]
				3819, -- [33]
				3819, -- [34]
				3819, -- [35]
				3819, -- [36]
				3819, -- [37]
				3819, -- [38]
				3515, -- [39]
				3515, -- [40]
				3515, -- [41]
				3199, -- [42]
				3199, -- [43]
				3219, -- [44]
				2631, -- [45]
				3819, -- [46]
				3819, -- [47]
				3819, -- [48]
				400, -- [49]
				400, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3819, -- [1]
				3819, -- [2]
				3819, -- [3]
				3819, -- [4]
				3819, -- [5]
				3819, -- [6]
				3819, -- [7]
				3819, -- [8]
				3819, -- [9]
				3819, -- [10]
				3819, -- [11]
				3819, -- [12]
				3819, -- [13]
				3819, -- [14]
				3819, -- [15]
				3819, -- [16]
				3819, -- [17]
				3819, -- [18]
				3819, -- [19]
				3819, -- [20]
				3819, -- [21]
				3819, -- [22]
				3819, -- [23]
				3819, -- [24]
				3819, -- [25]
				3819, -- [26]
				3819, -- [27]
				3819, -- [28]
				3819, -- [29]
				3819, -- [30]
				3819, -- [31]
				3819, -- [32]
				3819, -- [33]
				3819, -- [34]
				3819, -- [35]
				3819, -- [36]
				3819, -- [37]
				3819, -- [38]
				3819, -- [39]
				3819, -- [40]
				3819, -- [41]
				3819, -- [42]
				3819, -- [43]
				3819, -- [44]
				3819, -- [45]
				3819, -- [46]
				3819, -- [47]
				3819, -- [48]
				3819, -- [49]
				3819, -- [50]
			},
			["NextEventNum"] = 49,
			["LastDamageTime"] = 43916.642,
			["LastEvents"] = {
				"明定国是诏死亡。", -- [1]
				"明定国是诏 肉搏 丧尸暴龙-逐风者 Dodge (1)", -- [2]
				"明定国是诏 压制 丧尸暴龙-逐风者 Hit -244 (Physical)", -- [3]
				"明定国是诏 撕裂 (伤害/跳) 丧尸暴龙-逐风者 Tick -19 (Physical)", -- [4]
				"明定国是诏 拦截昏迷 张主任-逐风者 Hit -19 (Physical)", -- [5]
				"明定国是诏 肉搏 张主任-逐风者 Hit -264 (Physical)", -- [6]
				"张主任-逐风者 魔爆术 明定国是诏 Hit -282 (Arcane)", -- [7]
				"明定国是诏 斩杀 张主任-逐风者 Hit -472 (Physical)", -- [8]
				"明定国是诏 肉搏 红丶枫-逐风者 Hit -225 (Physical)", -- [9]
				"明定国是诏 雷霆一击 红丶枫-逐风者 Hit -37 (Physical)", -- [10]
				"明定国是诏 拦截昏迷 张主任-逐风者 Hit -22 (Physical)", -- [11]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 明定国是诏 Tick -250 (Shadow)", -- [12]
				"张主任-逐风者 冰锥术 明定国是诏 Hit -552 (Frost)", -- [13]
				"明定国是诏 肉搏 张主任-逐风者 Crit -620 (Physical)", -- [14]
				"明定国是诏 斩杀 张主任-逐风者 Hit -907 (Physical)", -- [15]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 明定国是诏 Tick -249 (Shadow)", -- [16]
				"耍下-黑龙费尔默 暗言术：痛 (伤害/跳) 明定国是诏 Tick -226 (Shadow)", -- [17]
				"明定国是诏 冲锋击昏 向天歌-黑龙费尔默 Immune (Physical)", -- [18]
				"明定国是诏 断筋 向天歌-黑龙费尔默 Absorb -33 (33 被吸收) (Physical)", -- [19]
				"向天歌-黑龙费尔默 冰霜新星 明定国是诏 Crit -56 (Frost)", -- [20]
				"明定国是诏 肉搏 向天歌-黑龙费尔默 Absorb -367 (367 被吸收) (1)", -- [21]
				"明定国是诏 血之狂热 明定国是诏 Tick +38", -- [22]
				"明定国是诏 重伤 (伤害/跳) 向天歌-黑龙费尔默 Absorb -50 (50 被吸收) (Physical)", -- [23]
				"明定国是诏 血之狂热 明定国是诏 Tick +38 (20 过量治疗)", -- [24]
				"明定国是诏 重伤 (伤害/跳) 向天歌-黑龙费尔默 Tick -50 (Physical)", -- [25]
				"明定国是诏 血之狂热 明定国是诏 Tick +38 (38 过量治疗)", -- [26]
				"明定国是诏 重伤 (伤害/跳) 向天歌-黑龙费尔默 Tick -51 (Physical)", -- [27]
				"明定国是诏 拦截昏迷 贴身施法 Absorb -25 (25 被吸收) (Physical)", -- [28]
				"明定国是诏 肉搏 丧尸暴龙-逐风者 Hit -292 (Physical)", -- [29]
				"明定国是诏 断筋 丧尸暴龙-逐风者 Miss (Physical)", -- [30]
				"明定国是诏 拦截昏迷 丧尸暴龙-逐风者 Hit -19 (Physical)", -- [31]
				"明定国是诏 撕裂 (伤害/跳) 丧尸暴龙-逐风者 Tick -19 (Physical)", -- [32]
				"明定国是诏 肉搏 丧尸暴龙-逐风者 Hit -281 (Physical)", -- [33]
				"明定国是诏 断筋 向天歌-黑龙费尔默 Absorb -14 (14 被吸收) (Physical)", -- [34]
				"明定国是诏 肉搏 向天歌-黑龙费尔默 Absorb -321 (321 被吸收) (1)", -- [35]
				"向天歌-黑龙费尔默 冰霜新星 明定国是诏 Resist (Frost)", -- [36]
				"明定国是诏 肉搏 向天歌-黑龙费尔默 Crit -621 (Physical)", -- [37]
				"向天歌-黑龙费尔默 魔爆术 明定国是诏 Hit -304 (Arcane)", -- [38]
				"明定国是诏 旋风斩 向天歌-黑龙费尔默 Hit -288 (Physical)", -- [39]
				"明定国是诏 肉搏 向天歌-黑龙费尔默 Immune (1)", -- [40]
				"向天歌-黑龙费尔默 魔爆术 明定国是诏 Hit -316 (Arcane)", -- [41]
				"明定国是诏 嗜血 向天歌-黑龙费尔默 Hit -334 (Physical)", -- [42]
				"明定国是诏 嗜血 明定国是诏 Hit +20", -- [43]
				"向天歌-黑龙费尔默 冰锥术 明定国是诏 Hit -588 (Frost)", -- [44]
				"向天歌-黑龙费尔默 吞噬之影 明定国是诏 Hit -110 (Shadow)", -- [45]
				"明定国是诏 冲锋击昏 丧尸暴龙-逐风者 Resist (Physical)", -- [46]
				"明定国是诏 英勇打击 丧尸暴龙-逐风者 Hit -314 (Physical)", -- [47]
				"炽天使-黑龙费尔默 冰霜新星 明定国是诏 Hit -94 (Frost)", -- [48]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 明定国是诏 Tick -298 (Shadow)", -- [49]
				"蓝染-黑龙费尔默 精神鞭笞 (伤害/跳) 明定国是诏 Tick -289 (Shadow)", -- [50]
			},
			["Name"] = "明定国是诏",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				43214.515, -- [1]
				43276.435, -- [2]
				43277.719, -- [3]
				43279.236, -- [4]
				43281.469, -- [5]
				43298.17, -- [6]
				43298.837, -- [7]
				43299.52, -- [8]
				43310.887, -- [9]
				43311.637, -- [10]
				43420.345, -- [11]
				43420.995, -- [12]
				43421.211, -- [13]
				43421.362, -- [14]
				43422.728, -- [15]
				43423.995, -- [16]
				43426.995, -- [17]
				43559.337, -- [18]
				43560.287, -- [19]
				43560.337, -- [20]
				43560.354, -- [21]
				43562.338, -- [22]
				43563.305, -- [23]
				43564.354, -- [24]
				43566.288, -- [25]
				43566.354, -- [26]
				43569.305, -- [27]
				43569.338, -- [28]
				43720.48, -- [29]
				43721.781, -- [30]
				43725.781, -- [31]
				43726.181, -- [32]
				43726.797, -- [33]
				43741.248, -- [34]
				43741.265, -- [35]
				43743.965, -- [36]
				43745.732, -- [37]
				43746.999, -- [38]
				43747.228, -- [39]
				43749.165, -- [40]
				43753.099, -- [41]
				43754.216, -- [42]
				43754.216, -- [43]
				43756.716, -- [44]
				43756.749, -- [45]
				43916.142, -- [46]
				43916.642, -- [47]
				43919.559, -- [48]
				43214.282, -- [49]
				43214.499, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["丧尸暴龙-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["熊汏-黑龙费尔默"] = {
									["count"] = 12,
								},
								["鄂尔多斯奶妈-黑龙费尔默"] = {
									["count"] = 9,
								},
								["向天歌-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 30,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 7,
								},
							},
							["amount"] = 10,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 9679,
					["RageGainedFrom"] = {
						["明定国是诏"] = {
							["Details"] = {
								["狂暴之怒效果"] = {
									["count"] = 50,
								},
								["血性狂暴"] = {
									["count"] = 30,
								},
								["怒不可遏"] = {
									["count"] = 7,
								},
								["冲锋"] = {
									["count"] = 168,
								},
							},
							["amount"] = 255,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 15,
					["ElementTaken"] = {
						["Frost"] = 2561,
						["Arcane"] = 2309,
						["Shadow"] = 2904,
						["Fire"] = 694,
						["Holy"] = 570,
						["Nature"] = 641,
					},
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["明定国是诏"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 8992,
					["TimeHeal"] = 9,
					["ElementDone"] = {
						["Melee"] = 5485,
						["Physical"] = 3507,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 21,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 18,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 37,
						},
					},
					["WhoDamaged"] = {
						["贴身施法"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 306,
								},
							},
							["amount"] = 306,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 601,
								},
							},
							["amount"] = 601,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 282,
								},
								["冰锥术"] = {
									["count"] = 552,
								},
							},
							["amount"] = 834,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 725,
								},
							},
							["amount"] = 725,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 620,
								},
								["吞噬之影"] = {
									["count"] = 110,
								},
								["冰锥术"] = {
									["count"] = 588,
								},
								["冰霜新星"] = {
									["count"] = 56,
								},
							},
							["amount"] = 1374,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 318,
								},
								["冰霜新星"] = {
									["count"] = 94,
								},
								["火焰冲击"] = {
									["count"] = 694,
								},
								["冰锥术"] = {
									["count"] = 1169,
								},
							},
							["amount"] = 2275,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 478,
								},
								["月火术"] = {
									["count"] = 305,
								},
								["荆棘术"] = {
									["count"] = 40,
								},
							},
							["amount"] = 823,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 912,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 868,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 289,
								},
							},
							["amount"] = 2069,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 102,
								},
								["惩击"] = {
									["count"] = 570,
								},
							},
							["amount"] = 672,
						},
					},
					["TimeHealing"] = {
						["明定国是诏"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
								["血之狂热"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
					},
					["OverHeals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 38,
									["min"] = 20,
									["count"] = 2,
									["amount"] = 58,
								},
							},
							["count"] = 2,
							["amount"] = 58,
						},
					},
					["PartialResist"] = {
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["惩击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["吞噬之影"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["PartialAbsorb"] = {
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["惩击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["吞噬之影"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["Interrupts"] = 1,
					["InterruptData"] = {
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["治疗波 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Overhealing"] = 58,
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 2,
									["amount"] = 40,
								},
							},
							["count"] = 2,
							["amount"] = 40,
						},
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 38,
									["min"] = 18,
									["count"] = 4,
									["amount"] = 132,
								},
							},
							["count"] = 4,
							["amount"] = 132,
						},
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 688,
						["Physical"] = 122,
					},
					["HealedWho"] = {
						["明定国是诏"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 40,
								},
								["血之狂热"] = {
									["count"] = 132,
								},
							},
							["amount"] = 172,
						},
					},
					["HealingTaken"] = 172,
					["Healing"] = 172,
					["WhoHealed"] = {
						["明定国是诏"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 40,
								},
								["血之狂热"] = {
									["count"] = 132,
								},
							},
							["amount"] = 172,
						},
					},
					["TimeSpent"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.62,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["刺耳怒吼"] = {
									["count"] = 0.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.28,
								},
							},
							["amount"] = 8.830000000000002,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 2.72,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 8.239999999999998,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.95,
								},
								["肉搏"] = {
									["count"] = 3.21,
								},
							},
							["amount"] = 16.16,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 0.75,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.25,
						},
						["贴身施法"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1,
								},
								["拦截昏迷"] = {
									["count"] = 1.53,
								},
							},
							["amount"] = 2.53,
						},
						["明定国是诏"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
								["血之狂热"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.47,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.03,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.23,
								},
							},
							["amount"] = 13.73,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 0.5,
								},
								["压制"] = {
									["count"] = 1.28,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.9,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.62,
								},
							},
							["amount"] = 11.6,
						},
					},
					["Attacks"] = {
						["压制"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 244,
									["min"] = 244,
									["count"] = 1,
									["amount"] = 244,
								},
							},
							["count"] = 1,
							["amount"] = 244,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 1,
									["amount"] = 50,
								},
								["Tick"] = {
									["max"] = 51,
									["min"] = 50,
									["count"] = 9,
									["amount"] = 455,
								},
							},
							["count"] = 10,
							["amount"] = 505,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 314,
									["min"] = 314,
									["count"] = 1,
									["amount"] = 314,
								},
							},
							["count"] = 1,
							["amount"] = 314,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1,
									["min"] = 1,
									["count"] = 2,
									["amount"] = 2,
								},
							},
							["count"] = 2,
							["amount"] = 2,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 334,
									["min"] = 334,
									["count"] = 1,
									["amount"] = 334,
								},
							},
							["count"] = 1,
							["amount"] = 334,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 37,
									["min"] = 37,
									["count"] = 1,
									["amount"] = 37,
								},
							},
							["count"] = 1,
							["amount"] = 37,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 25,
									["min"] = 25,
									["count"] = 1,
									["amount"] = 25,
								},
								["Hit"] = {
									["max"] = 23,
									["min"] = 14,
									["count"] = 6,
									["amount"] = 117,
								},
							},
							["count"] = 7,
							["amount"] = 142,
						},
						["刺耳怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 288,
									["min"] = 162,
									["count"] = 2,
									["amount"] = 450,
								},
							},
							["count"] = 2,
							["amount"] = 450,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 19,
									["min"] = 19,
									["count"] = 2,
									["amount"] = 38,
								},
							},
							["count"] = 2,
							["amount"] = 38,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 33,
									["min"] = 14,
									["count"] = 2,
									["amount"] = 47,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 14,
									["min"] = 1,
									["count"] = 2,
									["amount"] = 15,
								},
							},
							["count"] = 5,
							["amount"] = 62,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 907,
									["min"] = 472,
									["count"] = 2,
									["amount"] = 1379,
								},
							},
							["count"] = 2,
							["amount"] = 1379,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 367,
									["min"] = 321,
									["count"] = 2,
									["amount"] = 688,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 621,
									["min"] = 312,
									["count"] = 5,
									["amount"] = 2242,
								},
								["Hit"] = {
									["max"] = 292,
									["min"] = 159,
									["count"] = 11,
									["amount"] = 2555,
								},
							},
							["count"] = 21,
							["amount"] = 5485,
						},
					},
					["RageGain"] = 255,
					["ActiveTime"] = 72.34,
					["TimeDamage"] = 63.34000000000001,
					["TimeDamaging"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.62,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["刺耳怒吼"] = {
									["count"] = 0.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.28,
								},
							},
							["amount"] = 8.830000000000002,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.95,
								},
								["肉搏"] = {
									["count"] = 3.21,
								},
							},
							["amount"] = 16.16,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 0.75,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.25,
						},
						["贴身施法"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1,
								},
								["拦截昏迷"] = {
									["count"] = 1.53,
								},
							},
							["amount"] = 2.53,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 2.72,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 8.239999999999998,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.47,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.03,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.23,
								},
							},
							["amount"] = 13.73,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 0.5,
								},
								["压制"] = {
									["count"] = 1.28,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.9,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.62,
								},
							},
							["amount"] = 11.6,
						},
					},
					["RageGained"] = {
						["狂暴之怒效果"] = {
							["Details"] = {
								["明定国是诏"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
						["血性狂暴"] = {
							["Details"] = {
								["明定国是诏"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["怒不可遏"] = {
							["Details"] = {
								["明定国是诏"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["冲锋"] = {
							["Details"] = {
								["明定国是诏"] = {
									["count"] = 168,
								},
							},
							["amount"] = 168,
						},
					},
					["DOT_Time"] = 36,
					["DamagedWho"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 20,
								},
								["肉搏"] = {
									["count"] = 535,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 203,
								},
							},
							["amount"] = 758,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 334,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 151,
								},
								["断筋"] = {
									["count"] = 61,
								},
								["旋风斩"] = {
									["count"] = 288,
								},
								["肉搏"] = {
									["count"] = 1309,
								},
							},
							["amount"] = 2143,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 37,
								},
								["肉搏"] = {
									["count"] = 225,
								},
							},
							["amount"] = 262,
						},
						["贴身施法"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 283,
								},
								["拦截昏迷"] = {
									["count"] = 48,
								},
							},
							["amount"] = 331,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 41,
								},
								["斩杀"] = {
									["count"] = 1379,
								},
								["肉搏"] = {
									["count"] = 884,
								},
							},
							["amount"] = 2304,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 162,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 151,
								},
								["断筋"] = {
									["count"] = 1,
								},
								["拳击"] = {
									["count"] = 2,
								},
								["拦截昏迷"] = {
									["count"] = 14,
								},
								["肉搏"] = {
									["count"] = 1676,
								},
							},
							["amount"] = 2006,
						},
						["丧尸暴龙-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 244,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 38,
								},
								["拦截昏迷"] = {
									["count"] = 19,
								},
								["英勇打击"] = {
									["count"] = 314,
								},
								["肉搏"] = {
									["count"] = 573,
								},
							},
							["amount"] = 1188,
						},
					},
				},
			},
			["UnitLockout"] = 43558.587,
			["LastActive"] = 43918.592,
		},
		["柊镜-逐风者"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
					},
					["Messages"] = {
						"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Absorb -56 (56 被吸收) (Physical)", -- [1]
						"柊镜-逐风者 肉搏 蓝染-黑龙费尔默 Absorb -262 (262 被吸收) (1)", -- [2]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -297 (Shadow)", -- [3]
						"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [4]
						"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -57 (Physical)", -- [5]
						"柊镜-逐风者 拳击 蓝染-黑龙费尔默 Hit -12 (Physical)", -- [6]
						"柊镜-逐风者 interrupts 蓝染-黑龙费尔默 精神鞭笞 (拳击)", -- [7]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -306 (Shadow)", -- [8]
						"柊镜-逐风者 肉搏 蓝染-黑龙费尔默 Hit -293 (Physical)", -- [9]
						"柊镜-逐风者 致死打击 蓝染-黑龙费尔默 Crit -683 (Physical)", -- [10]
						"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [11]
						"蓝染-黑龙费尔默 射击 柊镜-逐风者 Hit -119 (Shadow)", -- [12]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -306 (Shadow)", -- [13]
						"欧尛-火妖鲁西弗隆 冰锥术 柊镜-逐风者 Hit -428 (Frost)", -- [14]
						"蓝染-黑龙费尔默 射击 柊镜-逐风者 Hit -184 (Shadow)", -- [15]
						"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -57 (Physical)", -- [16]
						"柊镜-逐风者 肉搏 蓝染-黑龙费尔默 Hit -226 (Physical)", -- [17]
						"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [18]
						"欧尛-火妖鲁西弗隆 魔爆术 柊镜-逐风者 Hit -325 (Arcane)", -- [19]
						"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -306 (Shadow)", -- [20]
						"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Absorb -57 (57 被吸收) (Physical)", -- [21]
						"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [22]
						"耍下-黑龙费尔默 心灵震爆 柊镜-逐风者 Hit -944 (Shadow)", -- [23]
						"柊镜-逐风者死亡。", -- [24]
					},
					["DeathAt"] = 44421.587,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-12.31699999999546, -- [1]
						-11.53399999999965, -- [2]
						-11.41700000000128, -- [3]
						-9.91700000000128, -- [4]
						-9.31699999999546, -- [5]
						-8.78399999999965, -- [6]
						-8.78399999999965, -- [7]
						-8.411999999996624, -- [8]
						-7.73399999999674, -- [9]
						-7.150999999998021, -- [10]
						-6.917000000001281, -- [11]
						-6.184000000001106, -- [12]
						-5.417000000001281, -- [13]
						-4.633999999998196, -- [14]
						-4.349999999998545, -- [15]
						-4.11699999999837, -- [16]
						-3.934000000001106, -- [17]
						-3.915000000000873, -- [18]
						-2.934000000001106, -- [19]
						-2.417000000001281, -- [20]
						-1.11699999999837, -- [21]
						-0.9170000000012806, -- [22]
						-0.01699999999982538, -- [23]
						0, -- [24]
					},
					["HealthMax"] = {
						4719, -- [1]
						4719, -- [2]
						4719, -- [3]
						4719, -- [4]
						4719, -- [5]
						4719, -- [6]
						4719, -- [7]
						4719, -- [8]
						4719, -- [9]
						4719, -- [10]
						4719, -- [11]
						4719, -- [12]
						4719, -- [13]
						4719, -- [14]
						4719, -- [15]
						4719, -- [16]
						4719, -- [17]
						4719, -- [18]
						4719, -- [19]
						4719, -- [20]
						4719, -- [21]
						4719, -- [22]
						4719, -- [23]
						4719, -- [24]
					},
					["Health"] = {
						3579, -- [1]
						3579, -- [2]
						3579, -- [3]
						3282, -- [4]
						3088, -- [5]
						3088, -- [6]
						3088, -- [7]
						3088, -- [8]
						2782, -- [9]
						2782, -- [10]
						2782, -- [11]
						2588, -- [12]
						2469, -- [13]
						2163, -- [14]
						1735, -- [15]
						1551, -- [16]
						1551, -- [17]
						1551, -- [18]
						1357, -- [19]
						1032, -- [20]
						726, -- [21]
						726, -- [22]
						532, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "耍下-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"MISC", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
					},
					["Messages"] = {
						"柊镜-逐风者 肉搏 炽天使-黑龙费尔默 Absorb -385 (1)", -- [1]
						"柊镜-逐风者 压制 炽天使-黑龙费尔默 Crit -526 (385 被吸收) (Physical)", -- [2]
						"像疯一样离去-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -162 (Shadow)", -- [3]
						"炽天使-黑龙费尔默 魔爆术 柊镜-逐风者 Hit -296 (Arcane)", -- [4]
						"柊镜-逐风者死亡。", -- [5]
					},
					["DeathAt"] = 43998.596,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
					},
					["MessageTimes"] = {
						-0.75, -- [1]
						-0.75, -- [2]
						-0.04999999999563443, -- [3]
						0, -- [4]
						0, -- [5]
					},
					["HealthMax"] = {
						5109, -- [1]
						5109, -- [2]
						5109, -- [3]
						5109, -- [4]
						5109, -- [5]
					},
					["Health"] = {
						286, -- [1]
						286, -- [2]
						286, -- [3]
						286, -- [4]
						0, -- [5]
					},
					["KilledBy"] = "炽天使-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"MISC", -- [5]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
					},
					["Messages"] = {
						"柊镜-逐风者 肉搏 张主任-逐风者 Hit -426 (Physical)", -- [1]
						"柊镜-逐风者 肉搏 红丶枫-逐风者 Crit -651 (Physical)", -- [2]
						"柊镜-逐风者 横扫攻击 秃老亮-黑龙费尔默 Hit -709 (Physical)", -- [3]
						"柊镜-逐风者 横扫攻击 红丶枫-逐风者 Hit -295 (Physical)", -- [4]
						"柊镜-逐风者 旋风斩 张主任-逐风者 Hit -365 (Physical)", -- [5]
						"柊镜-逐风者 旋风斩 红丶枫-逐风者 Hit -337 (Physical)", -- [6]
						"柊镜-逐风者 旋风斩 秃老亮-黑龙费尔默 Hit -310 (Physical)", -- [7]
						"柊镜-逐风者 横扫攻击 秃老亮-黑龙费尔默 Hit -322 (Physical)", -- [8]
						"柊镜-逐风者 斩杀 红丶枫-逐风者 Hit -500 (Physical)", -- [9]
						"柊镜-逐风者 横扫攻击 秃老亮-黑龙费尔默 Hit -313 (Physical)", -- [10]
						"耍下-黑龙费尔默 心灵震爆 柊镜-逐风者 Hit -842 (Shadow)", -- [11]
						"柊镜-逐风者死亡。", -- [12]
					},
					["DeathAt"] = 43417.595,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["MessageTimes"] = {
						-6.216999999996915, -- [1]
						-2.400000000001455, -- [2]
						-2.400000000001455, -- [3]
						-2.184000000001106, -- [4]
						-2.184000000001106, -- [5]
						-2.184000000001106, -- [6]
						-2.184000000001106, -- [7]
						-2.184000000001106, -- [8]
						-0.5499999999956344, -- [9]
						-0.532999999995809, -- [10]
						-0.0669999999954598, -- [11]
						0, -- [12]
					},
					["HealthMax"] = {
						5109, -- [1]
						5109, -- [2]
						5109, -- [3]
						5109, -- [4]
						5109, -- [5]
						5109, -- [6]
						5109, -- [7]
						5109, -- [8]
						5109, -- [9]
						5109, -- [10]
						5109, -- [11]
						5109, -- [12]
					},
					["Health"] = {
						737, -- [1]
						737, -- [2]
						737, -- [3]
						737, -- [4]
						737, -- [5]
						737, -- [6]
						737, -- [7]
						737, -- [8]
						737, -- [9]
						737, -- [10]
						737, -- [11]
						0, -- [12]
					},
					["KilledBy"] = "耍下-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
					},
					["Messages"] = {
						"柊镜-逐风者 断筋 鄂尔多斯奶妈-黑龙费尔默 Hit -28 (Physical)", -- [1]
						"柊镜-逐风者 肉搏 鄂尔多斯奶妈-黑龙费尔默 Crit -509 (Physical)", -- [2]
						"柊镜-逐风者 致死打击 鄂尔多斯奶妈-黑龙费尔默 Hit -377 (Physical)", -- [3]
						"柊镜-逐风者 重伤 (伤害/跳) 鄂尔多斯奶妈-黑龙费尔默 Tick -68 (Physical)", -- [4]
						"贴身施法 冰霜新星 柊镜-逐风者 Hit -94 (Frost)", -- [5]
						"雷滴呱呱-黑龙费尔默 寒冰箭 柊镜-逐风者 Hit -933 (Frost)", -- [6]
						"雷滴呱呱-黑龙费尔默 寒冰箭 柊镜-逐风者 Hit -915 (Frost)", -- [7]
						"柊镜-逐风者 dispels 柊镜-逐风者 冰霜新星 (逃命专家)", -- [8]
						"柊镜-逐风者 dispels 柊镜-逐风者 冰霜新星 (逃命专家)", -- [9]
						"柊镜-逐风者 dispels 柊镜-逐风者 寒冰箭 (逃命专家)", -- [10]
						"柊镜-逐风者 dispels 柊镜-逐风者 寒冰箭 (逃命专家)", -- [11]
						"雷滴呱呱-黑龙费尔默 火焰冲击 柊镜-逐风者 Crit -1047 (Fire)", -- [12]
						"雷滴呱呱-黑龙费尔默 寒冰箭 柊镜-逐风者 Hit -923 (Frost)", -- [13]
						"雷滴呱呱-黑龙费尔默 冰锥术 柊镜-逐风者 Hit -642 (Frost)", -- [14]
						"柊镜-逐风者 血之狂热 柊镜-逐风者 Tick +51", -- [15]
						"柊镜-逐风者 肉搏 雷滴呱呱-黑龙费尔默 Absorb -1191 (1)", -- [16]
						"柊镜-逐风者 致死打击 雷滴呱呱-黑龙费尔默 Crit -167 (1191 被吸收) (Physical)", -- [17]
						"柊镜-逐风者 肉搏 雷滴呱呱-黑龙费尔默 Hit -446 (Physical)", -- [18]
						"柊镜-逐风者 旋风斩 雷滴呱呱-黑龙费尔默 Dodge (Physical)", -- [19]
						"贴身施法 寒冰箭 柊镜-逐风者 Hit -787 (Frost)", -- [20]
						"柊镜-逐风者死亡。", -- [21]
						"柊镜-逐风者 重伤 (伤害/跳) 雷滴呱呱-黑龙费尔默 Tick -106 (Physical)", -- [22]
					},
					["DeathAt"] = 43201.581,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
					},
					["MessageTimes"] = {
						-13.96799999999348, -- [1]
						-13.66799999999785, -- [2]
						-12.33399999999529, -- [3]
						-10.65099999999802, -- [4]
						-9.150999999998021, -- [5]
						-8.300999999999476, -- [6]
						-5.73399999999674, -- [7]
						-5.23399999999674, -- [8]
						-5.23399999999674, -- [9]
						-5.23399999999674, -- [10]
						-5.23399999999674, -- [11]
						-3.98399999999674, -- [12]
						-3.36699999999837, -- [13]
						-2.467999999993481, -- [14]
						-1.98399999999674, -- [15]
						-1.716999999996915, -- [16]
						-1.716999999996915, -- [17]
						-1.350999999995111, -- [18]
						-0.216999999996915, -- [19]
						0, -- [20]
						0, -- [21]
						1.322000000000116, -- [22]
					},
					["HealthMax"] = {
						5109, -- [1]
						5109, -- [2]
						5109, -- [3]
						5109, -- [4]
						5109, -- [5]
						5109, -- [6]
						5109, -- [7]
						5109, -- [8]
						5109, -- [9]
						5109, -- [10]
						5109, -- [11]
						5109, -- [12]
						5109, -- [13]
						5109, -- [14]
						5109, -- [15]
						5109, -- [16]
						5109, -- [17]
						5109, -- [18]
						5109, -- [19]
						5109, -- [20]
						5109, -- [21]
						5109, -- [22]
					},
					["Health"] = {
						5109, -- [1]
						5109, -- [2]
						4772, -- [3]
						4772, -- [4]
						4772, -- [5]
						4678, -- [6]
						3745, -- [7]
						2830, -- [8]
						2830, -- [9]
						2830, -- [10]
						2830, -- [11]
						2830, -- [12]
						1783, -- [13]
						860, -- [14]
						218, -- [15]
						269, -- [16]
						269, -- [17]
						269, -- [18]
						269, -- [19]
						269, -- [20]
						0, -- [21]
						1, -- [22]
					},
					["KilledBy"] = "贴身施法",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"MISC", -- [8]
						"MISC", -- [9]
						"MISC", -- [10]
						"MISC", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"HEAL", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"MISC", -- [21]
						"DAMAGE", -- [22]
					},
				}, -- [4]
			},
			["TimeLast"] = {
				["TimeHeal"] = 43319.588,
				["Dispelled"] = 43193.581,
				["Dispels"] = 43193.581,
				["DeathCount"] = 44419.587,
				["OVERALL"] = 44419.587,
				["DamageTaken"] = 44419.587,
				["HealingTaken"] = 43319.588,
				["Healing"] = 43319.588,
				["RageGain"] = 44395.586,
				["HOT_Time"] = 43319.588,
				["TimeDamage"] = 44418.587,
				["Interrupts"] = 44410.587,
				["ActiveTime"] = 44418.587,
				["DOT_Time"] = 44418.587,
				["Damage"] = 44418.587,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"MISC", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					12, -- [1]
				},
				["Dispelled"] = {
					3, -- [1]
				},
				["Dispels"] = {
					3, -- [1]
				},
				["Healing"] = {
					408, -- [1]
				},
				["DamageTaken"] = {
					14042, -- [1]
				},
				["DeathCount"] = {
					4, -- [1]
				},
				["HealingTaken"] = {
					408, -- [1]
				},
				["RageGain"] = {
					284, -- [1]
				},
				["HOT_Time"] = {
					24, -- [1]
				},
				["TimeDamage"] = {
					117.44, -- [1]
				},
				["Interrupts"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					129.44, -- [1]
				},
				["DOT_Time"] = {
					87, -- [1]
				},
				["Damage"] = {
					32464, -- [1]
				},
			},
			["LastHealTime"] = 43319.971,
			["LastDamageTaken"] = 944,
			["LastEventHealthMax"] = {
				4719, -- [1]
				4719, -- [2]
				4719, -- [3]
				4719, -- [4]
				4719, -- [5]
				4719, -- [6]
				4719, -- [7]
				4719, -- [8]
				4719, -- [9]
				4719, -- [10]
				4719, -- [11]
				4719, -- [12]
				4719, -- [13]
				4719, -- [14]
				4719, -- [15]
				4719, -- [16]
				4719, -- [17]
				4719, -- [18]
				4719, -- [19]
				4719, -- [20]
				4719, -- [21]
				4719, -- [22]
				4719, -- [23]
				4719, -- [24]
				4719, -- [25]
				4719, -- [26]
				4719, -- [27]
				4719, -- [28]
				4719, -- [29]
				4719, -- [30]
				4719, -- [31]
				4719, -- [32]
				4719, -- [33]
				4719, -- [34]
				4719, -- [35]
				4719, -- [36]
				4719, -- [37]
				4719, -- [38]
				4719, -- [39]
				4719, -- [40]
				4719, -- [41]
				4719, -- [42]
				4719, -- [43]
				4719, -- [44]
				4719, -- [45]
				5109, -- [46]
				5109, -- [47]
				5109, -- [48]
				5109, -- [49]
				4719, -- [50]
			},
			["GUID"] = "Player-5451-02FBD33F",
			["level"] = 60,
			["LastDamageAbility"] = "心灵震爆",
			["LastFightIn"] = 13,
			["LastEventHealth"] = {
				4719, -- [1]
				4382, -- [2]
				4382, -- [3]
				4382, -- [4]
				2960, -- [5]
				2960, -- [6]
				2861, -- [7]
				1, -- [8]
				1, -- [9]
				1, -- [10]
				1, -- [11]
				4719, -- [12]
				4719, -- [13]
				4719, -- [14]
				4719, -- [15]
				4719, -- [16]
				4719, -- [17]
				4719, -- [18]
				4382, -- [19]
				4382, -- [20]
				4424, -- [21]
				3579, -- [22]
				3579, -- [23]
				3579, -- [24]
				3282, -- [25]
				3088, -- [26]
				3088, -- [27]
				3088, -- [28]
				3088, -- [29]
				2782, -- [30]
				2782, -- [31]
				2782, -- [32]
				2588, -- [33]
				2469, -- [34]
				2163, -- [35]
				1735, -- [36]
				1551, -- [37]
				1551, -- [38]
				1551, -- [39]
				1357, -- [40]
				1032, -- [41]
				726, -- [42]
				726, -- [43]
				532, -- [44]
				0, -- [45]
				0, -- [46]
				4772, -- [47]
				4772, -- [48]
				4772, -- [49]
				4719, -- [50]
			},
			["type"] = "Grouped",
			["enClass"] = "WARRIOR",
			["GuardianReverseGUIDs"] = {
				["联盟军旗"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "Creature-0-5427-529-22399-14465-00006C3FB5",
					},
				},
			},
			["unit"] = true,
			["Owner"] = false,
			["Pet"] = {
				"联盟军旗 <柊镜-逐风者>", -- [1]
			},
			["NextEventNum"] = 46,
			["LastDamageTime"] = 44419.237,
			["LastEvents"] = {
				"柊镜-逐风者 断筋 耍下-黑龙费尔默 Hit -33 (Physical)", -- [1]
				"柊镜-逐风者 肉搏 耍下-黑龙费尔默 Crit -683 (Physical)", -- [2]
				"柊镜-逐风者 致死打击 耍下-黑龙费尔默 Hit -420 (Physical)", -- [3]
				"柊镜-逐风者 旋风斩 耍下-黑龙费尔默 Hit -334 (Physical)", -- [4]
				"鬼武者 肉搏 柊镜-逐风者 Hit -59 (Physical)", -- [5]
				"鬼武者 爪击 柊镜-逐风者 Hit -40 (Physical)", -- [6]
				"柊镜-逐风者 拦截昏迷 蓝染-黑龙费尔默 Hit -27 (Physical)", -- [7]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -88 (Physical)", -- [8]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -88 (Physical)", -- [9]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -89 (Physical)", -- [10]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -89 (Physical)", -- [11]
				"柊镜-逐风者 斩杀 蓝染-黑龙费尔默 Hit -469 (Physical)", -- [12]
				"柊镜-逐风者 肉搏 耍下-黑龙费尔默 Hit -289 (Physical)", -- [13]
				"耍下-黑龙费尔默 心灵尖啸 柊镜-逐风者 Immune (Shadow)", -- [14]
				"柊镜-逐风者 断筋 耍下-黑龙费尔默 Hit -26 (Physical)", -- [15]
				"柊镜-逐风者 肉搏 耍下-黑龙费尔默 Crit -578 (Physical)", -- [16]
				"柊镜-逐风者 冲锋击昏 雷滴呱呱-黑龙费尔默 Immune (Physical)", -- [17]
				"柊镜-逐风者 肉搏 雷滴呱呱-黑龙费尔默 Immune (1)", -- [18]
				"柊镜-逐风者 肉搏 雷滴呱呱-黑龙费尔默 Immune (1)", -- [19]
				"柊镜-逐风者 斩杀 雷滴呱呱-黑龙费尔默 Crit -1621 (Physical)", -- [20]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -281 (Shadow)", -- [21]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Absorb -56 (56 被吸收) (Physical)", -- [22]
				"柊镜-逐风者 肉搏 蓝染-黑龙费尔默 Absorb -262 (262 被吸收) (1)", -- [23]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -297 (Shadow)", -- [24]
				"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [25]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -57 (Physical)", -- [26]
				"柊镜-逐风者 拳击 蓝染-黑龙费尔默 Hit -12 (Physical)", -- [27]
				"柊镜-逐风者 interrupts 蓝染-黑龙费尔默 精神鞭笞 (拳击)", -- [28]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -306 (Shadow)", -- [29]
				"柊镜-逐风者 肉搏 蓝染-黑龙费尔默 Hit -293 (Physical)", -- [30]
				"柊镜-逐风者 致死打击 蓝染-黑龙费尔默 Crit -683 (Physical)", -- [31]
				"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [32]
				"蓝染-黑龙费尔默 射击 柊镜-逐风者 Hit -119 (Shadow)", -- [33]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -306 (Shadow)", -- [34]
				"欧尛-火妖鲁西弗隆 冰锥术 柊镜-逐风者 Hit -428 (Frost)", -- [35]
				"蓝染-黑龙费尔默 射击 柊镜-逐风者 Hit -184 (Shadow)", -- [36]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Tick -57 (Physical)", -- [37]
				"柊镜-逐风者 肉搏 蓝染-黑龙费尔默 Hit -226 (Physical)", -- [38]
				"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [39]
				"欧尛-火妖鲁西弗隆 魔爆术 柊镜-逐风者 Hit -325 (Arcane)", -- [40]
				"蓝染-黑龙费尔默 暗言术：痛 (伤害/跳) 柊镜-逐风者 Tick -306 (Shadow)", -- [41]
				"柊镜-逐风者 重伤 (伤害/跳) 蓝染-黑龙费尔默 Absorb -57 (57 被吸收) (Physical)", -- [42]
				"蓝染-黑龙费尔默 噬灵瘟疫 (伤害/跳) 柊镜-逐风者 Tick -194 (Shadow)", -- [43]
				"耍下-黑龙费尔默 心灵震爆 柊镜-逐风者 Hit -944 (Shadow)", -- [44]
				"柊镜-逐风者死亡。", -- [45]
				"柊镜-逐风者 重伤 (伤害/跳) 炽天使-黑龙费尔默 Tick -77 (Physical)", -- [46]
				"柊镜-逐风者 肉搏 秃老亮-黑龙费尔默 Absorb -369 (369 被吸收) (1)", -- [47]
				"柊镜-逐风者 断筋 秃老亮-黑龙费尔默 Absorb -75 (75 被吸收) (Physical)", -- [48]
				"秃老亮-黑龙费尔默 神圣新星 柊镜-逐风者 Hit -230 (Holy)", -- [49]
				"柊镜-逐风者 肉搏 耍下-黑龙费尔默 Hit -333 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["Name"] = "柊镜-逐风者",
			["LastEventTimes"] = {
				44192.358, -- [1]
				44197.908, -- [2]
				44197.908, -- [3]
				44199.575, -- [4]
				44205.225, -- [5]
				44205.225, -- [6]
				44205.675, -- [7]
				44213.509, -- [8]
				44216.509, -- [9]
				44219.509, -- [10]
				44222.526, -- [11]
				44241.961, -- [12]
				44243.744, -- [13]
				44245.261, -- [14]
				44247.144, -- [15]
				44247.561, -- [16]
				44384.302, -- [17]
				44385.319, -- [18]
				44389.119, -- [19]
				44389.652, -- [20]
				44399.153, -- [21]
				44408.037, -- [22]
				44408.82, -- [23]
				44408.937, -- [24]
				44410.437, -- [25]
				44411.037, -- [26]
				44411.57, -- [27]
				44411.57, -- [28]
				44411.942, -- [29]
				44412.62, -- [30]
				44413.203, -- [31]
				44413.437, -- [32]
				44414.17, -- [33]
				44414.937, -- [34]
				44415.72, -- [35]
				44416.004, -- [36]
				44416.237, -- [37]
				44416.42, -- [38]
				44416.439, -- [39]
				44417.42, -- [40]
				44417.937, -- [41]
				44419.237, -- [42]
				44419.437, -- [43]
				44420.337, -- [44]
				44420.354, -- [45]
				43999.296, -- [46]
				44049.233, -- [47]
				44050.333, -- [48]
				44051.18300000001, -- [49]
				44192.274, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["蓝染-黑龙费尔默"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4272,
					["RageGainedFrom"] = {
						["柊镜-逐风者"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 35,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 12,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 8,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 3519,
						["Frost"] = 428,
						["Arcane"] = 325,
					},
					["DOT_Time"] = 12,
					["Damage"] = 3324,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 262,
						["Physical"] = 113,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 781,
						["Physical"] = 2543,
					},
					["PartialAbsorb"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 683,
								},
								["拳击"] = {
									["count"] = 12,
								},
								["肉搏"] = {
									["count"] = 781,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 227,
								},
							},
							["amount"] = 1703,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1621,
								},
							},
							["amount"] = 1621,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 325,
								},
								["冰锥术"] = {
									["count"] = 428,
								},
							},
							["amount"] = 753,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 303,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 776,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1496,
								},
							},
							["amount"] = 2575,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 944,
								},
							},
							["amount"] = 944,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["柊镜-逐风者"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["柊镜-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 1,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.58,
								},
								["拳击"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 2.01,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9.120000000000001,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 4.55,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 13.67,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 683,
									["min"] = 683,
									["count"] = 1,
									["amount"] = 683,
								},
							},
							["count"] = 1,
							["amount"] = 683,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 57,
									["min"] = 57,
									["count"] = 2,
									["amount"] = 114,
								},
								["Absorb"] = {
									["max"] = 57,
									["min"] = 56,
									["count"] = 2,
									["amount"] = 113,
								},
							},
							["count"] = 4,
							["amount"] = 227,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 12,
									["min"] = 12,
									["count"] = 1,
									["amount"] = 12,
								},
							},
							["count"] = 1,
							["amount"] = 12,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1621,
									["min"] = 1621,
									["count"] = 1,
									["amount"] = 1621,
								},
							},
							["count"] = 1,
							["amount"] = 1621,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 262,
									["min"] = 262,
									["count"] = 1,
									["amount"] = 262,
								},
								["Hit"] = {
									["max"] = 293,
									["min"] = 226,
									["count"] = 2,
									["amount"] = 519,
								},
							},
							["count"] = 5,
							["amount"] = 781,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 35,
					["TimeDamage"] = 13.67,
					["TimeDamaging"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.58,
								},
								["拳击"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 2.01,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9.120000000000001,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 4.55,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["像疯一样离去-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
								["耍下-黑龙费尔默"] = {
									["count"] = 3,
								},
								["雷滴呱呱-黑龙费尔默"] = {
									["count"] = 12,
								},
								["炽天使-黑龙费尔默"] = {
									["count"] = 3,
								},
								["鄂尔多斯奶妈-黑龙费尔默"] = {
									["count"] = 36,
								},
								["蓝染-黑龙费尔默"] = {
									["count"] = 24,
								},
							},
							["amount"] = 87,
						},
					},
					["TimeSpent"] = {
						["贴身施法"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 4.760000000000001,
								},
								["旋风斩"] = {
									["count"] = 2.78,
								},
								["断筋"] = {
									["count"] = 2.75,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 13.58,
								},
								["肉搏"] = {
									["count"] = 13.17,
								},
							},
							["amount"] = 38.54000000000001,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 4.390000000000001,
								},
							},
							["amount"] = 13.55,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.01,
								},
								["斩杀"] = {
									["count"] = 1.43,
								},
								["肉搏"] = {
									["count"] = 3.57,
								},
							},
							["amount"] = 9.01,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.53,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.08,
								},
								["拳击"] = {
									["count"] = 0.1,
								},
								["断筋"] = {
									["count"] = 0.82,
								},
								["铁皮手雷"] = {
									["count"] = 0.62,
								},
								["肉搏"] = {
									["count"] = 4.03,
								},
							},
							["amount"] = 9.18,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["肉搏"] = {
									["count"] = 4.92,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["横扫攻击"] = {
									["count"] = 0.22,
								},
								["断筋"] = {
									["count"] = 0.15,
								},
								["斩杀"] = {
									["count"] = 2.83,
								},
								["肉搏"] = {
									["count"] = 4.67,
								},
							},
							["amount"] = 9.370000000000001,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 6.05,
						},
						["柊镜-逐风者"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12,
								},
								["拳击"] = {
									["count"] = 0.53,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.01,
								},
							},
							["amount"] = 18.12,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 1.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.62,
						},
					},
					["DamageTaken"] = 14042,
					["ElementDoneAbsorb"] = {
						["Melee"] = 1221,
						["Physical"] = 2321,
					},
					["DeathCount"] = 4,
					["HOT_Time"] = 24,
					["ElementTaken"] = {
						["Shadow"] = 5581,
						["Melee"] = 568,
						["Arcane"] = 1236,
						["Holy"] = 230,
						["Fire"] = 1149,
						["Physical"] = 427,
						["Frost"] = 4851,
					},
					["DOT_Time"] = 87,
					["Damage"] = 32464,
					["TimeHeal"] = 12,
					["Dispels"] = 3,
					["ElementDone"] = {
						["Physical"] = 16520,
						["Melee"] = 15771,
						["Fire"] = 173,
					},
					["DamagedWho"] = {
						["贴身施法"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 35,
								},
							},
							["amount"] = 35,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2323,
								},
								["压制"] = {
									["count"] = 154,
								},
								["旋风斩"] = {
									["count"] = 780,
								},
								["断筋"] = {
									["count"] = 53,
								},
								["拦截昏迷"] = {
									["count"] = 27,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 915,
								},
								["肉搏"] = {
									["count"] = 6044,
								},
							},
							["amount"] = 10296,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 365,
								},
								["断筋"] = {
									["count"] = 112,
								},
								["斩杀"] = {
									["count"] = 771,
								},
								["肉搏"] = {
									["count"] = 1193,
								},
							},
							["amount"] = 2441,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 230,
								},
								["拳击"] = {
									["count"] = 15,
								},
								["断筋"] = {
									["count"] = 88,
								},
								["铁皮手雷"] = {
									["count"] = 173,
								},
								["肉搏"] = {
									["count"] = 1157,
								},
							},
							["amount"] = 1663,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 420,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 65,
								},
								["断筋"] = {
									["count"] = 59,
								},
								["旋风斩"] = {
									["count"] = 334,
								},
								["肉搏"] = {
									["count"] = 1883,
								},
							},
							["amount"] = 2761,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1173,
								},
								["旋风斩"] = {
									["count"] = 337,
								},
								["横扫攻击"] = {
									["count"] = 295,
								},
								["断筋"] = {
									["count"] = 32,
								},
								["斩杀"] = {
									["count"] = 1072,
								},
								["肉搏"] = {
									["count"] = 1913,
								},
							},
							["amount"] = 4822,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 526,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 77,
								},
								["拦截昏迷"] = {
									["count"] = 36,
								},
								["斩杀"] = {
									["count"] = 511,
								},
								["肉搏"] = {
									["count"] = 794,
								},
							},
							["amount"] = 1944,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 167,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 426,
								},
								["斩杀"] = {
									["count"] = 1621,
								},
								["肉搏"] = {
									["count"] = 1637,
								},
							},
							["amount"] = 3851,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 683,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 581,
								},
								["拳击"] = {
									["count"] = 12,
								},
								["拦截昏迷"] = {
									["count"] = 27,
								},
								["斩杀"] = {
									["count"] = 469,
								},
								["肉搏"] = {
									["count"] = 781,
								},
							},
							["amount"] = 2553,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 1344,
								},
								["断筋"] = {
									["count"] = 75,
								},
								["肉搏"] = {
									["count"] = 369,
								},
								["旋风斩"] = {
									["count"] = 310,
								},
							},
							["amount"] = 2098,
						},
					},
					["WhoDamaged"] = {
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 102,
								},
							},
							["amount"] = 102,
						},
						["贴身施法"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 310,
								},
								["寒冰箭"] = {
									["count"] = 787,
								},
								["冰霜新星"] = {
									["count"] = 196,
								},
							},
							["amount"] = 1293,
						},
						["欧尛-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 325,
								},
								["冰锥术"] = {
									["count"] = 428,
								},
							},
							["amount"] = 753,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
						["鬼武者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 40,
								},
								["肉搏"] = {
									["count"] = 59,
								},
							},
							["amount"] = 99,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 305,
								},
							},
							["amount"] = 305,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1220,
								},
							},
							["amount"] = 1220,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1786,
								},
							},
							["amount"] = 1786,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["脑部损伤"] = {
									["count"] = 155,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 125,
								},
								["断筋"] = {
									["count"] = 55,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 52,
								},
								["肉搏"] = {
									["count"] = 509,
								},
							},
							["amount"] = 896,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 296,
								},
							},
							["amount"] = 296,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2771,
								},
								["冰锥术"] = {
									["count"] = 642,
								},
								["火焰冲击"] = {
									["count"] = 1047,
								},
							},
							["amount"] = 4460,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 303,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 776,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1496,
								},
							},
							["amount"] = 2575,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 230,
								},
							},
							["amount"] = 230,
						},
					},
					["TimeHealing"] = {
						["柊镜-逐风者"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["Dispelled"] = 3,
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["纠缠根须"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["脑部损伤"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["纠缠根须"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["脑部损伤"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["Interrupts"] = 2,
					["HealingTaken"] = 408,
					["WhoDispelled"] = {
						["柊镜-逐风者"] = {
							["Details"] = {
								["寒冰箭 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoHealed"] = {
						["柊镜-逐风者"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
					},
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 51,
									["min"] = 51,
									["count"] = 8,
									["amount"] = 408,
								},
							},
							["count"] = 8,
							["amount"] = 408,
						},
					},
					["HealedWho"] = {
						["柊镜-逐风者"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 31,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 10,
								},
								["Tick"] = {
									["count"] = 25,
								},
							},
							["amount"] = 77,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 10,
								},
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 38,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["柊镜-逐风者"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["Healing"] = 408,
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 16,
								},
							},
							["amount"] = 21,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 12,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RageGainedFrom"] = {
						["柊镜-逐风者"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 120,
								},
								["血性狂暴"] = {
									["count"] = 164,
								},
							},
							["amount"] = 284,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1173,
									["min"] = 167,
									["count"] = 4,
									["amount"] = 2814,
								},
								["Hit"] = {
									["max"] = 420,
									["min"] = 344,
									["count"] = 5,
									["amount"] = 1952,
								},
							},
							["count"] = 9,
							["amount"] = 4766,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 526,
									["min"] = 154,
									["count"] = 2,
									["amount"] = 680,
								},
							},
							["count"] = 2,
							["amount"] = 680,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 77,
									["min"] = 56,
									["count"] = 4,
									["amount"] = 267,
								},
								["Tick"] = {
									["max"] = 107,
									["min"] = 57,
									["count"] = 25,
									["amount"] = 2027,
								},
							},
							["count"] = 29,
							["amount"] = 2294,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 15,
									["min"] = 12,
									["count"] = 2,
									["amount"] = 27,
								},
							},
							["count"] = 2,
							["amount"] = 27,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 35,
									["min"] = 25,
									["count"] = 7,
									["amount"] = 214,
								},
								["Absorb"] = {
									["max"] = 75,
									["min"] = 75,
									["count"] = 1,
									["amount"] = 75,
								},
								["Crit"] = {
									["max"] = 88,
									["min"] = 77,
									["count"] = 2,
									["amount"] = 165,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 454,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1621,
									["min"] = 1621,
									["count"] = 1,
									["amount"] = 1621,
								},
								["Hit"] = {
									["max"] = 771,
									["min"] = 469,
									["count"] = 5,
									["amount"] = 2823,
								},
							},
							["count"] = 6,
							["amount"] = 4444,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 365,
									["min"] = 253,
									["count"] = 5,
									["amount"] = 1599,
								},
								["Crit"] = {
									["max"] = 527,
									["min"] = 527,
									["count"] = 1,
									["amount"] = 527,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 2126,
						},
						["横扫攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 709,
									["min"] = 295,
									["count"] = 4,
									["amount"] = 1639,
								},
							},
							["count"] = 4,
							["amount"] = 1639,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 36,
									["min"] = 27,
									["count"] = 3,
									["amount"] = 90,
								},
							},
							["count"] = 4,
							["amount"] = 90,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 173,
									["min"] = 173,
									["count"] = 1,
									["amount"] = 173,
								},
							},
							["count"] = 1,
							["amount"] = 173,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 1191,
									["min"] = 262,
									["count"] = 6,
									["amount"] = 3200,
								},
								["Crit"] = {
									["max"] = 683,
									["min"] = 509,
									["count"] = 10,
									["amount"] = 5795,
								},
								["Hit"] = {
									["max"] = 488,
									["min"] = 226,
									["count"] = 19,
									["amount"] = 6776,
								},
							},
							["count"] = 38,
							["amount"] = 15771,
						},
					},
					["RageGain"] = 284,
					["ActiveTime"] = 129.44,
					["TimeDamage"] = 117.44,
					["TimeDamaging"] = {
						["贴身施法"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 4.760000000000001,
								},
								["旋风斩"] = {
									["count"] = 2.78,
								},
								["断筋"] = {
									["count"] = 2.75,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 13.58,
								},
								["肉搏"] = {
									["count"] = 13.17,
								},
							},
							["amount"] = 38.54000000000001,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.01,
								},
								["斩杀"] = {
									["count"] = 1.43,
								},
								["肉搏"] = {
									["count"] = 3.57,
								},
							},
							["amount"] = 9.01,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.53,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.08,
								},
								["拳击"] = {
									["count"] = 0.1,
								},
								["断筋"] = {
									["count"] = 0.82,
								},
								["铁皮手雷"] = {
									["count"] = 0.62,
								},
								["肉搏"] = {
									["count"] = 4.03,
								},
							},
							["amount"] = 9.18,
						},
						["耍下-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["肉搏"] = {
									["count"] = 4.92,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.5,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["横扫攻击"] = {
									["count"] = 0.22,
								},
								["断筋"] = {
									["count"] = 0.15,
								},
								["斩杀"] = {
									["count"] = 2.83,
								},
								["肉搏"] = {
									["count"] = 4.67,
								},
							},
							["amount"] = 9.370000000000001,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 6.05,
						},
						["雷滴呱呱-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 4.390000000000001,
								},
							},
							["amount"] = 13.55,
						},
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12,
								},
								["拳击"] = {
									["count"] = 0.53,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.01,
								},
							},
							["amount"] = 18.12,
						},
						["秃老亮-黑龙费尔默"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 1.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.62,
						},
					},
					["InterruptData"] = {
						["蓝染-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗术 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["柊镜-逐风者"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
						["血性狂暴"] = {
							["Details"] = {
								["柊镜-逐风者"] = {
									["count"] = 164,
								},
							},
							["amount"] = 164,
						},
					},
					["DispelledWho"] = {
						["柊镜-逐风者"] = {
							["Details"] = {
								["寒冰箭 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
				},
			},
			["UnitLockout"] = 43584.589,
			["LastActive"] = 44419.587,
		},
		["夏光年"] = {
			["GUID"] = "Player-5458-02E7B354",
			["TimeLast"] = {
				["TimeHeal"] = 43301.587,
				["OVERALL"] = 43757.583,
				["DamageTaken"] = 43756.582,
				["EnergyGain"] = 43117.593,
				["RageGain"] = 43757.583,
				["Healing"] = 43301.587,
				["ActiveTime"] = 43757.583,
				["Interrupts"] = 43020.588,
				["TimeDamage"] = 43757.583,
				["DOT_Time"] = 43508.584,
				["Damage"] = 43757.583,
			},
			["LastAttackedBy"] = "向天歌-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"HEAL", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Healing"] = {
					2045, -- [1]
				},
				["DamageTaken"] = {
					8420, -- [1]
				},
				["EnergyGain"] = {
					80, -- [1]
				},
				["RageGain"] = {
					195, -- [1]
				},
				["ActiveTime"] = {
					52.13999999999999, -- [1]
				},
				["TimeDamage"] = {
					50.63999999999999, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["DOT_Time"] = {
					27, -- [1]
				},
				["Damage"] = {
					7334, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "冰锥术",
			["LastFightIn"] = 5,
			["type"] = "Grouped",
			["LastHealTime"] = 43301.687,
			["LastDamageTaken"] = 527,
			["LastEventHealth"] = {
				3999, -- [1]
				3999, -- [2]
				3981, -- [3]
				3981, -- [4]
				3963, -- [5]
				1, -- [6]
				3493, -- [7]
				3518, -- [8]
				3613, -- [9]
				3613, -- [10]
				5170, -- [11]
				5170, -- [12]
				5038, -- [13]
				5038, -- [14]
				4907, -- [15]
				4776, -- [16]
				4645, -- [17]
				6110, -- [18]
				6110, -- [19]
				6084, -- [20]
				6084, -- [21]
				6084, -- [22]
				5984, -- [23]
				5984, -- [24]
				5984, -- [25]
				5939, -- [26]
				5939, -- [27]
				5939, -- [28]
				5749, -- [29]
				5459, -- [30]
				5459, -- [31]
				4932, -- [32]
				3613, -- [33]
				3613, -- [34]
				3613, -- [35]
				4488, -- [36]
				4488, -- [37]
				3213, -- [38]
				3213, -- [39]
				3213, -- [40]
				3213, -- [41]
				3381, -- [42]
				5313, -- [43]
				5313, -- [44]
				5175, -- [45]
				5175, -- [46]
				5157, -- [47]
				4438, -- [48]
				4438, -- [49]
				4293, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				5313, -- [1]
				5313, -- [2]
				5313, -- [3]
				5313, -- [4]
				5313, -- [5]
				3493, -- [6]
				3493, -- [7]
				3613, -- [8]
				3613, -- [9]
				3613, -- [10]
				5313, -- [11]
				5313, -- [12]
				5313, -- [13]
				5313, -- [14]
				5313, -- [15]
				5313, -- [16]
				5313, -- [17]
				6110, -- [18]
				6110, -- [19]
				6110, -- [20]
				6110, -- [21]
				6110, -- [22]
				6110, -- [23]
				6110, -- [24]
				6110, -- [25]
				6110, -- [26]
				6110, -- [27]
				6110, -- [28]
				6110, -- [29]
				6110, -- [30]
				6110, -- [31]
				6110, -- [32]
				3613, -- [33]
				3613, -- [34]
				3613, -- [35]
				5313, -- [36]
				5313, -- [37]
				3613, -- [38]
				3613, -- [39]
				3613, -- [40]
				3613, -- [41]
				3613, -- [42]
				5313, -- [43]
				5313, -- [44]
				5313, -- [45]
				5313, -- [46]
				5313, -- [47]
				5313, -- [48]
				5313, -- [49]
				5313, -- [50]
			},
			["NextEventNum"] = 33,
			["LastDamageTime"] = 43757.766,
			["LastEvents"] = {
				"夏光年 挥击 熊汏-黑龙费尔默 Hit -56 (Physical)", -- [1]
				"熊汏-黑龙费尔默 荆棘术 夏光年 Hit -18 (Nature)", -- [2]
				"夏光年 肉搏 熊汏-黑龙费尔默 Crit -294 (Physical)", -- [3]
				"熊汏-黑龙费尔默 荆棘术 夏光年 Hit -18 (Nature)", -- [4]
				"熊汏-黑龙费尔默 月火术 (伤害/跳) 夏光年 Tick -145 (Arcane)", -- [5]
				"夏光年 月火术 (伤害/跳) 贴身施法 Tick -107 (Arcane)", -- [6]
				"夏光年 月火术 (伤害/跳) 贴身施法 Tick -106 (Arcane)", -- [7]
				"夏光年 月火术 (伤害/跳) 贴身施法 Absorb -106 (106 被吸收) (Arcane)", -- [8]
				"夏光年 月火术 熊汏-黑龙费尔默 Hit -235 (Arcane)", -- [9]
				"狩望者-黑龙费尔默 烈焰弹 夏光年 Crit -97 (Fire)", -- [10]
				"夏光年 月火术 (伤害/跳) 熊汏-黑龙费尔默 Tick -106 (Arcane)", -- [11]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 夏光年 Tick -132 (Nature)", -- [12]
				"夏光年 月火术 (伤害/跳) 熊汏-黑龙费尔默 Tick -106 (Arcane)", -- [13]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 夏光年 Tick -131 (Nature)", -- [14]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 夏光年 Tick -131 (Nature)", -- [15]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 夏光年 Tick -131 (Nature)", -- [16]
				"狩望者-黑龙费尔默 毒蛇钉刺 (伤害/跳) 夏光年 Tick -131 (Nature)", -- [17]
				"夏光年 肉搏 红丶枫-逐风者 Hit -230 (Physical)", -- [18]
				"向天歌-黑龙费尔默 冰霜新星 夏光年 Hit -26 (Frost)", -- [19]
				"向天歌-黑龙费尔默 吞噬之影 夏光年 Hit -100 (Shadow)", -- [20]
				"夏光年 挥击 向天歌-黑龙费尔默 Absorb -89 (89 被吸收) (Physical)", -- [21]
				"夏光年 挥击 红丶枫-逐风者 Hit -82 (Physical)", -- [22]
				"红丶枫-逐风者 肉搏 夏光年 Miss (1)", -- [23]
				"红丶枫-逐风者 肉搏 夏光年 Hit -45 (Physical)", -- [24]
				"夏光年 荆棘术 红丶枫-逐风者 Hit -20 (Nature)", -- [25]
				"夏光年 挥击 向天歌-黑龙费尔默 Dodge (Physical)", -- [26]
				"夏光年 肉搏 向天歌-黑龙费尔默 Crit -463 (Physical)", -- [27]
				"向天歌-黑龙费尔默 魔爆术 夏光年 Crit -420 (Arcane)", -- [28]
				"向天歌-黑龙费尔默 魔爆术 夏光年 Hit -290 (Arcane)", -- [29]
				"夏光年 肉搏 向天歌-黑龙费尔默 Dodge (1)", -- [30]
				"向天歌-黑龙费尔默 冰锥术 夏光年 Hit -527 (Frost)", -- [31]
				"夏光年 肉搏 向天歌-黑龙费尔默 Crit -431 (Physical)", -- [32]
				"夏光年 月火术 鄂尔多斯奶妈-黑龙费尔默 Hit -231 (Arcane)", -- [33]
				"夏光年 月火术 (伤害/跳) 鄂尔多斯奶妈-黑龙费尔默 Tick -106 (Arcane)", -- [34]
				"张主任-逐风者 火焰冲击 夏光年 Hit -561 (Fire)", -- [35]
				"夏光年 槌击 张主任-逐风者 Hit -411 (Physical)", -- [36]
				"张主任-逐风者 冰霜新星 夏光年 Hit -24 (Frost)", -- [37]
				"夏光年 月火术 张主任-逐风者 Crit -251 (56 被抵抗) (Arcane)", -- [38]
				"夏光年 月火术 (伤害/跳) 张主任-逐风者 Tick -95 (Arcane)", -- [39]
				"夏光年 月火术 (伤害/跳) 张主任-逐风者 Tick -95 (Arcane)", -- [40]
				"夏光年 纠缠根须 (伤害/跳) 张主任-逐风者 Tick -29 (Nature)", -- [41]
				"夏光年 治疗之触 特变电工 Hit +2045", -- [42]
				"夏光年 肉搏 贴身施法 Absorb -234 (234 被吸收) (1)", -- [43]
				"熊汏-黑龙费尔默 月火术 夏光年 Hit -138 (138 被抵抗) (Arcane)", -- [44]
				"夏光年 肉搏 熊汏-黑龙费尔默 Hit -141 (Physical)", -- [45]
				"熊汏-黑龙费尔默 荆棘术 夏光年 Hit -18 (Nature)", -- [46]
				"贴身施法 寒冰箭 夏光年 Hit -719 (Frost)", -- [47]
				"夏光年 挥击 熊汏-黑龙费尔默 Miss (Physical)", -- [48]
				"熊汏-黑龙费尔默 月火术 (伤害/跳) 夏光年 Tick -145 (Arcane)", -- [49]
				"狩望者-黑龙费尔默 多重射击 夏光年 Hit -294 (Physical)", -- [50]
			},
			["Name"] = "夏光年",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				43473.948, -- [1]
				43473.948, -- [2]
				43474.131, -- [3]
				43474.148, -- [4]
				43475.487, -- [5]
				43487.399, -- [6]
				43490.399, -- [7]
				43493.399, -- [8]
				43502.6, -- [9]
				43503.383, -- [10]
				43505.6, -- [11]
				43506.35, -- [12]
				43508.6, -- [13]
				43509.35, -- [14]
				43512.351, -- [15]
				43515.351, -- [16]
				43518.351, -- [17]
				43743.632, -- [18]
				43743.965, -- [19]
				43743.998, -- [20]
				43744.065, -- [21]
				43744.065, -- [22]
				43744.715, -- [23]
				43744.848, -- [24]
				43744.865, -- [25]
				43746.832, -- [26]
				43746.865, -- [27]
				43746.999, -- [28]
				43753.099, -- [29]
				43754.249, -- [30]
				43756.716, -- [31]
				43757.766, -- [32]
				43184.83, -- [33]
				43187.83, -- [34]
				43277.602, -- [35]
				43279.169, -- [36]
				43280.202, -- [37]
				43282.969, -- [38]
				43285.986, -- [39]
				43288.969, -- [40]
				43288.986, -- [41]
				43301.687, -- [42]
				43462.081, -- [43]
				43469.481, -- [44]
				43471.115, -- [45]
				43471.131, -- [46]
				43472.015, -- [47]
				43472.098, -- [48]
				43472.498, -- [49]
				43473.581, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["张主任-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["张主任-逐风者"] = {
									["count"] = 6,
								},
								["熊汏-黑龙费尔默"] = {
									["count"] = 6,
								},
								["鄂尔多斯奶妈-黑龙费尔默"] = {
									["count"] = 3,
								},
								["贴身施法"] = {
									["count"] = 9,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementDoneResist"] = {
						["Arcane"] = 56,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 11,
						},
					},
					["DamageTaken"] = 8420,
					["ElementDoneAbsorb"] = {
						["Physical"] = 243,
						["Melee"] = 469,
						["Arcane"] = 106,
					},
					["ElementTaken"] = {
						["Frost"] = 3816,
						["Melee"] = 140,
						["Arcane"] = 1737,
						["Shadow"] = 100,
						["Fire"] = 658,
						["Physical"] = 1205,
						["Nature"] = 764,
					},
					["DOT_Time"] = 27,
					["Damage"] = 7334,
					["TimeHeal"] = 1.5,
					["ElementDone"] = {
						["Arcane"] = 1761,
						["Physical"] = 2174,
						["Melee"] = 3332,
						["Nature"] = 67,
					},
					["DamagedWho"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 313,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 212,
								},
								["挥击"] = {
									["count"] = 56,
								},
								["荆棘术"] = {
									["count"] = 18,
								},
								["月火术"] = {
									["count"] = 235,
								},
								["肉搏"] = {
									["count"] = 766,
								},
							},
							["amount"] = 1600,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 220,
								},
								["槌击"] = {
									["count"] = 400,
								},
							},
							["amount"] = 620,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 89,
								},
								["肉搏"] = {
									["count"] = 894,
								},
							},
							["amount"] = 983,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 82,
								},
								["荆棘术"] = {
									["count"] = 20,
								},
								["肉搏"] = {
									["count"] = 230,
								},
							},
							["amount"] = 332,
						},
						["贴身施法"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 84,
								},
								["槌击"] = {
									["count"] = 693,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 319,
								},
								["肉搏"] = {
									["count"] = 388,
								},
							},
							["amount"] = 1484,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 29,
								},
								["槌击"] = {
									["count"] = 411,
								},
								["月火术"] = {
									["count"] = 251,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 190,
								},
							},
							["amount"] = 881,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 46,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 106,
								},
								["月火术"] = {
									["count"] = 231,
								},
								["肉搏"] = {
									["count"] = 361,
								},
							},
							["amount"] = 744,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 217,
								},
								["肉搏"] = {
									["count"] = 473,
								},
							},
							["amount"] = 690,
						},
					},
					["WhoDamaged"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 290,
								},
								["肉搏"] = {
									["count"] = 95,
								},
								["月火术"] = {
									["count"] = 138,
								},
								["荆棘术"] = {
									["count"] = 108,
								},
							},
							["amount"] = 631,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 710,
								},
								["吞噬之影"] = {
									["count"] = 100,
								},
								["冰霜新星"] = {
									["count"] = 26,
								},
								["冰锥术"] = {
									["count"] = 1033,
								},
							},
							["amount"] = 1869,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
						["贴身施法"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 599,
								},
								["寒冰箭"] = {
									["count"] = 719,
								},
								["冰锥术"] = {
									["count"] = 553,
								},
								["冰霜新星"] = {
									["count"] = 187,
								},
							},
							["amount"] = 2058,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 24,
								},
								["火焰冲击"] = {
									["count"] = 561,
								},
							},
							["amount"] = 585,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["烈焰弹"] = {
									["count"] = 97,
								},
								["自动射击"] = {
									["count"] = 538,
								},
								["多重射击"] = {
									["count"] = 667,
								},
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 656,
								},
							},
							["amount"] = 1958,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 186,
								},
								["冰锥术"] = {
									["count"] = 1088,
								},
							},
							["amount"] = 1274,
						},
					},
					["EnergyGainedFrom"] = {
						["夏光年"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["治疗之触"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["EnergyGain"] = 80,
					["PartialAbsorb"] = {
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["烈焰弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["吞噬之影"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 52.13999999999999,
					["InterruptData"] = {
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["星火术 (野性冲锋效果)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["治疗之触"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2045,
									["min"] = 2045,
									["count"] = 1,
									["amount"] = 2045,
								},
							},
							["count"] = 1,
							["amount"] = 2045,
						},
					},
					["ElementTakenResist"] = {
						["Arcane"] = 138,
					},
					["EnergyGained"] = {
						["激怒"] = {
							["Details"] = {
								["夏光年"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["治疗之触"] = {
									["count"] = 2045,
								},
							},
							["amount"] = 2045,
						},
					},
					["Healing"] = 2045,
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["治疗之触"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["精灵之火（野性）"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["贴身施法"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.53,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.530000000000001,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.88,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 5.38,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.02,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.93,
								},
								["肉搏"] = {
									["count"] = 3.03,
								},
							},
							["amount"] = 4.96,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 0.8,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.3,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.77,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["重击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.77,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
								["挥击"] = {
									["count"] = 2.48,
								},
								["荆棘术"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.2,
								},
							},
							["amount"] = 13.18,
						},
					},
					["RageGainedFrom"] = {
						["夏光年"] = {
							["Details"] = {
								["原始狂怒"] = {
									["count"] = 25,
								},
								["激怒"] = {
									["count"] = 170,
								},
							},
							["amount"] = 195,
						},
					},
					["Attacks"] = {
						["槌击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 693,
									["min"] = 693,
									["count"] = 1,
									["amount"] = 693,
								},
								["Hit"] = {
									["max"] = 411,
									["min"] = 313,
									["count"] = 3,
									["amount"] = 1124,
								},
							},
							["count"] = 5,
							["amount"] = 1817,
						},
						["重击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["挥击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 89,
									["min"] = 89,
									["count"] = 1,
									["amount"] = 89,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 84,
									["min"] = 46,
									["count"] = 4,
									["amount"] = 268,
								},
							},
							["count"] = 7,
							["amount"] = 357,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
							},
							["count"] = 1,
							["amount"] = 29,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 106,
									["min"] = 106,
									["count"] = 1,
									["amount"] = 106,
								},
								["Tick"] = {
									["max"] = 107,
									["min"] = 95,
									["count"] = 7,
									["amount"] = 721,
								},
							},
							["count"] = 8,
							["amount"] = 827,
						},
						["精灵之火（野性）"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 18,
									["count"] = 2,
									["amount"] = 38,
								},
							},
							["count"] = 2,
							["amount"] = 38,
						},
						["月火术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 251,
									["min"] = 251,
									["count"] = 1,
									["amount"] = 251,
								},
								["Hit"] = {
									["max"] = 235,
									["min"] = 217,
									["count"] = 3,
									["amount"] = 683,
								},
							},
							["count"] = 4,
							["amount"] = 934,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 235,
									["min"] = 154,
									["count"] = 3,
									["amount"] = 623,
								},
								["Crit"] = {
									["max"] = 463,
									["min"] = 294,
									["count"] = 4,
									["amount"] = 1549,
								},
								["Hit"] = {
									["max"] = 238,
									["min"] = 141,
									["count"] = 6,
									["amount"] = 1160,
								},
							},
							["count"] = 14,
							["amount"] = 3332,
						},
					},
					["RageGain"] = 195,
					["PartialResist"] = {
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["烈焰弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 138,
									["min"] = 138,
									["count"] = 1,
									["amount"] = 138,
								},
							},
							["count"] = 138,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["吞噬之影"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["TimeDamage"] = 50.63999999999999,
					["TimeDamaging"] = {
						["狩望者-黑龙费尔默"] = {
							["Details"] = {
								["精灵之火（野性）"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["贴身施法"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.53,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.530000000000001,
						},
						["鄂尔多斯奶妈-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 0.88,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 5.38,
						},
						["张主任-逐风者"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.02,
						},
						["像疯一样离去-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["向天歌-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.93,
								},
								["肉搏"] = {
									["count"] = 3.03,
								},
							},
							["amount"] = 4.96,
						},
						["红丶枫-逐风者"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 0.8,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.3,
						},
						["炽天使-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.77,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["重击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.77,
						},
						["熊汏-黑龙费尔默"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
								["挥击"] = {
									["count"] = 2.48,
								},
								["荆棘术"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.2,
								},
							},
							["amount"] = 13.18,
						},
					},
					["Interrupts"] = 1,
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 14,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["RageGained"] = {
						["原始狂怒"] = {
							["Details"] = {
								["夏光年"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
						["激怒"] = {
							["Details"] = {
								["夏光年"] = {
									["count"] = 170,
								},
							},
							["amount"] = 170,
						},
					},
				},
			},
			["UnitLockout"] = 43743.582,
			["LastActive"] = 43757.583,
		},
	},
	["FightNum"] = 14,
	["CombatTimes"] = {
		{
			42996.586, -- [1]
			43068.59, -- [2]
			"01:20:15", -- [3]
			"01:21:26", -- [4]
			"向天歌-黑龙费尔默", -- [5]
		}, -- [1]
		{
			43102.592, -- [1]
			43326.588, -- [2]
			"01:22:00", -- [3]
			"01:25:44", -- [4]
			"炽天使-黑龙费尔默", -- [5]
		}, -- [2]
		{
			43352.59, -- [1]
			43483.582, -- [2]
			"01:26:11", -- [3]
			"01:28:21", -- [4]
			"炽天使-黑龙费尔默", -- [5]
		}, -- [3]
		{
			43489.582, -- [1]
			43613.591, -- [2]
			"01:28:28", -- [3]
			"01:30:31", -- [4]
			"贴身施法", -- [5]
		}, -- [4]
		{
			43615.591, -- [1]
			43659.594, -- [2]
			"01:30:33", -- [3]
			"01:31:17", -- [4]
			"Environment", -- [5]
		}, -- [5]
		{
			43713.597, -- [1]
			43769.583, -- [2]
			"01:32:12", -- [3]
			"01:33:07", -- [4]
			"丧尸暴龙-逐风者", -- [5]
		}, -- [6]
		{
			43770.583, -- [1]
			43788.584, -- [2]
			"01:33:09", -- [3]
			"01:33:26", -- [4]
			"张主任-逐风者", -- [5]
		}, -- [7]
		{
			43828.587, -- [1]
			43878.589, -- [2]
			"01:34:06", -- [3]
			"01:34:56", -- [4]
			"红丶枫-逐风者", -- [5]
		}, -- [8]
		{
			43901.591, -- [1]
			43951.594, -- [2]
			"01:35:20", -- [3]
			"01:36:09", -- [4]
			"像疯一样离去-火妖鲁西弗隆", -- [5]
		}, -- [9]
		{
			43952.594, -- [1]
			44020.581, -- [2]
			"01:36:10", -- [3]
			"01:37:18", -- [4]
			"炽天使-黑龙费尔默", -- [5]
		}, -- [10]
		{
			44024.581, -- [1]
			44066.584, -- [2]
			"01:37:23", -- [3]
			"01:38:04", -- [4]
			"秃老亮-黑龙费尔默", -- [5]
		}, -- [11]
		{
			44090.585, -- [1]
			44319.582, -- [2]
			"01:38:28", -- [3]
			"01:42:17", -- [4]
			"丧尸暴龙-逐风者", -- [5]
		}, -- [12]
		{
			44340.583, -- [1]
			44351.583, -- [2]
			"01:42:39", -- [3]
			"01:42:49", -- [4]
			"耍下-黑龙费尔默", -- [5]
		}, -- [13]
		{
			44364.584, -- [1]
			44442.178, -- [2]
			"01:43:02", -- [3]
			"01:44:20", -- [4]
			"耍下-黑龙费尔默", -- [5]
		}, -- [14]
	},
	["FoughtWho"] = {
	},
}
