
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["TimeLast"] = {
				["TimeHeal"] = 1694.826,
				["Dispelled"] = 1623.824,
				["OVERALL"] = 1698.824,
				["DamageTaken"] = 1698.824,
				["HealingTaken"] = 1694.826,
				["Healing"] = 1694.826,
				["RageGain"] = 1653.823,
				["Interrupts"] = 1682.825,
				["TimeDamage"] = 1697.826,
				["DeathCount"] = 1698.824,
				["ActiveTime"] = 1697.826,
				["DOT_Time"] = 1696.84,
				["Damage"] = 1697.826,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"MISC", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"MISC", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["Healing"] = {
					104, -- [1]
				},
				["DamageTaken"] = {
					15036, -- [1]
				},
				["HealingTaken"] = {
					104, -- [1]
				},
				["RageGain"] = {
					118, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					88.34000000000003, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["ActiveTime"] = {
					89.84000000000003, -- [1]
				},
				["DOT_Time"] = {
					69, -- [1]
				},
				["Damage"] = {
					21968, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["LastHealTime"] = 1695.701,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						false, -- [37]
						false, -- [38]
						false, -- [39]
						false, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
					},
					["Messages"] = {
						"特变电工 肉搏 卡乌恩 Hit -421 (Physical)", -- [1]
						"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [2]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [3]
						"特变电工 拦截昏迷 扎心德勒-火妖鲁西弗隆 Hit -25 (Physical)", -- [4]
						"特变电工 断筋 扎心德勒-火妖鲁西弗隆 Crit -31 (Physical)", -- [5]
						"特变电工 肉搏 扎心德勒-火妖鲁西弗隆 Hit -243 (Physical)", -- [6]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [7]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [8]
						"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [9]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [10]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [11]
						"扎恩霍恩 肉搏 特变电工 Hit -70 (Physical)", -- [12]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [13]
						"特变电工 重伤 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -34 (Physical)", -- [14]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [15]
						"特变电工 肉搏 扎心德勒-火妖鲁西弗隆 Hit -223 (Physical)", -- [16]
						"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [17]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [18]
						"扎恩霍恩 肉搏 特变电工 Hit -60 (Physical)", -- [19]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [20]
						"特变电工 重伤 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -34 (Physical)", -- [21]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -119 (Shadow)", -- [22]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [23]
						"卡乌恩 肉搏 特变电工 Crit -220 (Physical)", -- [24]
						"特变电工 致死打击 扎心德勒-火妖鲁西弗隆 Hit -443 (Physical)", -- [25]
						"扎恩霍恩 肉搏 特变电工 Hit -61 (Physical)", -- [26]
						"特变电工 肉搏 扎心德勒-火妖鲁西弗隆 Hit -307 (Physical)", -- [27]
						"特变电工 战士的决心 特变电工 Hit +104", -- [28]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [29]
						"卡乌恩 剧痛鞭笞 特变电工 Hit -148 (Shadow)", -- [30]
						"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -207 (Shadow)", -- [31]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -88 (Shadow)", -- [32]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -119 (Shadow)", -- [33]
						"卡乌恩 肉搏 特变电工 Hit -97 (Physical)", -- [34]
						"扎恩霍恩 肉搏 特变电工 Hit -69 (Physical)", -- [35]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -118 (Shadow)", -- [36]
						"特变电工 重伤 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -34 (Physical)", -- [37]
						"特变电工 旋风斩 卡乌恩 Hit -428 (Physical)", -- [38]
						"特变电工 旋风斩 扎恩霍恩 Hit -426 (Physical)", -- [39]
						"特变电工 旋风斩 扎心德勒-火妖鲁西弗隆 Hit -427 (Physical)", -- [40]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -167 (Shadow)", -- [41]
						"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -169 (Shadow)", -- [42]
						"扎心德勒-火妖鲁西弗隆 暗影灼烧 特变电工 Hit -683 (Shadow)", -- [43]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -88 (Shadow)", -- [44]
						"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -207 (Shadow)", -- [45]
						"特变电工死亡。", -- [46]
					},
					["DeathAt"] = 1700.835,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
					},
					["MessageTimes"] = {
						-14.60199999999986, -- [1]
						-12.3449999999998, -- [2]
						-11.84099999999989, -- [3]
						-11.00199999999995, -- [4]
						-10.30499999999984, -- [5]
						-10.19200000000001, -- [6]
						-9.838999999999942, -- [7]
						-9.805999999999813, -- [8]
						-9.358999999999924, -- [9]
						-9.306999999999789, -- [10]
						-7.858999999999924, -- [11]
						-7.508999999999787, -- [12]
						-7.308999999999969, -- [13]
						-7.274999999999864, -- [14]
						-6.824999999999818, -- [15]
						-6.774999999999864, -- [16]
						-6.358999999999924, -- [17]
						-5.841999999999871, -- [18]
						-5.507999999999811, -- [19]
						-5.307999999999993, -- [20]
						-4.257999999999811, -- [21]
						-3.839999999999918, -- [22]
						-3.824999999999818, -- [23]
						-3.806999999999789, -- [24]
						-3.625, -- [25]
						-3.502999999999929, -- [26]
						-3.367999999999938, -- [27]
						-3.349999999999909, -- [28]
						-3.299999999999955, -- [29]
						-3.048999999999978, -- [30]
						-3.013999999999896, -- [31]
						-2.144999999999982, -- [32]
						-1.846000000000004, -- [33]
						-1.800999999999931, -- [34]
						-1.476999999999862, -- [35]
						-1.320999999999913, -- [36]
						-1.274999999999864, -- [37]
						-1.000999999999976, -- [38]
						-1.000999999999976, -- [39]
						-1.000999999999976, -- [40]
						-0.8269999999999982, -- [41]
						-0.3650000000000091, -- [42]
						-0.2959999999998217, -- [43]
						-0.140999999999849, -- [44]
						-0.02099999999995816, -- [45]
						0, -- [46]
					},
					["HealthMax"] = {
						4819, -- [1]
						4819, -- [2]
						4819, -- [3]
						4819, -- [4]
						4819, -- [5]
						4819, -- [6]
						4819, -- [7]
						4819, -- [8]
						4819, -- [9]
						4819, -- [10]
						4819, -- [11]
						4819, -- [12]
						4819, -- [13]
						4819, -- [14]
						4819, -- [15]
						4819, -- [16]
						4819, -- [17]
						4819, -- [18]
						4819, -- [19]
						4819, -- [20]
						4819, -- [21]
						4819, -- [22]
						4819, -- [23]
						4819, -- [24]
						4819, -- [25]
						4819, -- [26]
						4819, -- [27]
						4819, -- [28]
						4819, -- [29]
						4819, -- [30]
						4819, -- [31]
						4819, -- [32]
						4819, -- [33]
						4819, -- [34]
						4819, -- [35]
						4819, -- [36]
						4819, -- [37]
						4819, -- [38]
						4819, -- [39]
						4819, -- [40]
						4819, -- [41]
						4819, -- [42]
						4819, -- [43]
						4819, -- [44]
						4819, -- [45]
						4819, -- [46]
					},
					["Health"] = {
						4113, -- [1]
						4113, -- [2]
						3945, -- [3]
						3874, -- [4]
						3874, -- [5]
						3874, -- [6]
						3874, -- [7]
						3803, -- [8]
						3635, -- [9]
						3467, -- [10]
						3397, -- [11]
						3326, -- [12]
						3256, -- [13]
						3186, -- [14]
						3186, -- [15]
						3018, -- [16]
						3018, -- [17]
						2850, -- [18]
						2779, -- [19]
						2719, -- [20]
						2649, -- [21]
						2649, -- [22]
						2530, -- [23]
						2530, -- [24]
						2142, -- [25]
						2142, -- [26]
						2081, -- [27]
						2081, -- [28]
						2185, -- [29]
						2114, -- [30]
						1966, -- [31]
						1759, -- [32]
						1671, -- [33]
						1552, -- [34]
						1455, -- [35]
						1386, -- [36]
						1268, -- [37]
						1268, -- [38]
						1268, -- [39]
						1268, -- [40]
						1268, -- [41]
						1101, -- [42]
						932, -- [43]
						249, -- [44]
						161, -- [45]
						0, -- [46]
					},
					["KilledBy"] = "扎心德勒-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"HEAL", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"MISC", -- [46]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						false, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						false, -- [33]
						false, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
					},
					["Messages"] = {
						"暮年-逐风者 火焰冲击 特变电工 Resist (Fire)", -- [1]
						"暮年-逐风者 冰霜新星 特变电工 Hit -28 (Frost)", -- [2]
						"特变电工 肉搏 暮年-逐风者 Absorb -332 (332 被吸收) (1)", -- [3]
						"特变电工 断筋 暮年-逐风者 Absorb -35 (35 被吸收) (Physical)", -- [4]
						"特变电工 断筋 暮年-逐风者 Absorb -78 (78 被吸收) (Physical)", -- [5]
						"特变电工 拦截昏迷 暮年-逐风者 Absorb -49 (49 被吸收) (Physical)", -- [6]
						"特变电工 肉搏 暮年-逐风者 Absorb -18 (1)", -- [7]
						"特变电工 重伤 (伤害/跳) 暮年-逐风者 Tick -53 (18 被吸收) (Physical)", -- [8]
						"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -89 (Shadow)", -- [9]
						"皇鹰-逐风者 冰霜新星 特变电工 Crit -63 (Frost)", -- [10]
						"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -89 (Shadow)", -- [11]
						"莱荫-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -208 (Shadow)", -- [12]
						"特变电工 重伤 (伤害/跳) 暮年-逐风者 Tick -71 (Physical)", -- [13]
						"暮年-逐风者 火焰冲击 特变电工 Crit -733 (Fire)", -- [14]
						"利群-逐风者 精神鞭笞 (伤害/跳) 特变电工 Tick -188 (Shadow)", -- [15]
						"皇家特工-逐风者 肉搏 特变电工 Hit -101 (Physical)", -- [16]
						"皇家特工-逐风者 邪恶攻击 特变电工 Crit -343 (Physical)", -- [17]
						"为了青春-黑龙费尔默 恐惧术 特变电工 Immune (Shadow)", -- [18]
						"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -89 (Shadow)", -- [19]
						"莱荫-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -74 (Shadow)", -- [20]
						"利群-逐风者 精神鞭笞 (伤害/跳) 特变电工 Tick -188 (Shadow)", -- [21]
						"皇家特工-逐风者 肉搏 特变电工 Hit -45 (Physical)", -- [22]
						"皇家特工-逐风者 邪恶攻击 特变电工 Hit -159 (Physical)", -- [23]
						"暮年-逐风者 冰锥术 特变电工 Hit -595 (Frost)", -- [24]
						"莱荫-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -208 (Shadow)", -- [25]
						"利群-逐风者 精神鞭笞 (伤害/跳) 特变电工 Tick -188 (Shadow)", -- [26]
						"皇家特工-逐风者 刺骨 特变电工 Crit -675 (Physical)", -- [27]
						"特变电工 旋风斩 皇家特工-逐风者 Absorb -480 (480 被吸收) (Physical)", -- [28]
						"特变电工 重伤 (伤害/跳) 暮年-逐风者 Tick -70 (Physical)", -- [29]
						"皇家特工-逐风者 肉搏 特变电工 Hit -120 (Physical)", -- [30]
						"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -89 (Shadow)", -- [31]
						"皇家特工-逐风者 肉搏 特变电工 Hit -59 (Physical)", -- [32]
						"特变电工 肉搏 皇家特工-逐风者 Absorb -639 (1)", -- [33]
						"特变电工 肉搏 皇家特工-逐风者 Crit -257 (639 被吸收) (Physical)", -- [34]
						"皇家特工-逐风者 致残毒药 特变电工 Resist (Nature)", -- [35]
						"皇家特工-逐风者 邪恶攻击 特变电工 Crit -352 (Physical)", -- [36]
						"特变电工死亡。", -- [37]
					},
					["DeathAt"] = 1568.834,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
					},
					["MessageTimes"] = {
						-13.21400000000017, -- [1]
						-11.70600000000013, -- [2]
						-11.6110000000001, -- [3]
						-11.50700000000006, -- [4]
						-9.986000000000104, -- [5]
						-7.922000000000026, -- [6]
						-6.980000000000018, -- [7]
						-6.980000000000018, -- [8]
						-6.830000000000155, -- [9]
						-5.124000000000024, -- [10]
						-4.819000000000187, -- [11]
						-4.327999999999975, -- [12]
						-3.979000000000042, -- [13]
						-3.513000000000147, -- [14]
						-3.317999999999984, -- [15]
						-3.109000000000151, -- [16]
						-3.095000000000027, -- [17]
						-3.006000000000086, -- [18]
						-2.833000000000084, -- [19]
						-2.82100000000014, -- [20]
						-2.313000000000102, -- [21]
						-2.246000000000095, -- [22]
						-2.096000000000004, -- [23]
						-1.993000000000166, -- [24]
						-1.326000000000022, -- [25]
						-1.304000000000087, -- [26]
						-1.080000000000155, -- [27]
						-0.9960000000000946, -- [28]
						-0.95900000000006, -- [29]
						-0.8960000000001855, -- [30]
						-0.8410000000001219, -- [31]
						-0.5310000000001764, -- [32]
						-0.1040000000000418, -- [33]
						-0.1040000000000418, -- [34]
						-0.0340000000001055, -- [35]
						0, -- [36]
						0, -- [37]
					},
					["HealthMax"] = {
						4819, -- [1]
						4819, -- [2]
						4819, -- [3]
						4819, -- [4]
						4819, -- [5]
						4819, -- [6]
						4819, -- [7]
						4819, -- [8]
						4819, -- [9]
						4819, -- [10]
						4819, -- [11]
						4819, -- [12]
						4819, -- [13]
						4819, -- [14]
						4819, -- [15]
						4819, -- [16]
						4819, -- [17]
						4819, -- [18]
						4819, -- [19]
						4819, -- [20]
						4819, -- [21]
						4819, -- [22]
						4819, -- [23]
						4819, -- [24]
						4819, -- [25]
						4819, -- [26]
						4819, -- [27]
						4819, -- [28]
						4819, -- [29]
						4819, -- [30]
						4819, -- [31]
						4819, -- [32]
						4819, -- [33]
						4819, -- [34]
						4819, -- [35]
						4819, -- [36]
						4819, -- [37]
					},
					["Health"] = {
						4819, -- [1]
						4819, -- [2]
						4791, -- [3]
						4791, -- [4]
						4791, -- [5]
						4454, -- [6]
						4454, -- [7]
						4454, -- [8]
						4454, -- [9]
						4365, -- [10]
						4302, -- [11]
						4213, -- [12]
						4005, -- [13]
						4005, -- [14]
						3272, -- [15]
						3084, -- [16]
						3084, -- [17]
						2640, -- [18]
						2640, -- [19]
						2640, -- [20]
						2477, -- [21]
						2289, -- [22]
						2244, -- [23]
						2085, -- [24]
						1490, -- [25]
						1490, -- [26]
						1094, -- [27]
						419, -- [28]
						419, -- [29]
						419, -- [30]
						299, -- [31]
						210, -- [32]
						151, -- [33]
						151, -- [34]
						151, -- [35]
						151, -- [36]
						0, -- [37]
					},
					["KilledBy"] = "皇家特工-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"MISC", -- [37]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
					},
					["Messages"] = {
						"特变电工 旋风斩 丶舊知己丶-逐风者 Crit -912 (Physical)", -- [1]
						"暴走扁哥-黑龙费尔默 腐蚀术 特变电工 Resist (Shadow)", -- [2]
						"扎恩霍恩 dispels 特变电工 魔法抑制 (吞噬魔法)", -- [3]
						"特变电工 肉搏 为了青春-黑龙费尔默 Hit -356 (Physical)", -- [4]
						"特变电工 拳击 为了青春-黑龙费尔默 Crit -84 (Physical)", -- [5]
						"特变电工 断筋 为了青春-黑龙费尔默 Crit -83 (Physical)", -- [6]
						"扎恩霍恩 肉搏 特变电工 Hit -66 (Physical)", -- [7]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [8]
						"特变电工 肉搏 为了青春-黑龙费尔默 Absorb -398 (398 被吸收) (1)", -- [9]
						"扎恩霍恩 肉搏 特变电工 Hit -56 (Physical)", -- [10]
						"暴走扁哥-黑龙费尔默 献祭 特变电工 Crit -500 (Fire)", -- [11]
						"特变电工 重伤 (伤害/跳) 为了青春-黑龙费尔默 Absorb -70 (70 被吸收) (Physical)", -- [12]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [13]
						"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -194 (Shadow)", -- [14]
						"Moana-逐风者 灼热之痛 特变电工 Hit -382 (Fire)", -- [15]
						"扎恩霍恩 肉搏 特变电工 Hit -66 (Physical)", -- [16]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -83 (Shadow)", -- [17]
						"Moana-逐风者 灼热之痛 特变电工 Crit -710 (Fire)", -- [18]
						"暮年-逐风者 寒冰箭 特变电工 Crit -1834 (Frost)", -- [19]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [20]
						"暴走扁哥-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -139 (Fire)", -- [21]
						"特变电工 重伤 (伤害/跳) 为了青春-黑龙费尔默 Absorb -71 (71 被吸收) (Physical)", -- [22]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -83 (Shadow)", -- [23]
						"为了青春-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -196 (Shadow)", -- [24]
						"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -193 (Shadow)", -- [25]
						"Moana-逐风者 灼热之痛 特变电工 Hit -352 (Fire)", -- [26]
						"特变电工死亡。", -- [27]
					},
					["DeathAt"] = 1486.829,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["MessageTimes"] = {
						-13.94100000000003, -- [1]
						-8.717000000000098, -- [2]
						-8.717000000000098, -- [3]
						-8.353000000000065, -- [4]
						-8.271999999999935, -- [5]
						-6.753999999999905, -- [6]
						-6.73700000000008, -- [7]
						-5.238000000000056, -- [8]
						-4.951999999999998, -- [9]
						-4.719000000000051, -- [10]
						-4.11200000000008, -- [11]
						-3.723999999999933, -- [12]
						-3.229000000000042, -- [13]
						-3.106999999999971, -- [14]
						-3.046000000000049, -- [15]
						-2.712999999999965, -- [16]
						-2.712999999999965, -- [17]
						-1.535000000000082, -- [18]
						-1.356999999999971, -- [19]
						-1.221000000000004, -- [20]
						-1.11200000000008, -- [21]
						-0.7180000000000746, -- [22]
						-0.7180000000000746, -- [23]
						-0.2210000000000036, -- [24]
						-0.1140000000000327, -- [25]
						-0.02899999999999636, -- [26]
						0, -- [27]
					},
					["HealthMax"] = {
						5519, -- [1]
						5519, -- [2]
						5519, -- [3]
						5519, -- [4]
						5519, -- [5]
						5519, -- [6]
						5519, -- [7]
						5519, -- [8]
						5519, -- [9]
						5519, -- [10]
						5519, -- [11]
						5519, -- [12]
						5519, -- [13]
						5519, -- [14]
						5519, -- [15]
						5519, -- [16]
						5519, -- [17]
						5519, -- [18]
						5519, -- [19]
						5519, -- [20]
						5519, -- [21]
						5519, -- [22]
						5519, -- [23]
						5519, -- [24]
						5519, -- [25]
						5519, -- [26]
						4819, -- [27]
					},
					["Health"] = {
						4767, -- [1]
						4767, -- [2]
						4767, -- [3]
						4767, -- [4]
						4767, -- [5]
						4767, -- [6]
						4767, -- [7]
						4701, -- [8]
						4630, -- [9]
						4630, -- [10]
						4574, -- [11]
						4074, -- [12]
						4074, -- [13]
						4004, -- [14]
						3810, -- [15]
						3428, -- [16]
						3428, -- [17]
						3279, -- [18]
						2569, -- [19]
						735, -- [20]
						665, -- [21]
						526, -- [22]
						526, -- [23]
						443, -- [24]
						247, -- [25]
						54, -- [26]
						0, -- [27]
					},
					["KilledBy"] = "Moana-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"MISC", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"MISC", -- [27]
					},
				}, -- [3]
			},
			["level"] = 60,
			["LastDamageAbility"] = "腐蚀术 (伤害/跳)",
			["LastFightIn"] = 2,
			["type"] = "Self",
			["LastDamageTaken"] = 207,
			["LastEventHealth"] = {
				3018, -- [1]
				2850, -- [2]
				2779, -- [3]
				2719, -- [4]
				2649, -- [5]
				2649, -- [6]
				2530, -- [7]
				2530, -- [8]
				2142, -- [9]
				2142, -- [10]
				2081, -- [11]
				2081, -- [12]
				2185, -- [13]
				2114, -- [14]
				1966, -- [15]
				1759, -- [16]
				1671, -- [17]
				1552, -- [18]
				1455, -- [19]
				1386, -- [20]
				1268, -- [21]
				1268, -- [22]
				1268, -- [23]
				1268, -- [24]
				1268, -- [25]
				1101, -- [26]
				932, -- [27]
				249, -- [28]
				161, -- [29]
				0, -- [30]
				4113, -- [31]
				4113, -- [32]
				4113, -- [33]
				4113, -- [34]
				4113, -- [35]
				4113, -- [36]
				3945, -- [37]
				3874, -- [38]
				3874, -- [39]
				3874, -- [40]
				3874, -- [41]
				3803, -- [42]
				3635, -- [43]
				3467, -- [44]
				3397, -- [45]
				3326, -- [46]
				3256, -- [47]
				3186, -- [48]
				3186, -- [49]
				3018, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4819, -- [1]
				4819, -- [2]
				4819, -- [3]
				4819, -- [4]
				4819, -- [5]
				4819, -- [6]
				4819, -- [7]
				4819, -- [8]
				4819, -- [9]
				4819, -- [10]
				4819, -- [11]
				4819, -- [12]
				4819, -- [13]
				4819, -- [14]
				4819, -- [15]
				4819, -- [16]
				4819, -- [17]
				4819, -- [18]
				4819, -- [19]
				4819, -- [20]
				4819, -- [21]
				4819, -- [22]
				4819, -- [23]
				4819, -- [24]
				4819, -- [25]
				4819, -- [26]
				4819, -- [27]
				4819, -- [28]
				4819, -- [29]
				4819, -- [30]
				4819, -- [31]
				4819, -- [32]
				4819, -- [33]
				4819, -- [34]
				4819, -- [35]
				4819, -- [36]
				4819, -- [37]
				4819, -- [38]
				4819, -- [39]
				4819, -- [40]
				4819, -- [41]
				4819, -- [42]
				4819, -- [43]
				4819, -- [44]
				4819, -- [45]
				4819, -- [46]
				4819, -- [47]
				4819, -- [48]
				4819, -- [49]
				4819, -- [50]
			},
			["NextEventNum"] = 31,
			["LastDamageTime"] = 1698.05,
			["LastEvents"] = {
				"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [1]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [2]
				"扎恩霍恩 肉搏 特变电工 Hit -60 (Physical)", -- [3]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [4]
				"特变电工 重伤 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -34 (Physical)", -- [5]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -119 (Shadow)", -- [6]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [7]
				"卡乌恩 肉搏 特变电工 Crit -220 (Physical)", -- [8]
				"特变电工 致死打击 扎心德勒-火妖鲁西弗隆 Hit -443 (Physical)", -- [9]
				"扎恩霍恩 肉搏 特变电工 Hit -61 (Physical)", -- [10]
				"特变电工 肉搏 扎心德勒-火妖鲁西弗隆 Hit -307 (Physical)", -- [11]
				"特变电工 战士的决心 特变电工 Hit +104", -- [12]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [13]
				"卡乌恩 剧痛鞭笞 特变电工 Hit -148 (Shadow)", -- [14]
				"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -207 (Shadow)", -- [15]
				"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -88 (Shadow)", -- [16]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -119 (Shadow)", -- [17]
				"卡乌恩 肉搏 特变电工 Hit -97 (Physical)", -- [18]
				"扎恩霍恩 肉搏 特变电工 Hit -69 (Physical)", -- [19]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -118 (Shadow)", -- [20]
				"特变电工 重伤 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -34 (Physical)", -- [21]
				"特变电工 旋风斩 卡乌恩 Hit -428 (Physical)", -- [22]
				"特变电工 旋风斩 扎恩霍恩 Hit -426 (Physical)", -- [23]
				"特变电工 旋风斩 扎心德勒-火妖鲁西弗隆 Hit -427 (Physical)", -- [24]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -167 (Shadow)", -- [25]
				"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -169 (Shadow)", -- [26]
				"扎心德勒-火妖鲁西弗隆 暗影灼烧 特变电工 Hit -683 (Shadow)", -- [27]
				"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -88 (Shadow)", -- [28]
				"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -207 (Shadow)", -- [29]
				"特变电工死亡。", -- [30]
				"特变电工 肉搏 卡乌恩 Hit -432 (Physical)", -- [31]
				"特变电工 断筋 卡乌恩 Hit -23 (Physical)", -- [32]
				"特变电工 拳击 卡乌恩 Hit -28 (Physical)", -- [33]
				"特变电工 interrupts 卡乌恩 诱惑 (拳击)", -- [34]
				"特变电工 肉搏 卡乌恩 Hit -421 (Physical)", -- [35]
				"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [36]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [37]
				"特变电工 拦截昏迷 扎心德勒-火妖鲁西弗隆 Hit -25 (Physical)", -- [38]
				"特变电工 断筋 扎心德勒-火妖鲁西弗隆 Crit -31 (Physical)", -- [39]
				"特变电工 肉搏 扎心德勒-火妖鲁西弗隆 Hit -243 (Physical)", -- [40]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [41]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [42]
				"Moana-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [43]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [44]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -71 (Shadow)", -- [45]
				"扎恩霍恩 肉搏 特变电工 Hit -70 (Physical)", -- [46]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -70 (Shadow)", -- [47]
				"特变电工 重伤 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -34 (Physical)", -- [48]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -168 (Shadow)", -- [49]
				"特变电工 肉搏 扎心德勒-火妖鲁西弗隆 Hit -223 (Physical)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				1692.692, -- [1]
				1693.209, -- [2]
				1693.543, -- [3]
				1693.743, -- [4]
				1694.793, -- [5]
				1695.211, -- [6]
				1695.226, -- [7]
				1695.244, -- [8]
				1695.426, -- [9]
				1695.548, -- [10]
				1695.683, -- [11]
				1695.701, -- [12]
				1695.751, -- [13]
				1696.002, -- [14]
				1696.037, -- [15]
				1696.906, -- [16]
				1697.205, -- [17]
				1697.25, -- [18]
				1697.574, -- [19]
				1697.73, -- [20]
				1697.776, -- [21]
				1698.05, -- [22]
				1698.05, -- [23]
				1698.05, -- [24]
				1698.224, -- [25]
				1698.686, -- [26]
				1698.755, -- [27]
				1698.91, -- [28]
				1699.03, -- [29]
				1699.051, -- [30]
				1681.05, -- [31]
				1681.425, -- [32]
				1683.481, -- [33]
				1683.481, -- [34]
				1684.449, -- [35]
				1686.706, -- [36]
				1687.21, -- [37]
				1688.049, -- [38]
				1688.746, -- [39]
				1688.859, -- [40]
				1689.212, -- [41]
				1689.245, -- [42]
				1689.692, -- [43]
				1689.744, -- [44]
				1691.192, -- [45]
				1691.542, -- [46]
				1691.742, -- [47]
				1691.776, -- [48]
				1692.226, -- [49]
				1692.276, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["暮年-逐风者"] = {
									["count"] = 0,
								},
								["小猫掉毛-逐风者"] = {
									["count"] = 18,
								},
								["皇家特工-逐风者"] = {
									["count"] = 6,
								},
								["克萨德鲁姆"] = {
									["count"] = 12,
								},
								["扎心德勒-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
							},
							["amount"] = 45,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4873,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 30,
								},
							},
							["amount"] = 50,
						},
					},
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 23,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 27,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						{
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						}, -- [1]
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 13,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 23,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 37,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Holy"] = 340,
						["Shadow"] = 3779,
						["Melee"] = 724,
						["Frost"] = 30,
					},
					["DOT_Time"] = 45,
					["Damage"] = 14989,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						532, -- [1]
						["Melee"] = 1676,
						["Physical"] = 465,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						532, -- [1]
						["Melee"] = 7836,
						["Physical"] = 6621,
					},
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 888,
								},
								["英勇打击"] = {
									["count"] = 393,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 102,
								},
								["旋风斩"] = {
									["count"] = 427,
								},
								["断筋"] = {
									["count"] = 62,
								},
								["拦截昏迷"] = {
									["count"] = 25,
								},
								["肉搏"] = {
									["count"] = 3081,
								},
							},
							["amount"] = 4978,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 920,
								},
								["压制"] = {
									["count"] = 331,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 287,
								},
								["断筋"] = {
									["count"] = 69,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 532,
								},
								["肉搏"] = {
									["count"] = 1124,
								},
							},
							["amount"] = 3263,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 283,
								},
								["肉搏"] = {
									["count"] = 353,
								},
							},
							["amount"] = 709,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 51,
								},
								["斩杀"] = {
									["count"] = 528,
								},
								["肉搏"] = {
									["count"] = 400,
								},
							},
							["amount"] = 979,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 379,
								},
								["断筋"] = {
									["count"] = 32,
								},
								["旋风斩"] = {
									["count"] = 645,
								},
								["肉搏"] = {
									["count"] = 2025,
								},
							},
							["amount"] = 3081,
						},
						["卡乌恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 428,
								},
								["断筋"] = {
									["count"] = 23,
								},
								["拳击"] = {
									["count"] = 28,
								},
								["肉搏"] = {
									["count"] = 853,
								},
							},
							["amount"] = 1332,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 221,
								},
							},
							["amount"] = 221,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 426,
								},
							},
							["amount"] = 426,
						},
						["暮年-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 683,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 414,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 176,
								},
							},
							["amount"] = 1273,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 673,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 522,
								},
							},
							["amount"] = 1195,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 147,
								},
							},
							["amount"] = 147,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
						["卡乌恩"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 148,
								},
								["肉搏"] = {
									["count"] = 317,
								},
							},
							["amount"] = 465,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 260,
								},
							},
							["amount"] = 260,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 340,
								},
							},
							["amount"] = 340,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 671,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 399,
								},
							},
							["amount"] = 1070,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Melee"] = 5,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 104,
								},
							},
							["amount"] = 104,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 1,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.71,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 2.17,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.840000000000001,
								},
							},
							["amount"] = 17.22,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["压制"] = {
									["count"] = 1.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 1.47,
								},
							},
							["amount"] = 15.36,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.57,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 7.199999999999999,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 0.66,
								},
							},
							["amount"] = 2.43,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.25,
								},
							},
							["amount"] = 9.02,
						},
						["卡乌恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 0.38,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.47,
								},
							},
							["amount"] = 4.619999999999999,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["暮年-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
						["卡乌恩"] = {
							["Details"] = {
								["诱惑 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["战士的决心"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 104,
									["min"] = 104,
									["count"] = 1,
									["amount"] = 104,
								},
							},
							["count"] = 1,
							["amount"] = 104,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 104,
								},
							},
							["amount"] = 104,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 60.35,
					["Healing"] = 104,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 379,
									["min"] = 379,
									["count"] = 1,
									["amount"] = 379,
								},
								["Crit"] = {
									["max"] = 920,
									["min"] = 920,
									["count"] = 1,
									["amount"] = 920,
								},
								["Hit"] = {
									["max"] = 445,
									["min"] = 443,
									["count"] = 2,
									["amount"] = 888,
								},
							},
							["count"] = 4,
							["amount"] = 2187,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 393,
									["min"] = 393,
									["count"] = 1,
									["amount"] = 393,
								},
							},
							["count"] = 1,
							["amount"] = 393,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 48,
									["min"] = 48,
									["count"] = 1,
									["amount"] = 48,
								},
								["Tick"] = {
									["max"] = 111,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 845,
								},
							},
							["count"] = 15,
							["amount"] = 893,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 532,
									["min"] = 532,
									["count"] = 1,
									["amount"] = 532,
								},
							},
							["count"] = 1,
							["amount"] = 532,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 331,
									["min"] = 331,
									["count"] = 1,
									["amount"] = 331,
								},
							},
							["count"] = 1,
							["amount"] = 331,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 645,
									["min"] = 645,
									["count"] = 1,
									["amount"] = 645,
								},
								["Hit"] = {
									["max"] = 428,
									["min"] = 426,
									["count"] = 3,
									["amount"] = 1281,
								},
							},
							["count"] = 4,
							["amount"] = 1926,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 51,
									["min"] = 25,
									["count"] = 2,
									["amount"] = 76,
								},
							},
							["count"] = 2,
							["amount"] = 76,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 38,
									["min"] = 38,
									["count"] = 1,
									["amount"] = 38,
								},
								["Crit"] = {
									["max"] = 73,
									["min"] = 31,
									["count"] = 2,
									["amount"] = 104,
								},
								["Hit"] = {
									["max"] = 32,
									["min"] = 23,
									["count"] = 4,
									["amount"] = 117,
								},
							},
							["count"] = 7,
							["amount"] = 259,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 528,
									["min"] = 528,
									["count"] = 1,
									["amount"] = 528,
								},
							},
							["count"] = 1,
							["amount"] = 528,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 482,
									["min"] = 307,
									["count"] = 4,
									["amount"] = 1676,
								},
								["Hit"] = {
									["max"] = 432,
									["min"] = 223,
									["count"] = 12,
									["amount"] = 4007,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 592,
									["min"] = 79,
									["count"] = 4,
									["amount"] = 1800,
								},
								["Hit (被格挡)"] = {
									["max"] = 353,
									["min"] = 353,
									["count"] = 1,
									["amount"] = 353,
								},
							},
							["count"] = 22,
							["amount"] = 7836,
						},
					},
					["HealingTaken"] = 104,
					["RageGain"] = 50,
					["TimeDamage"] = 58.85,
					["TimeDamaging"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.25,
								},
							},
							["amount"] = 9.02,
						},
						["暮年-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["卡乌恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 0.38,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.47,
								},
							},
							["amount"] = 4.619999999999999,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["压制"] = {
									["count"] = 1.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 1.47,
								},
							},
							["amount"] = 15.36,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.71,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 2.17,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.840000000000001,
								},
							},
							["amount"] = 17.22,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.57,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 7.199999999999999,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 0.66,
								},
							},
							["amount"] = 2.43,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["暮年-逐风者"] = {
									["count"] = 12,
								},
								["小猫掉毛-逐风者"] = {
									["count"] = 18,
								},
								["扎心德勒-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
								["皇家特工-逐风者"] = {
									["count"] = 12,
								},
								["克萨德鲁姆"] = {
									["count"] = 12,
								},
								["为了青春-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 69,
						},
					},
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 41,
								},
							},
							["amount"] = 47,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 15,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 15036,
					["ElementDoneAbsorb"] = {
						532, -- [1]
						["Melee"] = 3045,
						["Physical"] = 1266,
					},
					["DeathCount"] = 3,
					["ElementTaken"] = {
						["Shadow"] = 6149,
						["Melee"] = 1237,
						["Arcane"] = 415,
						["Holy"] = 340,
						["Fire"] = 2816,
						["Physical"] = 1529,
						["Frost"] = 2550,
					},
					["DOT_Time"] = 69,
					["Damage"] = 21968,
					["TimeHeal"] = 1.5,
					["ElementDone"] = {
						532, -- [1]
						["Melee"] = 11690,
						["Physical"] = 9746,
					},
					["ElementHitsDone"] = {
						{
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						}, -- [1]
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 17,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 33,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 20,
								},
							},
							["amount"] = 57,
						},
					},
					["WhoDamaged"] = {
						["暮年-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 595,
								},
								["寒冰箭"] = {
									["count"] = 1834,
								},
								["火焰冲击"] = {
									["count"] = 733,
								},
								["冰霜新星"] = {
									["count"] = 28,
								},
							},
							["amount"] = 3190,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 671,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 139,
								},
								["献祭"] = {
									["count"] = 500,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 610,
								},
							},
							["amount"] = 1920,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 683,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 414,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 176,
								},
							},
							["amount"] = 1273,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 340,
								},
							},
							["amount"] = 340,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 147,
								},
							},
							["amount"] = 147,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 74,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 416,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 356,
								},
							},
							["amount"] = 846,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 93,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 564,
								},
							},
							["amount"] = 657,
						},
						["卡乌恩"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 148,
								},
								["肉搏"] = {
									["count"] = 317,
								},
							},
							["amount"] = 465,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 675,
								},
								["邪恶攻击"] = {
									["count"] = 854,
								},
								["肉搏"] = {
									["count"] = 325,
								},
							},
							["amount"] = 1854,
						},
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 196,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 166,
								},
							},
							["amount"] = 362,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 415,
								},
								["冰霜新星"] = {
									["count"] = 63,
								},
							},
							["amount"] = 478,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 448,
								},
							},
							["amount"] = 448,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 522,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1060,
								},
								["灼热之痛"] = {
									["count"] = 1444,
								},
							},
							["amount"] = 3026,
						},
					},
					["ElementDoneBlock"] = {
						["Melee"] = 5,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Dispelled"] = 2,
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 22,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["恐惧术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
					},
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["恐惧术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
					},
					["Interrupts"] = 1,
					["WhoDispelled"] = {
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["魔法抑制 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["战士的决心"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 104,
									["min"] = 104,
									["count"] = 1,
									["amount"] = 104,
								},
							},
							["count"] = 1,
							["amount"] = 104,
						},
					},
					["HealingTaken"] = 104,
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 104,
								},
							},
							["amount"] = 104,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 104,
								},
							},
							["amount"] = 104,
						},
					},
					["Healing"] = 104,
					["TimeSpent"] = {
						["暮年-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3.04,
								},
								["断筋"] = {
									["count"] = 1.6,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.44,
								},
							},
							["amount"] = 8.579999999999998,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["压制"] = {
									["count"] = 1.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 1.47,
								},
							},
							["amount"] = 15.36,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.57,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 7.199999999999999,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.65,
								},
								["肉搏"] = {
									["count"] = 0.21,
								},
							},
							["amount"] = 3.86,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.25,
								},
							},
							["amount"] = 9.02,
						},
						["卡乌恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 0.38,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.47,
								},
							},
							["amount"] = 4.619999999999999,
						},
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 2.73,
								},
								["拳击"] = {
									["count"] = 0.08,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.310000000000001,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.33,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.16,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.390000000000001,
								},
								["肉搏"] = {
									["count"] = 5.36,
								},
							},
							["amount"] = 12.74,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 0.66,
								},
							},
							["amount"] = 2.43,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.71,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 2.17,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.840000000000001,
								},
							},
							["amount"] = 17.22,
						},
					},
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 58,
								},
								["冲锋"] = {
									["count"] = 60,
								},
							},
							["amount"] = 118,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 379,
									["min"] = 379,
									["count"] = 1,
									["amount"] = 379,
								},
								["Crit"] = {
									["max"] = 920,
									["min"] = 920,
									["count"] = 1,
									["amount"] = 920,
								},
								["Hit"] = {
									["max"] = 615,
									["min"] = 443,
									["count"] = 3,
									["amount"] = 1503,
								},
							},
							["count"] = 5,
							["amount"] = 2802,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 393,
									["min"] = 393,
									["count"] = 1,
									["amount"] = 393,
								},
							},
							["count"] = 1,
							["amount"] = 393,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 111,
									["min"] = 34,
									["count"] = 20,
									["amount"] = 1330,
								},
								["Absorb"] = {
									["max"] = 71,
									["min"] = 48,
									["count"] = 3,
									["amount"] = 189,
								},
							},
							["count"] = 23,
							["amount"] = 1519,
						},
						["拳击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 84,
									["min"] = 84,
									["count"] = 1,
									["amount"] = 84,
								},
								["Hit"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 2,
							["amount"] = 112,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 532,
									["min"] = 532,
									["count"] = 1,
									["amount"] = 532,
								},
							},
							["count"] = 1,
							["amount"] = 532,
						},
						["压制"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 331,
									["min"] = 331,
									["count"] = 1,
									["amount"] = 331,
								},
							},
							["count"] = 1,
							["amount"] = 331,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 480,
									["min"] = 480,
									["count"] = 1,
									["amount"] = 480,
								},
								["Crit"] = {
									["max"] = 912,
									["min"] = 645,
									["count"] = 2,
									["amount"] = 1557,
								},
								["Hit"] = {
									["max"] = 428,
									["min"] = 426,
									["count"] = 3,
									["amount"] = 1281,
								},
							},
							["count"] = 6,
							["amount"] = 3318,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 49,
									["min"] = 49,
									["count"] = 1,
									["amount"] = 49,
								},
								["Hit"] = {
									["max"] = 54,
									["min"] = 25,
									["count"] = 3,
									["amount"] = 130,
								},
							},
							["count"] = 4,
							["amount"] = 179,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 78,
									["min"] = 35,
									["count"] = 3,
									["amount"] = 151,
								},
								["Crit"] = {
									["max"] = 83,
									["min"] = 31,
									["count"] = 3,
									["amount"] = 187,
								},
								["Hit"] = {
									["max"] = 39,
									["min"] = 23,
									["count"] = 7,
									["amount"] = 226,
								},
							},
							["count"] = 13,
							["amount"] = 564,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 528,
									["min"] = 528,
									["count"] = 1,
									["amount"] = 528,
								},
							},
							["count"] = 1,
							["amount"] = 528,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 639,
									["min"] = 18,
									["count"] = 8,
									["amount"] = 3063,
								},
								["Hit"] = {
									["max"] = 432,
									["min"] = 223,
									["count"] = 16,
									["amount"] = 5504,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 713,
									["min"] = 79,
									["count"] = 6,
									["amount"] = 2770,
								},
								["Hit (被格挡)"] = {
									["max"] = 353,
									["min"] = 353,
									["count"] = 1,
									["amount"] = 353,
								},
							},
							["count"] = 32,
							["amount"] = 11690,
						},
					},
					["RageGain"] = 118,
					["ActiveTime"] = 89.84000000000003,
					["TimeDamage"] = 88.34000000000003,
					["TimeDamaging"] = {
						["暮年-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3.04,
								},
								["断筋"] = {
									["count"] = 1.6,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.44,
								},
							},
							["amount"] = 8.579999999999998,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["压制"] = {
									["count"] = 1.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 1.47,
								},
							},
							["amount"] = 15.36,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.57,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 7.199999999999999,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.65,
								},
								["肉搏"] = {
									["count"] = 0.21,
								},
							},
							["amount"] = 3.86,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.25,
								},
							},
							["amount"] = 9.02,
						},
						["卡乌恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 0.38,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.47,
								},
							},
							["amount"] = 4.619999999999999,
						},
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 2.73,
								},
								["拳击"] = {
									["count"] = 0.08,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.310000000000001,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.33,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.16,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.390000000000001,
								},
								["肉搏"] = {
									["count"] = 5.36,
								},
							},
							["amount"] = 12.74,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 0.66,
								},
							},
							["amount"] = 2.43,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.71,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 2.17,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.840000000000001,
								},
							},
							["amount"] = 17.22,
						},
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 58,
								},
							},
							["amount"] = 58,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
					},
					["InterruptData"] = {
						["卡乌恩"] = {
							["Details"] = {
								["诱惑 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["暮年-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 265,
								},
								["断筋"] = {
									["count"] = 113,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 350,
								},
							},
							["amount"] = 777,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 920,
								},
								["压制"] = {
									["count"] = 331,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 287,
								},
								["断筋"] = {
									["count"] = 69,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 532,
								},
								["肉搏"] = {
									["count"] = 1124,
								},
							},
							["amount"] = 3263,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 283,
								},
								["肉搏"] = {
									["count"] = 353,
								},
							},
							["amount"] = 709,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 912,
								},
								["拦截昏迷"] = {
									["count"] = 54,
								},
								["断筋"] = {
									["count"] = 39,
								},
								["肉搏"] = {
									["count"] = 713,
								},
							},
							["amount"] = 1718,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 379,
								},
								["断筋"] = {
									["count"] = 32,
								},
								["旋风斩"] = {
									["count"] = 645,
								},
								["肉搏"] = {
									["count"] = 2025,
								},
							},
							["amount"] = 3081,
						},
						["卡乌恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 428,
								},
								["断筋"] = {
									["count"] = 23,
								},
								["拳击"] = {
									["count"] = 28,
								},
								["肉搏"] = {
									["count"] = 853,
								},
							},
							["amount"] = 1332,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 426,
								},
							},
							["amount"] = 426,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 888,
								},
								["英勇打击"] = {
									["count"] = 393,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 102,
								},
								["旋风斩"] = {
									["count"] = 427,
								},
								["断筋"] = {
									["count"] = 62,
								},
								["拦截昏迷"] = {
									["count"] = 25,
								},
								["肉搏"] = {
									["count"] = 3081,
								},
							},
							["amount"] = 4978,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 615,
								},
								["旋风斩"] = {
									["count"] = 480,
								},
								["断筋"] = {
									["count"] = 70,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 441,
								},
								["肉搏"] = {
									["count"] = 2037,
								},
							},
							["amount"] = 3643,
						},
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 141,
								},
								["拳击"] = {
									["count"] = 84,
								},
								["断筋"] = {
									["count"] = 83,
								},
								["肉搏"] = {
									["count"] = 754,
								},
							},
							["amount"] = 1062,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 51,
								},
								["斩杀"] = {
									["count"] = 528,
								},
								["肉搏"] = {
									["count"] = 400,
								},
							},
							["amount"] = 979,
						},
					},
				},
			},
			["UnitLockout"] = 1458.835,
			["LastActive"] = 1698.824,
		},
		["暴风卫兵-逐风者"] = {
			["GUID"] = "Player-5451-02F0B9B0",
			["TimeLast"] = {
				["Dispelled"] = 1622.824,
				["OVERALL"] = 1676.832,
				["DamageTaken"] = 1676.832,
				["HealingTaken"] = 1672.827,
				["RageGain"] = 1631.839,
				["Overhealing"] = 1637.842,
				["TimeDamage"] = 1676.832,
				["DeathCount"] = 1676.832,
				["ActiveTime"] = 1676.832,
				["DOT_Time"] = 1638.843,
				["Damage"] = 1676.832,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"HEAL", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["Dispelled"] = {
					3, -- [1]
				},
				["DamageTaken"] = {
					16797, -- [1]
				},
				["HealingTaken"] = {
					2811, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["Overhealing"] = {
					124, -- [1]
				},
				["TimeDamage"] = {
					45.31, -- [1]
				},
				["RageGain"] = {
					84, -- [1]
				},
				["ActiveTime"] = {
					45.31, -- [1]
				},
				["DOT_Time"] = {
					51, -- [1]
				},
				["Damage"] = {
					10415, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "暴风卫兵-逐风者",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						false, -- [32]
						false, -- [33]
						false, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
					},
					["Messages"] = {
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -71 (Shadow)", -- [1]
						"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -191 (Shadow)", -- [2]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -70 (Shadow)", -- [3]
						"暴风卫兵-逐风者 拦截昏迷 小猫掉毛-逐风者 Resist (Physical)", -- [4]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [5]
						"暴风卫兵-逐风者 肉搏 小猫掉毛-逐风者 Hit -314 (Physical)", -- [6]
						"小猫掉毛-逐风者 暗影守卫 暴风卫兵-逐风者 Hit -172 (Shadow)", -- [7]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -71 (Shadow)", -- [8]
						"暴风卫兵-逐风者 破胆怒吼 小猫掉毛-逐风者 Immune (Physical)", -- [9]
						"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -191 (Shadow)", -- [10]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -168 (Shadow)", -- [11]
						"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Resist (Holy)", -- [12]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -71 (Shadow)", -- [13]
						"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Hit -243 (Holy)", -- [14]
						"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -191 (Shadow)", -- [15]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -119 (Shadow)", -- [16]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [17]
						"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +925", -- [18]
						"babayaga-逐风者 冰霜新星 暴风卫兵-逐风者 Hit -29 (Frost)", -- [19]
						"扎心德勒-火妖鲁西弗隆 献祭 暴风卫兵-逐风者 Hit -400 (Fire)", -- [20]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -119 (Shadow)", -- [21]
						"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +922", -- [22]
						"babayaga-逐风者 魔爆术 暴风卫兵-逐风者 Hit -332 (Arcane)", -- [23]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [24]
						"扎心德勒-火妖鲁西弗隆 灼热之痛 暴风卫兵-逐风者 Hit -439 (Fire)", -- [25]
						"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Crit -357 (Holy)", -- [26]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -119 (Shadow)", -- [27]
						"扎心德勒-火妖鲁西弗隆 献祭 (伤害/跳) 暴风卫兵-逐风者 Tick -172 (Fire)", -- [28]
						"扎心德勒-火妖鲁西弗隆 灼热之痛 暴风卫兵-逐风者 Hit -460 (Fire)", -- [29]
						"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Hit -53 (Holy)", -- [30]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -118 (Shadow)", -- [31]
						"暴风卫兵-逐风者 旋风斩 森伊塔 Hit -300 (Physical)", -- [32]
						"暴风卫兵-逐风者 旋风斩 小猫掉毛-逐风者 Hit -395 (Physical)", -- [33]
						"暴风卫兵-逐风者 旋风斩 Moana-逐风者 Absorb -352 (352 被吸收) (Physical)", -- [34]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [35]
						"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Hit -52 (Holy)", -- [36]
						"babayaga-逐风者 魔爆术 暴风卫兵-逐风者 Hit -337 (Arcane)", -- [37]
						"暴风卫兵-逐风者死亡。", -- [38]
					},
					["DeathAt"] = 1678.837,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
					},
					["MessageTimes"] = {
						-14.81400000000008, -- [1]
						-13.08699999999999, -- [2]
						-12.81799999999998, -- [3]
						-12.79600000000005, -- [4]
						-12.30899999999997, -- [5]
						-12.29099999999994, -- [6]
						-11.95600000000013, -- [7]
						-10.8130000000001, -- [8]
						-10.2650000000001, -- [9]
						-10.09699999999998, -- [10]
						-9.338999999999942, -- [11]
						-9.19900000000007, -- [12]
						-8.812000000000126, -- [13]
						-7.677000000000135, -- [14]
						-7.086999999999989, -- [15]
						-6.825000000000046, -- [16]
						-6.325000000000046, -- [17]
						-6.189000000000078, -- [18]
						-4.999000000000024, -- [19]
						-4.857999999999947, -- [20]
						-4.825000000000046, -- [21]
						-4.029999999999973, -- [22]
						-3.490999999999985, -- [23]
						-3.317999999999984, -- [24]
						-3.284000000000106, -- [25]
						-3.170000000000073, -- [26]
						-2.807000000000016, -- [27]
						-1.840000000000146, -- [28]
						-1.769999999999982, -- [29]
						-1.654999999999973, -- [30]
						-0.81899999999996, -- [31]
						-0.3759999999999764, -- [32]
						-0.3759999999999764, -- [33]
						-0.3759999999999764, -- [34]
						-0.3240000000000691, -- [35]
						-0.1369999999999436, -- [36]
						-0.0340000000001055, -- [37]
						0, -- [38]
					},
					["HealthMax"] = {
						4379, -- [1]
						4379, -- [2]
						4379, -- [3]
						4379, -- [4]
						4379, -- [5]
						4379, -- [6]
						4379, -- [7]
						4379, -- [8]
						4379, -- [9]
						4379, -- [10]
						4379, -- [11]
						4379, -- [12]
						4379, -- [13]
						4379, -- [14]
						4379, -- [15]
						4379, -- [16]
						4379, -- [17]
						4379, -- [18]
						4379, -- [19]
						4379, -- [20]
						4379, -- [21]
						4379, -- [22]
						4379, -- [23]
						4379, -- [24]
						4379, -- [25]
						4379, -- [26]
						4379, -- [27]
						4379, -- [28]
						4379, -- [29]
						4379, -- [30]
						4379, -- [31]
						4379, -- [32]
						4379, -- [33]
						4379, -- [34]
						4379, -- [35]
						4379, -- [36]
						4379, -- [37]
						4379, -- [38]
					},
					["Health"] = {
						3231, -- [1]
						3163, -- [2]
						2972, -- [3]
						2972, -- [4]
						2902, -- [5]
						2733, -- [6]
						2733, -- [7]
						2564, -- [8]
						2493, -- [9]
						2497, -- [10]
						2306, -- [11]
						2306, -- [12]
						2138, -- [13]
						2070, -- [14]
						1827, -- [15]
						1636, -- [16]
						1517, -- [17]
						1348, -- [18]
						2276, -- [19]
						2247, -- [20]
						2247, -- [21]
						1728, -- [22]
						2653, -- [23]
						2321, -- [24]
						2152, -- [25]
						2152, -- [26]
						1356, -- [27]
						1237, -- [28]
						1237, -- [29]
						609, -- [30]
						556, -- [31]
						438, -- [32]
						438, -- [33]
						438, -- [34]
						438, -- [35]
						269, -- [36]
						220, -- [37]
						0, -- [38]
					},
					["KilledBy"] = "babayaga-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"HEAL", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"HEAL", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"MISC", -- [38]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						false, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
					},
					["Messages"] = {
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -83 (Shadow)", -- [1]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -193 (Shadow)", -- [2]
						"暴风卫兵-逐风者 肉搏 为了青春-黑龙费尔默 Crit -714 (Physical)", -- [3]
						"暴风卫兵-逐风者 锤击昏迷效果 为了青春-黑龙费尔默 Resist (Physical)", -- [4]
						"暴风卫兵-逐风者 致死打击 为了青春-黑龙费尔默 Absorb -517 (517 被吸收) (Physical)", -- [5]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -83 (Shadow)", -- [6]
						"为了青春-黑龙费尔默 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -196 (Shadow)", -- [7]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -194 (Shadow)", -- [8]
						"暴风卫兵-逐风者 重伤 (伤害/跳) 为了青春-黑龙费尔默 Absorb -70 (70 被吸收) (Physical)", -- [9]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -83 (Shadow)", -- [10]
						"皇鹰-逐风者 寒冰箭 暴风卫兵-逐风者 Hit -812 (Frost)", -- [11]
						"为了青春-黑龙费尔默 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -196 (Shadow)", -- [12]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -83 (Shadow)", -- [13]
						"暴风卫兵-逐风者 重伤 (伤害/跳) 为了青春-黑龙费尔默 Absorb -70 (70 被吸收) (Physical)", -- [14]
						"皇鹰-逐风者 寒冰箭 暴风卫兵-逐风者 Resist (Frost)", -- [15]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -139 (Shadow)", -- [16]
						"暴风卫兵-逐风者 肉搏 小猫掉毛-逐风者 Hit -281 (Physical)", -- [17]
						"为了青春-黑龙费尔默 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -196 (Shadow)", -- [18]
						"暴风卫兵-逐风者 致死打击 小猫掉毛-逐风者 Crit -939 (Physical)", -- [19]
						"暴风卫兵-逐风者 重伤 (伤害/跳) 为了青春-黑龙费尔默 Absorb -70 (70 被吸收) (Physical)", -- [20]
						"皇鹰-逐风者 火焰冲击 暴风卫兵-逐风者 Hit -677 (Fire)", -- [21]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -139 (Shadow)", -- [22]
						"皇鹰-逐风者 寒冰箭 暴风卫兵-逐风者 Hit -826 (Frost)", -- [23]
						"暴风卫兵-逐风者死亡。", -- [24]
						"暴风卫兵-逐风者 重伤 (伤害/跳) 小猫掉毛-逐风者 Tick -69 (Physical)", -- [25]
					},
					["DeathAt"] = 1555.823,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
					},
					["MessageTimes"] = {
						-10.57600000000002, -- [1]
						-10.11500000000001, -- [2]
						-10.01099999999997, -- [3]
						-9.989000000000033, -- [4]
						-8.986000000000104, -- [5]
						-8.567000000000007, -- [6]
						-8.057000000000016, -- [7]
						-7.096000000000004, -- [8]
						-6.97199999999998, -- [9]
						-6.562000000000126, -- [10]
						-5.222999999999956, -- [11]
						-5.067000000000007, -- [12]
						-4.57100000000014, -- [13]
						-3.986000000000104, -- [14]
						-2.836999999999989, -- [15]
						-2.558999999999969, -- [16]
						-2.267000000000053, -- [17]
						-2.074000000000069, -- [18]
						-2.026000000000067, -- [19]
						-0.9930000000001655, -- [20]
						-0.7999999999999545, -- [21]
						-0.56899999999996, -- [22]
						-0.02200000000016189, -- [23]
						0, -- [24]
						1.005999999999858, -- [25]
					},
					["HealthMax"] = {
						4379, -- [1]
						4379, -- [2]
						4379, -- [3]
						4379, -- [4]
						4379, -- [5]
						4379, -- [6]
						4379, -- [7]
						4379, -- [8]
						4379, -- [9]
						4379, -- [10]
						4379, -- [11]
						4379, -- [12]
						4379, -- [13]
						4379, -- [14]
						4379, -- [15]
						4379, -- [16]
						4379, -- [17]
						4379, -- [18]
						4379, -- [19]
						4379, -- [20]
						4379, -- [21]
						4379, -- [22]
						4379, -- [23]
						4379, -- [24]
						4379, -- [25]
					},
					["Health"] = {
						3836, -- [1]
						3757, -- [2]
						3757, -- [3]
						3757, -- [4]
						3564, -- [5]
						3564, -- [6]
						3484, -- [7]
						3288, -- [8]
						3094, -- [9]
						3094, -- [10]
						3014, -- [11]
						3014, -- [12]
						2006, -- [13]
						1926, -- [14]
						1926, -- [15]
						1926, -- [16]
						1787, -- [17]
						1790, -- [18]
						1594, -- [19]
						1594, -- [20]
						1594, -- [21]
						1594, -- [22]
						782, -- [23]
						0, -- [24]
						0, -- [25]
					},
					["KilledBy"] = "皇鹰-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
						"DAMAGE", -- [25]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						false, -- [29]
					},
					["Messages"] = {
						"暴风卫兵-逐风者 肉搏 Moana-逐风者 Absorb -570 (1)", -- [1]
						"暴风卫兵-逐风者 肉搏 Moana-逐风者 Crit -224 (570 被吸收) (Physical)", -- [2]
						"暴风卫兵-逐风者 断筋 Moana-逐风者 Hit -38 (Physical)", -- [3]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -64 (Shadow)", -- [4]
						"暴风卫兵-逐风者 重伤 (伤害/跳) Moana-逐风者 Tick -69 (Physical)", -- [5]
						"暴风卫兵-逐风者 英勇打击 Moana-逐风者 Hit -440 (Physical)", -- [6]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -64 (Shadow)", -- [7]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -153 (Shadow)", -- [8]
						"为了青春-黑龙费尔默 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -155 (Shadow)", -- [9]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -63 (Shadow)", -- [10]
						"暴风卫兵-逐风者 重伤 (伤害/跳) Moana-逐风者 Tick -70 (Physical)", -- [11]
						"Moana-逐风者 死亡缠绕 暴风卫兵-逐风者 Hit -581 (Shadow)", -- [12]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -65 (Shadow)", -- [13]
						"为了青春-黑龙费尔默 生命虹吸 (伤害/跳) 暴风卫兵-逐风者 Tick -58 (Shadow)", -- [14]
						"暮年-逐风者 火焰冲击 暴风卫兵-逐风者 Hit -498 (Fire)", -- [15]
						"为了青春-黑龙费尔默 献祭 暴风卫兵-逐风者 Hit -285 (Fire)", -- [16]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -63 (Shadow)", -- [17]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -153 (Shadow)", -- [18]
						"为了青春-黑龙费尔默 献祭 (伤害/跳) 暴风卫兵-逐风者 Tick -132 (Fire)", -- [19]
						"为了青春-黑龙费尔默 暗影箭 暴风卫兵-逐风者 Hit -796 (Shadow)", -- [20]
						"为了青春-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -126 (Shadow)", -- [21]
						"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -176 (Shadow)", -- [22]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -152 (Shadow)", -- [23]
						"为了青春-黑龙费尔默 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -178 (Shadow)", -- [24]
						"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -74 (Shadow)", -- [25]
						"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -64 (Shadow)", -- [26]
						"为了青春-黑龙费尔默 暗影灼烧 暴风卫兵-逐风者 Crit -1402 (Shadow)", -- [27]
						"暴风卫兵-逐风者死亡。", -- [28]
						"暴风卫兵-逐风者 重伤 (伤害/跳) Moana-逐风者 Absorb -70 (70 被吸收) (Physical)", -- [29]
					},
					["DeathAt"] = 1469.826,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
					},
					["MessageTimes"] = {
						-11.20900000000006, -- [1]
						-11.20900000000006, -- [2]
						-10.73500000000013, -- [3]
						-8.991999999999962, -- [4]
						-8.162000000000035, -- [5]
						-7.419000000000096, -- [6]
						-6.997000000000071, -- [7]
						-6.763000000000147, -- [8]
						-6.506000000000086, -- [9]
						-6.262000000000171, -- [10]
						-5.189000000000078, -- [11]
						-5, -- [12]
						-5, -- [13]
						-5, -- [14]
						-4.875999999999976, -- [15]
						-4.605000000000018, -- [16]
						-4.267000000000053, -- [17]
						-3.7650000000001, -- [18]
						-1.605999999999995, -- [19]
						-1.230999999999995, -- [20]
						-1.00200000000018, -- [21]
						-0.7670000000000528, -- [22]
						-0.5420000000001437, -- [23]
						-0.4850000000001273, -- [24]
						-0.2650000000001, -- [25]
						-0.03500000000008186, -- [26]
						-0.02300000000013824, -- [27]
						0, -- [28]
						0.8089999999999691, -- [29]
					},
					["HealthMax"] = {
						5079, -- [1]
						5079, -- [2]
						5079, -- [3]
						5079, -- [4]
						5079, -- [5]
						5079, -- [6]
						5079, -- [7]
						5079, -- [8]
						5079, -- [9]
						5079, -- [10]
						5079, -- [11]
						5079, -- [12]
						5079, -- [13]
						5079, -- [14]
						5079, -- [15]
						5079, -- [16]
						5079, -- [17]
						5079, -- [18]
						5079, -- [19]
						5079, -- [20]
						5079, -- [21]
						5079, -- [22]
						5079, -- [23]
						5079, -- [24]
						5079, -- [25]
						5079, -- [26]
						5079, -- [27]
						4379, -- [28]
						4379, -- [29]
					},
					["Health"] = {
						5079, -- [1]
						5079, -- [2]
						5079, -- [3]
						5079, -- [4]
						5015, -- [5]
						5015, -- [6]
						5015, -- [7]
						4954, -- [8]
						4801, -- [9]
						4646, -- [10]
						4583, -- [11]
						4583, -- [12]
						4005, -- [13]
						4005, -- [14]
						3882, -- [15]
						3384, -- [16]
						3099, -- [17]
						3036, -- [18]
						2501, -- [19]
						2032, -- [20]
						1236, -- [21]
						1113, -- [22]
						937, -- [23]
						785, -- [24]
						785, -- [25]
						533, -- [26]
						533, -- [27]
						0, -- [28]
						0, -- [29]
					},
					["KilledBy"] = "为了青春-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"MISC", -- [28]
						"DAMAGE", -- [29]
					},
				}, -- [3]
			},
			["level"] = 60,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 2,
			["type"] = "Grouped",
			["LastDamageTaken"] = 337,
			["LastEventHealth"] = {
				2306, -- [1]
				2306, -- [2]
				2138, -- [3]
				2070, -- [4]
				1827, -- [5]
				1636, -- [6]
				1517, -- [7]
				1348, -- [8]
				2276, -- [9]
				2247, -- [10]
				2247, -- [11]
				1728, -- [12]
				2653, -- [13]
				2321, -- [14]
				2152, -- [15]
				2152, -- [16]
				1356, -- [17]
				1237, -- [18]
				1237, -- [19]
				609, -- [20]
				556, -- [21]
				438, -- [22]
				438, -- [23]
				438, -- [24]
				438, -- [25]
				269, -- [26]
				220, -- [27]
				0, -- [28]
				4379, -- [29]
				4379, -- [30]
				4379, -- [31]
				4379, -- [32]
				4379, -- [33]
				4379, -- [34]
				4183, -- [35]
				4104, -- [36]
				3914, -- [37]
				3720, -- [38]
				3594, -- [39]
				3400, -- [40]
				3231, -- [41]
				3163, -- [42]
				2972, -- [43]
				2972, -- [44]
				2902, -- [45]
				2733, -- [46]
				2733, -- [47]
				2564, -- [48]
				2493, -- [49]
				2497, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4379, -- [1]
				4379, -- [2]
				4379, -- [3]
				4379, -- [4]
				4379, -- [5]
				4379, -- [6]
				4379, -- [7]
				4379, -- [8]
				4379, -- [9]
				4379, -- [10]
				4379, -- [11]
				4379, -- [12]
				4379, -- [13]
				4379, -- [14]
				4379, -- [15]
				4379, -- [16]
				4379, -- [17]
				4379, -- [18]
				4379, -- [19]
				4379, -- [20]
				4379, -- [21]
				4379, -- [22]
				4379, -- [23]
				4379, -- [24]
				4379, -- [25]
				4379, -- [26]
				4379, -- [27]
				4379, -- [28]
				4379, -- [29]
				4379, -- [30]
				4379, -- [31]
				4379, -- [32]
				4379, -- [33]
				4379, -- [34]
				4379, -- [35]
				4379, -- [36]
				4379, -- [37]
				4379, -- [38]
				4379, -- [39]
				4379, -- [40]
				4379, -- [41]
				4379, -- [42]
				4379, -- [43]
				4379, -- [44]
				4379, -- [45]
				4379, -- [46]
				4379, -- [47]
				4379, -- [48]
				4379, -- [49]
				4379, -- [50]
			},
			["NextEventNum"] = 29,
			["LastDamageTime"] = 1677.14,
			["LastEvents"] = {
				"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -168 (Shadow)", -- [1]
				"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Resist (Holy)", -- [2]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -71 (Shadow)", -- [3]
				"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Hit -243 (Holy)", -- [4]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -191 (Shadow)", -- [5]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -119 (Shadow)", -- [6]
				"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [7]
				"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +925", -- [8]
				"babayaga-逐风者 冰霜新星 暴风卫兵-逐风者 Hit -29 (Frost)", -- [9]
				"扎心德勒-火妖鲁西弗隆 献祭 暴风卫兵-逐风者 Hit -400 (Fire)", -- [10]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -119 (Shadow)", -- [11]
				"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +922", -- [12]
				"babayaga-逐风者 魔爆术 暴风卫兵-逐风者 Hit -332 (Arcane)", -- [13]
				"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [14]
				"扎心德勒-火妖鲁西弗隆 灼热之痛 暴风卫兵-逐风者 Hit -439 (Fire)", -- [15]
				"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Crit -357 (Holy)", -- [16]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -119 (Shadow)", -- [17]
				"扎心德勒-火妖鲁西弗隆 献祭 (伤害/跳) 暴风卫兵-逐风者 Tick -172 (Fire)", -- [18]
				"扎心德勒-火妖鲁西弗隆 灼热之痛 暴风卫兵-逐风者 Hit -460 (Fire)", -- [19]
				"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Hit -53 (Holy)", -- [20]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -118 (Shadow)", -- [21]
				"暴风卫兵-逐风者 旋风斩 森伊塔 Hit -300 (Physical)", -- [22]
				"暴风卫兵-逐风者 旋风斩 小猫掉毛-逐风者 Hit -395 (Physical)", -- [23]
				"暴风卫兵-逐风者 旋风斩 Moana-逐风者 Absorb -352 (352 被吸收) (Physical)", -- [24]
				"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [25]
				"小猫掉毛-逐风者 神圣新星 暴风卫兵-逐风者 Hit -52 (Holy)", -- [26]
				"babayaga-逐风者 魔爆术 暴风卫兵-逐风者 Hit -337 (Arcane)", -- [27]
				"暴风卫兵-逐风者死亡。", -- [28]
				"暴风卫兵-逐风者 英勇打击 暴走扁哥-黑龙费尔默 Absorb -535 (535 被吸收) (Physical)", -- [29]
				"暴风卫兵-逐风者 神圣力量 暴风卫兵-逐风者 Hit +124 (124 过量治疗)", -- [30]
				"暴风卫兵-逐风者 断筋 暴走扁哥-黑龙费尔默 Hit -41 (Physical)", -- [31]
				"暴风卫兵-逐风者 重伤 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -70 (Physical)", -- [32]
				"暴风卫兵-逐风者 肉搏 暴走扁哥-黑龙费尔默 Hit -505 (Physical)", -- [33]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -196 (Shadow)", -- [34]
				"利群-逐风者 肉搏 暴风卫兵-逐风者 Hit -82 (Physical)", -- [35]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -197 (Shadow)", -- [36]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -197 (Shadow)", -- [37]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -196 (Shadow)", -- [38]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -197 (Shadow)", -- [39]
				"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [40]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -71 (Shadow)", -- [41]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -191 (Shadow)", -- [42]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -70 (Shadow)", -- [43]
				"暴风卫兵-逐风者 拦截昏迷 小猫掉毛-逐风者 Resist (Physical)", -- [44]
				"Moana-逐风者 腐蚀术 (伤害/跳) 暴风卫兵-逐风者 Tick -169 (Shadow)", -- [45]
				"暴风卫兵-逐风者 肉搏 小猫掉毛-逐风者 Hit -314 (Physical)", -- [46]
				"小猫掉毛-逐风者 暗影守卫 暴风卫兵-逐风者 Hit -172 (Shadow)", -- [47]
				"Moana-逐风者 痛苦诅咒 (伤害/跳) 暴风卫兵-逐风者 Tick -71 (Shadow)", -- [48]
				"暴风卫兵-逐风者 破胆怒吼 小猫掉毛-逐风者 Immune (Physical)", -- [49]
				"利群-逐风者 暗言术：痛 (伤害/跳) 暴风卫兵-逐风者 Tick -191 (Shadow)", -- [50]
			},
			["Name"] = "暴风卫兵-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				1668.177, -- [1]
				1668.317, -- [2]
				1668.704, -- [3]
				1669.839, -- [4]
				1670.429, -- [5]
				1670.691, -- [6]
				1671.191, -- [7]
				1671.327, -- [8]
				1672.517, -- [9]
				1672.658, -- [10]
				1672.691, -- [11]
				1673.486, -- [12]
				1674.025, -- [13]
				1674.198, -- [14]
				1674.232, -- [15]
				1674.346, -- [16]
				1674.709, -- [17]
				1675.676, -- [18]
				1675.746, -- [19]
				1675.861, -- [20]
				1676.697, -- [21]
				1677.14, -- [22]
				1677.14, -- [23]
				1677.14, -- [24]
				1677.192, -- [25]
				1677.379, -- [26]
				1677.482, -- [27]
				1677.516, -- [28]
				1637.909, -- [29]
				1638.676, -- [30]
				1638.676, -- [31]
				1639.476, -- [32]
				1641.707, -- [33]
				1649.423, -- [34]
				1649.523, -- [35]
				1652.444, -- [36]
				1655.423, -- [37]
				1658.423, -- [38]
				1661.424, -- [39]
				1662.193, -- [40]
				1662.702, -- [41]
				1664.429, -- [42]
				1664.698, -- [43]
				1664.72, -- [44]
				1665.207, -- [45]
				1665.225, -- [46]
				1665.56, -- [47]
				1666.703, -- [48]
				1667.251, -- [49]
				1667.419, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 6,
								},
								["babayaga-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 18,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 7595,
					["RageGainedFrom"] = {
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 63,
								},
							},
							["amount"] = 63,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Holy"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 22,
								},
							},
							["amount"] = 23,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 6,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 17,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 565,
						["Melee"] = 82,
						["Arcane"] = 1273,
						["Fire"] = 1471,
						["Holy"] = 705,
						["Shadow"] = 3499,
					},
					["DOT_Time"] = 18,
					["Damage"] = 5927,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 957,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 2263,
						["Physical"] = 3664,
					},
					["PartialAbsorb"] = {
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1123,
								},
								["英勇打击"] = {
									["count"] = 535,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 140,
								},
								["断筋"] = {
									["count"] = 83,
								},
								["肉搏"] = {
									["count"] = 873,
								},
							},
							["amount"] = 2754,
						},
						["森伊塔"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 352,
								},
							},
							["amount"] = 352,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 395,
								},
								["肉搏"] = {
									["count"] = 314,
								},
							},
							["amount"] = 709,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 423,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 276,
								},
								["肉搏"] = {
									["count"] = 1076,
								},
							},
							["amount"] = 1812,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1556,
								},
								["肉搏"] = {
									["count"] = 82,
								},
							},
							["amount"] = 1638,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1013,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 758,
								},
							},
							["amount"] = 1771,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 172,
								},
								["献祭"] = {
									["count"] = 400,
								},
								["灼热之痛"] = {
									["count"] = 899,
								},
							},
							["amount"] = 1471,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 705,
								},
								["暗影守卫"] = {
									["count"] = 172,
								},
							},
							["amount"] = 877,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1273,
								},
								["冰霜新星"] = {
									["count"] = 55,
								},
								["冰锥术"] = {
									["count"] = 510,
								},
							},
							["amount"] = 1838,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 124,
									["min"] = 124,
									["count"] = 1,
									["amount"] = 124,
								},
							},
							["count"] = 1,
							["amount"] = 124,
						},
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["暴风卫兵-逐风者"] = {
									["count"] = 63,
								},
							},
							["amount"] = 63,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 124,
					["TimeSpent"] = {
						["森伊塔"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.51,
								},
							},
							["amount"] = 3.51,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.44,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.6,
								},
								["断筋"] = {
									["count"] = 2.27,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 8.48,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.31,
						},
					},
					["WhoDispelled"] = {
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰锥术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰霜新星 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 2811,
								},
							},
							["amount"] = 2811,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 22.8,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 3,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1123,
									["min"] = 1123,
									["count"] = 1,
									["amount"] = 1123,
								},
								["Hit"] = {
									["max"] = 423,
									["min"] = 423,
									["count"] = 1,
									["amount"] = 423,
								},
							},
							["count"] = 2,
							["amount"] = 1546,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 352,
									["min"] = 352,
									["count"] = 1,
									["amount"] = 352,
								},
								["Hit"] = {
									["max"] = 395,
									["min"] = 300,
									["count"] = 2,
									["amount"] = 695,
								},
							},
							["count"] = 3,
							["amount"] = 1047,
						},
						["英勇打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 535,
									["min"] = 535,
									["count"] = 1,
									["amount"] = 535,
								},
							},
							["count"] = 1,
							["amount"] = 535,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 70,
									["min"] = 70,
									["count"] = 1,
									["amount"] = 70,
								},
								["Tick"] = {
									["max"] = 70,
									["min"] = 69,
									["count"] = 5,
									["amount"] = 346,
								},
							},
							["count"] = 6,
							["amount"] = 416,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 37,
									["count"] = 3,
									["amount"] = 120,
								},
							},
							["count"] = 3,
							["amount"] = 120,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 718,
									["min"] = 718,
									["count"] = 1,
									["amount"] = 718,
								},
								["Hit"] = {
									["max"] = 505,
									["min"] = 314,
									["count"] = 4,
									["amount"] = 1545,
								},
							},
							["count"] = 5,
							["amount"] = 2263,
						},
					},
					["HealingTaken"] = 2811,
					["RageGain"] = 63,
					["TimeDamage"] = 22.8,
					["TimeDamaging"] = {
						["森伊塔"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.51,
								},
							},
							["amount"] = 3.51,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.44,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.6,
								},
								["断筋"] = {
									["count"] = 2.27,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 8.48,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.31,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["为了青春-黑龙费尔默"] = {
									["count"] = 12,
								},
								["Moana-逐风者"] = {
									["count"] = 9,
								},
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 6,
								},
								["小猫掉毛-逐风者"] = {
									["count"] = 12,
								},
								["babayaga-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 51,
						},
					},
					["TimeSpent"] = {
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["锤击昏迷效果"] = {
									["count"] = 0.02,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.04,
								},
								["致死打击"] = {
									["count"] = 1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.56,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 0.47,
								},
								["英勇打击"] = {
									["count"] = 0.74,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.21,
						},
						["森伊塔"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.44,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.6,
								},
								["断筋"] = {
									["count"] = 2.27,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 8.48,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.24,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.01,
								},
							},
							["amount"] = 11.25,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.31,
						},
					},
					["DamageTaken"] = 16797,
					["RageGainedFrom"] = {
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 22,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["DeathCount"] = 3,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 45.31,
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 124,
									["min"] = 124,
									["count"] = 1,
									["amount"] = 124,
								},
							},
							["count"] = 1,
							["amount"] = 124,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 2203,
						["Melee"] = 82,
						["Arcane"] = 1273,
						["Fire"] = 3063,
						["Holy"] = 705,
						["Shadow"] = 9471,
					},
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["暴风卫兵-逐风者"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
					},
					["Damage"] = 10415,
					["Overhealing"] = 124,
					["WhoDispelled"] = {
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰锥术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰霜新星 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["Dispelled"] = 3,
					["HealingTaken"] = 2811,
					["WhoHealed"] = {
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 2811,
								},
							},
							["amount"] = 2811,
						},
					},
					["DOT_Time"] = 51,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
						["Holy"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 48,
								},
							},
							["amount"] = 52,
						},
					},
					["WhoDamaged"] = {
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 1402,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 58,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 929,
								},
								["暗影箭"] = {
									["count"] = 796,
								},
								["献祭"] = {
									["count"] = 285,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 921,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 132,
								},
							},
							["amount"] = 4523,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 152,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 64,
								},
							},
							["amount"] = 216,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1273,
								},
								["冰霜新星"] = {
									["count"] = 55,
								},
								["冰锥术"] = {
									["count"] = 510,
								},
							},
							["amount"] = 1838,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1556,
								},
								["肉搏"] = {
									["count"] = 82,
								},
							},
							["amount"] = 1638,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 172,
								},
								["献祭"] = {
									["count"] = 400,
								},
								["灼热之痛"] = {
									["count"] = 899,
								},
							},
							["amount"] = 1471,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 705,
								},
								["暗影守卫"] = {
									["count"] = 172,
								},
							},
							["amount"] = 877,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 677,
								},
								["寒冰箭"] = {
									["count"] = 1638,
								},
							},
							["amount"] = 2315,
						},
						["暮年-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 498,
								},
							},
							["amount"] = 498,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 581,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1882,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 958,
								},
							},
							["amount"] = 3421,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 517,
									["min"] = 517,
									["count"] = 1,
									["amount"] = 517,
								},
								["Crit"] = {
									["max"] = 1123,
									["min"] = 939,
									["count"] = 2,
									["amount"] = 2062,
								},
								["Hit"] = {
									["max"] = 423,
									["min"] = 423,
									["count"] = 1,
									["amount"] = 423,
								},
							},
							["count"] = 4,
							["amount"] = 3002,
						},
						["英勇打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 535,
									["min"] = 535,
									["count"] = 1,
									["amount"] = 535,
								},
								["Hit"] = {
									["max"] = 440,
									["min"] = 440,
									["count"] = 1,
									["amount"] = 440,
								},
							},
							["count"] = 2,
							["amount"] = 975,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 70,
									["min"] = 69,
									["count"] = 6,
									["amount"] = 419,
								},
								["Tick"] = {
									["max"] = 70,
									["min"] = 69,
									["count"] = 11,
									["amount"] = 762,
								},
							},
							["count"] = 17,
							["amount"] = 1181,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 352,
									["min"] = 352,
									["count"] = 1,
									["amount"] = 352,
								},
								["Hit"] = {
									["max"] = 395,
									["min"] = 300,
									["count"] = 2,
									["amount"] = 695,
								},
							},
							["count"] = 3,
							["amount"] = 1047,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 37,
									["count"] = 4,
									["amount"] = 158,
								},
							},
							["count"] = 4,
							["amount"] = 158,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 570,
									["min"] = 570,
									["count"] = 1,
									["amount"] = 570,
								},
								["Crit"] = {
									["max"] = 718,
									["min"] = 224,
									["count"] = 3,
									["amount"] = 1656,
								},
								["Hit"] = {
									["max"] = 505,
									["min"] = 281,
									["count"] = 5,
									["amount"] = 1826,
								},
							},
							["count"] = 9,
							["amount"] = 4052,
						},
					},
					["RageGain"] = 84,
					["DamagedWho"] = {
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 517,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 279,
								},
								["肉搏"] = {
									["count"] = 714,
								},
							},
							["amount"] = 1510,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 440,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 209,
								},
								["断筋"] = {
									["count"] = 38,
								},
								["旋风斩"] = {
									["count"] = 352,
								},
								["肉搏"] = {
									["count"] = 794,
								},
							},
							["amount"] = 1833,
						},
						["森伊塔"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1123,
								},
								["英勇打击"] = {
									["count"] = 535,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 140,
								},
								["断筋"] = {
									["count"] = 83,
								},
								["肉搏"] = {
									["count"] = 873,
								},
							},
							["amount"] = 2754,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 939,
								},
								["旋风斩"] = {
									["count"] = 395,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 277,
								},
								["肉搏"] = {
									["count"] = 595,
								},
							},
							["amount"] = 2206,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 423,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 276,
								},
								["肉搏"] = {
									["count"] = 1076,
								},
							},
							["amount"] = 1812,
						},
					},
					["TimeDamage"] = 45.31,
					["TimeDamaging"] = {
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["锤击昏迷效果"] = {
									["count"] = 0.02,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.04,
								},
								["致死打击"] = {
									["count"] = 1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.56,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 0.47,
								},
								["英勇打击"] = {
									["count"] = 0.74,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.21,
						},
						["森伊塔"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.44,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.6,
								},
								["断筋"] = {
									["count"] = 2.27,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 8.48,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.24,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.01,
								},
							},
							["amount"] = 11.25,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.31,
						},
					},
					["ElementDone"] = {
						["Melee"] = 4052,
						["Physical"] = 6363,
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 570,
						["Physical"] = 1823,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 33,
						},
					},
				},
			},
			["UnitLockout"] = 1455.831,
			["LastActive"] = 1676.832,
		},
		["肌肉髪-逐风者"] = {
			["GUID"] = "Player-5451-030D566A",
			["LastEventHealth"] = {
				802, -- [1]
				802, -- [2]
				1754, -- [3]
				1754, -- [4]
				1754, -- [5]
				1754, -- [6]
				1754, -- [7]
				1645, -- [8]
				2621, -- [9]
				2621, -- [10]
				2621, -- [11]
				2621, -- [12]
				2403, -- [13]
				2433, -- [14]
				2433, -- [15]
				2800, -- [16]
				2800, -- [17]
				2800, -- [18]
				2800, -- [19]
				2800, -- [20]
				2800, -- [21]
				2800, -- [22]
				2800, -- [23]
				2800, -- [24]
				2800, -- [25]
				2800, -- [26]
				2800, -- [27]
				2670, -- [28]
				2541, -- [29]
				2541, -- [30]
				2541, -- [31]
				2541, -- [32]
				2541, -- [33]
				2541, -- [34]
				2389, -- [35]
				2311, -- [36]
				2159, -- [37]
				2159, -- [38]
				2159, -- [39]
				2007, -- [40]
				2007, -- [41]
				1855, -- [42]
				1855, -- [43]
				1855, -- [44]
				1855, -- [45]
				1855, -- [46]
				1703, -- [47]
				1703, -- [48]
				1021, -- [49]
				802, -- [50]
			},
			["LastAttackedBy"] = "小猫掉毛-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"HEAL", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"MISC", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"MISC", -- [17]
				"MISC", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"MISC", -- [22]
				"DAMAGE", -- [23]
				"MISC", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"MISC", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"MISC", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Dispelled"] = {
					5, -- [1]
				},
				["DamageTaken"] = {
					2724, -- [1]
				},
				["Absorbs"] = {
					514, -- [1]
				},
				["HealingTaken"] = {
					2442, -- [1]
				},
				["TimeDamage"] = {
					28.7, -- [1]
				},
				["ActiveTime"] = {
					30.2, -- [1]
				},
				["ManaGain"] = {
					1148, -- [1]
				},
				["Interrupts"] = {
					2, -- [1]
				},
				["Damage"] = {
					17289, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "肌肉髪-逐风者",
			["level"] = 60,
			["LastDamageAbility"] = "神圣新星",
			["LastFightIn"] = 2,
			["type"] = "Grouped",
			["LastDamageTaken"] = 218,
			["LastHealTime"] = 1629.526,
			["TimeLast"] = {
				["TimeHeal"] = 1628.825,
				["Dispelled"] = 1688.825,
				["OVERALL"] = 1688.825,
				["DamageTaken"] = 1668.839,
				["Absorbs"] = 1628.825,
				["HealingTaken"] = 1668.839,
				["TimeDamage"] = 1668.839,
				["ActiveTime"] = 1668.839,
				["ManaGain"] = 1657.823,
				["Interrupts"] = 1654.823,
				["Damage"] = 1668.839,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2800, -- [1]
				2800, -- [2]
				2800, -- [3]
				2800, -- [4]
				2800, -- [5]
				2800, -- [6]
				2800, -- [7]
				2800, -- [8]
				2800, -- [9]
				2800, -- [10]
				2800, -- [11]
				2800, -- [12]
				2800, -- [13]
				2800, -- [14]
				2800, -- [15]
				2800, -- [16]
				2800, -- [17]
				2800, -- [18]
				2800, -- [19]
				2800, -- [20]
				2800, -- [21]
				2800, -- [22]
				2800, -- [23]
				2800, -- [24]
				2800, -- [25]
				2800, -- [26]
				2800, -- [27]
				2800, -- [28]
				2800, -- [29]
				2800, -- [30]
				2800, -- [31]
				2800, -- [32]
				2800, -- [33]
				2800, -- [34]
				2800, -- [35]
				2800, -- [36]
				2800, -- [37]
				2800, -- [38]
				2800, -- [39]
				2800, -- [40]
				2800, -- [41]
				2800, -- [42]
				2800, -- [43]
				2800, -- [44]
				2800, -- [45]
				2800, -- [46]
				2800, -- [47]
				2800, -- [48]
				2800, -- [49]
				2800, -- [50]
			},
			["NextEventNum"] = 16,
			["LastDamageTime"] = 1669.666,
			["LastEvents"] = {
				"森伊塔 肉搏 肌肉髪-逐风者 Immune (1)", -- [1]
				"圆嘟嘟-黑龙费尔默 快速治疗 肌肉髪-逐风者 Hit +952", -- [2]
				"肌肉髪-逐风者 冰霜新星 卡乌恩 Resist (Frost)", -- [3]
				"肌肉髪-逐风者 冰霜新星 森伊塔 Hit -84 (Frost)", -- [4]
				"肌肉髪-逐风者 冰霜新星 Moana-逐风者 Absorb -89 (89 被吸收) (Frost)", -- [5]
				"肌肉髪-逐风者 冰霜新星 babayaga-逐风者 Hit -89 (Frost)", -- [6]
				"森伊塔 肉搏 肌肉髪-逐风者 Hit -109 (Physical)", -- [7]
				"圆嘟嘟-黑龙费尔默 快速治疗 肌肉髪-逐风者 Hit +976", -- [8]
				"肌肉髪-逐风者 冰锥术 小猫掉毛-逐风者 Resist (Frost)", -- [9]
				"肌肉髪-逐风者 冰锥术 森伊塔 Hit -540 (Frost)", -- [10]
				"肌肉髪-逐风者 冰锥术 babayaga-逐风者 Crit -1082 (Frost)", -- [11]
				"小猫掉毛-逐风者 神圣新星 肌肉髪-逐风者 Hit -218 (Holy)", -- [12]
				"森伊塔 诱惑 肌肉髪-逐风者 Resist (Shadow)", -- [13]
				"利群-逐风者 dispels 肌肉髪-逐风者 寒冰护体 (驱散魔法)", -- [14]
				"利群-逐风者 心灵尖啸 肌肉髪-逐风者 Immune (Shadow)", -- [15]
				"肌肉髪-逐风者 寒冰箭 扎心德勒-火妖鲁西弗隆 Hit -573 (Frost)", -- [16]
				"利群-逐风者 dispels 肌肉髪-逐风者 奥术智慧 (驱散魔法)", -- [17]
				"利群-逐风者 dispels 肌肉髪-逐风者 冰甲术 (驱散魔法)", -- [18]
				"肌肉髪-逐风者 寒冰箭 babayaga-逐风者 Hit -737 (Frost)", -- [19]
				"肌肉髪-逐风者 肉搏 扎心德勒-火妖鲁西弗隆 Absorb -121 (1)", -- [20]
				"肌肉髪-逐风者 火焰冲击 扎心德勒-火妖鲁西弗隆 Hit -543 (121 被吸收) (Fire)", -- [21]
				"肌肉髪-逐风者 interrupts 利群-逐风者 快速治疗 (法术反制)", -- [22]
				"暴走扁哥-黑龙费尔默 暗影灼烧 肌肉髪-逐风者 Absorb -514 (514 被吸收) (Shadow)", -- [23]
				"扎恩霍恩 dispels 肌肉髪-逐风者 寒冰护体 (吞噬魔法)", -- [24]
				"肌肉髪-逐风者 冰霜新星 扎恩霍恩 Hit -91 (Frost)", -- [25]
				"肌肉髪-逐风者 冰霜新星 暴走扁哥-黑龙费尔默 Hit -89 (Frost)", -- [26]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -130 (Shadow)", -- [27]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -129 (Shadow)", -- [28]
				"肌肉髪-逐风者 肉搏 暴走扁哥-黑龙费尔默 Absorb -509 (1)", -- [29]
				"肌肉髪-逐风者 火焰冲击 暴走扁哥-黑龙费尔默 Crit -378 (509 被吸收) (Fire)", -- [30]
				"肌肉髪-逐风者 冰锥术 扎恩霍恩 Hit -530 (Frost)", -- [31]
				"肌肉髪-逐风者 冰锥术 暴走扁哥-黑龙费尔默 Hit -528 (Frost)", -- [32]
				"扎恩霍恩 dispels 肌肉髪-逐风者 魔法抑制 (吞噬魔法)", -- [33]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -152 (Shadow)", -- [34]
				"扎恩霍恩 肉搏 肌肉髪-逐风者 Hit -78 (Physical)", -- [35]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -152 (Shadow)", -- [36]
				"肌肉髪-逐风者 肉搏 利群-逐风者 Absorb -428 (1)", -- [37]
				"肌肉髪-逐风者 寒冰箭 利群-逐风者 Hit -303 (428 被吸收) (Frost)", -- [38]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -152 (Shadow)", -- [39]
				"肌肉髪-逐风者 寒冰箭 利群-逐风者 Hit -754 (Frost)", -- [40]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -152 (Shadow)", -- [41]
				"肌肉髪-逐风者 火焰冲击 利群-逐风者 Hit -582 (Fire)", -- [42]
				"肌肉髪-逐风者 interrupts babayaga-逐风者 变形术 (法术反制)", -- [43]
				"肌肉髪-逐风者 寒冰箭 babayaga-逐风者 Absorb -741 (741 被吸收) (Frost)", -- [44]
				"肌肉髪-逐风者 火焰冲击 babayaga-逐风者 Absorb -627 (627 被吸收) (Fire)", -- [45]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -152 (Shadow)", -- [46]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 肌肉髪-逐风者 Tick -152 (Shadow)", -- [47]
				"Moana-逐风者 死亡缠绕 肌肉髪-逐风者 Hit -530 (Shadow)", -- [48]
				"森伊塔 剧痛鞭笞 肌肉髪-逐风者 Hit -104 (Shadow)", -- [49]
				"森伊塔 肉搏 肌肉髪-逐风者 Immune (1)", -- [50]
			},
			["Name"] = "肌肉髪-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				1667.05, -- [1]
				1667.34, -- [2]
				1668.157, -- [3]
				1668.157, -- [4]
				1668.157, -- [5]
				1668.157, -- [6]
				1669.059, -- [7]
				1669.298, -- [8]
				1669.666, -- [9]
				1669.666, -- [10]
				1669.666, -- [11]
				1669.839, -- [12]
				1674.825, -- [13]
				1688.879, -- [14]
				1691.892, -- [15]
				1601.336, -- [16]
				1609.537, -- [17]
				1609.537, -- [18]
				1609.637, -- [19]
				1614.921, -- [20]
				1614.921, -- [21]
				1616.204, -- [22]
				1629.526, -- [23]
				1631.355, -- [24]
				1631.672, -- [25]
				1631.672, -- [26]
				1634.373, -- [27]
				1637.376, -- [28]
				1637.922, -- [29]
				1637.922, -- [30]
				1639.508, -- [31]
				1639.508, -- [32]
				1639.756, -- [33]
				1640.372, -- [34]
				1641.756, -- [35]
				1643.377, -- [36]
				1646.076, -- [37]
				1646.076, -- [38]
				1646.376, -- [39]
				1648.723, -- [40]
				1649.376, -- [41]
				1650.674, -- [42]
				1654.89, -- [43]
				1657.823, -- [44]
				1659.008, -- [45]
				1659.731, -- [46]
				1662.757, -- [47]
				1662.774, -- [48]
				1663.126, -- [49]
				1665.057, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["肌肉髪-逐风者"] = {
									["max"] = 514,
									["min"] = 514,
									["count"] = 1,
									["amount"] = 514,
								},
							},
							["count"] = 1,
							["amount"] = 514,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2724,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 514,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 17,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
						["Shadow"] = 514,
					},
					["ElementTaken"] = {
						["Shadow"] = 2319,
						["Melee"] = 187,
						["Holy"] = 218,
					},
					["DOT_Time"] = 0,
					["Damage"] = 9991,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 1258,
						["Fire"] = 1257,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 6803,
						["Melee"] = 1058,
						["Fire"] = 2130,
					},
					["PartialAbsorb"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["诱惑"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 514,
									["min"] = 514,
									["count"] = 1,
									["amount"] = 514,
								},
							},
							["count"] = 1,
							["amount"] = 514,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1146,
								},
								["火焰冲击"] = {
									["count"] = 543,
								},
								["肉搏"] = {
									["count"] = 121,
								},
							},
							["amount"] = 1810,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 89,
								},
							},
							["amount"] = 89,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 530,
								},
								["冰霜新星"] = {
									["count"] = 91,
								},
							},
							["amount"] = 621,
						},
						["森伊塔"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 540,
								},
								["冰霜新星"] = {
									["count"] = 84,
								},
							},
							["amount"] = 624,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1057,
								},
								["火焰冲击"] = {
									["count"] = 582,
								},
								["肉搏"] = {
									["count"] = 428,
								},
							},
							["amount"] = 2067,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 528,
								},
								["火焰冲击"] = {
									["count"] = 378,
								},
								["肉搏"] = {
									["count"] = 509,
								},
								["冰霜新星"] = {
									["count"] = 89,
								},
							},
							["amount"] = 1504,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1082,
								},
								["寒冰箭"] = {
									["count"] = 1478,
								},
								["冰霜新星"] = {
									["count"] = 89,
								},
								["火焰冲击"] = {
									["count"] = 627,
								},
							},
							["amount"] = 3276,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 514,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1171,
								},
							},
							["amount"] = 1685,
						},
						["森伊塔"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 104,
								},
								["肉搏"] = {
									["count"] = 109,
								},
							},
							["amount"] = 213,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 530,
								},
							},
							["amount"] = 530,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 78,
								},
							},
							["amount"] = 78,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["诱惑"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["补充法力"] = {
									["count"] = 1148,
								},
							},
							["amount"] = 1148,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 514,
								},
							},
							["amount"] = 514,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["补充法力"] = {
							["Details"] = {
								["肌肉髪-逐风者"] = {
									["count"] = 1148,
								},
							},
							["amount"] = 1148,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 2,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["卡乌恩"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.18,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.18,
						},
					},
					["WhoDispelled"] = {
						["扎恩霍恩"] = {
							["Details"] = {
								["寒冰护体 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["魔法抑制 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["奥术智慧 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰甲术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["InterruptData"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["变形术 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["快速治疗 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 514,
									["min"] = 514,
									["count"] = 1,
									["amount"] = 514,
								},
							},
							["count"] = 1,
							["amount"] = 514,
						},
					},
					["WhoHealed"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 514,
								},
							},
							["amount"] = 514,
						},
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1928,
								},
							},
							["amount"] = 1928,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 22.18,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 5,
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 89,
									["min"] = 89,
									["count"] = 1,
									["amount"] = 89,
								},
								["Hit"] = {
									["max"] = 91,
									["min"] = 84,
									["count"] = 4,
									["amount"] = 353,
								},
							},
							["count"] = 6,
							["amount"] = 442,
						},
						["冰锥术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1082,
									["min"] = 1082,
									["count"] = 1,
									["amount"] = 1082,
								},
								["Hit"] = {
									["max"] = 540,
									["min"] = 528,
									["count"] = 3,
									["amount"] = 1598,
								},
							},
							["count"] = 5,
							["amount"] = 2680,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 741,
									["min"] = 741,
									["count"] = 1,
									["amount"] = 741,
								},
								["Hit"] = {
									["max"] = 754,
									["min"] = 303,
									["count"] = 5,
									["amount"] = 2940,
								},
							},
							["count"] = 6,
							["amount"] = 3681,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 627,
									["min"] = 627,
									["count"] = 1,
									["amount"] = 627,
								},
								["Crit"] = {
									["max"] = 378,
									["min"] = 378,
									["count"] = 1,
									["amount"] = 378,
								},
								["Hit"] = {
									["max"] = 582,
									["min"] = 543,
									["count"] = 2,
									["amount"] = 1125,
								},
							},
							["count"] = 4,
							["amount"] = 2130,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 509,
									["min"] = 121,
									["count"] = 3,
									["amount"] = 1058,
								},
							},
							["count"] = 3,
							["amount"] = 1058,
						},
					},
					["HealingTaken"] = 2442,
					["RageGain"] = 0,
					["TimeDamage"] = 20.68,
					["TimeDamaging"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["卡乌恩"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.18,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.18,
						},
					},
					["ManaGain"] = 1148,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ManaGainedFrom"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["补充法力"] = {
									["count"] = 1148,
								},
							},
							["amount"] = 1148,
						},
					},
					["TimeHealing"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Dispelled"] = 5,
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDispelled"] = {
						["扎恩霍恩"] = {
							["Details"] = {
								["寒冰护体 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["魔法抑制 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["奥术智慧 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰甲术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeSpent"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 2.01,
								},
							},
							["amount"] = 3.51,
						},
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["卡乌恩"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 0.43,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.93,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.18,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.18,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.08,
								},
							},
							["amount"] = 1.08,
						},
					},
					["HealedWho"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 514,
								},
							},
							["amount"] = 514,
						},
					},
					["ElementDoneAbsorb"] = {
						["Fire"] = 1257,
						["Frost"] = 1846,
					},
					["Absorbs"] = 514,
					["ManaGained"] = {
						["补充法力"] = {
							["Details"] = {
								["肌肉髪-逐风者"] = {
									["count"] = 1148,
								},
							},
							["amount"] = 1148,
						},
					},
					["ElementTakenAbsorb"] = {
						["Shadow"] = 514,
					},
					["ActiveTime"] = 30.2,
					["PartialAbsorb"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["诱惑"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 514,
									["min"] = 514,
									["count"] = 1,
									["amount"] = 514,
								},
							},
							["count"] = 1,
							["amount"] = 514,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["ElementTaken"] = {
						["Shadow"] = 2319,
						["Melee"] = 187,
						["Holy"] = 218,
					},
					["PartialResist"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["诱惑"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
					},
					["Damage"] = 17289,
					["WhoDamaged"] = {
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 514,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1171,
								},
							},
							["amount"] = 1685,
						},
						["森伊塔"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 104,
								},
								["肉搏"] = {
									["count"] = 109,
								},
							},
							["amount"] = 213,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 530,
								},
							},
							["amount"] = 530,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 78,
								},
							},
							["amount"] = 78,
						},
					},
					["TimeHeal"] = 1.5,
					["DamageTaken"] = 2724,
					["WhoHealed"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 514,
								},
							},
							["amount"] = 514,
						},
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1928,
								},
							},
							["amount"] = 1928,
						},
					},
					["Interrupts"] = 2,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 514,
									["min"] = 514,
									["count"] = 1,
									["amount"] = 514,
								},
							},
							["count"] = 1,
							["amount"] = 514,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 28,
						},
					},
					["InterruptData"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["变形术 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["快速治疗 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 588,
									["min"] = 121,
									["count"] = 4,
									["amount"] = 1646,
								},
							},
							["count"] = 4,
							["amount"] = 1646,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 89,
									["min"] = 89,
									["count"] = 1,
									["amount"] = 89,
								},
								["Hit"] = {
									["max"] = 91,
									["min"] = 84,
									["count"] = 4,
									["amount"] = 353,
								},
							},
							["count"] = 6,
							["amount"] = 442,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 741,
									["min"] = 741,
									["count"] = 1,
									["amount"] = 741,
								},
								["Crit"] = {
									["max"] = 1316,
									["min"] = 1316,
									["count"] = 1,
									["amount"] = 1316,
								},
								["Hit"] = {
									["max"] = 754,
									["min"] = 155,
									["count"] = 8,
									["amount"] = 4499,
								},
							},
							["count"] = 10,
							["amount"] = 6556,
						},
						["冰锥术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1082,
									["min"] = 1082,
									["count"] = 1,
									["amount"] = 1082,
								},
								["Hit"] = {
									["max"] = 557,
									["min"] = 518,
									["count"] = 8,
									["amount"] = 4303,
								},
							},
							["count"] = 11,
							["amount"] = 5385,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 627,
									["min"] = 627,
									["count"] = 1,
									["amount"] = 627,
								},
								["Crit"] = {
									["max"] = 378,
									["min"] = 378,
									["count"] = 1,
									["amount"] = 378,
								},
								["Hit"] = {
									["max"] = 601,
									["min"] = 529,
									["count"] = 4,
									["amount"] = 2255,
								},
							},
							["count"] = 6,
							["amount"] = 3260,
						},
					},
					["HealingTaken"] = 2442,
					["DamagedWho"] = {
						["卡尔摩斯"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 557,
								},
							},
							["amount"] = 557,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1146,
								},
								["火焰冲击"] = {
									["count"] = 543,
								},
								["肉搏"] = {
									["count"] = 121,
								},
							},
							["amount"] = 1810,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 530,
								},
								["冰霜新星"] = {
									["count"] = 91,
								},
							},
							["amount"] = 621,
						},
						["森伊塔"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 540,
								},
								["冰霜新星"] = {
									["count"] = 84,
								},
							},
							["amount"] = 624,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 529,
								},
								["寒冰箭"] = {
									["count"] = 1976,
								},
							},
							["amount"] = 2505,
						},
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 155,
								},
								["肉搏"] = {
									["count"] = 588,
								},
							},
							["amount"] = 743,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1057,
								},
								["火焰冲击"] = {
									["count"] = 582,
								},
								["肉搏"] = {
									["count"] = 428,
								},
							},
							["amount"] = 2067,
						},
						["阿莱克斯·巴罗夫的仆从"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1595,
								},
							},
							["amount"] = 1595,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 89,
								},
							},
							["amount"] = 89,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 744,
								},
								["冰锥术"] = {
									["count"] = 553,
								},
								["火焰冲击"] = {
									["count"] = 601,
								},
							},
							["amount"] = 1898,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 528,
								},
								["火焰冲击"] = {
									["count"] = 378,
								},
								["肉搏"] = {
									["count"] = 509,
								},
								["冰霜新星"] = {
									["count"] = 89,
								},
							},
							["amount"] = 1504,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1082,
								},
								["寒冰箭"] = {
									["count"] = 1478,
								},
								["冰霜新星"] = {
									["count"] = 89,
								},
								["火焰冲击"] = {
									["count"] = 627,
								},
							},
							["amount"] = 3276,
						},
					},
					["TimeDamage"] = 28.7,
					["TimeDamaging"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 2.01,
								},
							},
							["amount"] = 3.51,
						},
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["卡乌恩"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 0.43,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.93,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.18,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.18,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.08,
								},
							},
							["amount"] = 1.08,
						},
					},
					["ManaGain"] = 1148,
					["ElementDone"] = {
						["Fire"] = 3260,
						["Melee"] = 1646,
						["Frost"] = 12383,
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["肌肉髪-逐风者"] = {
									["max"] = 514,
									["min"] = 514,
									["count"] = 1,
									["amount"] = 514,
								},
							},
							["count"] = 1,
							["amount"] = 514,
						},
					},
				},
			},
			["UnitLockout"] = 1460.828,
			["LastActive"] = 1691.826,
		},
		["前渡-逐风者"] = {
			["GUID"] = "Player-5451-030955BC",
			["LastEventHealth"] = {
				2790, -- [1]
				2790, -- [2]
				2790, -- [3]
				2790, -- [4]
				2790, -- [5]
				2790, -- [6]
				2790, -- [7]
				2790, -- [8]
				2790, -- [9]
				2790, -- [10]
				2790, -- [11]
				2790, -- [12]
				2790, -- [13]
				2790, -- [14]
				2790, -- [15]
				2790, -- [16]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"MISC", -- [16]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					13.72, -- [1]
				},
				["Damage"] = {
					1430, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["ActiveTime"] = {
					13.72, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "前渡-逐风者",
			["level"] = 60,
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["TimeLast"] = {
				["ActiveTime"] = 1483.834,
				["TimeDamage"] = 1483.834,
				["OVERALL"] = 1483.834,
				["DOT_Time"] = 1483.834,
				["Damage"] = 1483.834,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2790, -- [1]
				2790, -- [2]
				2790, -- [3]
				2790, -- [4]
				2790, -- [5]
				2790, -- [6]
				2790, -- [7]
				2790, -- [8]
				2790, -- [9]
				2790, -- [10]
				2790, -- [11]
				2790, -- [12]
				2790, -- [13]
				2790, -- [14]
				2790, -- [15]
				2790, -- [16]
			},
			["NextEventNum"] = 17,
			["LastDamageTime"] = 1484.145,
			["LastEvents"] = {
				"前渡-逐风者 奥术飞弹 利群-逐风者 Crit -390 (Arcane)", -- [1]
				"前渡-逐风者 奥术飞弹 利群-逐风者 Hit -260 (Arcane)", -- [2]
				"前渡-逐风者 奥术飞弹 利群-逐风者 Hit -260 (Arcane)", -- [3]
				"前渡-逐风者 寒冰箭 皇鹰-逐风者 Absorb -53 (53 被吸收) (Frost)", -- [4]
				"前渡-逐风者 寒冰箭 皇家特工-逐风者 Hit -68 (Frost)", -- [5]
				"前渡-逐风者 寒冰箭 丶舊知己丶-逐风者 Hit -62 (Frost)", -- [6]
				"利群-逐风者 驱散魔法 前渡-逐风者 Immune (Holy)", -- [7]
				"前渡-逐风者 肉搏 利群-逐风者 Absorb -70 (1)", -- [8]
				"前渡-逐风者 冰霜新星 利群-逐风者 Hit -21 (70 被吸收) (Frost)", -- [9]
				"前渡-逐风者 冰霜新星 莱荫-黑龙费尔默 Hit -90 (Frost)", -- [10]
				"前渡-逐风者 暴风雪 (伤害/跳) 暴走扁哥-黑龙费尔默 Absorb -39 (39 被吸收) (Frost)", -- [11]
				"前渡-逐风者 暴风雪 (伤害/跳) 暴走扁哥-黑龙费尔默 Absorb -39 (39 被吸收) (Frost)", -- [12]
				"莱荫-黑龙费尔默 灵魂之火 前渡-逐风者 Resist (Fire)", -- [13]
				"前渡-逐风者 暴风雪 (伤害/跳) 暴走扁哥-黑龙费尔默 Absorb -39 (39 被吸收) (Frost)", -- [14]
				"前渡-逐风者 暴风雪 (伤害/跳) 暴走扁哥-黑龙费尔默 Absorb -39 (39 被吸收) (Frost)", -- [15]
				"扎恩霍恩 interrupts 前渡-逐风者 暴风雪 (法术封锁)", -- [16]
			},
			["Name"] = "前渡-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
			},
			["LastEventTimes"] = {
				1454.265, -- [1]
				1455.253, -- [2]
				1456.284, -- [3]
				1459.85, -- [4]
				1461.044, -- [5]
				1466.527, -- [6]
				1472.335, -- [7]
				1473.997, -- [8]
				1473.997, -- [9]
				1473.997, -- [10]
				1481.133, -- [11]
				1482.145, -- [12]
				1482.245, -- [13]
				1483.161, -- [14]
				1484.145, -- [15]
				1484.331, -- [16]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ActiveTime"] = 13.72,
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Holy"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["驱散魔法"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灵魂之火"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["奥术飞弹"] = {
									["count"] = 3.520000000000001,
								},
							},
							["amount"] = 5.020000000000001,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 4.51,
								},
							},
							["amount"] = 4.51,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.19,
								},
							},
							["amount"] = 1.19,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["PartialResist"] = {
						["驱散魔法"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灵魂之火"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 279,
					},
					["ElementDone"] = {
						["Frost"] = 450,
						["Melee"] = 70,
						["Arcane"] = 910,
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["DamagedWho"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 21,
								},
								["肉搏"] = {
									["count"] = 70,
								},
								["奥术飞弹"] = {
									["count"] = 910,
								},
							},
							["amount"] = 1001,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 156,
								},
							},
							["amount"] = 156,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 68,
								},
							},
							["amount"] = 68,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 53,
								},
							},
							["amount"] = 53,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 62,
								},
							},
							["amount"] = 62,
						},
					},
					["TimeDamage"] = 13.72,
					["TimeDamaging"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["奥术飞弹"] = {
									["count"] = 3.520000000000001,
								},
							},
							["amount"] = 5.020000000000001,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 4.51,
								},
							},
							["amount"] = 4.51,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.19,
								},
							},
							["amount"] = 1.19,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 4,
									["amount"] = 156,
								},
							},
							["count"] = 4,
							["amount"] = 156,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 390,
									["min"] = 390,
									["count"] = 1,
									["amount"] = 390,
								},
								["Hit"] = {
									["max"] = 260,
									["min"] = 260,
									["count"] = 2,
									["amount"] = 520,
								},
							},
							["count"] = 3,
							["amount"] = 910,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 68,
									["min"] = 62,
									["count"] = 2,
									["amount"] = 130,
								},
								["Absorb"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
							},
							["count"] = 3,
							["amount"] = 183,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 90,
									["min"] = 21,
									["count"] = 2,
									["amount"] = 111,
								},
							},
							["count"] = 2,
							["amount"] = 111,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 70,
									["min"] = 70,
									["count"] = 1,
									["amount"] = 70,
								},
							},
							["count"] = 1,
							["amount"] = 70,
						},
					},
					["DOT_Time"] = 12,
					["Damage"] = 1430,
				},
			},
			["UnitLockout"] = 1453.836,
			["LastActive"] = 1483.834,
		},
		["灬羽宝灬 <灬羽兒灬>"] = {
			["GUID"] = "Pet-0-5428-329-929-2850-0301374F1E",
			["LastEventHealth"] = {
				2412, -- [1]
				2412, -- [2]
				2412, -- [3]
				2412, -- [4]
				2412, -- [5]
				2412, -- [6]
				2412, -- [7]
				2112, -- [8]
				2112, -- [9]
				2112, -- [10]
				2112, -- [11]
				2112, -- [12]
				2112, -- [13]
				2112, -- [14]
				2112, -- [15]
				2112, -- [16]
				2112, -- [17]
				2112, -- [18]
				2083, -- [19]
				298, -- [20]
				298, -- [21]
				298, -- [22]
				298, -- [23]
				298, -- [24]
				298, -- [25]
				298, -- [26]
				298, -- [27]
				298, -- [28]
				298, -- [29]
				298, -- [30]
				298, -- [31]
				298, -- [32]
			},
			["LastAttackedBy"] = "皇鹰-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					23.10000000000001, -- [1]
				},
				["Damage"] = {
					987, -- [1]
				},
				["DamageTaken"] = {
					782, -- [1]
				},
				["ActiveTime"] = {
					23.10000000000001, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "灬羽宝灬",
			["level"] = 1,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 1,
			["type"] = "Pet",
			["ownerName"] = "灬羽兒灬",
			["LastDamageTaken"] = 453,
			["TimeLast"] = {
				["ActiveTime"] = 1551.839,
				["TimeDamage"] = 1551.839,
				["OVERALL"] = 1551.839,
				["DamageTaken"] = 1474.841,
				["Damage"] = 1551.839,
			},
			["LastEventHealthMax"] = {
				3305, -- [1]
				3305, -- [2]
				3305, -- [3]
				3305, -- [4]
				3305, -- [5]
				3305, -- [6]
				3305, -- [7]
				3305, -- [8]
				3305, -- [9]
				3305, -- [10]
				3305, -- [11]
				3305, -- [12]
				3305, -- [13]
				3305, -- [14]
				3305, -- [15]
				3305, -- [16]
				3305, -- [17]
				3305, -- [18]
				3305, -- [19]
				3305, -- [20]
				3305, -- [21]
				3305, -- [22]
				3305, -- [23]
				3305, -- [24]
				3305, -- [25]
				3305, -- [26]
				3305, -- [27]
				3305, -- [28]
				3305, -- [29]
				3305, -- [30]
				3305, -- [31]
				3305, -- [32]
			},
			["NextEventNum"] = 33,
			["LastDamageTime"] = 1552.22,
			["LastEvents"] = {
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Dodge (1)", -- [1]
				"灬羽宝灬 <灬羽兒灬> 爪击 皇家特工-逐风者 Hit -58 (Physical)", -- [2]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Miss (1)", -- [3]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Crit -93 (Physical)", -- [4]
				"灬羽宝灬 <灬羽兒灬> 爪击 皇家特工-逐风者 Hit -49 (Physical)", -- [5]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Hit -46 (Physical)", -- [6]
				"皇鹰-逐风者 魔爆术 灬羽宝灬 <灬羽兒灬> Hit -300 (Arcane)", -- [7]
				"灬羽宝灬 <灬羽兒灬> 爪击 皇家特工-逐风者 Dodge (Physical)", -- [8]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Hit -50 (Physical)", -- [9]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇鹰-逐风者 Immune (1)", -- [10]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇鹰-逐风者 Immune (1)", -- [11]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇鹰-逐风者 Immune (1)", -- [12]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇鹰-逐风者 Immune (1)", -- [13]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇鹰-逐风者 Immune (1)", -- [14]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇鹰-逐风者 Immune (1)", -- [15]
				"灬羽宝灬 <灬羽兒灬> 爪击 皇鹰-逐风者 Absorb -61 (61 被吸收) (Physical)", -- [16]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇鹰-逐风者 Absorb -53 (53 被吸收) (1)", -- [17]
				"皇鹰-逐风者 冰霜新星 灬羽宝灬 <灬羽兒灬> Hit -29 (Frost)", -- [18]
				"皇鹰-逐风者 魔爆术 灬羽宝灬 <灬羽兒灬> Crit -453 (Arcane)", -- [19]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Hit -51 (Physical)", -- [20]
				"灬羽宝灬 <灬羽兒灬> 爪击 皇家特工-逐风者 Hit -54 (Physical)", -- [21]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Hit -42 (Physical)", -- [22]
				"灬羽宝灬 <灬羽兒灬> 爪击 皇家特工-逐风者 Dodge (Physical)", -- [23]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Hit -43 (Physical)", -- [24]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Hit -42 (Physical)", -- [25]
				"灬羽宝灬 <灬羽兒灬> 爪击 皇家特工-逐风者 Hit -52 (Physical)", -- [26]
				"灬羽宝灬 <灬羽兒灬> 肉搏 皇家特工-逐风者 Hit -49 (Physical)", -- [27]
				"灬羽宝灬 <灬羽兒灬> 肉搏 莱荫-黑龙费尔默 Hit -45 (Physical)", -- [28]
				"灬羽宝灬 <灬羽兒灬> 肉搏 莱荫-黑龙费尔默 Hit -47 (Physical)", -- [29]
				"灬羽宝灬 <灬羽兒灬> 爪击 莱荫-黑龙费尔默 Hit -52 (Physical)", -- [30]
				"灬羽宝灬 <灬羽兒灬> 肉搏 莱荫-黑龙费尔默 Hit -48 (Physical)", -- [31]
				"灬羽宝灬 <灬羽兒灬> 肉搏 莱荫-黑龙费尔默 Hit -52 (Physical)", -- [32]
			},
			["Name"] = "灬羽宝灬",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
			},
			["LastEventTimes"] = {
				1457.406, -- [1]
				1457.406, -- [2]
				1458.387, -- [3]
				1459.402, -- [4]
				1459.62, -- [5]
				1460.407, -- [6]
				1460.653, -- [7]
				1461.239, -- [8]
				1461.427, -- [9]
				1467.423, -- [10]
				1468.428, -- [11]
				1469.445, -- [12]
				1470.444, -- [13]
				1471.453, -- [14]
				1472.44, -- [15]
				1473.413, -- [16]
				1473.461, -- [17]
				1473.675, -- [18]
				1475.182, -- [19]
				1542.967, -- [20]
				1543.024, -- [21]
				1543.994, -- [22]
				1544.629, -- [23]
				1544.983, -- [24]
				1545.99, -- [25]
				1546.262, -- [26]
				1546.988, -- [27]
				1549.209, -- [28]
				1550.204, -- [29]
				1550.308, -- [30]
				1551.213, -- [31]
				1552.22, -- [32]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["WhoDamaged"] = {
						["皇鹰-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 753,
								},
								["冰霜新星"] = {
									["count"] = 29,
								},
							},
							["amount"] = 782,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["爪击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 61,
									["min"] = 61,
									["count"] = 1,
									["amount"] = 61,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 58,
									["min"] = 49,
									["count"] = 5,
									["amount"] = 265,
								},
							},
							["count"] = 8,
							["amount"] = 326,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
								["Hit"] = {
									["max"] = 52,
									["min"] = 42,
									["count"] = 11,
									["amount"] = 515,
								},
								["Crit"] = {
									["max"] = 93,
									["min"] = 93,
									["count"] = 1,
									["amount"] = 93,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 661,
						},
					},
					["TimeSpent"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 4.4,
								},
							},
							["amount"] = 4.5,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.01,
								},
								["肉搏"] = {
									["count"] = 9.040000000000001,
								},
							},
							["amount"] = 11.05,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 6.579999999999999,
								},
							},
							["amount"] = 7.549999999999999,
						},
					},
					["DamageTaken"] = 782,
					["ElementDoneAbsorb"] = {
						["Melee"] = 53,
						["Physical"] = 61,
					},
					["ElementDone"] = {
						["Melee"] = 661,
						["Physical"] = 326,
					},
					["DamagedWho"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 52,
								},
								["肉搏"] = {
									["count"] = 192,
								},
							},
							["amount"] = 244,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 416,
								},
								["爪击"] = {
									["count"] = 213,
								},
							},
							["amount"] = 629,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 53,
								},
								["爪击"] = {
									["count"] = 61,
								},
							},
							["amount"] = 114,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 21,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
					},
					["TimeDamage"] = 23.10000000000001,
					["TimeDamaging"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 4.4,
								},
							},
							["amount"] = 4.5,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.01,
								},
								["肉搏"] = {
									["count"] = 9.040000000000001,
								},
							},
							["amount"] = 11.05,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 6.579999999999999,
								},
							},
							["amount"] = 7.549999999999999,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 29,
						["Arcane"] = 753,
					},
					["ActiveTime"] = 23.10000000000001,
					["Damage"] = 987,
				},
			},
			["UnitLockout"] = 1456.826,
			["LastActive"] = 1551.839,
		},
		["麦兹弗格 <云淡风轻刺猬-黑龙费尔默>"] = {
			["GUID"] = "Pet-0-5427-30-6737-1860-07011B0345",
			["LastEventHealth"] = {
				2866, -- [1]
				2866, -- [2]
				2866, -- [3]
				2866, -- [4]
				2866, -- [5]
				2866, -- [6]
				2866, -- [7]
				2866, -- [8]
				3419, -- [9]
				0, -- [10]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"MISC", -- [9]
				"MISC", -- [10]
			},
			["TimeWindows"] = {
				["Damage"] = {
					122, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					12, -- [1]
				},
				["ActiveTime"] = {
					12, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "麦兹弗格",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
					},
					["Messages"] = {
						"麦兹弗格 <云淡风轻刺猬-黑龙费尔默>死亡。", -- [1]
						"麦兹弗格 <云淡风轻刺猬-黑龙费尔默>死亡。", -- [2]
					},
					["DeathAt"] = 1679.841,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["MessageTimes"] = {
						-0.03399999999987813, -- [1]
						0, -- [2]
					},
					["HealthMax"] = {
						3419, -- [1]
						3419, -- [2]
					},
					["Health"] = {
						3419, -- [1]
						0, -- [2]
					},
					["KilledBy"] = "麦兹弗格 <云淡风轻刺猬-黑龙费尔默>",
					["MessageType"] = {
						"MISC", -- [1]
						"MISC", -- [2]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
					},
					["Messages"] = {
						"麦兹弗格 <云淡风轻刺猬-黑龙费尔默>死亡。", -- [1]
						"麦兹弗格 <云淡风轻刺猬-黑龙费尔默>死亡。", -- [2]
					},
					["DeathAt"] = 1679.841,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["MessageTimes"] = {
						0, -- [1]
						0.03399999999987813, -- [2]
					},
					["HealthMax"] = {
						3419, -- [1]
						3419, -- [2]
					},
					["Health"] = {
						3419, -- [1]
						0, -- [2]
					},
					["KilledBy"] = "麦兹弗格 <云淡风轻刺猬-黑龙费尔默>",
					["MessageType"] = {
						"MISC", -- [1]
						"MISC", -- [2]
					},
				}, -- [2]
			},
			["level"] = 1,
			["LastFightIn"] = 2,
			["type"] = "Pet",
			["LastKilledAt"] = 1678.7,
			["ownerName"] = "云淡风轻刺猬-黑龙费尔默",
			["LastKilledBy"] = "麦兹弗格 <云淡风轻刺猬-黑龙费尔默>",
			["TimeLast"] = {
				["DeathCount"] = 1677.825,
				["ActiveTime"] = 1476.838,
				["OVERALL"] = 1677.825,
				["TimeDamage"] = 1476.838,
				["Damage"] = 1476.838,
			},
			["LastEventHealthMax"] = {
				3419, -- [1]
				3419, -- [2]
				3419, -- [3]
				3419, -- [4]
				3419, -- [5]
				3419, -- [6]
				3419, -- [7]
				3419, -- [8]
				3419, -- [9]
				3419, -- [10]
			},
			["NextEventNum"] = 11,
			["LastDamageTime"] = 1476.941,
			["LastEvents"] = {
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Absorb -19 (19 被吸收) (1)", -- [1]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Absorb -15 (15 被吸收) (1)", -- [2]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Miss (1)", -- [3]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Absorb -15 (15 被吸收) (1)", -- [4]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Absorb -17 (17 被吸收) (1)", -- [5]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Miss (1)", -- [6]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Hit -29 (Physical)", -- [7]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默> 肉搏 利群-逐风者 Hit -27 (Physical)", -- [8]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默>死亡。", -- [9]
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默>死亡。", -- [10]
			},
			["Name"] = "麦兹弗格",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
			},
			["LastEventTimes"] = {
				1460.419, -- [1]
				1462.425, -- [2]
				1466.437, -- [3]
				1468.449, -- [4]
				1470.444, -- [5]
				1472.44, -- [6]
				1474.944, -- [7]
				1476.941, -- [8]
				1678.7, -- [9]
				1678.734, -- [10]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 8,
						},
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 66,
					},
					["ElementDone"] = {
						["Melee"] = 122,
					},
					["DeathCount"] = 1,
					["DamagedWho"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 122,
								},
							},
							["amount"] = 122,
						},
					},
					["TimeDamage"] = 12,
					["TimeDamaging"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 19,
									["min"] = 15,
									["count"] = 4,
									["amount"] = 66,
								},
								["Hit"] = {
									["max"] = 29,
									["min"] = 27,
									["count"] = 2,
									["amount"] = 56,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 122,
						},
					},
					["ActiveTime"] = 12,
					["Damage"] = 122,
				},
			},
			["UnitLockout"] = 1459.828,
			["LastActive"] = 1476.838,
		},
		["云淡风轻刺猬-黑龙费尔默"] = {
			["GUID"] = "Player-5450-030404CE",
			["LastEventHealth"] = {
				2616, -- [1]
				2618, -- [2]
				2343, -- [3]
				2287, -- [4]
				2497, -- [5]
				2497, -- [6]
				2497, -- [7]
				2635, -- [8]
				2643, -- [9]
				2643, -- [10]
				2578, -- [11]
				2789, -- [12]
				2789, -- [13]
				2672, -- [14]
				2672, -- [15]
				2672, -- [16]
				2695, -- [17]
				2080, -- [18]
				2080, -- [19]
				2814, -- [20]
				2822, -- [21]
				2822, -- [22]
				2877, -- [23]
				2885, -- [24]
				2885, -- [25]
				2885, -- [26]
				2947, -- [27]
				2947, -- [28]
				2947, -- [29]
				2955, -- [30]
				2955, -- [31]
				3010, -- [32]
				3020, -- [33]
				3020, -- [34]
				3020, -- [35]
				3061, -- [36]
				3080, -- [37]
				3080, -- [38]
				3119, -- [39]
				3119, -- [40]
				3119, -- [41]
				3122, -- [42]
				3122, -- [43]
				3161, -- [44]
				3163, -- [45]
				3165, -- [46]
				3165, -- [47]
				3168, -- [48]
				3170, -- [49]
				3173, -- [50]
			},
			["LastAttackedBy"] = "利群-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"HEAL", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"HEAL", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"HEAL", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"HEAL", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"HEAL", -- [38]
				"MISC", -- [39]
				"MISC", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"HEAL", -- [43]
				"MISC", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					13.5, -- [1]
				},
				["Dispelled"] = {
					5, -- [1]
				},
				["Dispels"] = {
					1, -- [1]
				},
				["Healing"] = {
					2308, -- [1]
				},
				["DamageTaken"] = {
					9073, -- [1]
				},
				["HealingTaken"] = {
					7230, -- [1]
				},
				["TimeDamage"] = {
					43.09999999999999, -- [1]
				},
				["ActiveTime"] = {
					56.6, -- [1]
				},
				["ManaGain"] = {
					668, -- [1]
				},
				["DOT_Time"] = {
					81, -- [1]
				},
				["Damage"] = {
					3884, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = "云淡风轻刺猬-黑龙费尔默",
			["level"] = 60,
			["LastDamageAbility"] = "心灵震爆",
			["LastFightIn"] = 2,
			["TimeLast"] = {
				["TimeHeal"] = 1686.84,
				["Dispelled"] = 1686.84,
				["Dispels"] = 1454.841,
				["OVERALL"] = 1698.824,
				["DamageTaken"] = 1483.834,
				["HealingTaken"] = 1686.84,
				["Healing"] = 1686.84,
				["TimeDamage"] = 1698.824,
				["ActiveTime"] = 1698.824,
				["ManaGain"] = 1696.84,
				["DOT_Time"] = 1698.824,
				["Damage"] = 1698.824,
			},
			["type"] = "Grouped",
			["LastHealTime"] = 1686.987,
			["LastEventHealthMax"] = {
				3464, -- [1]
				3464, -- [2]
				4264, -- [3]
				4264, -- [4]
				4264, -- [5]
				4264, -- [6]
				4264, -- [7]
				4264, -- [8]
				4264, -- [9]
				4264, -- [10]
				4264, -- [11]
				4264, -- [12]
				4264, -- [13]
				4264, -- [14]
				4264, -- [15]
				4264, -- [16]
				4264, -- [17]
				4264, -- [18]
				4264, -- [19]
				3464, -- [20]
				3464, -- [21]
				3464, -- [22]
				3464, -- [23]
				3464, -- [24]
				3464, -- [25]
				3464, -- [26]
				3464, -- [27]
				3464, -- [28]
				3464, -- [29]
				3464, -- [30]
				3464, -- [31]
				3464, -- [32]
				3464, -- [33]
				3464, -- [34]
				3464, -- [35]
				3464, -- [36]
				3464, -- [37]
				3464, -- [38]
				3464, -- [39]
				3464, -- [40]
				3464, -- [41]
				3464, -- [42]
				3464, -- [43]
				3464, -- [44]
				3464, -- [45]
				3464, -- [46]
				3464, -- [47]
				3464, -- [48]
				3464, -- [49]
				3464, -- [50]
			},
			["LastDamageTaken"] = 615,
			["Owner"] = false,
			["Pet"] = {
				"麦兹弗格 <云淡风轻刺猬-黑龙费尔默>", -- [1]
			},
			["NextEventNum"] = 3,
			["LastDamageTime"] = 1698.996,
			["LastEvents"] = {
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 小猫掉毛-逐风者 Absorb -130 (130 被吸收) (Shadow)", -- [1]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Absorb -55 (55 被吸收) (Shadow)", -- [2]
				"为了青春-黑龙费尔默 生命虹吸 (伤害/跳) 云淡风轻刺猬-黑龙费尔默 Tick -64 (Shadow)", -- [3]
				"圆嘟嘟-黑龙费尔默 恢复 云淡风轻刺猬-黑龙费尔默 Tick +203", -- [4]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 莱荫-黑龙费尔默 Absorb -109 (109 被吸收) (Shadow)", -- [5]
				"云淡风轻刺猬-黑龙费尔默 疲劳诅咒 利群-逐风者 Resist (Shadow)", -- [6]
				"为了青春-黑龙费尔默 生命虹吸 (伤害/跳) 云淡风轻刺猬-黑龙费尔默 Tick -65 (Shadow)", -- [7]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 莱荫-黑龙费尔默 Absorb -55 (55 被吸收) (Shadow)", -- [8]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 莱荫-黑龙费尔默 Absorb -144 (144 被吸收) (Shadow)", -- [9]
				"为了青春-黑龙费尔默 生命虹吸 (伤害/跳) 云淡风轻刺猬-黑龙费尔默 Tick -65 (Shadow)", -- [10]
				"圆嘟嘟-黑龙费尔默 恢复 云淡风轻刺猬-黑龙费尔默 Tick +203", -- [11]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 莱荫-黑龙费尔默 Absorb -55 (55 被吸收) (Shadow)", -- [12]
				"利群-逐风者 噬灵瘟疫 (伤害/跳) 云淡风轻刺猬-黑龙费尔默 Tick -125 (Shadow)", -- [13]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 莱荫-黑龙费尔默 Tick -145 (Shadow)", -- [14]
				"利群-逐风者 暗言术：痛 (伤害/跳) 云淡风轻刺猬-黑龙费尔默 Tick -179 (Shadow)", -- [15]
				"圆嘟嘟-黑龙费尔默 恢复 云淡风轻刺猬-黑龙费尔默 Tick +202", -- [16]
				"利群-逐风者 心灵震爆 云淡风轻刺猬-黑龙费尔默 Hit -615 (Shadow)", -- [17]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 莱荫-黑龙费尔默 Tick -55 (Shadow)", -- [18]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 云淡风轻刺猬-黑龙费尔默 Hit +55", -- [19]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -145 (Shadow)", -- [20]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -55 (Shadow)", -- [21]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 云淡风轻刺猬-黑龙费尔默 Hit +55", -- [22]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -144 (Shadow)", -- [23]
				"云淡风轻刺猬-黑龙费尔默 献祭 暴走扁哥-黑龙费尔默 Hit -291 (Fire)", -- [24]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -55 (Shadow)", -- [25]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 云淡风轻刺猬-黑龙费尔默 Hit +55", -- [26]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -144 (Shadow)", -- [27]
				"扎恩霍恩 dispels 云淡风轻刺猬-黑龙费尔默 魔甲术 (吞噬魔法)", -- [28]
				"云淡风轻刺猬-黑龙费尔默 献祭 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -119 (Fire)", -- [29]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -55 (Shadow)", -- [30]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 云淡风轻刺猬-黑龙费尔默 Hit +55", -- [31]
				"云淡风轻刺猬-黑龙费尔默 暗影箭 暴走扁哥-黑龙费尔默 Hit -651 (Shadow)", -- [32]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -101 (Shadow)", -- [33]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -39 (Shadow)", -- [34]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 云淡风轻刺猬-黑龙费尔默 Hit +39", -- [35]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -101 (Shadow)", -- [36]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -39 (Shadow)", -- [37]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 云淡风轻刺猬-黑龙费尔默 Hit +39", -- [38]
				"利群-逐风者 dispels 云淡风轻刺猬-黑龙费尔默 暗影冥思 (驱散魔法)", -- [39]
				"利群-逐风者 dispels 云淡风轻刺猬-黑龙费尔默 牺牲 (驱散魔法)", -- [40]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -101 (Shadow)", -- [41]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Tick -39 (Shadow)", -- [42]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 云淡风轻刺猬-黑龙费尔默 Hit +39", -- [43]
				"利群-逐风者 dispels 云淡风轻刺猬-黑龙费尔默 暗影冥思 (驱散魔法)", -- [44]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Absorb -144 (144 被吸收) (Shadow)", -- [45]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Absorb -55 (55 被吸收) (Shadow)", -- [46]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Absorb -144 (144 被吸收) (Shadow)", -- [47]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Absorb -55 (55 被吸收) (Shadow)", -- [48]
				"云淡风轻刺猬-黑龙费尔默 腐蚀术 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Absorb -73 (73 被吸收) (Shadow)", -- [49]
				"云淡风轻刺猬-黑龙费尔默 生命虹吸 (伤害/跳) 扎心德勒-火妖鲁西弗隆 Absorb -55 (55 被吸收) (Shadow)", -- [50]
			},
			["Name"] = "云淡风轻刺猬-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				1697.674, -- [1]
				1698.996, -- [2]
				1475.046, -- [3]
				1475.216, -- [4]
				1477.557, -- [5]
				1477.557, -- [6]
				1478.035, -- [7]
				1479.054, -- [8]
				1480.55, -- [9]
				1481.046, -- [10]
				1481.215, -- [11]
				1482.063, -- [12]
				1482.679, -- [13]
				1483.551, -- [14]
				1484.179, -- [15]
				1484.229, -- [16]
				1484.614, -- [17]
				1485.057, -- [18]
				1485.057, -- [19]
				1664.241, -- [20]
				1665.741, -- [21]
				1665.741, -- [22]
				1667.239, -- [23]
				1668.501, -- [24]
				1668.738, -- [25]
				1668.738, -- [26]
				1670.255, -- [27]
				1671.293, -- [28]
				1671.499, -- [29]
				1671.741, -- [30]
				1671.741, -- [31]
				1673.091, -- [32]
				1679.481, -- [33]
				1680.994, -- [34]
				1680.994, -- [35]
				1682.485, -- [36]
				1683.994, -- [37]
				1683.994, -- [38]
				1684.675, -- [39]
				1684.675, -- [40]
				1685.486, -- [41]
				1686.987, -- [42]
				1686.987, -- [43]
				1687.38, -- [44]
				1688.494, -- [45]
				1689.992, -- [46]
				1691.476, -- [47]
				1692.993, -- [48]
				1694.493, -- [49]
				1695.99, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["扎心德勒-火妖鲁西弗隆"] = {
									["count"] = 18,
								},
								["小猫掉毛-逐风者"] = {
									["count"] = 3,
								},
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 30,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["扎心德勒-火妖鲁西弗隆"] = {
									["count"] = 21,
								},
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 30,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 12,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 63,
					["Damage"] = 2790,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 9,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 711,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 410,
						["Shadow"] = 2380,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 664,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 337,
								},
							},
							["amount"] = 1001,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 130,
								},
							},
							["amount"] = 130,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 165,
								},
								["暗影箭"] = {
									["count"] = 651,
								},
								["献祭"] = {
									["count"] = 291,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 433,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 119,
								},
							},
							["amount"] = 1659,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 668,
								},
							},
							["amount"] = 668,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 282,
								},
							},
							["amount"] = 282,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["云淡风轻刺猬-黑龙费尔默"] = {
									["count"] = 668,
								},
							},
							["amount"] = 668,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 8.96,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 10.32,
								},
							},
							["amount"] = 19.28,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["暗影箭"] = {
									["count"] = 1.35,
								},
								["献祭"] = {
									["count"] = 1.26,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.24,
								},
							},
							["amount"] = 10.33,
						},
					},
					["WhoDispelled"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["暗影冥思 (驱散魔法)"] = {
									["count"] = 2,
								},
								["牺牲 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["魔甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 55,
									["min"] = 39,
									["count"] = 6,
									["amount"] = 282,
								},
							},
							["count"] = 6,
							["amount"] = 282,
						},
					},
					["WhoHealed"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 282,
								},
							},
							["amount"] = 282,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 40.10999999999999,
					["Healing"] = 282,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 4,
					["Attacks"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 4,
									["amount"] = 220,
								},
								["Tick"] = {
									["max"] = 55,
									["min"] = 39,
									["count"] = 6,
									["amount"] = 282,
								},
							},
							["count"] = 10,
							["amount"] = 502,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 651,
									["min"] = 651,
									["count"] = 1,
									["amount"] = 651,
								},
							},
							["count"] = 1,
							["amount"] = 651,
						},
						["献祭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 291,
									["min"] = 291,
									["count"] = 1,
									["amount"] = 291,
								},
							},
							["count"] = 1,
							["amount"] = 291,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 144,
									["min"] = 73,
									["count"] = 4,
									["amount"] = 491,
								},
								["Tick"] = {
									["max"] = 145,
									["min"] = 101,
									["count"] = 6,
									["amount"] = 736,
								},
							},
							["count"] = 10,
							["amount"] = 1227,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 119,
									["min"] = 119,
									["count"] = 1,
									["amount"] = 119,
								},
							},
							["count"] = 1,
							["amount"] = 119,
						},
					},
					["HealingTaken"] = 282,
					["RageGain"] = 0,
					["TimeDamage"] = 31.11,
					["TimeDamaging"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 8.96,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 10.32,
								},
							},
							["amount"] = 19.28,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["暗影箭"] = {
									["count"] = 1.35,
								},
								["献祭"] = {
									["count"] = 1.26,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.24,
								},
							},
							["amount"] = 10.33,
						},
					},
					["ManaGain"] = 668,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["莱荫-黑龙费尔默"] = {
									["count"] = 9,
								},
								["扎心德勒-火妖鲁西弗隆"] = {
									["count"] = 18,
								},
								["小猫掉毛-逐风者"] = {
									["count"] = 3,
								},
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 39,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["莱荫-黑龙费尔默"] = {
									["count"] = 9,
								},
								["扎心德勒-火妖鲁西弗隆"] = {
									["count"] = 21,
								},
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 39,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeSpent"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.49,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 8.99,
						},
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["特效治疗石"] = {
									["count"] = 1.5,
								},
								["生命虹吸"] = {
									["count"] = 10.5,
								},
							},
							["amount"] = 13.5,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["暗影箭"] = {
									["count"] = 1.35,
								},
								["献祭"] = {
									["count"] = 1.26,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.24,
								},
							},
							["amount"] = 10.33,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 8.96,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 10.32,
								},
							},
							["amount"] = 19.28,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["HealedWho"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 531,
								},
								["特效治疗石"] = {
									["count"] = 1440,
								},
								["生命虹吸"] = {
									["count"] = 337,
								},
							},
							["amount"] = 2308,
						},
					},
					["ElementTakenResist"] = {
						["Shadow"] = 32,
					},
					["ElementTaken"] = {
						["Shadow"] = 6470,
						["Melee"] = 755,
						["Arcane"] = 296,
						["Fire"] = 22,
						["Physical"] = 1530,
					},
					["DOT_Time"] = 81,
					["Damage"] = 3884,
					["TimeHeal"] = 13.5,
					["Dispels"] = 1,
					["ElementDone"] = {
						["Fire"] = 410,
						["Shadow"] = 3474,
					},
					["DamagedWho"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 398,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 165,
								},
							},
							["amount"] = 563,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 664,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 337,
								},
							},
							["amount"] = 1001,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 165,
								},
								["暗影箭"] = {
									["count"] = 651,
								},
								["献祭"] = {
									["count"] = 291,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 433,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 119,
								},
							},
							["amount"] = 1659,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 531,
								},
							},
							["amount"] = 531,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 130,
								},
							},
							["amount"] = 130,
						},
					},
					["WhoDamaged"] = {
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 583,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 890,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1256,
								},
							},
							["amount"] = 2729,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 777,
								},
								["灼热之痛"] = {
									["count"] = 22,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1341,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 704,
								},
								["肉搏"] = {
									["count"] = 329,
								},
							},
							["amount"] = 3173,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1530,
								},
								["肉搏"] = {
									["count"] = 426,
								},
							},
							["amount"] = 1956,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 615,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 179,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 125,
								},
							},
							["amount"] = 919,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 296,
								},
							},
							["amount"] = 296,
						},
					},
					["TimeHealing"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["特效治疗石"] = {
									["count"] = 1.5,
								},
								["生命虹吸"] = {
									["count"] = 10.5,
								},
							},
							["amount"] = 13.5,
						},
					},
					["Dispelled"] = 5,
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["伏击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 32,
									["min"] = 32,
									["count"] = 1,
									["amount"] = 32,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 32,
							["amount"] = 19,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["云淡风轻刺猬-黑龙费尔默"] = {
									["count"] = 668,
								},
							},
							["amount"] = 668,
						},
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["伏击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 777,
									["min"] = 777,
									["count"] = 1,
									["amount"] = 777,
								},
							},
							["count"] = 1,
							["amount"] = 777,
						},
						["灼热之痛"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 329,
									["min"] = 329,
									["count"] = 1,
									["amount"] = 329,
								},
							},
							["count"] = 1,
							["amount"] = 329,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 56.6,
					["WhoDispelled"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["暗影冥思 (驱散魔法)"] = {
									["count"] = 2,
								},
								["牺牲 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["魔甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 531,
									["min"] = 531,
									["count"] = 1,
									["amount"] = 531,
								},
							},
							["count"] = 1,
							["amount"] = 531,
						},
						["特效治疗石"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1440,
									["min"] = 1440,
									["count"] = 1,
									["amount"] = 1440,
								},
							},
							["count"] = 1,
							["amount"] = 1440,
						},
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 55,
									["min"] = 39,
									["count"] = 7,
									["amount"] = 337,
								},
							},
							["count"] = 7,
							["amount"] = 337,
						},
					},
					["ManaGainedFrom"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 668,
								},
							},
							["amount"] = 668,
						},
					},
					["DamageTaken"] = 9073,
					["ElementDoneAbsorb"] = {
						["Shadow"] = 1074,
					},
					["Healing"] = 2308,
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 39,
								},
							},
							["amount"] = 41,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["WhoHealed"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 531,
								},
								["特效治疗石"] = {
									["count"] = 1440,
								},
								["生命虹吸"] = {
									["count"] = 337,
								},
							},
							["amount"] = 2308,
						},
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 1331,
								},
								["快速治疗"] = {
									["count"] = 2983,
								},
								["恢复"] = {
									["count"] = 608,
								},
							},
							["amount"] = 4922,
						},
					},
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 531,
									["min"] = 531,
									["count"] = 1,
									["amount"] = 531,
								},
							},
							["count"] = 1,
							["amount"] = 531,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 651,
									["min"] = 651,
									["count"] = 1,
									["amount"] = 651,
								},
							},
							["count"] = 1,
							["amount"] = 651,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 55,
									["min"] = 39,
									["count"] = 7,
									["amount"] = 337,
								},
								["Absorb"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 6,
									["amount"] = 330,
								},
							},
							["count"] = 13,
							["amount"] = 667,
						},
						["疲劳诅咒"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["生命虹吸"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 291,
									["min"] = 291,
									["count"] = 1,
									["amount"] = 291,
								},
							},
							["count"] = 1,
							["amount"] = 291,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 145,
									["min"] = 101,
									["count"] = 7,
									["amount"] = 881,
								},
								["Absorb"] = {
									["max"] = 144,
									["min"] = 73,
									["count"] = 6,
									["amount"] = 744,
								},
							},
							["count"] = 13,
							["amount"] = 1625,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 119,
									["min"] = 119,
									["count"] = 1,
									["amount"] = 119,
								},
							},
							["count"] = 1,
							["amount"] = 119,
						},
					},
					["HealingTaken"] = 7230,
					["ElementTakenAbsorb"] = {
						["Fire"] = 329,
						["Shadow"] = 777,
					},
					["TimeDamage"] = 43.09999999999999,
					["TimeDamaging"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.49,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 8.99,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 8.96,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 10.32,
								},
							},
							["amount"] = 19.28,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["暗影箭"] = {
									["count"] = 1.35,
								},
								["献祭"] = {
									["count"] = 1.26,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.24,
								},
							},
							["amount"] = 10.33,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 668,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 12,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 14,
								},
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 30,
						},
					},
					["DispelledWho"] = {
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 1453.836,
			["LastActive"] = 1698.824,
		},
		["小小的贼-逐风者"] = {
			["GUID"] = "Player-5451-02EFE80C",
			["LastEventHealth"] = {
				3191, -- [1]
				3191, -- [2]
				3051, -- [3]
				3051, -- [4]
				3051, -- [5]
				2914, -- [6]
				2762, -- [7]
				2631, -- [8]
				2479, -- [9]
				2415, -- [10]
				2308, -- [11]
				1395, -- [12]
				1272, -- [13]
				1150, -- [14]
				1400, -- [15]
				1678, -- [16]
				1928, -- [17]
				2206, -- [18]
				2484, -- [19]
				2484, -- [20]
				2484, -- [21]
				2484, -- [22]
				2484, -- [23]
				2484, -- [24]
				2484, -- [25]
				919, -- [26]
				824, -- [27]
				1792, -- [28]
				1194, -- [29]
				1105, -- [30]
				952, -- [31]
				730, -- [32]
				730, -- [33]
				730, -- [34]
				577, -- [35]
				0, -- [36]
				3343, -- [37]
				3343, -- [38]
				3343, -- [39]
				3343, -- [40]
				3343, -- [41]
				3343, -- [42]
				3343, -- [43]
				3343, -- [44]
				3343, -- [45]
				3343, -- [46]
				3343, -- [47]
				3343, -- [48]
				3191, -- [49]
				3191, -- [50]
			},
			["LastAttackedBy"] = "暴走扁哥-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"HEAL", -- [15]
				"HEAL", -- [16]
				"HEAL", -- [17]
				"HEAL", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"HEAL", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"MISC", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					5.48, -- [1]
				},
				["Healing"] = {
					1250, -- [1]
				},
				["DamageTaken"] = {
					5970, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Overhealing"] = {
					95, -- [1]
				},
				["TimeDamage"] = {
					24.21, -- [1]
				},
				["HOT_Time"] = {
					15, -- [1]
				},
				["HealingTaken"] = {
					2218, -- [1]
				},
				["ActiveTime"] = {
					29.69, -- [1]
				},
				["Damage"] = {
					8124, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "小小的贼-逐风者",
			["LastHealTime"] = 1693.592,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
					},
					["Messages"] = {
						"小小的贼-逐风者 肉搏 babayaga-逐风者 Crit -214 (Physical)", -- [1]
						"克萨德鲁姆 肉搏 小小的贼-逐风者 Hit -73 (Physical)", -- [2]
						"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -222 (Shadow)", -- [3]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -95 (Shadow)", -- [4]
						"babayaga-逐风者 冰锥术 小小的贼-逐风者 Crit -1066 (Frost)", -- [5]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -95 (Shadow)", -- [6]
						"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -223 (Shadow)", -- [7]
						"babayaga-逐风者 魔爆术 小小的贼-逐风者 Resist (Arcane)", -- [8]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -95 (Shadow)", -- [9]
						"babayaga-逐风者 魔爆术 小小的贼-逐风者 Hit -304 (Arcane)", -- [10]
						"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -223 (Shadow)", -- [11]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -95 (Shadow)", -- [12]
						"圆嘟嘟-黑龙费尔默 快速治疗 小小的贼-逐风者 Hit +968", -- [13]
						"babayaga-逐风者 火焰冲击 小小的贼-逐风者 Hit -598 (Fire)", -- [14]
						"克萨德鲁姆 肉搏 小小的贼-逐风者 Hit -89 (Physical)", -- [15]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -153 (Shadow)", -- [16]
						"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -222 (Shadow)", -- [17]
						"小小的贼-逐风者 肉搏 克萨德鲁姆 Miss (1)", -- [18]
						"小小的贼-逐风者 邪恶攻击 克萨德鲁姆 Crit -554 (Physical)", -- [19]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -153 (Shadow)", -- [20]
						"扎心德勒-火妖鲁西弗隆 暗影灼烧 小小的贼-逐风者 Hit -814 (Shadow)", -- [21]
						"小小的贼-逐风者死亡。", -- [22]
					},
					["DeathAt"] = 1617.838,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
					},
					["MessageTimes"] = {
						-14.33400000000006, -- [1]
						-12.61699999999996, -- [2]
						-11.61699999999996, -- [3]
						-11.11699999999996, -- [4]
						-10.68399999999997, -- [5]
						-9.116999999999962, -- [6]
						-8.616999999999962, -- [7]
						-8.299999999999955, -- [8]
						-7.116999999999962, -- [9]
						-6.799999999999955, -- [10]
						-5.616999999999962, -- [11]
						-5.116999999999962, -- [12]
						-4.849999999999909, -- [13]
						-4.017000000000053, -- [14]
						-3.383000000000038, -- [15]
						-3.099999999999909, -- [16]
						-2.615999999999985, -- [17]
						-2.133000000000038, -- [18]
						-2.133000000000038, -- [19]
						-1.115999999999985, -- [20]
						-0.0160000000000764, -- [21]
						0, -- [22]
					},
					["HealthMax"] = {
						3343, -- [1]
						3343, -- [2]
						3343, -- [3]
						3343, -- [4]
						3343, -- [5]
						3343, -- [6]
						3343, -- [7]
						3343, -- [8]
						3343, -- [9]
						3343, -- [10]
						3343, -- [11]
						3343, -- [12]
						3343, -- [13]
						3343, -- [14]
						3343, -- [15]
						3343, -- [16]
						3343, -- [17]
						3343, -- [18]
						3343, -- [19]
						3343, -- [20]
						3343, -- [21]
						3343, -- [22]
					},
					["Health"] = {
						3315, -- [1]
						3315, -- [2]
						3242, -- [3]
						3020, -- [4]
						2925, -- [5]
						1859, -- [6]
						1764, -- [7]
						1541, -- [8]
						1541, -- [9]
						1446, -- [10]
						1142, -- [11]
						919, -- [12]
						824, -- [13]
						1792, -- [14]
						1194, -- [15]
						1105, -- [16]
						952, -- [17]
						730, -- [18]
						730, -- [19]
						730, -- [20]
						577, -- [21]
						0, -- [22]
					},
					["KilledBy"] = "扎心德勒-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"MISC", -- [22]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "痛苦诅咒 (伤害/跳)",
			["LastFightIn"] = 2,
			["type"] = "Grouped",
			["LastDamageTaken"] = 151,
			["TimeLast"] = {
				["TimeHeal"] = 1692.826,
				["OVERALL"] = 1698.824,
				["DamageTaken"] = 1686.84,
				["Healing"] = 1692.826,
				["HealingTaken"] = 1692.826,
				["Overhealing"] = 1657.823,
				["TimeDamage"] = 1698.824,
				["HOT_Time"] = 1692.826,
				["DeathCount"] = 1615.842,
				["ActiveTime"] = 1698.824,
				["Damage"] = 1698.824,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3343, -- [1]
				3343, -- [2]
				3343, -- [3]
				3343, -- [4]
				3343, -- [5]
				3343, -- [6]
				3343, -- [7]
				3343, -- [8]
				3343, -- [9]
				3343, -- [10]
				3343, -- [11]
				3343, -- [12]
				3343, -- [13]
				3343, -- [14]
				3343, -- [15]
				3343, -- [16]
				3343, -- [17]
				3343, -- [18]
				3343, -- [19]
				3343, -- [20]
				3343, -- [21]
				3343, -- [22]
				3343, -- [23]
				3343, -- [24]
				3343, -- [25]
				3343, -- [26]
				3343, -- [27]
				3343, -- [28]
				3343, -- [29]
				3343, -- [30]
				3343, -- [31]
				3343, -- [32]
				3343, -- [33]
				3343, -- [34]
				3343, -- [35]
				3343, -- [36]
				3343, -- [37]
				3343, -- [38]
				3343, -- [39]
				3343, -- [40]
				3343, -- [41]
				3343, -- [42]
				3343, -- [43]
				3343, -- [44]
				3343, -- [45]
				3343, -- [46]
				3343, -- [47]
				3343, -- [48]
				3343, -- [49]
				3343, -- [50]
			},
			["NextEventNum"] = 26,
			["LastDamageTime"] = 1698.996,
			["LastEvents"] = {
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -64 (Shadow)", -- [1]
				"扎恩霍恩 肉搏 小小的贼-逐风者 Hit -76 (Physical)", -- [2]
				"小小的贼-逐风者 肉搏 暴走扁哥-黑龙费尔默 Hit -119 (Physical)", -- [3]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -64 (Shadow)", -- [4]
				"扎恩霍恩 肉搏 小小的贼-逐风者 Hit -73 (Physical)", -- [5]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -152 (Shadow)", -- [6]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -64 (Shadow)", -- [7]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -152 (Shadow)", -- [8]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -64 (Shadow)", -- [9]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -107 (Shadow)", -- [10]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -152 (Shadow)", -- [11]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -151 (Shadow)", -- [12]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -151 (Shadow)", -- [13]
				"小小的贼-逐风者 急救 小小的贼-逐风者 Tick +250", -- [14]
				"小小的贼-逐风者 急救 小小的贼-逐风者 Tick +250", -- [15]
				"小小的贼-逐风者 急救 小小的贼-逐风者 Tick +250", -- [16]
				"小小的贼-逐风者 急救 小小的贼-逐风者 Tick +250", -- [17]
				"小小的贼-逐风者 急救 小小的贼-逐风者 Tick +250", -- [18]
				"小小的贼-逐风者 偷袭 小猫掉毛-逐风者 Resist (Physical)", -- [19]
				"小小的贼-逐风者 邪恶攻击 小猫掉毛-逐风者 Hit -254 (Physical)", -- [20]
				"小小的贼-逐风者 肉搏 小猫掉毛-逐风者 Absorb -256 (256 被吸收) (1)", -- [21]
				"小小的贼-逐风者 肉搏 小猫掉毛-逐风者 Miss (1)", -- [22]
				"小小的贼-逐风者 邪恶攻击 小猫掉毛-逐风者 Absorb -669 (669 被吸收) (Physical)", -- [23]
				"小小的贼-逐风者 肉搏 小猫掉毛-逐风者 Absorb -59 (1)", -- [24]
				"小小的贼-逐风者 邪恶攻击 小猫掉毛-逐风者 Hit -238 (59 被吸收) (Physical)", -- [25]
				"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -95 (Shadow)", -- [26]
				"圆嘟嘟-黑龙费尔默 快速治疗 小小的贼-逐风者 Hit +968", -- [27]
				"babayaga-逐风者 火焰冲击 小小的贼-逐风者 Hit -598 (Fire)", -- [28]
				"克萨德鲁姆 肉搏 小小的贼-逐风者 Hit -89 (Physical)", -- [29]
				"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -153 (Shadow)", -- [30]
				"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -222 (Shadow)", -- [31]
				"小小的贼-逐风者 肉搏 克萨德鲁姆 Miss (1)", -- [32]
				"小小的贼-逐风者 邪恶攻击 克萨德鲁姆 Crit -554 (Physical)", -- [33]
				"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小小的贼-逐风者 Tick -153 (Shadow)", -- [34]
				"扎心德勒-火妖鲁西弗隆 暗影灼烧 小小的贼-逐风者 Hit -814 (Shadow)", -- [35]
				"小小的贼-逐风者死亡。", -- [36]
				"小小的贼-逐风者 神圣力量 小小的贼-逐风者 Hit +95 (95 过量治疗)", -- [37]
				"小小的贼-逐风者 肉搏 暴走扁哥-黑龙费尔默 Hit -254 (Physical)", -- [38]
				"小小的贼-逐风者 邪恶攻击 暴走扁哥-黑龙费尔默 Hit -310 (Physical)", -- [39]
				"小小的贼-逐风者 肉搏 暴走扁哥-黑龙费尔默 Hit -111 (Physical)", -- [40]
				"小小的贼-逐风者 邪恶攻击 暴走扁哥-黑龙费尔默 Hit -282 (Physical)", -- [41]
				"小小的贼-逐风者 邪恶攻击 暴走扁哥-黑龙费尔默 Hit -296 (Physical)", -- [42]
				"小小的贼-逐风者 肉搏 暴走扁哥-黑龙费尔默 Miss (1)", -- [43]
				"小小的贼-逐风者 肉搏 暴走扁哥-黑龙费尔默 Crit -502 (Physical)", -- [44]
				"扎恩霍恩 肉搏 小小的贼-逐风者 Dodge (1)", -- [45]
				"小小的贼-逐风者 肉搏 暴走扁哥-黑龙费尔默 Crit -263 (Physical)", -- [46]
				"小小的贼-逐风者 肾击 暴走扁哥-黑龙费尔默 Resist (Physical)", -- [47]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 小小的贼-逐风者 Tick -152 (Shadow)", -- [48]
				"小小的贼-逐风者 肉搏 暴走扁哥-黑龙费尔默 Hit -270 (Physical)", -- [49]
				"小小的贼-逐风者 肉搏 (剑类武器专精) 暴走扁哥-黑龙费尔默 Hit -275 (Physical)", -- [50]
			},
			["Name"] = "小小的贼-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				1665.057, -- [1]
				1665.174, -- [2]
				1665.374, -- [3]
				1667.038, -- [4]
				1667.184, -- [5]
				1667.542, -- [6]
				1669.046, -- [7]
				1670.547, -- [8]
				1671.052, -- [9]
				1673.057, -- [10]
				1673.542, -- [11]
				1685.063, -- [12]
				1687.042, -- [13]
				1689.61, -- [14]
				1690.612, -- [15]
				1691.592, -- [16]
				1692.609, -- [17]
				1693.592, -- [18]
				1695.831, -- [19]
				1696.84, -- [20]
				1697.171, -- [21]
				1697.574, -- [22]
				1697.844, -- [23]
				1698.996, -- [24]
				1698.996, -- [25]
				1610.92, -- [26]
				1611.187, -- [27]
				1612.02, -- [28]
				1612.654, -- [29]
				1612.937, -- [30]
				1613.421, -- [31]
				1613.904, -- [32]
				1613.904, -- [33]
				1614.921, -- [34]
				1616.021, -- [35]
				1616.037, -- [36]
				1658.557, -- [37]
				1658.557, -- [38]
				1658.557, -- [39]
				1659.457, -- [40]
				1659.557, -- [41]
				1660.557, -- [42]
				1661.759, -- [43]
				1661.874, -- [44]
				1662.045, -- [45]
				1663.574, -- [46]
				1664.497, -- [47]
				1664.542, -- [48]
				1664.666, -- [49]
				1664.666, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5970,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 21,
								},
							},
							["amount"] = 22,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 15,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 13,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 1094,
						["Melee"] = 311,
						["Arcane"] = 304,
						["Fire"] = 598,
						["Shadow"] = 3663,
					},
					["DOT_Time"] = 0,
					["Damage"] = 6130,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 5.48,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 686,
						["Physical"] = 1149,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 2638,
						["Physical"] = 3492,
					},
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 315,
								},
								["邪恶攻击"] = {
									["count"] = 1161,
								},
							},
							["amount"] = 1476,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 888,
								},
								["肉搏 (剑类武器专精)"] = {
									["count"] = 275,
								},
								["肉搏"] = {
									["count"] = 1519,
								},
							},
							["amount"] = 2682,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 554,
								},
							},
							["amount"] = 554,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 804,
								},
								["邪恶攻击"] = {
									["count"] = 614,
								},
							},
							["amount"] = 1418,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 814,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 890,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 686,
								},
							},
							["amount"] = 2390,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 608,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 665,
								},
							},
							["amount"] = 1273,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 149,
								},
							},
							["amount"] = 149,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 162,
								},
							},
							["amount"] = 162,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 304,
								},
								["火焰冲击"] = {
									["count"] = 598,
								},
								["冰锥术"] = {
									["count"] = 1066,
								},
								["冰霜新星"] = {
									["count"] = 28,
								},
							},
							["amount"] = 1996,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 5.48,
								},
							},
							["amount"] = 5.48,
						},
					},
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 95,
									["min"] = 95,
									["count"] = 1,
									["amount"] = 95,
								},
							},
							["count"] = 1,
							["amount"] = 95,
						},
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1250,
								},
							},
							["amount"] = 1250,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 95,
					["TimeSpent"] = {
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肾击"] = {
									["count"] = 0.92,
								},
								["邪恶攻击"] = {
									["count"] = 1.1,
								},
								["肉搏"] = {
									["count"] = 6.1,
								},
							},
							["amount"] = 8.120000000000001,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.88,
								},
								["邪恶攻击"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 4.66,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 5.48,
								},
							},
							["amount"] = 5.48,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.82,
								},
								["邪恶攻击"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 4.34,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 5,
									["amount"] = 1250,
								},
							},
							["count"] = 5,
							["amount"] = 1250,
						},
					},
					["WhoHealed"] = {
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1250,
								},
							},
							["amount"] = 1250,
						},
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 968,
								},
							},
							["amount"] = 968,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 24.09999999999999,
					["Healing"] = 1250,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["肉搏 (剑类武器专精)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 275,
									["min"] = 275,
									["count"] = 1,
									["amount"] = 275,
								},
							},
							["count"] = 1,
							["amount"] = 275,
						},
						["肾击"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["偷袭"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 270,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 754,
								},
								["Absorb"] = {
									["max"] = 256,
									["min"] = 59,
									["count"] = 5,
									["amount"] = 905,
								},
								["Crit"] = {
									["max"] = 502,
									["min"] = 214,
									["count"] = 3,
									["amount"] = 979,
								},
								["Miss"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 2638,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 669,
									["min"] = 261,
									["count"] = 2,
									["amount"] = 930,
								},
								["Crit"] = {
									["max"] = 554,
									["min"] = 554,
									["count"] = 1,
									["amount"] = 554,
								},
								["Hit"] = {
									["max"] = 310,
									["min"] = 109,
									["count"] = 7,
									["amount"] = 1733,
								},
							},
							["count"] = 10,
							["amount"] = 3217,
						},
					},
					["HealingTaken"] = 2218,
					["RageGain"] = 0,
					["TimeDamage"] = 18.61999999999999,
					["TimeDamaging"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.88,
								},
								["邪恶攻击"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 4.66,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肾击"] = {
									["count"] = 0.92,
								},
								["邪恶攻击"] = {
									["count"] = 1.1,
								},
								["肉搏"] = {
									["count"] = 6.1,
								},
							},
							["amount"] = 8.120000000000001,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.82,
								},
								["邪恶攻击"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 4.34,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["小小的贼-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 5.48,
								},
							},
							["amount"] = 5.48,
						},
					},
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 95,
									["min"] = 95,
									["count"] = 1,
									["amount"] = 95,
								},
							},
							["count"] = 1,
							["amount"] = 95,
						},
					},
					["TimeSpent"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.88,
								},
								["邪恶攻击"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 4.66,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 5.48,
								},
							},
							["amount"] = 5.48,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肾击"] = {
									["count"] = 0.92,
								},
								["邪恶攻击"] = {
									["count"] = 1.1,
								},
								["肉搏"] = {
									["count"] = 6.1,
								},
							},
							["amount"] = 8.120000000000001,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.82,
								},
								["邪恶攻击"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 4.34,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.09,
								},
							},
							["amount"] = 4.09,
						},
					},
					["DamageTaken"] = 5970,
					["ElementDoneAbsorb"] = {
						["Melee"] = 1169,
						["Physical"] = 1822,
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 29.69,
					["ElementTaken"] = {
						["Frost"] = 1094,
						["Melee"] = 311,
						["Arcane"] = 304,
						["Fire"] = 598,
						["Shadow"] = 3663,
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["小小的贼-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 8124,
					["HealedWho"] = {
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1250,
								},
							},
							["amount"] = 1250,
						},
					},
					["TimeHeal"] = 5.48,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 5,
									["amount"] = 1250,
								},
							},
							["count"] = 5,
							["amount"] = 1250,
						},
					},
					["Overhealing"] = 95,
					["HOT_Time"] = 15,
					["Healing"] = 1250,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 21,
								},
							},
							["amount"] = 22,
						},
					},
					["WhoHealed"] = {
						["小小的贼-逐风者"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1250,
								},
							},
							["amount"] = 1250,
						},
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 968,
								},
							},
							["amount"] = 968,
						},
					},
					["ElementDone"] = {
						["Melee"] = 3728,
						["Physical"] = 4396,
					},
					["HealingTaken"] = 2218,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
								["Absorb"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 4,
								},
							},
							["amount"] = 19,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 16,
						},
					},
					["TimeDamage"] = 24.21,
					["TimeDamaging"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.88,
								},
								["邪恶攻击"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 4.66,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["肾击"] = {
									["count"] = 0.92,
								},
								["邪恶攻击"] = {
									["count"] = 1.1,
								},
								["肉搏"] = {
									["count"] = 6.1,
								},
							},
							["amount"] = 8.120000000000001,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.82,
								},
								["邪恶攻击"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 4.34,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.09,
								},
							},
							["amount"] = 4.09,
						},
					},
					["Attacks"] = {
						["肉搏 (剑类武器专精)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 275,
									["min"] = 275,
									["count"] = 1,
									["amount"] = 275,
								},
							},
							["count"] = 1,
							["amount"] = 275,
						},
						["肾击"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["偷袭"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 673,
									["min"] = 261,
									["count"] = 3,
									["amount"] = 1603,
								},
								["Crit"] = {
									["max"] = 554,
									["min"] = 554,
									["count"] = 1,
									["amount"] = 554,
								},
								["Hit"] = {
									["max"] = 310,
									["min"] = 109,
									["count"] = 8,
									["amount"] = 1964,
								},
							},
							["count"] = 12,
							["amount"] = 4121,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 270,
									["min"] = 111,
									["count"] = 5,
									["amount"] = 949,
								},
								["Absorb"] = {
									["max"] = 483,
									["min"] = 59,
									["count"] = 6,
									["amount"] = 1388,
								},
								["Crit"] = {
									["max"] = 502,
									["min"] = 214,
									["count"] = 4,
									["amount"] = 1391,
								},
								["Miss"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 3728,
						},
					},
					["WhoDamaged"] = {
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 814,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 890,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 686,
								},
							},
							["amount"] = 2390,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 608,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 665,
								},
							},
							["amount"] = 1273,
						},
						["扎恩霍恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 149,
								},
							},
							["amount"] = 149,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 162,
								},
							},
							["amount"] = 162,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 304,
								},
								["火焰冲击"] = {
									["count"] = 598,
								},
								["冰锥术"] = {
									["count"] = 1066,
								},
								["冰霜新星"] = {
									["count"] = 28,
								},
							},
							["amount"] = 1996,
						},
					},
					["DamagedWho"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 315,
								},
								["邪恶攻击"] = {
									["count"] = 1161,
								},
							},
							["amount"] = 1476,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 888,
								},
								["肉搏 (剑类武器专精)"] = {
									["count"] = 275,
								},
								["肉搏"] = {
									["count"] = 1519,
								},
							},
							["amount"] = 2682,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 804,
								},
								["邪恶攻击"] = {
									["count"] = 614,
								},
							},
							["amount"] = 1418,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 673,
								},
								["肉搏"] = {
									["count"] = 483,
								},
							},
							["amount"] = 1156,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 554,
								},
							},
							["amount"] = 554,
						},
						["丶舊知己丶-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 231,
								},
								["肉搏"] = {
									["count"] = 607,
								},
							},
							["amount"] = 838,
						},
					},
				},
			},
			["UnitLockout"] = 1463.833,
			["LastActive"] = 1698.824,
		},
		["湘六六叁捌"] = {
			["GUID"] = "Player-5458-03196120",
			["LastEventHealth"] = {
				2600, -- [1]
				2343, -- [2]
				1745, -- [3]
				1631, -- [4]
				849, -- [5]
				712, -- [6]
				598, -- [7]
				0, -- [8]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"MISC", -- [8]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					1.5, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["DamageTaken"] = {
					2263, -- [1]
				},
				["ActiveTime"] = {
					1.5, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "湘六六叁捌",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
					},
					["Messages"] = {
						"莱荫-黑龙费尔默 献祭 (伤害/跳) 湘六六叁捌 Tick -114 (Fire)", -- [1]
						"莱荫-黑龙费尔默 暗影箭 湘六六叁捌 Hit -782 (Shadow)", -- [2]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 湘六六叁捌 Tick -137 (Shadow)", -- [3]
						"莱荫-黑龙费尔默 献祭 (伤害/跳) 湘六六叁捌 Tick -114 (Fire)", -- [4]
						"莱荫-黑龙费尔默 暗影箭 湘六六叁捌 Hit -825 (Shadow)", -- [5]
						"湘六六叁捌死亡。", -- [6]
					},
					["DeathAt"] = 1544.845,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
					},
					["MessageTimes"] = {
						-3.914999999999964, -- [1]
						-3.38799999999992, -- [2]
						-1.825000000000046, -- [3]
						-0.9369999999998981, -- [4]
						-0.02299999999991087, -- [5]
						0, -- [6]
					},
					["HealthMax"] = {
						2600, -- [1]
						2600, -- [2]
						2600, -- [3]
						2600, -- [4]
						2600, -- [5]
						2600, -- [6]
					},
					["Health"] = {
						1745, -- [1]
						1631, -- [2]
						849, -- [3]
						712, -- [4]
						598, -- [5]
						0, -- [6]
					},
					["KilledBy"] = "莱荫-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"MISC", -- [6]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暗影箭",
			["LastFightIn"] = 1,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				2600, -- [1]
				2600, -- [2]
				2600, -- [3]
				2600, -- [4]
				2600, -- [5]
				2600, -- [6]
				2600, -- [7]
				2600, -- [8]
			},
			["LastDamageTaken"] = 825,
			["Owner"] = false,
			["TimeLast"] = {
				["DeathCount"] = 1542.833,
				["ActiveTime"] = 1468.832,
				["OVERALL"] = 1542.833,
				["DamageTaken"] = 1542.833,
				["TimeDamage"] = 1468.832,
			},
			["NextEventNum"] = 9,
			["LastDamageTime"] = 1469.042,
			["LastEvents"] = {
				"皇鹰-逐风者 魔爆术 湘六六叁捌 Hit -291 (Arcane)", -- [1]
				"湘六六叁捌 法术反制 皇鹰-逐风者 Immune (Arcane)", -- [2]
				"莱荫-黑龙费尔默 献祭 (伤害/跳) 湘六六叁捌 Tick -114 (Fire)", -- [3]
				"莱荫-黑龙费尔默 暗影箭 湘六六叁捌 Hit -782 (Shadow)", -- [4]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 湘六六叁捌 Tick -137 (Shadow)", -- [5]
				"莱荫-黑龙费尔默 献祭 (伤害/跳) 湘六六叁捌 Tick -114 (Fire)", -- [6]
				"莱荫-黑龙费尔默 暗影箭 湘六六叁捌 Hit -825 (Shadow)", -- [7]
				"湘六六叁捌死亡。", -- [8]
			},
			["Name"] = "湘六六叁捌",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
			},
			["LastEventTimes"] = {
				1460.653, -- [1]
				1469.042, -- [2]
				1539.768, -- [3]
				1540.295, -- [4]
				1541.858, -- [5]
				1542.746, -- [6]
				1543.66, -- [7]
				1543.683, -- [8]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeDamaging"] = {
						["皇鹰-逐风者"] = {
							["Details"] = {
								["法术反制"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 2263,
					["Attacks"] = {
						["法术反制"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 1.5,
					["WhoDamaged"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1607,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 228,
								},
							},
							["amount"] = 1835,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 291,
								},
							},
							["amount"] = 291,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 137,
								},
							},
							["amount"] = 137,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 228,
						["Shadow"] = 1744,
						["Arcane"] = 291,
					},
					["TimeDamage"] = 1.5,
					["TimeSpent"] = {
						["皇鹰-逐风者"] = {
							["Details"] = {
								["法术反制"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
				},
			},
			["UnitLockout"] = 1459.828,
			["LastActive"] = 1542.833,
		},
		["六毛六-逐风者"] = {
			["GUID"] = "Player-5451-02F03C50",
			["TimeLast"] = {
				["TimeHeal"] = 1677.825,
				["Dispelled"] = 1624.825,
				["Dispels"] = 1624.825,
				["Healing"] = 1677.825,
				["DamageTaken"] = 1678.837,
				["ActiveTime"] = 1770.853,
				["Overhealing"] = 1670.825,
				["HealingTaken"] = 1677.825,
				["FDamage"] = 1678.837,
				["TimeDamage"] = 1770.853,
				["OVERALL"] = 1770.853,
				["ManaGain"] = 1681.842,
				["DOT_Time"] = 1770.853,
				["Damage"] = 1770.853,
			},
			["LastAttackedBy"] = "babayaga-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"HEAL", -- [21]
				"DAMAGE", -- [22]
				"HEAL", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"HEAL", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"HEAL", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					13.49, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["Dispels"] = {
					1, -- [1]
				},
				["Healing"] = {
					1452, -- [1]
				},
				["DamageTaken"] = {
					6146, -- [1]
				},
				["ActiveTime"] = {
					85.85999999999999, -- [1]
				},
				["HealingTaken"] = {
					5467, -- [1]
				},
				["FDamage"] = {
					1678, -- [1]
				},
				["TimeDamage"] = {
					72.36999999999999, -- [1]
				},
				["Overhealing"] = {
					177, -- [1]
				},
				["ManaGain"] = {
					613, -- [1]
				},
				["DOT_Time"] = {
					198, -- [1]
				},
				["Damage"] = {
					8875, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = "六毛六-逐风者",
			["level"] = 60,
			["LastDamageAbility"] = "冰锥术",
			["LastFightIn"] = 3,
			["LastDamageTaken"] = 370,
			["type"] = "Grouped",
			["LastHealTime"] = 1678.734,
			["LastEventHealth"] = {
				3354, -- [1]
				2984, -- [2]
				2984, -- [3]
				2990, -- [4]
				1, -- [5]
				1, -- [6]
				1, -- [7]
				1, -- [8]
				1, -- [9]
				3586, -- [10]
				3586, -- [11]
				3586, -- [12]
				3586, -- [13]
				3586, -- [14]
				3586, -- [15]
				3606, -- [16]
				3606, -- [17]
				3453, -- [18]
				3453, -- [19]
				3453, -- [20]
				3453, -- [21]
				3551, -- [22]
				3551, -- [23]
				3644, -- [24]
				3644, -- [25]
				3644, -- [26]
				3644, -- [27]
				3644, -- [28]
				3644, -- [29]
				3626, -- [30]
				3626, -- [31]
				3626, -- [32]
				3318, -- [33]
				3318, -- [34]
				3173, -- [35]
				3179, -- [36]
				3179, -- [37]
				3179, -- [38]
				3276, -- [39]
				3282, -- [40]
				3282, -- [41]
				3380, -- [42]
				3380, -- [43]
				3154, -- [44]
				3154, -- [45]
				3251, -- [46]
				3251, -- [47]
				3257, -- [48]
				3257, -- [49]
				3354, -- [50]
			},
			["LastEventHealthMax"] = {
				3644, -- [1]
				3644, -- [2]
				3644, -- [3]
				3644, -- [4]
				3644, -- [5]
				3644, -- [6]
				3644, -- [7]
				3644, -- [8]
				3644, -- [9]
				3644, -- [10]
				3644, -- [11]
				3644, -- [12]
				3644, -- [13]
				3644, -- [14]
				3644, -- [15]
				3644, -- [16]
				3644, -- [17]
				3644, -- [18]
				3644, -- [19]
				3644, -- [20]
				3644, -- [21]
				3644, -- [22]
				3644, -- [23]
				3644, -- [24]
				3644, -- [25]
				3644, -- [26]
				3644, -- [27]
				3644, -- [28]
				3644, -- [29]
				3644, -- [30]
				3644, -- [31]
				3644, -- [32]
				3644, -- [33]
				3644, -- [34]
				3644, -- [35]
				3644, -- [36]
				3644, -- [37]
				3644, -- [38]
				3644, -- [39]
				3644, -- [40]
				3644, -- [41]
				3644, -- [42]
				3644, -- [43]
				3644, -- [44]
				3644, -- [45]
				3644, -- [46]
				3644, -- [47]
				3644, -- [48]
				3644, -- [49]
				3644, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"格里鲁姆 <六毛六-逐风者>", -- [1]
			},
			["NextEventNum"] = 10,
			["LastDamageTime"] = 1771.453,
			["LastEvents"] = {
				"babayaga-逐风者 冰锥术 六毛六-逐风者 Hit -370 (Frost)", -- [1]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -158 (Shadow)", -- [2]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Tick -115 (Shadow)", -- [3]
				"六毛六-逐风者 腐蚀术 (伤害/跳) babayaga-逐风者 Tick -155 (Shadow)", -- [4]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) 皇家特工-逐风者 Tick -115 (Shadow)", -- [5]
				"六毛六-逐风者 腐蚀术 (伤害/跳) 皇家特工-逐风者 Tick -155 (Shadow)", -- [6]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) 皇家特工-逐风者 Tick -116 (Shadow)", -- [7]
				"六毛六-逐风者 腐蚀术 (伤害/跳) 皇家特工-逐风者 Tick -155 (Shadow)", -- [8]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) 皇家特工-逐风者 Tick -115 (Shadow)", -- [9]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Absorb -67 (67 被吸收) (Shadow)", -- [10]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Absorb -97 (97 被吸收) (Shadow)", -- [11]
				"babayaga-逐风者 变形术 六毛六-逐风者 Resist (Arcane)", -- [12]
				"六毛六-逐风者 肉搏 babayaga-逐风者 Absorb -77 (1)", -- [13]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -20 (77 被吸收) (Shadow)", -- [14]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +20", -- [15]
				"小猫掉毛-逐风者 神圣新星 六毛六-逐风者 Hit -159 (Holy)", -- [16]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -68 (Shadow)", -- [17]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Tick -68 (Shadow)", -- [18]
				"六毛六-逐风者 腐蚀术 (伤害/跳) babayaga-逐风者 Tick -155 (Shadow)", -- [19]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -98 (Shadow)", -- [20]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +98", -- [21]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -98 (Shadow)", -- [22]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +98 (5 过量治疗)", -- [23]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Tick -68 (Shadow)", -- [24]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -98 (Shadow)", -- [25]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +98 (98 过量治疗)", -- [26]
				"六毛六-逐风者 腐蚀术 (伤害/跳) babayaga-逐风者 Tick -155 (Shadow)", -- [27]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Tick -67 (Shadow)", -- [28]
				"babayaga-逐风者 冰霜新星 六毛六-逐风者 Hit -18 (Frost)", -- [29]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -7 (Shadow)", -- [30]
				"babayaga-逐风者 魔爆术 六毛六-逐风者 Crit -308 (Arcane)", -- [31]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -132 (Shadow)", -- [32]
				"小猫掉毛-逐风者 神圣新星 六毛六-逐风者 Hit -145 (Holy)", -- [33]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -62 (Shadow)", -- [34]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Tick -115 (Shadow)", -- [35]
				"六毛六-逐风者 腐蚀术 (伤害/跳) babayaga-逐风者 Tick -155 (Shadow)", -- [36]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -97 (Shadow)", -- [37]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +97", -- [38]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Tick -115 (Shadow)", -- [39]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -98 (Shadow)", -- [40]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +98", -- [41]
				"babayaga-逐风者 魔爆术 六毛六-逐风者 Crit -226 (72 被抵抗) (Arcane)", -- [42]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -96 (Shadow)", -- [43]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -97 (Shadow)", -- [44]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +97", -- [45]
				"六毛六-逐风者 腐蚀术 (伤害/跳) babayaga-逐风者 Tick -155 (Shadow)", -- [46]
				"六毛六-逐风者 痛苦诅咒 (伤害/跳) babayaga-逐风者 Tick -115 (Shadow)", -- [47]
				"六毛六-逐风者 吸取生命 (伤害/跳) babayaga-逐风者 Tick -97 (Shadow)", -- [48]
				"六毛六-逐风者 吸取生命 六毛六-逐风者 Hit +97", -- [49]
				"babayaga-逐风者 法术反制 六毛六-逐风者 Resist (Arcane)", -- [50]
			},
			["Name"] = "六毛六-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				1679.537, -- [1]
				1679.537, -- [2]
				1680.486, -- [3]
				1680.982, -- [4]
				1767.453, -- [5]
				1767.953, -- [6]
				1769.453, -- [7]
				1770.953, -- [8]
				1771.453, -- [9]
				1666.47, -- [10]
				1666.983, -- [11]
				1667.016, -- [12]
				1667.991, -- [13]
				1667.991, -- [14]
				1667.991, -- [15]
				1668.332, -- [16]
				1668.332, -- [17]
				1668.479, -- [18]
				1668.977, -- [19]
				1668.977, -- [20]
				1668.977, -- [21]
				1669.991, -- [22]
				1669.991, -- [23]
				1670.5, -- [24]
				1670.984, -- [25]
				1670.984, -- [26]
				1671.969, -- [27]
				1672.483, -- [28]
				1672.517, -- [29]
				1672.551, -- [30]
				1674.025, -- [31]
				1674.041, -- [32]
				1674.346, -- [33]
				1674.367, -- [34]
				1674.469, -- [35]
				1674.983, -- [36]
				1675.725, -- [37]
				1675.725, -- [38]
				1676.482, -- [39]
				1676.731, -- [40]
				1676.731, -- [41]
				1677.482, -- [42]
				1677.494, -- [43]
				1677.743, -- [44]
				1677.743, -- [45]
				1677.982, -- [46]
				1678.475, -- [47]
				1678.734, -- [48]
				1678.734, -- [49]
				1678.859, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["babayaga-逐风者"] = {
									["count"] = 33,
								},
							},
							["amount"] = 33,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 3,
								},
								["babayaga-逐风者"] = {
									["count"] = 21,
								},
							},
							["amount"] = 24,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 3,
								},
								["babayaga-逐风者"] = {
									["count"] = 30,
								},
							},
							["amount"] = 33,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5052,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 14,
								},
							},
							["amount"] = 20,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 27,
								},
							},
							["amount"] = 31,
						},
					},
					["ElementTakenAbsorb"] = {
						["Arcane"] = 286,
						["Shadow"] = 820,
					},
					["ElementTaken"] = {
						["Shadow"] = 2988,
						["Melee"] = 203,
						["Arcane"] = 820,
						["Fire"] = 310,
						["Holy"] = 304,
						["Frost"] = 427,
					},
					["DOT_Time"] = 90,
					["Damage"] = 3792,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 10.99,
					["RessedWho"] = {
					},
					["Dispels"] = 1,
					["ElementTakenResist"] = {
						["Fire"] = 147,
						["Shadow"] = 39,
						["Arcane"] = 144,
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 396,
					},
					["FAttacks"] = {
						["灵魂链接"] = {
							["Details"] = {
								["Split"] = {
									["max"] = 219,
									["min"] = 7,
									["count"] = 27,
									["amount"] = 1678,
								},
							},
							["count"] = 27,
							["amount"] = 1678,
						},
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 77,
						["Shadow"] = 3715,
					},
					["PartialAbsorb"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["法术反制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["变形术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 153,
									["min"] = 70,
									["count"] = 3,
									["amount"] = 376,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 376,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 286,
									["min"] = 286,
									["count"] = 1,
									["amount"] = 286,
								},
							},
							["count"] = 3,
							["amount"] = 286,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 222,
									["min"] = 222,
									["count"] = 2,
									["amount"] = 444,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 444,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 160,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 69,
								},
							},
							["amount"] = 229,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 542,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 864,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 995,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1085,
								},
								["肉搏"] = {
									["count"] = 77,
								},
							},
							["amount"] = 3563,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 304,
								},
								["暗影守卫"] = {
									["count"] = 82,
								},
							},
							["amount"] = 386,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 512,
								},
								["肉搏"] = {
									["count"] = 70,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1065,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1329,
								},
							},
							["amount"] = 2976,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 133,
								},
							},
							["amount"] = 133,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 820,
								},
								["冰锥术"] = {
									["count"] = 370,
								},
								["冰霜新星"] = {
									["count"] = 57,
								},
								["火焰冲击"] = {
									["count"] = 310,
								},
							},
							["amount"] = 1557,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["法术反制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗影守卫"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
							},
							["count"] = 39,
							["amount"] = 1,
						},
						["变形术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["魔爆术"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 144,
									["min"] = 144,
									["count"] = 1,
									["amount"] = 144,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 144,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["火焰冲击"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 147,
									["min"] = 147,
									["count"] = 1,
									["amount"] = 147,
								},
							},
							["count"] = 147,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 10.51,
								},
								["死亡缠绕"] = {
									["count"] = 0.48,
								},
							},
							["amount"] = 10.99,
						},
					},
					["OverHeals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 74,
									["min"] = 74,
									["count"] = 1,
									["amount"] = 74,
								},
							},
							["count"] = 1,
							["amount"] = 74,
						},
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 98,
									["min"] = 5,
									["count"] = 2,
									["amount"] = 103,
								},
							},
							["count"] = 2,
							["amount"] = 103,
						},
					},
					["ManaGainedFrom"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 613,
								},
							},
							["amount"] = 613,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 795,
								},
								["死亡缠绕"] = {
									["count"] = 468,
								},
							},
							["amount"] = 1263,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["六毛六-逐风者"] = {
									["count"] = 613,
								},
							},
							["amount"] = 613,
						},
					},
					["FDamage"] = 1678,
					["Interrupts"] = 0,
					["Overhealing"] = 177,
					["TimeSpent"] = {
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 10.51,
								},
								["死亡缠绕"] = {
									["count"] = 0.48,
								},
							},
							["amount"] = 10.99,
						},
						["格里鲁姆 <六毛六-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 22.23,
								},
							},
							["amount"] = 22.23,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.15,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 4.369999999999999,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.74,
								},
								["肉搏"] = {
									["count"] = 1.01,
								},
							},
							["amount"] = 15.77,
						},
					},
					["WhoDispelled"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 98,
									["min"] = 20,
									["count"] = 9,
									["amount"] = 795,
								},
							},
							["count"] = 9,
							["amount"] = 795,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 468,
									["min"] = 468,
									["count"] = 1,
									["amount"] = 468,
								},
							},
							["count"] = 1,
							["amount"] = 468,
						},
					},
					["WhoHealed"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 795,
								},
								["死亡缠绕"] = {
									["count"] = 468,
								},
							},
							["amount"] = 1263,
						},
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1908,
								},
								["真言术：盾"] = {
									["count"] = 1106,
								},
							},
							["amount"] = 3014,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 50.99,
					["Healing"] = 1263,
					["FDamagedWho"] = {
						["格里鲁姆 <六毛六-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 1678,
								},
							},
							["amount"] = 1678,
						},
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 542,
									["min"] = 542,
									["count"] = 1,
									["amount"] = 542,
								},
							},
							["count"] = 1,
							["amount"] = 542,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 67,
									["min"] = 67,
									["count"] = 1,
									["amount"] = 67,
								},
								["Tick"] = {
									["max"] = 115,
									["min"] = 67,
									["count"] = 10,
									["amount"] = 866,
								},
							},
							["count"] = 11,
							["amount"] = 933,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 97,
									["min"] = 97,
									["count"] = 1,
									["amount"] = 97,
								},
								["Tick"] = {
									["max"] = 98,
									["min"] = 20,
									["count"] = 10,
									["amount"] = 898,
								},
							},
							["count"] = 11,
							["amount"] = 995,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 155,
									["min"] = 155,
									["count"] = 1,
									["amount"] = 155,
								},
								["Tick"] = {
									["max"] = 160,
									["min"] = 155,
									["count"] = 7,
									["amount"] = 1090,
								},
							},
							["count"] = 8,
							["amount"] = 1245,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 77,
									["min"] = 77,
									["count"] = 1,
									["amount"] = 77,
								},
							},
							["count"] = 1,
							["amount"] = 77,
						},
					},
					["HealingTaken"] = 4277,
					["RageGain"] = 0,
					["TimeDamage"] = 40.00000000000001,
					["TimeDamaging"] = {
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
						["格里鲁姆 <六毛六-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 22.23,
								},
							},
							["amount"] = 22.23,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.15,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 4.369999999999999,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.74,
								},
								["肉搏"] = {
									["count"] = 1.01,
								},
							},
							["amount"] = 15.77,
						},
					},
					["ManaGain"] = 613,
					["HOTs"] = {
					},
					["DispelledWho"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["皇家特工-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["皇家特工-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 15,
					["Damage"] = 656,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 656,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["皇家特工-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 310,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 346,
								},
							},
							["amount"] = 656,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["皇家特工-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 5.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 5.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 155,
									["min"] = 155,
									["count"] = 2,
									["amount"] = 310,
								},
							},
							["count"] = 2,
							["amount"] = 310,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 116,
									["min"] = 115,
									["count"] = 3,
									["amount"] = 346,
								},
							},
							["count"] = 3,
							["amount"] = 346,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 5.5,
					["TimeDamaging"] = {
						["皇家特工-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 5.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["babayaga-逐风者"] = {
									["count"] = 33,
								},
								["Moana-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 39,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["莱荫-黑龙费尔默"] = {
									["count"] = 3,
								},
								["利群-逐风者"] = {
									["count"] = 6,
								},
								["Moana-逐风者"] = {
									["count"] = 18,
								},
								["皇家特工-逐风者"] = {
									["count"] = 6,
								},
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 3,
								},
								["babayaga-逐风者"] = {
									["count"] = 21,
								},
							},
							["amount"] = 57,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["莱荫-黑龙费尔默"] = {
									["count"] = 15,
								},
								["利群-逐风者"] = {
									["count"] = 9,
								},
								["Moana-逐风者"] = {
									["count"] = 36,
								},
								["皇家特工-逐风者"] = {
									["count"] = 9,
								},
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 3,
								},
								["babayaga-逐风者"] = {
									["count"] = 30,
								},
							},
							["amount"] = 102,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 14,
								},
							},
							["amount"] = 20,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["WhoHealed"] = {
						["圆嘟嘟-黑龙费尔默"] = {
							["Details"] = {
								["治疗术"] = {
									["count"] = 1001,
								},
								["真言术：盾"] = {
									["count"] = 1106,
								},
								["快速治疗"] = {
									["count"] = 1908,
								},
							},
							["amount"] = 4015,
						},
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 984,
								},
								["死亡缠绕"] = {
									["count"] = 468,
								},
							},
							["amount"] = 1452,
						},
					},
					["ElementTakenResist"] = {
						["Fire"] = 327,
						["Shadow"] = 39,
						["Arcane"] = 144,
					},
					["FDamagedWho"] = {
						["格里鲁姆 <六毛六-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 1678,
								},
							},
							["amount"] = 1678,
						},
					},
					["ElementTaken"] = {
						["Shadow"] = 2988,
						["Melee"] = 203,
						["Arcane"] = 820,
						["Fire"] = 1404,
						["Holy"] = 304,
						["Frost"] = 427,
					},
					["DOT_Time"] = 198,
					["Damage"] = 8875,
					["TimeHeal"] = 13.49,
					["Dispels"] = 1,
					["FAttacks"] = {
						["灵魂链接"] = {
							["Details"] = {
								["Split"] = {
									["max"] = 219,
									["min"] = 7,
									["count"] = 27,
									["amount"] = 1678,
								},
							},
							["count"] = 27,
							["amount"] = 1678,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 8504,
						["Melee"] = 77,
						["Fire"] = 294,
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 11,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 55,
								},
							},
							["amount"] = 70,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 537,
								},
								["献祭"] = {
									["count"] = 303,
								},
								["灼热之痛"] = {
									["count"] = 254,
								},
							},
							["amount"] = 1094,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 512,
								},
								["肉搏"] = {
									["count"] = 70,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1065,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1329,
								},
							},
							["amount"] = 2976,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 304,
								},
								["暗影守卫"] = {
									["count"] = 82,
								},
							},
							["amount"] = 386,
						},
						["克萨德鲁姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 133,
								},
							},
							["amount"] = 133,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 820,
								},
								["冰锥术"] = {
									["count"] = 370,
								},
								["冰霜新星"] = {
									["count"] = 57,
								},
								["火焰冲击"] = {
									["count"] = 310,
								},
							},
							["amount"] = 1557,
						},
					},
					["TimeHealing"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 13.01,
								},
								["死亡缠绕"] = {
									["count"] = 0.48,
								},
							},
							["amount"] = 13.49,
						},
					},
					["OverHeals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 74,
									["min"] = 74,
									["count"] = 1,
									["amount"] = 74,
								},
							},
							["count"] = 1,
							["amount"] = 74,
						},
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 98,
									["min"] = 5,
									["count"] = 2,
									["amount"] = 103,
								},
							},
							["count"] = 2,
							["amount"] = 103,
						},
					},
					["PartialResist"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["法术反制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["变形术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热之痛"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 85,
									["min"] = 85,
									["count"] = 1,
									["amount"] = 85,
								},
							},
							["count"] = 85,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
							},
							["count"] = 39,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 147,
									["min"] = 147,
									["count"] = 1,
									["amount"] = 147,
								},
							},
							["count"] = 147,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["魔爆术"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 144,
									["min"] = 144,
									["count"] = 1,
									["amount"] = 144,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 144,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["50% 抵抗"] = {
									["max"] = 63,
									["min"] = 63,
									["count"] = 1,
									["amount"] = 63,
								},
								["25% 抵抗"] = {
									["max"] = 32,
									["min"] = 32,
									["count"] = 1,
									["amount"] = 32,
								},
							},
							["count"] = 95,
							["amount"] = 5,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["六毛六-逐风者"] = {
									["count"] = 613,
								},
							},
							["amount"] = 613,
						},
					},
					["FDamage"] = 1678,
					["ActiveTime"] = 85.85999999999999,
					["ManaGainedFrom"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 613,
								},
							},
							["amount"] = 613,
						},
					},
					["PartialAbsorb"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["法术反制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["变形术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 153,
									["min"] = 70,
									["count"] = 3,
									["amount"] = 376,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 376,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 286,
									["min"] = 286,
									["count"] = 1,
									["amount"] = 286,
								},
							},
							["count"] = 3,
							["amount"] = 286,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 222,
									["min"] = 222,
									["count"] = 2,
									["amount"] = 444,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 444,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["Heals"] = {
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 98,
									["min"] = 20,
									["count"] = 11,
									["amount"] = 984,
								},
							},
							["count"] = 11,
							["amount"] = 984,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 468,
									["min"] = 468,
									["count"] = 1,
									["amount"] = 468,
								},
							},
							["count"] = 1,
							["amount"] = 468,
						},
					},
					["DamagedWho"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 150,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 326,
								},
							},
							["amount"] = 476,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 294,
								},
								["暗影箭"] = {
									["count"] = 682,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 300,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 243,
								},
							},
							["amount"] = 1519,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 189,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 901,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1342,
								},
							},
							["amount"] = 2432,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 310,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 346,
								},
							},
							["amount"] = 656,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 160,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 69,
								},
							},
							["amount"] = 229,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 542,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 864,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 995,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1085,
								},
								["肉搏"] = {
									["count"] = 77,
								},
							},
							["amount"] = 3563,
						},
					},
					["Overhealing"] = 177,
					["ElementTakenAbsorb"] = {
						["Arcane"] = 286,
						["Shadow"] = 820,
					},
					["Healing"] = 1452,
					["TimeSpent"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.59,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.07,
								},
								["恐惧术"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 4.71,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 0.02,
								},
								["暗影箭"] = {
									["count"] = 0.96,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2.1,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.49,
								},
								["献祭"] = {
									["count"] = 0.32,
								},
							},
							["amount"] = 4.89,
						},
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 13.01,
								},
								["死亡缠绕"] = {
									["count"] = 0.48,
								},
							},
							["amount"] = 13.49,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.51,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 10.93,
								},
							},
							["amount"] = 17.27,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 5.5,
						},
						["格里鲁姆 <六毛六-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 22.23,
								},
							},
							["amount"] = 22.23,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.15,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 4.369999999999999,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.74,
								},
								["肉搏"] = {
									["count"] = 1.01,
								},
							},
							["amount"] = 15.77,
						},
					},
					["HealedWho"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 984,
								},
								["死亡缠绕"] = {
									["count"] = 468,
								},
							},
							["amount"] = 1452,
						},
					},
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 542,
									["min"] = 542,
									["count"] = 1,
									["amount"] = 542,
								},
							},
							["count"] = 1,
							["amount"] = 542,
						},
						["献祭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 294,
									["min"] = 294,
									["count"] = 1,
									["amount"] = 294,
								},
							},
							["count"] = 1,
							["amount"] = 294,
						},
						["恐惧术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 97,
									["min"] = 97,
									["count"] = 1,
									["amount"] = 97,
								},
								["Tick"] = {
									["max"] = 98,
									["min"] = 20,
									["count"] = 12,
									["amount"] = 1087,
								},
							},
							["count"] = 13,
							["amount"] = 1184,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 682,
									["min"] = 682,
									["count"] = 1,
									["amount"] = 682,
								},
							},
							["count"] = 1,
							["amount"] = 682,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 112,
									["min"] = 33,
									["count"] = 7,
									["amount"] = 459,
								},
								["Tick"] = {
									["max"] = 158,
									["min"] = 65,
									["count"] = 27,
									["amount"] = 2731,
								},
							},
							["count"] = 34,
							["amount"] = 3190,
						},
						["吸取生命"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 155,
									["min"] = 150,
									["count"] = 3,
									["amount"] = 455,
								},
								["Tick"] = {
									["max"] = 160,
									["min"] = 150,
									["count"] = 16,
									["amount"] = 2451,
								},
							},
							["count"] = 19,
							["amount"] = 2906,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 77,
									["min"] = 77,
									["count"] = 1,
									["amount"] = 77,
								},
							},
							["count"] = 1,
							["amount"] = 77,
						},
					},
					["HealingTaken"] = 5467,
					["ElementDoneAbsorb"] = {
						["Shadow"] = 1088,
					},
					["TimeDamage"] = 72.36999999999999,
					["TimeDamaging"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.59,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.07,
								},
								["恐惧术"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 4.71,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 0.02,
								},
								["暗影箭"] = {
									["count"] = 0.96,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2.1,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.49,
								},
								["献祭"] = {
									["count"] = 0.32,
								},
							},
							["amount"] = 4.89,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.51,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 10.93,
								},
							},
							["amount"] = 17.27,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.5,
								},
							},
							["amount"] = 5.5,
						},
						["格里鲁姆 <六毛六-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 22.23,
								},
							},
							["amount"] = 22.23,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.15,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 4.369999999999999,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.74,
								},
								["肉搏"] = {
									["count"] = 1.01,
								},
							},
							["amount"] = 15.77,
						},
					},
					["ManaGain"] = 613,
					["DamageTaken"] = 6146,
					["DispelledWho"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 1459.828,
			["LastActive"] = 1770.853,
		},
		["灬羽兒灬"] = {
			["GUID"] = "Player-5458-03350F1B",
			["LastEventHealth"] = {
				3913, -- [1]
				3913, -- [2]
				3913, -- [3]
				3913, -- [4]
				3913, -- [5]
				3913, -- [6]
				3913, -- [7]
				3913, -- [8]
				3913, -- [9]
				2461, -- [10]
				2461, -- [11]
				2461, -- [12]
				2461, -- [13]
				2461, -- [14]
				2461, -- [15]
				2461, -- [16]
				2461, -- [17]
				1925, -- [18]
				1856, -- [19]
				1856, -- [20]
				1786, -- [21]
				1717, -- [22]
				921, -- [23]
				921, -- [24]
				921, -- [25]
				433, -- [26]
				0, -- [27]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"MISC", -- [27]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["DamageTaken"] = {
					3108, -- [1]
				},
				["ActiveTime"] = {
					19.97, -- [1]
				},
				["TimeDamage"] = {
					19.97, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DOT_Time"] = {
					9, -- [1]
				},
				["Damage"] = {
					1463, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = "灬羽兒灬",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
					},
					["Messages"] = {
						"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -154 (Physical)", -- [1]
						"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -169 (Physical)", -- [2]
						"灬羽兒灬 毒蛇钉刺 (伤害/跳) 皇家特工-逐风者 Tick -101 (Nature)", -- [3]
						"灬羽兒灬 自动射击 皇家特工-逐风者 Crit -378 (Physical)", -- [4]
						"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -149 (Physical)", -- [5]
						"灬羽兒灬 毒蛇钉刺 (伤害/跳) 皇家特工-逐风者 Tick -100 (Nature)", -- [6]
						"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -147 (Physical)", -- [7]
						"暮年-逐风者 寒冰箭 灬羽兒灬 Hit -536 (Frost)", -- [8]
						"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 灬羽兒灬 Tick -69 (Shadow)", -- [9]
						"灬羽兒灬 毒蛇钉刺 (伤害/跳) 皇家特工-逐风者 Tick -101 (Nature)", -- [10]
						"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 灬羽兒灬 Tick -70 (Shadow)", -- [11]
						"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 灬羽兒灬 Tick -69 (Shadow)", -- [12]
						"莱荫-黑龙费尔默 灵魂之火 灬羽兒灬 Hit -796 (Fire)", -- [13]
						"皇家特工-逐风者 致残毒药 灬羽兒灬 Resist (Nature)", -- [14]
						"皇家特工-逐风者 肉搏 灬羽兒灬 Hit -128 (Physical)", -- [15]
						"皇家特工-逐风者 邪恶攻击 灬羽兒灬 Crit -360 (Physical)", -- [16]
						"暮年-逐风者 寒冰箭 灬羽兒灬 Crit -1080 (Frost)", -- [17]
						"灬羽兒灬死亡。", -- [18]
					},
					["DeathAt"] = 1553.827,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
					},
					["MessageTimes"] = {
						-12.21499999999992, -- [1]
						-10.79600000000005, -- [2]
						-10.11500000000001, -- [3]
						-9.451000000000022, -- [4]
						-8.260999999999967, -- [5]
						-7.116999999999962, -- [6]
						-6.825000000000046, -- [7]
						-5.5, -- [8]
						-5.161000000000058, -- [9]
						-4.117999999999938, -- [10]
						-3.161000000000058, -- [11]
						-1.157999999999902, -- [12]
						-0.9149999999999636, -- [13]
						-0.1389999999998963, -- [14]
						-0.1389999999998963, -- [15]
						-0.1389999999998963, -- [16]
						-0.01299999999991996, -- [17]
						0, -- [18]
					},
					["HealthMax"] = {
						3913, -- [1]
						3913, -- [2]
						3913, -- [3]
						3913, -- [4]
						3913, -- [5]
						3913, -- [6]
						3913, -- [7]
						3913, -- [8]
						3913, -- [9]
						3913, -- [10]
						3913, -- [11]
						3913, -- [12]
						3913, -- [13]
						3913, -- [14]
						3913, -- [15]
						3913, -- [16]
						3913, -- [17]
						3143, -- [18]
					},
					["Health"] = {
						2461, -- [1]
						2461, -- [2]
						2461, -- [3]
						2461, -- [4]
						2461, -- [5]
						2461, -- [6]
						2461, -- [7]
						2461, -- [8]
						1925, -- [9]
						1856, -- [10]
						1856, -- [11]
						1786, -- [12]
						1717, -- [13]
						921, -- [14]
						921, -- [15]
						921, -- [16]
						433, -- [17]
						0, -- [18]
					},
					["KilledBy"] = "暮年-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"MISC", -- [18]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "寒冰箭",
			["LastFightIn"] = 1,
			["type"] = "Grouped",
			["LastDamageTaken"] = 1080,
			["LastEventHealthMax"] = {
				3913, -- [1]
				3913, -- [2]
				3913, -- [3]
				3913, -- [4]
				3913, -- [5]
				3913, -- [6]
				3913, -- [7]
				3913, -- [8]
				3913, -- [9]
				3913, -- [10]
				3913, -- [11]
				3913, -- [12]
				3913, -- [13]
				3913, -- [14]
				3913, -- [15]
				3913, -- [16]
				3913, -- [17]
				3913, -- [18]
				3913, -- [19]
				3913, -- [20]
				3913, -- [21]
				3913, -- [22]
				3913, -- [23]
				3913, -- [24]
				3913, -- [25]
				3913, -- [26]
				3143, -- [27]
			},
			["TimeLast"] = {
				["DamageTaken"] = 1551.839,
				["DeathCount"] = 1551.839,
				["TimeDamage"] = 1547.836,
				["ActiveTime"] = 1547.836,
				["Healing"] = 1456.826,
				["OVERALL"] = 1551.839,
				["DOT_Time"] = 1547.836,
				["Damage"] = 1547.836,
			},
			["Owner"] = false,
			["Pet"] = {
				"灬羽宝灬 <灬羽兒灬>", -- [1]
			},
			["NextEventNum"] = 28,
			["LastDamageTime"] = 1548.392,
			["LastEvents"] = {
				"灬羽兒灬 自动射击 皇鹰-逐风者 Immune (Physical)", -- [1]
				"灬羽兒灬 毒蛇钉刺 皇鹰-逐风者 Immune (Nature)", -- [2]
				"灬羽兒灬 自动射击 皇鹰-逐风者 Immune (Physical)", -- [3]
				"灬羽兒灬 自动射击 皇鹰-逐风者 Immune (Physical)", -- [4]
				"灬羽兒灬 自动射击 皇鹰-逐风者 Immune (Physical)", -- [5]
				"灬羽兒灬 自动射击 皇鹰-逐风者 Immune (Physical)", -- [6]
				"灬羽兒灬 自动射击 皇鹰-逐风者 Immune (Physical)", -- [7]
				"灬羽兒灬 自动射击 皇鹰-逐风者 Immune (Physical)", -- [8]
				"灬羽兒灬 自动射击 皇鹰-逐风者 Absorb -164 (164 被吸收) (Physical)", -- [9]
				"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -154 (Physical)", -- [10]
				"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -169 (Physical)", -- [11]
				"灬羽兒灬 毒蛇钉刺 (伤害/跳) 皇家特工-逐风者 Tick -101 (Nature)", -- [12]
				"灬羽兒灬 自动射击 皇家特工-逐风者 Crit -378 (Physical)", -- [13]
				"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -149 (Physical)", -- [14]
				"灬羽兒灬 毒蛇钉刺 (伤害/跳) 皇家特工-逐风者 Tick -100 (Nature)", -- [15]
				"灬羽兒灬 自动射击 皇家特工-逐风者 Hit -147 (Physical)", -- [16]
				"暮年-逐风者 寒冰箭 灬羽兒灬 Hit -536 (Frost)", -- [17]
				"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 灬羽兒灬 Tick -69 (Shadow)", -- [18]
				"灬羽兒灬 毒蛇钉刺 (伤害/跳) 皇家特工-逐风者 Tick -101 (Nature)", -- [19]
				"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 灬羽兒灬 Tick -70 (Shadow)", -- [20]
				"莱荫-黑龙费尔默 痛苦诅咒 (伤害/跳) 灬羽兒灬 Tick -69 (Shadow)", -- [21]
				"莱荫-黑龙费尔默 灵魂之火 灬羽兒灬 Hit -796 (Fire)", -- [22]
				"皇家特工-逐风者 致残毒药 灬羽兒灬 Resist (Nature)", -- [23]
				"皇家特工-逐风者 肉搏 灬羽兒灬 Hit -128 (Physical)", -- [24]
				"皇家特工-逐风者 邪恶攻击 灬羽兒灬 Crit -360 (Physical)", -- [25]
				"暮年-逐风者 寒冰箭 灬羽兒灬 Crit -1080 (Frost)", -- [26]
				"灬羽兒灬死亡。", -- [27]
			},
			["Name"] = "灬羽兒灬",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
			},
			["LastEventTimes"] = {
				1454.442, -- [1]
				1465.432, -- [2]
				1465.894, -- [3]
				1467.307, -- [4]
				1468.74, -- [5]
				1470.613, -- [6]
				1472.055, -- [7]
				1473.482, -- [8]
				1474.406, -- [9]
				1540.295, -- [10]
				1541.714, -- [11]
				1542.395, -- [12]
				1543.059, -- [13]
				1544.249, -- [14]
				1545.393, -- [15]
				1545.685, -- [16]
				1547.01, -- [17]
				1547.349, -- [18]
				1548.392, -- [19]
				1549.349, -- [20]
				1551.352, -- [21]
				1551.595, -- [22]
				1552.371, -- [23]
				1552.371, -- [24]
				1552.371, -- [25]
				1552.497, -- [26]
				1552.51, -- [27]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["皇家特工-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeSpent"] = {
						["皇家特工-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 3.32,
								},
								["自动射击"] = {
									["count"] = 5.06,
								},
							},
							["amount"] = 8.379999999999999,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 10.09,
								},
							},
							["amount"] = 11.59,
						},
					},
					["DamageTaken"] = 3108,
					["ElementDoneAbsorb"] = {
						["Physical"] = 164,
					},
					["PartialResist"] = {
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灵魂之火"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灵魂之火"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 19.97,
					["ElementTaken"] = {
						["Shadow"] = 208,
						["Melee"] = 128,
						["Fire"] = 796,
						["Physical"] = 360,
						["Frost"] = 1616,
					},
					["DOT_Time"] = 9,
					["Damage"] = 1463,
					["Healing"] = 0,
					["ElementDone"] = {
						["Nature"] = 302,
						["Physical"] = 1161,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 7,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 13,
						},
					},
					["TimeDamage"] = 19.97,
					["TimeDamaging"] = {
						["皇家特工-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 3.32,
								},
								["自动射击"] = {
									["count"] = 5.06,
								},
							},
							["amount"] = 8.379999999999999,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 10.09,
								},
							},
							["amount"] = 11.59,
						},
					},
					["WhoDamaged"] = {
						["莱荫-黑龙费尔默"] = {
							["Details"] = {
								["灵魂之火"] = {
									["count"] = 796,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 208,
								},
							},
							["amount"] = 1004,
						},
						["暮年-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1616,
								},
							},
							["amount"] = 1616,
						},
						["皇家特工-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 360,
								},
								["肉搏"] = {
									["count"] = 128,
								},
							},
							["amount"] = 488,
						},
					},
					["DamagedWho"] = {
						["皇家特工-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 302,
								},
								["自动射击"] = {
									["count"] = 997,
								},
							},
							["amount"] = 1299,
						},
						["皇鹰-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 164,
								},
							},
							["amount"] = 164,
						},
					},
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 100,
									["count"] = 3,
									["amount"] = 302,
								},
							},
							["count"] = 3,
							["amount"] = 302,
						},
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 164,
									["min"] = 164,
									["count"] = 1,
									["amount"] = 164,
								},
								["Immune"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 378,
									["min"] = 378,
									["count"] = 1,
									["amount"] = 378,
								},
								["Hit"] = {
									["max"] = 169,
									["min"] = 147,
									["count"] = 4,
									["amount"] = 619,
								},
							},
							["count"] = 13,
							["amount"] = 1161,
						},
						["毒蛇钉刺"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
				},
			},
			["UnitLockout"] = 1453.836,
			["LastActive"] = 1551.839,
		},
		["来年子苗-逐风者"] = {
			["GUID"] = "Player-5451-031DB5DD",
			["LastEventHealth"] = {
				4158, -- [1]
				4158, -- [2]
				4158, -- [3]
				4158, -- [4]
				4158, -- [5]
				4158, -- [6]
				4158, -- [7]
				4158, -- [8]
				4158, -- [9]
				4158, -- [10]
				4158, -- [11]
				4158, -- [12]
				4158, -- [13]
				4158, -- [14]
				4158, -- [15]
				4005, -- [16]
				3941, -- [17]
				3118, -- [18]
				3054, -- [19]
				3054, -- [20]
				2726, -- [21]
				2410, -- [22]
				1616, -- [23]
				1005, -- [24]
				182, -- [25]
				118, -- [26]
				118, -- [27]
				118, -- [28]
				135, -- [29]
			},
			["LastAttackedBy"] = "暴走扁哥-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"MISC", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"MISC", -- [11]
				"MISC", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
			},
			["TimeWindows"] = {
				["Dispelled"] = {
					3, -- [1]
				},
				["ActiveTime"] = {
					5.1, -- [1]
				},
				["TimeDamage"] = {
					5.1, -- [1]
				},
				["ManaGain"] = {
					106, -- [1]
				},
				["DamageTaken"] = {
					4040, -- [1]
				},
				["Damage"] = {
					2688, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "来年子苗-逐风者",
			["level"] = 60,
			["LastDamageAbility"] = "痛苦诅咒 (伤害/跳)",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastDamageTaken"] = 64,
			["TimeLast"] = {
				["TimeDamage"] = 1470.841,
				["Dispelled"] = 1469.826,
				["ActiveTime"] = 1470.841,
				["ManaGain"] = 1469.826,
				["OVERALL"] = 1475.833,
				["DamageTaken"] = 1475.833,
				["Damage"] = 1470.841,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4180, -- [1]
				4180, -- [2]
				4180, -- [3]
				4180, -- [4]
				4180, -- [5]
				4180, -- [6]
				4180, -- [7]
				4180, -- [8]
				4180, -- [9]
				4180, -- [10]
				4180, -- [11]
				4180, -- [12]
				4180, -- [13]
				4180, -- [14]
				4180, -- [15]
				4180, -- [16]
				4180, -- [17]
				4180, -- [18]
				4180, -- [19]
				4180, -- [20]
				4180, -- [21]
				4180, -- [22]
				4180, -- [23]
				4180, -- [24]
				4180, -- [25]
				4180, -- [26]
				4180, -- [27]
				4180, -- [28]
				4180, -- [29]
			},
			["NextEventNum"] = 30,
			["LastDamageTime"] = 1471.669,
			["LastEvents"] = {
				"来年子苗-逐风者 魔爆术 Moana-逐风者 Absorb -276 (276 被吸收) (Arcane)", -- [1]
				"来年子苗-逐风者 魔爆术 利群-逐风者 Absorb -290 (290 被吸收) (Arcane)", -- [2]
				"来年子苗-逐风者 魔爆术 为了青春-黑龙费尔默 Hit -288 (Arcane)", -- [3]
				"来年子苗-逐风者 法术反制 - 沉默 Moana-逐风者 Resist (Arcane)", -- [4]
				"利群-逐风者 dispels 来年子苗-逐风者 防护冰霜结界 (驱散魔法)", -- [5]
				"来年子苗-逐风者 魔爆术 小猫掉毛-逐风者 Hit -263 (Arcane)", -- [6]
				"来年子苗-逐风者 肉搏 Moana-逐风者 Absorb -141 (1)", -- [7]
				"来年子苗-逐风者 魔爆术 Moana-逐风者 Hit -132 (141 被吸收) (Arcane)", -- [8]
				"来年子苗-逐风者 魔爆术 为了青春-黑龙费尔默 Hit -284 (Arcane)", -- [9]
				"小猫掉毛-逐风者 暗影守卫 来年子苗-逐风者 Resist (Shadow)", -- [10]
				"利群-逐风者 dispels 来年子苗-逐风者 魔法抑制 (驱散魔法)", -- [11]
				"利群-逐风者 dispels 来年子苗-逐风者 寒冰护体 (驱散魔法)", -- [12]
				"来年子苗-逐风者 冰锥术 Moana-逐风者 Hit -507 (Frost)", -- [13]
				"来年子苗-逐风者 冰锥术 为了青春-黑龙费尔默 Hit -507 (Frost)", -- [14]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 来年子苗-逐风者 Tick -153 (Shadow)", -- [15]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 来年子苗-逐风者 Tick -64 (Shadow)", -- [16]
				"暮年-逐风者 寒冰箭 来年子苗-逐风者 Hit -823 (Frost)", -- [17]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 来年子苗-逐风者 Tick -64 (Shadow)", -- [18]
				"Moana-逐风者 腐蚀术 (伤害/跳) 来年子苗-逐风者 Tick -176 (Shadow)", -- [19]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 来年子苗-逐风者 Tick -152 (Shadow)", -- [20]
				"Moana-逐风者 灼热之痛 来年子苗-逐风者 Hit -316 (Fire)", -- [21]
				"为了青春-黑龙费尔默 暗影箭 来年子苗-逐风者 Hit -794 (Shadow)", -- [22]
				"暮年-逐风者 火焰冲击 来年子苗-逐风者 Hit -611 (Fire)", -- [23]
				"暮年-逐风者 寒冰箭 来年子苗-逐风者 Hit -823 (Frost)", -- [24]
				"暴走扁哥-黑龙费尔默 痛苦诅咒 (伤害/跳) 来年子苗-逐风者 Tick -64 (Shadow)", -- [25]
				"Moana-逐风者 灼热之痛 来年子苗-逐风者 Immune (Fire)", -- [26]
				"Moana-逐风者 暗影灼烧 来年子苗-逐风者 Immune (Shadow)", -- [27]
				"为了青春-黑龙费尔默 痛苦诅咒 来年子苗-逐风者 Immune (Shadow)", -- [28]
				"莱荫-黑龙费尔默 痛苦诅咒 来年子苗-逐风者 Immune (Shadow)", -- [29]
			},
			["Name"] = "来年子苗-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
			},
			["LastEventTimes"] = {
				1468.069, -- [1]
				1468.069, -- [2]
				1468.069, -- [3]
				1469.042, -- [4]
				1469.309, -- [5]
				1470.183, -- [6]
				1470.183, -- [7]
				1470.183, -- [8]
				1470.183, -- [9]
				1470.183, -- [10]
				1470.819, -- [11]
				1470.819, -- [12]
				1471.669, -- [13]
				1471.669, -- [14]
				1472.137, -- [15]
				1472.628, -- [16]
				1473.619, -- [17]
				1474.635, -- [18]
				1475.046, -- [19]
				1475.114, -- [20]
				1475.408, -- [21]
				1475.717, -- [22]
				1476.084, -- [23]
				1476.199, -- [24]
				1476.633, -- [25]
				1476.907, -- [26]
				1476.941, -- [27]
				1478.974, -- [28]
				1485.162, -- [29]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 3,
					["TimeSpent"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.14,
								},
							},
							["amount"] = 1.14,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.49,
								},
								["法术反制 - 沉默"] = {
									["count"] = 0.97,
								},
							},
							["amount"] = 3.96,
						},
					},
					["DamageTaken"] = 4040,
					["ElementDoneAbsorb"] = {
						["Arcane"] = 707,
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["来年子苗-逐风者"] = {
									["count"] = 106,
								},
							},
							["amount"] = 106,
						},
					},
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 5.1,
					["ElementTaken"] = {
						["Shadow"] = 1467,
						["Fire"] = 927,
						["Frost"] = 1646,
					},
					["Damage"] = 2688,
					["WhoDamaged"] = {
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 794,
								},
							},
							["amount"] = 794,
						},
						["暮年-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 611,
								},
								["寒冰箭"] = {
									["count"] = 1646,
								},
							},
							["amount"] = 2257,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 176,
								},
								["灼热之痛"] = {
									["count"] = 316,
								},
							},
							["amount"] = 492,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 305,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 192,
								},
							},
							["amount"] = 497,
						},
					},
					["ManaGainedFrom"] = {
						["来年子苗-逐风者"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 106,
								},
							},
							["amount"] = 106,
						},
					},
					["Attacks"] = {
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 288,
									["min"] = 132,
									["count"] = 4,
									["amount"] = 967,
								},
								["Absorb"] = {
									["max"] = 290,
									["min"] = 276,
									["count"] = 2,
									["amount"] = 566,
								},
							},
							["count"] = 6,
							["amount"] = 1533,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 507,
									["min"] = 507,
									["count"] = 2,
									["amount"] = 1014,
								},
							},
							["count"] = 2,
							["amount"] = 1014,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 141,
									["min"] = 141,
									["count"] = 1,
									["amount"] = 141,
								},
							},
							["count"] = 1,
							["amount"] = 141,
						},
						["法术反制 - 沉默"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Frost"] = 1014,
						["Melee"] = 141,
						["Arcane"] = 1533,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 11,
						},
						["Fire"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamagedWho"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 263,
								},
							},
							["amount"] = 263,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 290,
								},
							},
							["amount"] = 290,
						},
						["为了青春-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 572,
								},
								["冰锥术"] = {
									["count"] = 507,
								},
							},
							["amount"] = 1079,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 408,
								},
								["冰锥术"] = {
									["count"] = 507,
								},
								["肉搏"] = {
									["count"] = 141,
								},
							},
							["amount"] = 1056,
						},
					},
					["TimeDamage"] = 5.1,
					["TimeDamaging"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.14,
								},
							},
							["amount"] = 1.14,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.49,
								},
								["法术反制 - 沉默"] = {
									["count"] = 0.97,
								},
							},
							["amount"] = 3.96,
						},
					},
					["ManaGain"] = 106,
					["WhoDispelled"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["魔法抑制 (驱散魔法)"] = {
									["count"] = 1,
								},
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护冰霜结界 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
					},
				},
			},
			["UnitLockout"] = 1467.826,
			["LastActive"] = 1484.828,
		},
		["圆嘟嘟-黑龙费尔默"] = {
			["GUID"] = "Player-5450-02F9E728",
			["LastEventHealth"] = {
				3867, -- [1]
				3867, -- [2]
				3867, -- [3]
				3867, -- [4]
				3867, -- [5]
				3842, -- [6]
				3817, -- [7]
				3817, -- [8]
				3727, -- [9]
				3727, -- [10]
				3727, -- [11]
				3699, -- [12]
				3699, -- [13]
				3167, -- [14]
				3167, -- [15]
				3167, -- [16]
				3167, -- [17]
				3167, -- [18]
				3167, -- [19]
				3167, -- [20]
				3167, -- [21]
				3167, -- [22]
				3167, -- [23]
				3167, -- [24]
				3021, -- [25]
				2893, -- [26]
				2893, -- [27]
				2744, -- [28]
				2744, -- [29]
				2529, -- [30]
				2529, -- [31]
				2380, -- [32]
				2380, -- [33]
				2146, -- [34]
				2098, -- [35]
				1946, -- [36]
				1585, -- [37]
				1537, -- [38]
				1537, -- [39]
				1388, -- [40]
				1388, -- [41]
				1388, -- [42]
				1044, -- [43]
				1044, -- [44]
				623, -- [45]
				547, -- [46]
				142, -- [47]
				0, -- [48]
			},
			["LastEventType"] = {
				"HEAL", -- [1]
				"HEAL", -- [2]
				"HEAL", -- [3]
				"HEAL", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"HEAL", -- [15]
				"HEAL", -- [16]
				"MISC", -- [17]
				"HEAL", -- [18]
				"MISC", -- [19]
				"MISC", -- [20]
				"MISC", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"HEAL", -- [30]
				"DAMAGE", -- [31]
				"HEAL", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"MISC", -- [48]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					26.36, -- [1]
				},
				["Dispels"] = {
					4, -- [1]
				},
				["Healing"] = {
					13538, -- [1]
				},
				["DamageTaken"] = {
					3388, -- [1]
				},
				["Absorbs"] = {
					1106, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["HOT_Time"] = {
					9, -- [1]
				},
				["ActiveTime"] = {
					31.86, -- [1]
				},
				["Overhealing"] = {
					811, -- [1]
				},
				["TimeDamage"] = {
					5.5, -- [1]
				},
				["DOT_Time"] = {
					6, -- [1]
				},
				["Damage"] = {
					543, -- [1]
				},
			},
			["enClass"] = "PRIEST",
			["unit"] = "圆嘟嘟-黑龙费尔默",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
					},
					["Messages"] = {
						"圆嘟嘟-黑龙费尔默 快速治疗 肌肉髪-逐风者 Hit +952", -- [1]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [2]
						"圆嘟嘟-黑龙费尔默 快速治疗 肌肉髪-逐风者 Hit +976", -- [3]
						"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -218 (Holy)", -- [4]
						"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +925", -- [5]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -153 (Shadow)", -- [6]
						"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +922", -- [7]
						"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -237 (Holy)", -- [8]
						"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -48 (Holy)", -- [9]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [10]
						"扎心德勒-火妖鲁西弗隆 献祭 圆嘟嘟-黑龙费尔默 Hit -364 (Fire)", -- [11]
						"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -48 (Holy)", -- [12]
						"圆嘟嘟-黑龙费尔默 射击 babayaga-逐风者 Hit -76 (Fire)", -- [13]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [14]
						"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -188 (Shadow)", -- [15]
						"扎心德勒-火妖鲁西弗隆 献祭 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -156 (Fire)", -- [16]
						"卡乌恩 肉搏 圆嘟嘟-黑龙费尔默 Crit -286 (Physical)", -- [17]
						"卡乌恩 剧痛鞭笞 圆嘟嘟-黑龙费尔默 Hit -135 (Shadow)", -- [18]
						"圆嘟嘟-黑龙费尔默 射击 babayaga-逐风者 Hit -89 (Fire)", -- [19]
						"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -80 (Shadow)", -- [20]
						"扎心德勒-火妖鲁西弗隆 灼热之痛 圆嘟嘟-黑龙费尔默 Hit -405 (Fire)", -- [21]
						"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [22]
						"圆嘟嘟-黑龙费尔默死亡。", -- [23]
					},
					["DeathAt"] = 1683.834,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
					},
					["MessageTimes"] = {
						-14.63699999999994, -- [1]
						-13.6110000000001, -- [2]
						-12.67900000000009, -- [3]
						-12.13800000000015, -- [4]
						-10.65000000000009, -- [5]
						-9.024000000000115, -- [6]
						-8.490999999999985, -- [7]
						-7.631000000000086, -- [8]
						-6.115999999999985, -- [9]
						-6.024000000000115, -- [10]
						-4.734000000000151, -- [11]
						-4.597999999999956, -- [12]
						-3.311000000000149, -- [13]
						-3.027000000000044, -- [14]
						-1.727000000000089, -- [15]
						-1.727000000000089, -- [16]
						-1.355999999999995, -- [17]
						-1.355999999999995, -- [18]
						-1.288000000000011, -- [19]
						-1.198000000000093, -- [20]
						-0.2250000000001364, -- [21]
						-0.03300000000012915, -- [22]
						0, -- [23]
					},
					["HealthMax"] = {
						3167, -- [1]
						3167, -- [2]
						3167, -- [3]
						3167, -- [4]
						3167, -- [5]
						3167, -- [6]
						3167, -- [7]
						3167, -- [8]
						3167, -- [9]
						3167, -- [10]
						3167, -- [11]
						3167, -- [12]
						3167, -- [13]
						3167, -- [14]
						3167, -- [15]
						3167, -- [16]
						3167, -- [17]
						3167, -- [18]
						3167, -- [19]
						3167, -- [20]
						3167, -- [21]
						3167, -- [22]
						3167, -- [23]
					},
					["Health"] = {
						2893, -- [1]
						2893, -- [2]
						2744, -- [3]
						2744, -- [4]
						2529, -- [5]
						2529, -- [6]
						2380, -- [7]
						2380, -- [8]
						2146, -- [9]
						2098, -- [10]
						1946, -- [11]
						1585, -- [12]
						1537, -- [13]
						1537, -- [14]
						1388, -- [15]
						1388, -- [16]
						1388, -- [17]
						1044, -- [18]
						1044, -- [19]
						623, -- [20]
						547, -- [21]
						142, -- [22]
						0, -- [23]
					},
					["KilledBy"] = "暴走扁哥-黑龙费尔默",
					["MessageType"] = {
						"HEAL", -- [1]
						"DAMAGE", -- [2]
						"HEAL", -- [3]
						"DAMAGE", -- [4]
						"HEAL", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"MISC", -- [23]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "腐蚀术 (伤害/跳)",
			["LastFightIn"] = 2,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				3867, -- [1]
				3867, -- [2]
				3867, -- [3]
				3867, -- [4]
				3867, -- [5]
				3867, -- [6]
				3867, -- [7]
				3867, -- [8]
				3867, -- [9]
				3867, -- [10]
				3867, -- [11]
				3867, -- [12]
				3867, -- [13]
				3167, -- [14]
				3167, -- [15]
				3167, -- [16]
				3167, -- [17]
				3167, -- [18]
				3167, -- [19]
				3167, -- [20]
				3167, -- [21]
				3167, -- [22]
				3167, -- [23]
				3167, -- [24]
				3167, -- [25]
				3167, -- [26]
				3167, -- [27]
				3167, -- [28]
				3167, -- [29]
				3167, -- [30]
				3167, -- [31]
				3167, -- [32]
				3167, -- [33]
				3167, -- [34]
				3167, -- [35]
				3167, -- [36]
				3167, -- [37]
				3167, -- [38]
				3167, -- [39]
				3167, -- [40]
				3167, -- [41]
				3167, -- [42]
				3167, -- [43]
				3167, -- [44]
				3167, -- [45]
				3167, -- [46]
				3167, -- [47]
				3167, -- [48]
			},
			["LastDamageTaken"] = 152,
			["TimeLast"] = {
				["TimeHeal"] = 1672.827,
				["Dispels"] = 1623.824,
				["Healing"] = 1672.827,
				["DamageTaken"] = 1681.842,
				["OVERALL"] = 1681.842,
				["Absorbs"] = 1610.837,
				["DeathCount"] = 1681.842,
				["HOT_Time"] = 1483.834,
				["ActiveTime"] = 1679.841,
				["Overhealing"] = 1464.828,
				["TimeDamage"] = 1679.841,
				["DOT_Time"] = 1640.824,
				["Damage"] = 1679.841,
			},
			["Owner"] = false,
			["LastHealTime"] = 1673.486,
			["NextEventNum"] = 49,
			["LastDamageTime"] = 1680.689,
			["LastEvents"] = {
				"圆嘟嘟-黑龙费尔默 快速治疗 云淡风轻刺猬-黑龙费尔默 Hit +990", -- [1]
				"圆嘟嘟-黑龙费尔默 快速治疗 云淡风轻刺猬-黑龙费尔默 Hit +969", -- [2]
				"圆嘟嘟-黑龙费尔默 快速治疗 云淡风轻刺猬-黑龙费尔默 Hit +1024", -- [3]
				"圆嘟嘟-黑龙费尔默 强效治疗术 云淡风轻刺猬-黑龙费尔默 Hit +2142 (811 过量治疗)", -- [4]
				"卡尔摩斯 肉搏 圆嘟嘟-黑龙费尔默 Hit -29 (Physical)", -- [5]
				"卡尔摩斯 肉搏 圆嘟嘟-黑龙费尔默 Hit -31 (Physical)", -- [6]
				"圆嘟嘟-黑龙费尔默 恢复 云淡风轻刺猬-黑龙费尔默 Tick +203", -- [7]
				"卡尔摩斯 肉搏 圆嘟嘟-黑龙费尔默 Hit -33 (Physical)", -- [8]
				"圆嘟嘟-黑龙费尔默 恢复 云淡风轻刺猬-黑龙费尔默 Tick +203", -- [9]
				"圆嘟嘟-黑龙费尔默 治疗术 六毛六-逐风者 Hit +1001", -- [10]
				"卡尔摩斯 肉搏 圆嘟嘟-黑龙费尔默 Hit -31 (Physical)", -- [11]
				"圆嘟嘟-黑龙费尔默 恢复 云淡风轻刺猬-黑龙费尔默 Tick +202", -- [12]
				"卡尔摩斯 肉搏 圆嘟嘟-黑龙费尔默 Hit -34 (Physical)", -- [13]
				"圆嘟嘟-黑龙费尔默 快速治疗 六毛六-逐风者 Hit +978", -- [14]
				"圆嘟嘟-黑龙费尔默 快速治疗 小小的贼-逐风者 Hit +968", -- [15]
				"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +964", -- [16]
				"圆嘟嘟-黑龙费尔默 dispels 暴风卫兵-逐风者 冰锥术 (驱散魔法)", -- [17]
				"圆嘟嘟-黑龙费尔默 快速治疗 六毛六-逐风者 Hit +930", -- [18]
				"圆嘟嘟-黑龙费尔默 dispels 暴风卫兵-逐风者 冰冻 (驱散魔法)", -- [19]
				"圆嘟嘟-黑龙费尔默 dispels 暴风卫兵-逐风者 冰霜新星 (驱散魔法)", -- [20]
				"圆嘟嘟-黑龙费尔默 dispels 特变电工 冰冻 (驱散魔法)", -- [21]
				"圆嘟嘟-黑龙费尔默 精神鞭笞 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -189 (Shadow)", -- [22]
				"圆嘟嘟-黑龙费尔默 精神鞭笞 (伤害/跳) 暴走扁哥-黑龙费尔默 Tick -189 (Shadow)", -- [23]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [24]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [25]
				"圆嘟嘟-黑龙费尔默 快速治疗 肌肉髪-逐风者 Hit +952", -- [26]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [27]
				"圆嘟嘟-黑龙费尔默 快速治疗 肌肉髪-逐风者 Hit +976", -- [28]
				"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -218 (Holy)", -- [29]
				"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +925", -- [30]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -153 (Shadow)", -- [31]
				"圆嘟嘟-黑龙费尔默 快速治疗 暴风卫兵-逐风者 Hit +922", -- [32]
				"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -237 (Holy)", -- [33]
				"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -48 (Holy)", -- [34]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [35]
				"扎心德勒-火妖鲁西弗隆 献祭 圆嘟嘟-黑龙费尔默 Hit -364 (Fire)", -- [36]
				"小猫掉毛-逐风者 神圣新星 圆嘟嘟-黑龙费尔默 Hit -48 (Holy)", -- [37]
				"圆嘟嘟-黑龙费尔默 射击 babayaga-逐风者 Hit -76 (Fire)", -- [38]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [39]
				"扎心德勒-火妖鲁西弗隆 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -188 (Shadow)", -- [40]
				"扎心德勒-火妖鲁西弗隆 献祭 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -156 (Fire)", -- [41]
				"卡乌恩 肉搏 圆嘟嘟-黑龙费尔默 Crit -286 (Physical)", -- [42]
				"卡乌恩 剧痛鞭笞 圆嘟嘟-黑龙费尔默 Hit -135 (Shadow)", -- [43]
				"圆嘟嘟-黑龙费尔默 射击 babayaga-逐风者 Hit -89 (Fire)", -- [44]
				"扎心德勒-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -80 (Shadow)", -- [45]
				"扎心德勒-火妖鲁西弗隆 灼热之痛 圆嘟嘟-黑龙费尔默 Hit -405 (Fire)", -- [46]
				"暴走扁哥-黑龙费尔默 腐蚀术 (伤害/跳) 圆嘟嘟-黑龙费尔默 Tick -152 (Shadow)", -- [47]
				"圆嘟嘟-黑龙费尔默死亡。", -- [48]
			},
			["Name"] = "圆嘟嘟-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
			},
			["LastEventTimes"] = {
				1457.044, -- [1]
				1460.144, -- [2]
				1461.795, -- [3]
				1465.365, -- [4]
				1468.915, -- [5]
				1470.944, -- [6]
				1475.216, -- [7]
				1476.452, -- [8]
				1481.215, -- [9]
				1481.268, -- [10]
				1482.478, -- [11]
				1484.229, -- [12]
				1484.473, -- [13]
				1609.687, -- [14]
				1611.187, -- [15]
				1613.121, -- [16]
				1615.104, -- [17]
				1621.404, -- [18]
				1623.121, -- [19]
				1623.121, -- [20]
				1624.624, -- [21]
				1640.156, -- [22]
				1641.156, -- [23]
				1662.35, -- [24]
				1665.359, -- [25]
				1667.34, -- [26]
				1668.366, -- [27]
				1669.298, -- [28]
				1669.839, -- [29]
				1671.327, -- [30]
				1672.953, -- [31]
				1673.486, -- [32]
				1674.346, -- [33]
				1675.861, -- [34]
				1675.953, -- [35]
				1677.243, -- [36]
				1677.379, -- [37]
				1678.666, -- [38]
				1678.95, -- [39]
				1680.25, -- [40]
				1680.25, -- [41]
				1680.621, -- [42]
				1680.621, -- [43]
				1680.689, -- [44]
				1680.779, -- [45]
				1681.752, -- [46]
				1681.944, -- [47]
				1681.977, -- [48]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["真言术：盾"] = {
							["Details"] = {
								["六毛六-逐风者"] = {
									["max"] = 286,
									["min"] = 70,
									["count"] = 6,
									["amount"] = 1106,
								},
							},
							["count"] = 6,
							["amount"] = 1106,
						},
					},
					["DOTs"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3230,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 1106,
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 925,
						["Shadow"] = 1468,
						["Melee"] = 286,
						["Holy"] = 551,
					},
					["DOT_Time"] = 6,
					["Damage"] = 543,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 15.81,
					["RessedWho"] = {
					},
					["Dispels"] = 4,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 165,
						["Shadow"] = 378,
					},
					["PartialAbsorb"] = {
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 165,
								},
							},
							["amount"] = 165,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 378,
								},
							},
							["amount"] = 378,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 551,
								},
							},
							["amount"] = 551,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 364,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 80,
								},
								["灼热之痛"] = {
									["count"] = 405,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 188,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 156,
								},
							},
							["amount"] = 1193,
						},
						["卡乌恩"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 135,
								},
								["肉搏"] = {
									["count"] = 286,
								},
							},
							["amount"] = 421,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1065,
								},
							},
							["amount"] = 1065,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["六毛六-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.88,
								},
								["真言术：盾"] = {
									["count"] = 5.18,
								},
							},
							["amount"] = 7.06,
						},
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 4.35,
								},
							},
							["amount"] = 4.35,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 1.4,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1928,
								},
							},
							["amount"] = 1928,
						},
						["六毛六-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1908,
								},
								["真言术：盾"] = {
									["count"] = 1106,
								},
							},
							["amount"] = 3014,
						},
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 2811,
								},
							},
							["amount"] = 2811,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 968,
								},
							},
							["amount"] = 968,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.88,
								},
								["真言术：盾"] = {
									["count"] = 5.18,
								},
							},
							["amount"] = 7.06,
						},
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 4.35,
								},
							},
							["amount"] = 4.35,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 1.4,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["快速治疗"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 978,
									["min"] = 922,
									["count"] = 8,
									["amount"] = 7615,
								},
							},
							["count"] = 8,
							["amount"] = 7615,
						},
						["真言术：盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 286,
									["min"] = 70,
									["count"] = 6,
									["amount"] = 1106,
								},
							},
							["count"] = 6,
							["amount"] = 1106,
						},
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 21.31,
					["Healing"] = 7615,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 89,
									["min"] = 76,
									["count"] = 2,
									["amount"] = 165,
								},
							},
							["count"] = 2,
							["amount"] = 165,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 189,
									["min"] = 189,
									["count"] = 2,
									["amount"] = 378,
								},
							},
							["count"] = 2,
							["amount"] = 378,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 5.5,
					["TimeDamaging"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰锥术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰霜新星 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["特变电工"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["治疗术"] = {
									["count"] = 0.05,
								},
								["真言术：盾"] = {
									["count"] = 5.18,
								},
								["快速治疗"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 7.109999999999999,
						},
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 4.35,
								},
							},
							["amount"] = 4.35,
						},
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 1.4,
						},
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 1.5,
								},
								["快速治疗"] = {
									["count"] = 4.5,
								},
								["恢复"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 10.5,
						},
					},
					["OverHeals"] = {
						["强效治疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 811,
									["min"] = 811,
									["count"] = 1,
									["amount"] = 811,
								},
							},
							["count"] = 1,
							["amount"] = 811,
						},
					},
					["ElementDone"] = {
						["Fire"] = 165,
						["Shadow"] = 378,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["TimeSpent"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["治疗术"] = {
									["count"] = 0.05,
								},
								["真言术：盾"] = {
									["count"] = 5.18,
								},
								["快速治疗"] = {
									["count"] = 1.88,
								},
							},
							["amount"] = 7.109999999999999,
						},
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 4.35,
								},
							},
							["amount"] = 4.35,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 1.4,
						},
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 1.5,
								},
								["快速治疗"] = {
									["count"] = 4.5,
								},
								["恢复"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 10.5,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 3388,
					["HOT_Time"] = 9,
					["PartialResist"] = {
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["DeathCount"] = 1,
					["Overhealing"] = 811,
					["ActiveTime"] = 31.86,
					["TimeHeal"] = 26.36,
					["ElementTaken"] = {
						["Fire"] = 925,
						["Shadow"] = 1468,
						["Melee"] = 444,
						["Holy"] = 551,
					},
					["HOTs"] = {
						["恢复"] = {
							["Details"] = {
								["云淡风轻刺猬-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["Damage"] = 543,
					["DOTs"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["暴走扁哥-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["Heals"] = {
						["治疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1001,
									["min"] = 1001,
									["count"] = 1,
									["amount"] = 1001,
								},
							},
							["count"] = 1,
							["amount"] = 1001,
						},
						["真言术：盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 286,
									["min"] = 70,
									["count"] = 6,
									["amount"] = 1106,
								},
							},
							["count"] = 6,
							["amount"] = 1106,
						},
						["恢复"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 203,
									["min"] = 202,
									["count"] = 3,
									["amount"] = 608,
								},
							},
							["count"] = 3,
							["amount"] = 608,
						},
						["快速治疗"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1024,
									["min"] = 922,
									["count"] = 11,
									["amount"] = 10598,
								},
							},
							["count"] = 11,
							["amount"] = 10598,
						},
						["强效治疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1331,
									["min"] = 1331,
									["count"] = 1,
									["amount"] = 1331,
								},
							},
							["count"] = 1,
							["amount"] = 1331,
						},
					},
					["DOT_Time"] = 6,
					["Dispels"] = 4,
					["TimeDamaging"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
					},
					["Healing"] = 13538,
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DispelledWho"] = {
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰锥术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰霜新星 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["特变电工"] = {
							["Details"] = {
								["冰冻 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 89,
									["min"] = 76,
									["count"] = 2,
									["amount"] = 165,
								},
							},
							["count"] = 2,
							["amount"] = 165,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 189,
									["min"] = 189,
									["count"] = 2,
									["amount"] = 378,
								},
							},
							["count"] = 2,
							["amount"] = 378,
						},
					},
					["Absorbs"] = 1106,
					["DamagedWho"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 165,
								},
							},
							["amount"] = 165,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 378,
								},
							},
							["amount"] = 378,
						},
					},
					["TimeDamage"] = 5.5,
					["WhoDamaged"] = {
						["卡尔摩斯"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 158,
								},
							},
							["amount"] = 158,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 364,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 80,
								},
								["灼热之痛"] = {
									["count"] = 405,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 188,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 156,
								},
							},
							["amount"] = 1193,
						},
						["卡乌恩"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 135,
								},
								["肉搏"] = {
									["count"] = 286,
								},
							},
							["amount"] = 421,
						},
						["暴走扁哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1065,
								},
							},
							["amount"] = 1065,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 551,
								},
							},
							["amount"] = 551,
						},
					},
					["PartialAbsorb"] = {
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["剧痛鞭笞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["HealedWho"] = {
						["六毛六-逐风者"] = {
							["Details"] = {
								["治疗术"] = {
									["count"] = 1001,
								},
								["真言术：盾"] = {
									["count"] = 1106,
								},
								["快速治疗"] = {
									["count"] = 1908,
								},
							},
							["amount"] = 4015,
						},
						["暴风卫兵-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 2811,
								},
							},
							["amount"] = 2811,
						},
						["肌肉髪-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1928,
								},
							},
							["amount"] = 1928,
						},
						["小小的贼-逐风者"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 968,
								},
							},
							["amount"] = 968,
						},
						["云淡风轻刺猬-黑龙费尔默"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 1331,
								},
								["快速治疗"] = {
									["count"] = 2983,
								},
								["恢复"] = {
									["count"] = 608,
								},
							},
							["amount"] = 4922,
						},
					},
					["Absorbed"] = {
						["真言术：盾"] = {
							["Details"] = {
								["六毛六-逐风者"] = {
									["max"] = 286,
									["min"] = 70,
									["count"] = 6,
									["amount"] = 1106,
								},
							},
							["count"] = 6,
							["amount"] = 1106,
						},
					},
				},
			},
			["UnitLockout"] = 1456.826,
			["LastActive"] = 1681.842,
		},
		["格里鲁姆 <六毛六-逐风者>"] = {
			["GUID"] = "Pet-0-5427-529-6511-417-0D0116F323",
			["LastEventHealth"] = {
				2282, -- [1]
				2282, -- [2]
				2219, -- [3]
				2219, -- [4]
				2156, -- [5]
				2668, -- [6]
				2605, -- [7]
				2605, -- [8]
				2668, -- [9]
				2633, -- [10]
				2668, -- [11]
				2668, -- [12]
				2668, -- [13]
				2668, -- [14]
				2668, -- [15]
				2369, -- [16]
				2668, -- [17]
				2551, -- [18]
				2320, -- [19]
				2320, -- [20]
				2092, -- [21]
				2085, -- [22]
				1744, -- [23]
				1744, -- [24]
				1744, -- [25]
				1462, -- [26]
				1462, -- [27]
				1176, -- [28]
				1098, -- [29]
				1098, -- [30]
				1717, -- [31]
				1669, -- [32]
				1669, -- [33]
				1423, -- [34]
				1423, -- [35]
				1423, -- [36]
				1265, -- [37]
				1265, -- [38]
				1265, -- [39]
				1265, -- [40]
				1265, -- [41]
				1265, -- [42]
				1180, -- [43]
				1180, -- [44]
				1180, -- [45]
				1799, -- [46]
				2477, -- [47]
				2411, -- [48]
				2348, -- [49]
				2348, -- [50]
			},
			["LastAttackedBy"] = "利群-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"MISC", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"MISC", -- [10]
				"MISC", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"MISC", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"MISC", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"MISC", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["Interrupts"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					49.06, -- [1]
				},
				["TimeDamage"] = {
					49.06, -- [1]
				},
				["Dispels"] = {
					10, -- [1]
				},
				["DamageTaken"] = {
					2587, -- [1]
				},
				["Damage"] = {
					2648, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "格里鲁姆",
			["level"] = 1,
			["LastDamageAbility"] = "虚弱之触",
			["LastFightIn"] = 2,
			["type"] = "Pet",
			["ownerName"] = "六毛六-逐风者",
			["LastDamageTaken"] = 85,
			["TimeLast"] = {
				["Interrupts"] = 1660.824,
				["TimeDamage"] = 1695.831,
				["ActiveTime"] = 1695.831,
				["Dispels"] = 1693.826,
				["OVERALL"] = 1695.831,
				["DamageTaken"] = 1690.826,
				["Damage"] = 1695.831,
			},
			["LastEventHealthMax"] = {
				2668, -- [1]
				2668, -- [2]
				2668, -- [3]
				2668, -- [4]
				2668, -- [5]
				2668, -- [6]
				2668, -- [7]
				2668, -- [8]
				2668, -- [9]
				2668, -- [10]
				2668, -- [11]
				2668, -- [12]
				2668, -- [13]
				2668, -- [14]
				2668, -- [15]
				2668, -- [16]
				2668, -- [17]
				2668, -- [18]
				2668, -- [19]
				2668, -- [20]
				2668, -- [21]
				2668, -- [22]
				2668, -- [23]
				2668, -- [24]
				2668, -- [25]
				2668, -- [26]
				2668, -- [27]
				2668, -- [28]
				2668, -- [29]
				2668, -- [30]
				2668, -- [31]
				2668, -- [32]
				2668, -- [33]
				2668, -- [34]
				2668, -- [35]
				2668, -- [36]
				2668, -- [37]
				2668, -- [38]
				2668, -- [39]
				2668, -- [40]
				2668, -- [41]
				2668, -- [42]
				2668, -- [43]
				2668, -- [44]
				2668, -- [45]
				2668, -- [46]
				2668, -- [47]
				2668, -- [48]
				2668, -- [49]
				2668, -- [50]
			},
			["NextEventNum"] = 47,
			["LastDamageTime"] = 1695.968,
			["LastEvents"] = {
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -63 (Shadow)", -- [1]
				"格里鲁姆 <六毛六-逐风者> 肉搏 扎心德勒-火妖鲁西弗隆 Hit -103 (Physical)", -- [2]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -63 (Shadow)", -- [3]
				"格里鲁姆 <六毛六-逐风者> 肉搏 扎心德勒-火妖鲁西弗隆 Hit -90 (Physical)", -- [4]
				"格里鲁姆 <六毛六-逐风者> dispels 扎心德勒-火妖鲁西弗隆 奥术智慧 (吞噬魔法)", -- [5]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -63 (Shadow)", -- [6]
				"babayaga-逐风者 冰霜新星 格里鲁姆 <六毛六-逐风者> Resist (Frost)", -- [7]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -8 (Shadow)", -- [8]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -35 (Shadow)", -- [9]
				"格里鲁姆 <六毛六-逐风者> dispels 小猫掉毛-逐风者 奥术智慧 (吞噬魔法)", -- [10]
				"格里鲁姆 interrupts babayaga-逐风者 灼烧 (法术封锁)", -- [11]
				"格里鲁姆 <六毛六-逐风者> 肉搏 babayaga-逐风者 Absorb -92 (92 被吸收) (1)", -- [12]
				"格里鲁姆 <六毛六-逐风者> 肉搏 babayaga-逐风者 Absorb -95 (95 被吸收) (1)", -- [13]
				"小猫掉毛-逐风者 神圣新星 格里鲁姆 <六毛六-逐风者> Hit -231 (Holy)", -- [14]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -68 (Shadow)", -- [15]
				"格里鲁姆 <六毛六-逐风者> dispels 小猫掉毛-逐风者 心灵之火 (吞噬魔法)", -- [16]
				"小猫掉毛-逐风者 暗影守卫 格里鲁姆 <六毛六-逐风者> Hit -117 (39 被抵抗) (Shadow)", -- [17]
				"小猫掉毛-逐风者 神圣新星 格里鲁姆 <六毛六-逐风者> Hit -231 (Holy)", -- [18]
				"小猫掉毛-逐风者 神圣新星 格里鲁姆 <六毛六-逐风者> Hit -228 (Holy)", -- [19]
				"格里鲁姆 <六毛六-逐风者> 肉搏 小猫掉毛-逐风者 Hit -96 (Physical)", -- [20]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -7 (Shadow)", -- [21]
				"小猫掉毛-逐风者 神圣新星 格里鲁姆 <六毛六-逐风者> Crit -341 (Holy)", -- [22]
				"格里鲁姆 <六毛六-逐风者> 肉搏 小猫掉毛-逐风者 Hit -88 (Physical)", -- [23]
				"babayaga-逐风者 魔爆术 格里鲁姆 <六毛六-逐风者> Hit -150 (150 被抵抗) (Arcane)", -- [24]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -132 (Shadow)", -- [25]
				"小猫掉毛-逐风者 神圣新星 格里鲁姆 <六毛六-逐风者> Hit -224 (Holy)", -- [26]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -62 (Shadow)", -- [27]
				"小猫掉毛-逐风者 神圣新星 格里鲁姆 <六毛六-逐风者> Crit -78 (Holy)", -- [28]
				"格里鲁姆 <六毛六-逐风者> 肉搏 小猫掉毛-逐风者 Hit -97 (Physical)", -- [29]
				"格里鲁姆 <六毛六-逐风者> dispels babayaga-逐风者 冰甲术 (吞噬魔法)", -- [30]
				"小猫掉毛-逐风者 神圣新星 格里鲁姆 <六毛六-逐风者> Hit -48 (Holy)", -- [31]
				"babayaga-逐风者 魔爆术 格里鲁姆 <六毛六-逐风者> Hit -150 (150 被抵抗) (Arcane)", -- [32]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -96 (Shadow)", -- [33]
				"格里鲁姆 <六毛六-逐风者> 肉搏 babayaga-逐风者 Hit -100 (Physical)", -- [34]
				"babayaga-逐风者 冰锥术 格里鲁姆 <六毛六-逐风者> Resist (Frost)", -- [35]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -158 (Shadow)", -- [36]
				"格里鲁姆 <六毛六-逐风者> 肉搏 小猫掉毛-逐风者 Hit -89 (Physical)", -- [37]
				"小猫掉毛-逐风者 心灵尖啸 格里鲁姆 <六毛六-逐风者> Resist (Shadow)", -- [38]
				"格里鲁姆 <六毛六-逐风者> 吞噬魔法 小猫掉毛-逐风者 Resist (Shadow)", -- [39]
				"格里鲁姆 <六毛六-逐风者> 肉搏 利群-逐风者 Hit -84 (Physical)", -- [40]
				"利群-逐风者 虚弱之触 格里鲁姆 <六毛六-逐风者> Hit -85 (Shadow)", -- [41]
				"利群-逐风者 昏阙 格里鲁姆 <六毛六-逐风者> Resist (Shadow)", -- [42]
				"利群-逐风者 心灵尖啸 格里鲁姆 <六毛六-逐风者> Resist (Shadow)", -- [43]
				"格里鲁姆 <六毛六-逐风者> 法术封锁 利群-逐风者 Resist (Shadow)", -- [44]
				"格里鲁姆 <六毛六-逐风者> dispels 利群-逐风者 心灵之火 (吞噬魔法)", -- [45]
				"格里鲁姆 <六毛六-逐风者> 肉搏 利群-逐风者 Hit -84 (Physical)", -- [46]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -66 (Shadow)", -- [47]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -63 (Shadow)", -- [48]
				"格里鲁姆 <六毛六-逐风者> 肉搏 扎心德勒-火妖鲁西弗隆 Absorb -106 (106 被吸收) (1)", -- [49]
				"六毛六-逐风者 灵魂链接 格里鲁姆 <六毛六-逐风者> Split -66 (Shadow)", -- [50]
			},
			["Name"] = "格里鲁姆",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				1615.771, -- [1]
				1615.904, -- [2]
				1617.788, -- [3]
				1617.887, -- [4]
				1617.938, -- [5]
				1619.788, -- [6]
				1621.038, -- [7]
				1621.058, -- [8]
				1660.057, -- [9]
				1660.057, -- [10]
				1661.576, -- [11]
				1663.574, -- [12]
				1666.212, -- [13]
				1668.332, -- [14]
				1668.332, -- [15]
				1668.855, -- [16]
				1669.059, -- [17]
				1669.839, -- [18]
				1671.327, -- [19]
				1671.486, -- [20]
				1672.551, -- [21]
				1672.849, -- [22]
				1673.899, -- [23]
				1674.025, -- [24]
				1674.041, -- [25]
				1674.346, -- [26]
				1674.367, -- [27]
				1675.861, -- [28]
				1675.918, -- [29]
				1676.98, -- [30]
				1677.379, -- [31]
				1677.482, -- [32]
				1677.494, -- [33]
				1678.984, -- [34]
				1679.537, -- [35]
				1679.537, -- [36]
				1683.153, -- [37]
				1684.313, -- [38]
				1685.063, -- [39]
				1691.376, -- [40]
				1691.409, -- [41]
				1691.426, -- [42]
				1691.892, -- [43]
				1692.359, -- [44]
				1693.976, -- [45]
				1695.968, -- [46]
				1612.287, -- [47]
				1613.787, -- [48]
				1613.887, -- [49]
				1615.289, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1883,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 20,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Holy"] = 1381,
						["Shadow"] = 202,
						["Arcane"] = 300,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1780,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 7,
					["ElementTakenResist"] = {
						["Arcane"] = 300,
						["Shadow"] = 39,
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 293,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 1780,
					},
					["PartialAbsorb"] = {
						["昏阙"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 168,
								},
							},
							["amount"] = 168,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 955,
								},
							},
							["amount"] = 955,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 370,
								},
							},
							["amount"] = 370,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 287,
								},
							},
							["amount"] = 287,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 85,
								},
							},
							["amount"] = 85,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 1381,
								},
								["暗影守卫"] = {
									["count"] = 117,
								},
							},
							["amount"] = 1498,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["昏阙"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
							},
							["count"] = 39,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 150,
									["min"] = 150,
									["count"] = 2,
									["amount"] = 300,
								},
							},
							["count"] = 300,
							["amount"] = 2,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 1,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["法术封锁"] = {
									["count"] = 0.98,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.98,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 0.05,
								},
								["肉搏"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.55,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7.5,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["灼烧 (法术封锁)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 32.53,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["吞噬魔法"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["法术封锁"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 106,
									["min"] = 92,
									["count"] = 3,
									["amount"] = 293,
								},
								["Crit"] = {
									["max"] = 161,
									["min"] = 161,
									["count"] = 1,
									["amount"] = 161,
								},
								["Hit"] = {
									["max"] = 103,
									["min"] = 64,
									["count"] = 16,
									["amount"] = 1326,
								},
							},
							["count"] = 20,
							["amount"] = 1780,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 32.53,
					["TimeDamaging"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["法术封锁"] = {
									["count"] = 0.98,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.98,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 0.05,
								},
								["肉搏"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.55,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7.5,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
						["利群-逐风者"] = {
							["Details"] = {
								["心灵之火 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影防护祷言 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["魔甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["冰甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["心灵之火 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7.5,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["法术锁定"] = {
									["count"] = 0.03,
								},
								["法术封锁"] = {
									["count"] = 0.98,
								},
								["肉搏"] = {
									["count"] = 19.5,
								},
							},
							["amount"] = 20.51,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 0.05,
								},
								["肉搏"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.55,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["DamageTaken"] = 2587,
					["ElementDoneAbsorb"] = {
						["Melee"] = 880,
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["昏阙"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
							},
							["count"] = 39,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 150,
									["min"] = 150,
									["count"] = 2,
									["amount"] = 300,
								},
							},
							["count"] = 300,
							["amount"] = 2,
						},
						["放逐术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["昏阙"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["放逐术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 49.06,
					["ElementTaken"] = {
						["Shadow"] = 906,
						["Holy"] = 1381,
						["Arcane"] = 300,
					},
					["Damage"] = 2648,
					["Dispels"] = 10,
					["ElementTakenResist"] = {
						["Arcane"] = 300,
						["Shadow"] = 39,
					},
					["InterruptData"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["灼烧 (法术封锁)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 1,
					["WhoDamaged"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 300,
								},
							},
							["amount"] = 300,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 85,
								},
							},
							["amount"] = 85,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 1381,
								},
								["暗影守卫"] = {
									["count"] = 117,
								},
							},
							["amount"] = 1498,
						},
						["Moana-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 704,
								},
							},
							["amount"] = 704,
						},
					},
					["Attacks"] = {
						["法术锁定"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["吞噬魔法"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["法术封锁"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 127,
									["min"] = 66,
									["count"] = 10,
									["amount"] = 880,
								},
								["Crit"] = {
									["max"] = 161,
									["min"] = 161,
									["count"] = 1,
									["amount"] = 161,
								},
								["Hit"] = {
									["max"] = 103,
									["min"] = 64,
									["count"] = 19,
									["amount"] = 1607,
								},
							},
							["count"] = 31,
							["amount"] = 2648,
						},
					},
					["DamagedWho"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 370,
								},
							},
							["amount"] = 370,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1036,
								},
							},
							["amount"] = 1036,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 955,
								},
							},
							["amount"] = 955,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 287,
								},
							},
							["amount"] = 287,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 31,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["TimeDamage"] = 49.06,
					["TimeDamaging"] = {
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7.5,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["法术锁定"] = {
									["count"] = 0.03,
								},
								["法术封锁"] = {
									["count"] = 0.98,
								},
								["肉搏"] = {
									["count"] = 19.5,
								},
							},
							["amount"] = 20.51,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["吞噬魔法"] = {
									["count"] = 0.05,
								},
								["肉搏"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.55,
						},
						["babayaga-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 12,
						},
						["Holy"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDone"] = {
						["Melee"] = 2648,
					},
					["DispelledWho"] = {
						["babayaga-逐风者"] = {
							["Details"] = {
								["冰甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["利群-逐风者"] = {
							["Details"] = {
								["恢复 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["心灵之火 (吞噬魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["扎心德勒-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影防护祷言 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["魔甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["小猫掉毛-逐风者"] = {
							["Details"] = {
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["心灵之火 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 1459.828,
			["LastActive"] = 1695.831,
		},
	},
	["FightNum"] = 3,
	["CombatTimes"] = {
		{
			1453.836, -- [1]
			1486.829, -- [2]
			"22:28:29", -- [3]
			"22:29:01", -- [4]
			"利群-逐风者", -- [5]
		}, -- [1]
		{
			1524.831, -- [1]
			1568.834, -- [2]
			"22:29:40", -- [3]
			"22:30:23", -- [4]
			"利群-逐风者", -- [5]
		}, -- [2]
		{
			1575.852, -- [1]
			1712.839, -- [2]
			"22:30:31", -- [3]
			"22:32:47", -- [4]
			"皇家特工-逐风者", -- [5]
		}, -- [3]
	},
	["FoughtWho"] = {
	},
}
