
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["LastEventHealth"] = {
				3062, -- [1]
				3062, -- [2]
				3062, -- [3]
				3062, -- [4]
				1777, -- [5]
				1234, -- [6]
				2346, -- [7]
				2346, -- [8]
				2366, -- [9]
				2366, -- [10]
				2366, -- [11]
				2366, -- [12]
				2366, -- [13]
				2366, -- [14]
				2366, -- [15]
				2366, -- [16]
				2366, -- [17]
				2366, -- [18]
				2366, -- [19]
				2616, -- [20]
				2866, -- [21]
				3116, -- [22]
				3116, -- [23]
				3366, -- [24]
				3366, -- [25]
				3366, -- [26]
				3366, -- [27]
				3366, -- [28]
				3366, -- [29]
				3366, -- [30]
				3072, -- [31]
				3012, -- [32]
				3012, -- [33]
				2962, -- [34]
				2962, -- [35]
				2962, -- [36]
				2962, -- [37]
				2962, -- [38]
				2962, -- [39]
				2962, -- [40]
				2962, -- [41]
				2982, -- [42]
				2982, -- [43]
				2982, -- [44]
				3002, -- [45]
				3022, -- [46]
				3022, -- [47]
				3042, -- [48]
				3042, -- [49]
				3062, -- [50]
			},
			["LastAttackedBy"] = "莱弗提",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"HEAL", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"HEAL", -- [19]
				"HEAL", -- [20]
				"HEAL", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"HEAL", -- [43]
				"DAMAGE", -- [44]
				"HEAL", -- [45]
				"DAMAGE", -- [46]
				"HEAL", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					72.66000000000003, -- [1]
				},
				["Dispelled"] = {
					11, -- [1]
				},
				["HOT_Time"] = {
					12, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Healing"] = {
					3728, -- [1]
				},
				["DamageTaken"] = {
					25629, -- [1]
				},
				["ActiveTime"] = {
					263.1600000000002, -- [1]
				},
				["GTFOEvents"] = {
					34, -- [1]
				},
				["RageGain"] = {
					171, -- [1]
				},
				["Overhealing"] = {
					76, -- [1]
				},
				["TimeDamage"] = {
					190.5, -- [1]
				},
				["HealingTaken"] = {
					15209, -- [1]
				},
				["GTFOEventDamage"] = {
					4824, -- [1]
				},
				["DOT_Time"] = {
					126, -- [1]
				},
				["Damage"] = {
					46842, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						false, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						false, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						false, -- [38]
						false, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
						false, -- [45]
						true, -- [46]
						false, -- [47]
						true, -- [48]
						true, -- [49]
					},
					["Messages"] = {
						"塞尔德林 肉搏 特变电工 Hit -217 (Physical)", -- [1]
						"塞尔德林 致死打击 特变电工 Hit -305 (Physical)", -- [2]
						"特变电工 嗜血 玛尔根·长矛 Crit -430 (Physical)", -- [3]
						"特变电工 嗜血 特变电工 Hit +10", -- [4]
						"斯诺恩·黑骨 肉搏 特变电工 Hit -55 (Physical)", -- [5]
						"自爆绵羊 肉搏 特变电工 Hit -13 (Physical)", -- [6]
						"自爆绵羊 自爆绵羊 特变电工 Hit -147 (Fire)", -- [7]
						"塞尔德林 断筋 特变电工 Hit -19 (Physical)", -- [8]
						"斯诺恩·黑骨 肉搏 特变电工 Hit -70 (Physical)", -- [9]
						"塞尔德林 肉搏 特变电工 Hit -260 (Physical)", -- [10]
						"特变电工 重伤 (伤害/跳) 玛尔根·长矛 Tick -32 (Physical)", -- [11]
						"玛尔根·长矛 肉搏 特变电工 Hit -85 (Physical)", -- [12]
						"玛尔根·长矛 摔绊 特变电工 Hit -21 (Physical)", -- [13]
						"特变电工 肉搏 玛尔根·长矛 Hit -152 (Physical)", -- [14]
						"特变电工 嗜血 特变电工 Hit +10", -- [15]
						"斯诺恩·黑骨 肉搏 特变电工 Hit -71 (Physical)", -- [16]
						"雷兹尼克 黑铁炸弹 特变电工 Hit -348 (Fire)", -- [17]
						"玛尔根·长矛 肉搏 特变电工 Hit -78 (Physical)", -- [18]
						"特变电工 肉搏 玛尔根·长矛 Hit -122 (Physical)", -- [19]
						"特变电工 嗜血 特变电工 Hit +10", -- [20]
						"特变电工 重伤 (伤害/跳) 玛尔根·长矛 Tick -32 (Physical)", -- [21]
						"斯诺恩·黑骨 肉搏 特变电工 Hit -24 (Physical)", -- [22]
						"塞尔德林 肉搏 特变电工 Hit -227 (Physical)", -- [23]
						"玛尔根·长矛 肉搏 特变电工 Parry (1)", -- [24]
						"雷兹尼克 地精龙枪 特变电工 Hit -122 (45 被抵抗) (Fire)", -- [25]
						"特变电工 肉搏 玛尔根·长矛 Hit -131 (Physical)", -- [26]
						"特变电工 嗜血 特变电工 Hit +10", -- [27]
						"特变电工 复仇 玛尔根·长矛 Hit -44 (Physical)", -- [28]
						"特变电工 嗜血 特变电工 Hit +10", -- [29]
						"斯诺恩·黑骨 灼烧 特变电工 Hit -277 (Fire)", -- [30]
						"塞尔德林 断筋 特变电工 Hit -19 (Physical)", -- [31]
						"雷兹尼克 地精龙枪 特变电工 Hit -163 (Fire)", -- [32]
						"特变电工 重伤 (伤害/跳) 玛尔根·长矛 Tick -32 (Physical)", -- [33]
						"玛尔根·长矛 肉搏 特变电工 Miss (1)", -- [34]
						"雷兹尼克 地精龙枪 特变电工 Hit -148 (Fire)", -- [35]
						"斯诺恩·黑骨 灼烧 特变电工 Hit -367 (Fire)", -- [36]
						"塞尔德林 肉搏 特变电工 Hit -224 (Physical)", -- [37]
						"特变电工 顺劈斩 玛尔根·长矛 Dodge (Physical)", -- [38]
						"特变电工 顺劈斩 塞尔德林 Hit -168 (Physical)", -- [39]
						"雷兹尼克 地精龙枪 特变电工 Hit -154 (Fire)", -- [40]
						"玛尔根·长矛 肉搏 特变电工 Hit -92 (Physical)", -- [41]
						"塞尔德林 致死打击 特变电工 Miss (Physical)", -- [42]
						"雷兹尼克 地精龙枪 特变电工 Hit -129 (48 被抵抗) (Fire)", -- [43]
						"斯诺恩·黑骨 肉搏 特变电工 Miss (1)", -- [44]
						"特变电工 重伤 (伤害/跳) 玛尔根·长矛 Tick -32 (Physical)", -- [45]
						"斯诺恩·黑骨 肉搏 特变电工 Hit -64 (Physical)", -- [46]
						"特变电工 肉搏 玛尔根·长矛 Hit -186 (Physical)", -- [47]
						"玛尔根·长矛 肉搏 特变电工 Hit -88 (Physical)", -- [48]
						"特变电工死亡。", -- [49]
					},
					["DeathAt"] = 17969.173,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
					},
					["MessageTimes"] = {
						-14.8169999999991, -- [1]
						-13.8169999999991, -- [2]
						-13.61699999999837, -- [3]
						-13.61699999999837, -- [4]
						-13.53399999999965, -- [5]
						-13.3169999999991, -- [6]
						-13.28399999999965, -- [7]
						-12.18399999999747, -- [8]
						-11.51699999999983, -- [9]
						-11.01699999999983, -- [10]
						-10.58399999999892, -- [11]
						-10.5669999999991, -- [12]
						-10.5669999999991, -- [13]
						-10.0669999999991, -- [14]
						-10.0669999999991, -- [15]
						-9.53399999999965, -- [16]
						-8.683000000000902, -- [17]
						-8.566999999999098, -- [18]
						-7.916999999997643, -- [19]
						-7.916999999997643, -- [20]
						-7.599999999998545, -- [21]
						-7.514999999999418, -- [22]
						-7.200000000000728, -- [23]
						-6.566999999999098, -- [24]
						-6.316999999999098, -- [25]
						-6.132999999997992, -- [26]
						-6.11699999999837, -- [27]
						-6.032999999999447, -- [28]
						-6.016999999999825, -- [29]
						-5.816999999999098, -- [30]
						-5.717000000000553, -- [31]
						-5.316999999999098, -- [32]
						-4.599999999998545, -- [33]
						-4.566999999999098, -- [34]
						-4.316999999999098, -- [35]
						-4.216000000000349, -- [36]
						-3.382999999997992, -- [37]
						-3.36699999999837, -- [38]
						-3.36699999999837, -- [39]
						-3.316999999999098, -- [40]
						-2.549999999999272, -- [41]
						-2.483000000000175, -- [42]
						-2.316999999999098, -- [43]
						-2.200000000000728, -- [44]
						-1.599999999998545, -- [45]
						-0.2000000000007276, -- [46]
						-0.08299999999871943, -- [47]
						-0.03299999999944703, -- [48]
						0, -- [49]
					},
					["HealthMax"] = {
						4229, -- [1]
						4229, -- [2]
						4229, -- [3]
						4229, -- [4]
						4229, -- [5]
						4229, -- [6]
						4229, -- [7]
						4229, -- [8]
						4229, -- [9]
						4229, -- [10]
						4229, -- [11]
						4229, -- [12]
						4229, -- [13]
						4229, -- [14]
						4229, -- [15]
						4229, -- [16]
						4229, -- [17]
						4229, -- [18]
						4229, -- [19]
						4229, -- [20]
						4229, -- [21]
						4229, -- [22]
						4229, -- [23]
						4229, -- [24]
						4229, -- [25]
						4229, -- [26]
						4229, -- [27]
						4229, -- [28]
						4229, -- [29]
						4229, -- [30]
						4229, -- [31]
						4229, -- [32]
						4229, -- [33]
						4229, -- [34]
						4229, -- [35]
						4229, -- [36]
						4229, -- [37]
						4229, -- [38]
						4229, -- [39]
						4229, -- [40]
						4229, -- [41]
						4229, -- [42]
						4229, -- [43]
						4229, -- [44]
						4229, -- [45]
						4229, -- [46]
						4229, -- [47]
						4229, -- [48]
						4229, -- [49]
					},
					["Health"] = {
						3702, -- [1]
						3485, -- [2]
						3180, -- [3]
						3180, -- [4]
						3180, -- [5]
						3135, -- [6]
						3122, -- [7]
						2975, -- [8]
						2956, -- [9]
						2886, -- [10]
						2626, -- [11]
						2626, -- [12]
						2626, -- [13]
						2520, -- [14]
						2520, -- [15]
						2530, -- [16]
						2459, -- [17]
						2111, -- [18]
						2033, -- [19]
						2033, -- [20]
						2043, -- [21]
						2043, -- [22]
						2019, -- [23]
						1792, -- [24]
						1792, -- [25]
						1670, -- [26]
						1670, -- [27]
						1680, -- [28]
						1680, -- [29]
						1690, -- [30]
						1413, -- [31]
						1394, -- [32]
						1231, -- [33]
						1231, -- [34]
						1231, -- [35]
						1083, -- [36]
						716, -- [37]
						716, -- [38]
						492, -- [39]
						492, -- [40]
						338, -- [41]
						246, -- [42]
						246, -- [43]
						117, -- [44]
						117, -- [45]
						117, -- [46]
						53, -- [47]
						53, -- [48]
						0, -- [49]
					},
					["KilledBy"] = "玛尔根·长矛",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"HEAL", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"HEAL", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"HEAL", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"HEAL", -- [27]
						"DAMAGE", -- [28]
						"HEAL", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"MISC", -- [49]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 8,
			["LastHealTime"] = 18913.163,
			["type"] = "Self",
			["FightsSaved"] = 5,
			["LastEventHealthMax"] = {
				4089, -- [1]
				4089, -- [2]
				4089, -- [3]
				4089, -- [4]
				4089, -- [5]
				4089, -- [6]
				4089, -- [7]
				4089, -- [8]
				4089, -- [9]
				4089, -- [10]
				4089, -- [11]
				4089, -- [12]
				4089, -- [13]
				4089, -- [14]
				4089, -- [15]
				4089, -- [16]
				4089, -- [17]
				4089, -- [18]
				4089, -- [19]
				4089, -- [20]
				4089, -- [21]
				4089, -- [22]
				4089, -- [23]
				4089, -- [24]
				4089, -- [25]
				4089, -- [26]
				4089, -- [27]
				4089, -- [28]
				4089, -- [29]
				4089, -- [30]
				4089, -- [31]
				4089, -- [32]
				4089, -- [33]
				4089, -- [34]
				4089, -- [35]
				4089, -- [36]
				4089, -- [37]
				4089, -- [38]
				4089, -- [39]
				4089, -- [40]
				4089, -- [41]
				4089, -- [42]
				4089, -- [43]
				4089, -- [44]
				4089, -- [45]
				4089, -- [46]
				4089, -- [47]
				4089, -- [48]
				4089, -- [49]
				4089, -- [50]
			},
			["LastDamageTaken"] = 50,
			["Owner"] = false,
			["TimeLast"] = {
				["HOT_Time"] = 18900.179,
				["TimeHeal"] = 18912.18,
				["Dispelled"] = 18813.174,
				["DeathCount"] = 17967.173,
				["ActiveTime"] = 18914.18,
				["OVERALL"] = 18914.18,
				["DamageTaken"] = 18906.179,
				["GTFOEvents"] = 18855.176,
				["HealingTaken"] = 18912.18,
				["RageGain"] = 18912.18,
				["Overhealing"] = 17900.17,
				["TimeDamage"] = 18914.18,
				["Healing"] = 18912.18,
				["GTFOEventDamage"] = 18855.176,
				["DOT_Time"] = 18914.18,
				["Damage"] = 18914.18,
			},
			["NextEventNum"] = 5,
			["LastDamageTime"] = 18914.905,
			["LastEvents"] = {
				"特变电工 重伤 (伤害/跳) 莱弗提 Tick -42 (Physical)", -- [1]
				"莱弗提 肉搏 特变电工 Miss (1)", -- [2]
				"特变电工 斩杀 莱弗提 Crit -1339 (Physical)", -- [3]
				"特变电工 肉搏 莱弗提 Dodge (1)", -- [4]
				"塞尔德林 断筋 特变电工 Hit -38 (Physical)", -- [5]
				"特变电工 治疗药水 特变电工 Hit +1112", -- [6]
				"特变电工 肉搏 塞尔德林 Hit -77 (Physical)", -- [7]
				"特变电工 嗜血 特变电工 Hit +20", -- [8]
				"特变电工 肉搏 塞尔德林 Miss (1)", -- [9]
				"特变电工 肉搏 塞尔德林 Glancing -72 (Physical)", -- [10]
				"特变电工 断筋 塞尔德林 Crit -54 (Physical)", -- [11]
				"特变电工 肉搏 塞尔德林 Crit -339 (Physical)", -- [12]
				"特变电工 肉搏 塞尔德林 Miss (1)", -- [13]
				"特变电工 斩杀 塞尔德林 Hit -408 (Physical)", -- [14]
				"特变电工 肉搏 塞尔德林 Glancing -75 (Physical)", -- [15]
				"特变电工 肉搏 塞尔德林 Hit -186 (Physical)", -- [16]
				"特变电工 重伤 (伤害/跳) 塞尔德林 Tick -52 (Physical)", -- [17]
				"特变电工 肉搏 塞尔德林 Crit -161 (Physical)", -- [18]
				"特变电工 急救 特变电工 Tick +250", -- [19]
				"特变电工 急救 特变电工 Tick +250", -- [20]
				"特变电工 急救 特变电工 Tick +250", -- [21]
				"特变电工 急救 特变电工 Tick +250", -- [22]
				"特变电工 肉搏 莱弗提 Glancing -78 (Physical)", -- [23]
				"特变电工 断筋 莱弗提 Hit -27 (Physical)", -- [24]
				"特变电工 肉搏 莱弗提 Hit -76 (Physical)", -- [25]
				"特变电工 肉搏 莱弗提 Miss (1)", -- [26]
				"特变电工 嘲讽 莱弗提 Immune (Physical)", -- [27]
				"特变电工 肉搏 莱弗提 Crit -134 (Physical)", -- [28]
				"莱弗提 击倒 特变电工 Hit -196 (Physical)", -- [29]
				"莱弗提 肉搏 特变电工 Hit -98 (Physical)", -- [30]
				"莱弗提 肉搏 特变电工 Hit -60 (Physical)", -- [31]
				"莱弗提 肉搏 特变电工 Miss (1)", -- [32]
				"莱弗提 肉搏 特变电工 Hit -50 (Physical)", -- [33]
				"特变电工 肉搏 莱弗提 Glancing -70 (Physical)", -- [34]
				"特变电工 肉搏 莱弗提 Miss (1)", -- [35]
				"特变电工 重伤 (伤害/跳) 莱弗提 Tick -42 (Physical)", -- [36]
				"特变电工 肉搏 莱弗提 Crit -158 (Physical)", -- [37]
				"特变电工 肉搏 莱弗提 Crit -372 (Physical)", -- [38]
				"特变电工 肉搏 莱弗提 Crit -152 (Physical)", -- [39]
				"特变电工 嗜血 莱弗提 Hit -273 (Physical)", -- [40]
				"特变电工 嗜血 特变电工 Hit +20", -- [41]
				"特变电工 肉搏 莱弗提 Crit -397 (Physical)", -- [42]
				"特变电工 嗜血 特变电工 Hit +20", -- [43]
				"特变电工 肉搏 莱弗提 Crit -141 (Physical)", -- [44]
				"特变电工 嗜血 特变电工 Hit +20", -- [45]
				"特变电工 肉搏 莱弗提 Hit -84 (Physical)", -- [46]
				"特变电工 嗜血 特变电工 Hit +20", -- [47]
				"特变电工 肉搏 莱弗提 Hit -196 (Physical)", -- [48]
				"特变电工 嗜血 特变电工 Hit +20", -- [49]
				"特变电工 肉搏 莱弗提 Hit -78 (Physical)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				18914.397, -- [1]
				18914.863, -- [2]
				18914.863, -- [3]
				18914.905, -- [4]
				18879.828, -- [5]
				18882.428, -- [6]
				18887.328, -- [7]
				18887.345, -- [8]
				18887.578, -- [9]
				18889.112, -- [10]
				18889.712, -- [11]
				18890.212, -- [12]
				18890.612, -- [13]
				18891.212, -- [14]
				18891.995, -- [15]
				18892.345, -- [16]
				18893.245, -- [17]
				18894.179, -- [18]
				18897.929, -- [19]
				18898.929, -- [20]
				18899.929, -- [21]
				18900.929, -- [22]
				18901.212, -- [23]
				18901.313, -- [24]
				18902.579, -- [25]
				18902.713, -- [26]
				18903.046, -- [27]
				18904.346, -- [28]
				18904.346, -- [29]
				18904.346, -- [30]
				18905.096, -- [31]
				18905.846, -- [32]
				18906.596, -- [33]
				18906.729, -- [34]
				18906.746, -- [35]
				18907.363, -- [36]
				18908.613, -- [37]
				18908.863, -- [38]
				18909.98, -- [39]
				18910.015, -- [40]
				18910.034, -- [41]
				18911.013, -- [42]
				18911.013, -- [43]
				18911.363, -- [44]
				18911.38, -- [45]
				18912.746, -- [46]
				18912.746, -- [47]
				18913.146, -- [48]
				18913.163, -- [49]
				18914.113, -- [50]
			},
			["Fights"] = {
				["Fight5"] = {
					["FDamagedWho"] = {
					},
					["GTFOEventDamage"] = 2160,
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["玛尔根·长矛"] = {
									["count"] = 24,
								},
								["塞尔德林"] = {
									["count"] = 12,
								},
							},
							["amount"] = 36,
						},
					},
					["GTFOEvents"] = 12,
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 9280,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 15,
								},
								["怒不可遏"] = {
									["count"] = 5,
								},
							},
							["amount"] = 20,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 19,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 25,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 25,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
								["Block"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 15,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 12,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 386,
						["Frost"] = 601,
						["Melee"] = 2564,
						["Fire"] = 5729,
					},
					["DOT_Time"] = 36,
					["Damage"] = 5108,
					["ElementTakenBlock"] = {
						["Melee"] = 51,
					},
					["TimeHeal"] = 11.61,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 135,
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 2109,
						["Physical"] = 2999,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["烈焰风暴"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["烈焰风暴 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 0,
								},
							},
							["count"] = 24,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["塞尔德林"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 168,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 161,
								},
								["肉搏"] = {
									["count"] = 506,
								},
							},
							["amount"] = 835,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 706,
								},
								["嗜血"] = {
									["count"] = 853,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 289,
								},
								["复仇"] = {
									["count"] = 44,
								},
								["肉搏"] = {
									["count"] = 1014,
								},
							},
							["amount"] = 2906,
						},
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 386,
								},
							},
							["amount"] = 386,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 203,
								},
								["顺劈斩"] = {
									["count"] = 235,
								},
							},
							["amount"] = 438,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 543,
								},
							},
							["amount"] = 543,
						},
					},
					["PartialBlock"] = {
						["肉搏"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 51,
									["min"] = 51,
									["count"] = 1,
									["amount"] = 51,
								},
							},
							["count"] = 1,
							["amount"] = 51,
						},
					},
					["WhoDamaged"] = {
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 374,
								},
							},
							["amount"] = 374,
						},
						["碎腭"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 126,
								},
							},
							["amount"] = 126,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["自爆绵羊"] = {
									["count"] = 147,
								},
								["肉搏"] = {
									["count"] = 13,
								},
							},
							["amount"] = 160,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 43,
								},
								["肉搏"] = {
									["count"] = 615,
								},
							},
							["amount"] = 658,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 305,
								},
								["断筋"] = {
									["count"] = 38,
								},
								["肉搏"] = {
									["count"] = 1425,
								},
							},
							["amount"] = 1768,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 284,
								},
								["烈焰风暴"] = {
									["count"] = 804,
								},
								["灼烧"] = {
									["count"] = 999,
								},
								["炎爆术"] = {
									["count"] = 580,
								},
								["冲击波"] = {
									["count"] = 428,
								},
								["烈焰风暴 (伤害/跳)"] = {
									["count"] = 146,
								},
								["炎爆术 (伤害/跳)"] = {
									["count"] = 199,
								},
							},
							["amount"] = 3440,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["地精龙枪"] = {
									["count"] = 982,
								},
								["黑铁炸弹"] = {
									["count"] = 1070,
								},
							},
							["amount"] = 2052,
						},
						["考尔夫"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 601,
								},
								["肉搏"] = {
									["count"] = 101,
								},
							},
							["amount"] = 702,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["地精龙枪"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 48,
									["min"] = 42,
									["count"] = 3,
									["amount"] = 135,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 7,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["烈焰风暴"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["烈焰风暴 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 24,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Melee"] = 86,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 10.11,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 11.61,
						},
					},
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
							},
							["count"] = 1,
							["amount"] = 76,
						},
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 130,
								},
								["神圣力量"] = {
									["count"] = 2,
								},
							},
							["amount"] = 132,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 76,
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 10.11,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 11.61,
						},
						["塞尔德林"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3.3,
								},
								["肉搏"] = {
									["count"] = 3.1,
								},
							},
							["amount"] = 6.4,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 2.78,
								},
								["嗜血"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.12,
								},
								["复仇"] = {
									["count"] = 0.1,
								},
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.009999999999998,
								},
							},
							["amount"] = 26.51,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["考尔夫"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
					},
					["WhoDispelled"] = {
						["牛攵"] = {
							["Details"] = {
								["冰霜震击 (驱散魔法)"] = {
									["count"] = 1,
								},
								["地缚术 (驱散魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["考尔夫"] = {
							["Details"] = {
								["精神祷言 (净化)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (净化)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 10,
									["count"] = 9,
									["amount"] = 130,
								},
							},
							["count"] = 9,
							["amount"] = 130,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2,
									["min"] = 2,
									["count"] = 1,
									["amount"] = 2,
								},
							},
							["count"] = 1,
							["amount"] = 2,
						},
					},
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 2333,
								},
							},
							["amount"] = 2333,
						},
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 130,
								},
								["神圣力量"] = {
									["count"] = 2,
								},
							},
							["amount"] = 132,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 52.02,
					["Healing"] = 132,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["火焰新星"] = {
									["max"] = 374,
									["min"] = 374,
									["count"] = 1,
									["amount"] = 374,
								},
								["地精龙枪"] = {
									["max"] = 163,
									["min"] = 114,
									["count"] = 7,
									["amount"] = 982,
								},
								["+烈焰风暴"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["烈焰风暴"] = {
									["max"] = 405,
									["min"] = 399,
									["count"] = 2,
									["amount"] = 804,
								},
							},
							["count"] = 12,
							["amount"] = 2160,
						},
					},
					["Dispelled"] = 5,
					["Attacks"] = {
						["顺劈斩"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 468,
									["min"] = 468,
									["count"] = 1,
									["amount"] = 468,
								},
								["Hit"] = {
									["max"] = 296,
									["min"] = 168,
									["count"] = 5,
									["amount"] = 1184,
								},
							},
							["count"] = 7,
							["amount"] = 1652,
						},
						["嗜血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 430,
									["min"] = 430,
									["count"] = 1,
									["amount"] = 430,
								},
								["Hit"] = {
									["max"] = 423,
									["min"] = 423,
									["count"] = 1,
									["amount"] = 423,
								},
							},
							["count"] = 2,
							["amount"] = 853,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 41,
									["min"] = 32,
									["count"] = 12,
									["amount"] = 450,
								},
							},
							["count"] = 12,
							["amount"] = 450,
						},
						["复仇"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 1,
							["amount"] = 44,
						},
						["嘲讽"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 203,
									["min"] = 62,
									["count"] = 3,
									["amount"] = 453,
								},
								["Hit"] = {
									["max"] = 283,
									["min"] = 140,
									["count"] = 6,
									["amount"] = 1110,
								},
								["Hit (被格挡)"] = {
									["max"] = 131,
									["min"] = 122,
									["count"] = 2,
									["amount"] = 253,
								},
								["Crit"] = {
									["max"] = 293,
									["min"] = 293,
									["count"] = 1,
									["amount"] = 293,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 2109,
						},
					},
					["HealingTaken"] = 2465,
					["RageGain"] = 20,
					["TimeDamage"] = 40.41,
					["TimeDamaging"] = {
						["塞尔德林"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3.3,
								},
								["肉搏"] = {
									["count"] = 3.1,
								},
							},
							["amount"] = 6.4,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 2.78,
								},
								["嗜血"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.12,
								},
								["复仇"] = {
									["count"] = 0.1,
								},
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.009999999999998,
								},
							},
							["amount"] = 26.51,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["考尔夫"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight2"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["洞穴爬行者"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1940,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 9,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 14,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 20,
								},
							},
							["amount"] = 33,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 27,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 0,
						["Melee"] = 1940,
						["Nature"] = 0,
					},
					["DOT_Time"] = 30,
					["Damage"] = 10570,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 14.04,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 5186,
						["Physical"] = 5384,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 116,
								},
								["嗜血"] = {
									["count"] = 1673,
								},
								["旋风斩"] = {
									["count"] = 2059,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 559,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 85,
								},
								["斩杀"] = {
									["count"] = 892,
								},
								["肉搏"] = {
									["count"] = 5186,
								},
							},
							["amount"] = 10570,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["毒云术 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1940,
								},
							},
							["amount"] = 1940,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 9.54,
								},
								["神圣力量"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 14.04,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 280,
								},
								["神圣力量"] = {
									["count"] = 311,
								},
							},
							["amount"] = 591,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 9.54,
								},
								["神圣力量"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 14.04,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.55,
								},
								["嗜血"] = {
									["count"] = 0.45,
								},
								["旋风斩"] = {
									["count"] = 0.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.18,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 1.28,
								},
								["肉搏"] = {
									["count"] = 23.59000000000001,
								},
							},
							["amount"] = 35.52,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 14,
									["amount"] = 280,
								},
							},
							["count"] = 14,
							["amount"] = 280,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 120,
									["min"] = 78,
									["count"] = 3,
									["amount"] = 311,
								},
							},
							["count"] = 3,
							["amount"] = 311,
						},
					},
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1145,
								},
							},
							["amount"] = 1145,
						},
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 280,
								},
								["神圣力量"] = {
									["count"] = 311,
								},
							},
							["amount"] = 591,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 49.56000000000003,
					["Healing"] = 591,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 4,
									["amount"] = 116,
								},
							},
							["count"] = 4,
							["amount"] = 116,
						},
						["嗜血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 969,
									["min"] = 969,
									["count"] = 1,
									["amount"] = 969,
								},
								["Hit"] = {
									["max"] = 380,
									["min"] = 324,
									["count"] = 2,
									["amount"] = 704,
								},
							},
							["count"] = 3,
							["amount"] = 1673,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 532,
									["min"] = 518,
									["count"] = 2,
									["amount"] = 1050,
								},
								["Hit"] = {
									["max"] = 226,
									["min"] = 176,
									["count"] = 5,
									["amount"] = 1009,
								},
							},
							["count"] = 7,
							["amount"] = 2059,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 63,
									["min"] = 51,
									["count"] = 10,
									["amount"] = 559,
								},
							},
							["count"] = 10,
							["amount"] = 559,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 85,
									["min"] = 85,
									["count"] = 1,
									["amount"] = 85,
								},
							},
							["count"] = 1,
							["amount"] = 85,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 477,
									["min"] = 415,
									["count"] = 2,
									["amount"] = 892,
								},
							},
							["count"] = 2,
							["amount"] = 892,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 511,
									["min"] = 164,
									["count"] = 8,
									["amount"] = 2119,
								},
								["Hit"] = {
									["max"] = 292,
									["min"] = 77,
									["count"] = 20,
									["amount"] = 3067,
								},
							},
							["count"] = 33,
							["amount"] = 5186,
						},
					},
					["HealingTaken"] = 1736,
					["RageGain"] = 24,
					["TimeDamage"] = 35.52,
					["TimeDamaging"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.55,
								},
								["嗜血"] = {
									["count"] = 0.45,
								},
								["旋风斩"] = {
									["count"] = 0.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.18,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 1.28,
								},
								["肉搏"] = {
									["count"] = 23.59000000000001,
								},
							},
							["amount"] = 35.52,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Dispelled"] = 0,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 0,
								},
								["冲锋"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 0,
								},
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 0,
						["Melee"] = 0,
						["Nature"] = 0,
					},
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Damage"] = 0,
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeHeal"] = 0,
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DOT_Time"] = 0,
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["洞穴雷霆蜥蜴"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Healing"] = 0,
					["WhoDispelled"] = {
						["牛攵"] = {
							["Details"] = {
								["雷霆一击 (驱散魔法)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 0,
								},
								["嗜血"] = {
									["count"] = 0,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
								["旋风斩"] = {
									["count"] = 0,
								},
								["斩杀"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["顺劈斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["RageGain"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Miss"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["WhoDamaged"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["蜥蜴之矢"] = {
									["count"] = 0,
								},
								["雷霆一击"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["TimeSpent"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 0,
								},
								["嗜血"] = {
									["count"] = 0,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
								["旋风斩"] = {
									["count"] = 0,
								},
								["斩杀"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 0,
								},
								["嗜血"] = {
									["count"] = 0,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
								["旋风斩"] = {
									["count"] = 0,
								},
								["斩杀"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["Fight3"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 464,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 4,
								},
								["血性狂暴"] = {
									["count"] = 20,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Nature"] = 464,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1391,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 795,
						["Physical"] = 596,
					},
					["PartialAbsorb"] = {
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 57,
								},
								["斩杀"] = {
									["count"] = 539,
								},
								["肉搏"] = {
									["count"] = 795,
								},
							},
							["amount"] = 1391,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["毒云术 (伤害/跳)"] = {
									["count"] = 210,
								},
								["闪电之盾"] = {
									["count"] = 254,
								},
							},
							["amount"] = 464,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.25,
								},
								["斩杀"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 7.200000000000001,
								},
							},
							["amount"] = 7.670000000000001,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.670000000000001,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 29,
									["min"] = 28,
									["count"] = 2,
									["amount"] = 57,
								},
							},
							["count"] = 2,
							["amount"] = 57,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 539,
									["min"] = 539,
									["count"] = 1,
									["amount"] = 539,
								},
							},
							["count"] = 1,
							["amount"] = 539,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 139,
									["min"] = 123,
									["count"] = 2,
									["amount"] = 262,
								},
								["Hit"] = {
									["max"] = 187,
									["min"] = 61,
									["count"] = 5,
									["amount"] = 533,
								},
							},
							["count"] = 8,
							["amount"] = 795,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 24,
					["TimeDamage"] = 7.670000000000001,
					["TimeDamaging"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.25,
								},
								["斩杀"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 7.200000000000001,
								},
							},
							["amount"] = 7.670000000000001,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight4"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 254,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 1,
								},
								["血性狂暴"] = {
									["count"] = 20,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Nature"] = 254,
					},
					["DOT_Time"] = 0,
					["Damage"] = 586,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 558,
						["Physical"] = 28,
					},
					["PartialAbsorb"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 28,
								},
								["肉搏"] = {
									["count"] = 558,
								},
							},
							["amount"] = 586,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 254,
								},
							},
							["amount"] = 254,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["征服者派隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.43,
								},
								["肉搏"] = {
									["count"] = 4.6,
								},
							},
							["amount"] = 5.03,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6.53,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 183,
									["min"] = 68,
									["count"] = 3,
									["amount"] = 425,
								},
								["Crit"] = {
									["max"] = 133,
									["min"] = 133,
									["count"] = 1,
									["amount"] = 133,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 558,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 21,
					["TimeDamage"] = 6.53,
					["TimeDamaging"] = {
						["征服者派隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.43,
								},
								["肉搏"] = {
									["count"] = 4.6,
								},
							},
							["amount"] = 5.03,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["FDamagedWho"] = {
					},
					["GTFOEventDamage"] = 2664,
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 12,
								},
								["莱弗提"] = {
									["count"] = 6,
								},
								["塞尔德林"] = {
									["count"] = 3,
								},
								["雷兹尼克"] = {
									["count"] = 12,
								},
								["沃莉达"] = {
									["count"] = 3,
								},
							},
							["amount"] = 36,
						},
					},
					["GTFOEvents"] = 22,
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 10756,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 15,
								},
								["怒不可遏"] = {
									["count"] = 18,
								},
								["血性狂暴"] = {
									["count"] = 20,
								},
							},
							["amount"] = 53,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 26,
								},
								["Miss"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 42,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 17,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 12,
					["ElementHitsDone"] = {
						{
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						}, -- [1]
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 8,
								},
								["Miss"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 25,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 19,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 64,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 34,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 468,
						["Frost"] = 241,
					},
					["ElementTaken"] = {
						["Physical"] = 907,
						["Melee"] = 4864,
						["Fire"] = 1445,
						["Shadow"] = 698,
						["Frost"] = 2842,
					},
					["DOT_Time"] = 36,
					["Damage"] = 19303,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 37.73,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Frost"] = 37,
					},
					["ElementDoneAbsorb"] = {
						221, -- [1]
						["Physical"] = 65,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						221, -- [1]
						["Melee"] = 10141,
						["Physical"] = 8941,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 241,
									["min"] = 241,
									["count"] = 1,
									["amount"] = 241,
								},
							},
							["count"] = 1,
							["amount"] = 241,
						},
						["击倒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 39,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 232,
									["min"] = 111,
									["count"] = 3,
									["amount"] = 468,
								},
							},
							["count"] = 42,
							["amount"] = 468,
						},
					},
					["DamagedWho"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 477,
								},
								["旋风斩"] = {
									["count"] = 294,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 221,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 190,
								},
								["肉搏"] = {
									["count"] = 1180,
								},
							},
							["amount"] = 2362,
						},
						["莱弗提"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 273,
								},
								["旋风斩"] = {
									["count"] = 235,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 84,
								},
								["断筋"] = {
									["count"] = 27,
								},
								["斩杀"] = {
									["count"] = 1339,
								},
								["肉搏"] = {
									["count"] = 1936,
								},
							},
							["amount"] = 3894,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 326,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 52,
								},
								["断筋"] = {
									["count"] = 54,
								},
								["斩杀"] = {
									["count"] = 408,
								},
								["肉搏"] = {
									["count"] = 1370,
								},
							},
							["amount"] = 2210,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 655,
								},
							},
							["amount"] = 655,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 270,
								},
							},
							["amount"] = 270,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 320,
								},
								["嗜血"] = {
									["count"] = 333,
								},
								["旋风斩"] = {
									["count"] = 511,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 178,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["斩杀"] = {
									["count"] = 843,
								},
								["肉搏"] = {
									["count"] = 1819,
								},
							},
							["amount"] = 4046,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 992,
								},
								["旋风斩"] = {
									["count"] = 268,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 44,
								},
								["斩杀"] = {
									["count"] = 1651,
								},
								["肉搏"] = {
									["count"] = 2911,
								},
							},
							["amount"] = 5866,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 698,
								},
								["肉搏"] = {
									["count"] = 509,
								},
							},
							["amount"] = 1207,
						},
						["莱弗提"] = {
							["Details"] = {
								["击倒"] = {
									["count"] = 196,
								},
								["蹬踏"] = {
									["count"] = 63,
								},
								["肉搏"] = {
									["count"] = 1614,
								},
							},
							["amount"] = 1873,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 549,
								},
								["断筋"] = {
									["count"] = 99,
								},
								["肉搏"] = {
									["count"] = 2049,
								},
							},
							["amount"] = 2697,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 88,
								},
							},
							["amount"] = 88,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["自爆绵羊"] = {
									["count"] = 313,
								},
							},
							["amount"] = 313,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["地精龙枪"] = {
									["count"] = 1132,
								},
								["肉搏"] = {
									["count"] = 479,
								},
							},
							["amount"] = 1611,
						},
						["沃莉达"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1599,
								},
								["冰霜新星"] = {
									["count"] = 241,
								},
								["寒冰箭"] = {
									["count"] = 583,
								},
								["冰锥术"] = {
									["count"] = 419,
								},
								["肉搏"] = {
									["count"] = 125,
								},
							},
							["amount"] = 2967,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["击倒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 37,
									["min"] = 37,
									["count"] = 1,
									["amount"] = 37,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 37,
							["amount"] = 13,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 42,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Melee"] = 43,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 0.58,
								},
								["嗜血"] = {
									["count"] = 31.15000000000001,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 37.73,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1000,
								},
								["神圣力量"] = {
									["count"] = 83,
								},
								["嗜血"] = {
									["count"] = 610,
								},
								["治疗药水"] = {
									["count"] = 1112,
								},
							},
							["amount"] = 2805,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["莱弗提"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["嗜血"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.47,
								},
								["肉搏"] = {
									["count"] = 12.48,
								},
							},
							["amount"] = 14.31,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.8999999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.1,
								},
								["破甲攻击"] = {
									["count"] = 0.35,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 5.960000000000001,
								},
							},
							["amount"] = 12.43,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.4,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["断筋"] = {
									["count"] = 0.6,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 9.999999999999998,
								},
							},
							["amount"] = 12.25,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 0.58,
								},
								["嗜血"] = {
									["count"] = 31.15000000000001,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 37.73,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.85,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 1.2,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 6.21,
								},
							},
							["amount"] = 12.42,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.6900000000000001,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 11.43,
								},
							},
							["amount"] = 15.32,
						},
					},
					["WhoDispelled"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["真言术：盾 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护暗影 (驱散魔法)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
								["精神祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1000,
								},
							},
							["count"] = 4,
							["amount"] = 1000,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 10,
									["count"] = 33,
									["amount"] = 610,
								},
							},
							["count"] = 33,
							["amount"] = 610,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1112,
									["min"] = 1112,
									["count"] = 1,
									["amount"] = 1112,
								},
							},
							["count"] = 1,
							["amount"] = 1112,
						},
					},
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 5852,
								},
								["真言术：盾"] = {
									["count"] = 709,
								},
							},
							["amount"] = 6561,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1000,
								},
								["神圣力量"] = {
									["count"] = 83,
								},
								["嗜血"] = {
									["count"] = 610,
								},
								["治疗药水"] = {
									["count"] = 1112,
								},
							},
							["amount"] = 2805,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 106.8,
					["Healing"] = 2805,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["地精龙枪"] = {
									["max"] = 173,
									["min"] = 145,
									["count"] = 7,
									["amount"] = 1132,
								},
								["+暴风雪"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
								["暴风雪"] = {
									["max"] = 149,
									["min"] = 101,
									["count"] = 11,
									["amount"] = 1532,
								},
							},
							["count"] = 22,
							["amount"] = 2664,
						},
					},
					["Dispelled"] = 4,
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 477,
									["min"] = 273,
									["count"] = 7,
									["amount"] = 2401,
								},
							},
							["count"] = 8,
							["amount"] = 2401,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 65,
									["min"] = 65,
									["count"] = 1,
									["amount"] = 65,
								},
								["Tick"] = {
									["max"] = 80,
									["min"] = 30,
									["count"] = 11,
									["amount"] = 625,
								},
							},
							["count"] = 12,
							["amount"] = 690,
						},
						["破甲攻击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
								["Absorb"] = {
									["max"] = 221,
									["min"] = 221,
									["count"] = 1,
									["amount"] = 221,
								},
							},
							["count"] = 2,
							["amount"] = 399,
						},
						["嘲讽"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 511,
									["min"] = 511,
									["count"] = 1,
									["amount"] = 511,
								},
								["Hit"] = {
									["max"] = 294,
									["min"] = 235,
									["count"] = 3,
									["amount"] = 797,
								},
							},
							["count"] = 4,
							["amount"] = 1308,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 54,
									["min"] = 54,
									["count"] = 1,
									["amount"] = 54,
								},
								["Hit"] = {
									["max"] = 27,
									["min"] = 27,
									["count"] = 1,
									["amount"] = 27,
								},
							},
							["count"] = 2,
							["amount"] = 81,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 1,
							["amount"] = 42,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1651,
									["min"] = 1339,
									["count"] = 2,
									["amount"] = 2990,
								},
								["Hit"] = {
									["max"] = 843,
									["min"] = 408,
									["count"] = 2,
									["amount"] = 1251,
								},
							},
							["count"] = 4,
							["amount"] = 4241,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 263,
									["min"] = 70,
									["count"] = 8,
									["amount"] = 911,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 288,
									["min"] = 76,
									["count"] = 24,
									["amount"] = 3458,
								},
								["Miss"] = {
									["count"] = 8,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 655,
									["min"] = 134,
									["count"] = 19,
									["amount"] = 5692,
								},
								["Hit (被格挡)"] = {
									["max"] = 80,
									["min"] = 80,
									["count"] = 1,
									["amount"] = 80,
								},
							},
							["count"] = 63,
							["amount"] = 10141,
						},
					},
					["HealingTaken"] = 9366,
					["RageGain"] = 53,
					["TimeDamage"] = 69.07000000000001,
					["TimeDamaging"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.8999999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.1,
								},
								["破甲攻击"] = {
									["count"] = 0.35,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 5.960000000000001,
								},
							},
							["amount"] = 12.43,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.4,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["断筋"] = {
									["count"] = 0.6,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 9.999999999999998,
								},
							},
							["amount"] = 12.25,
						},
						["莱弗提"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["嗜血"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.47,
								},
								["肉搏"] = {
									["count"] = 12.48,
								},
							},
							["amount"] = 14.31,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.85,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 1.2,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 6.21,
								},
							},
							["amount"] = 12.42,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.6900000000000001,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 11.43,
								},
							},
							["amount"] = 15.32,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["FDamagedWho"] = {
					},
					["GTFOEventDamage"] = 2664,
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 12,
								},
								["莱弗提"] = {
									["count"] = 6,
								},
								["塞尔德林"] = {
									["count"] = 3,
								},
								["雷兹尼克"] = {
									["count"] = 12,
								},
								["沃莉达"] = {
									["count"] = 3,
								},
							},
							["amount"] = 36,
						},
					},
					["GTFOEvents"] = 22,
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 10756,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 15,
								},
								["怒不可遏"] = {
									["count"] = 18,
								},
								["血性狂暴"] = {
									["count"] = 20,
								},
							},
							["amount"] = 53,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 26,
								},
								["Miss"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 42,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 17,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 12,
					["ElementHitsDone"] = {
						{
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						}, -- [1]
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 8,
								},
								["Miss"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 25,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 19,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 64,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 34,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 468,
						["Frost"] = 241,
					},
					["ElementTaken"] = {
						["Physical"] = 907,
						["Melee"] = 4864,
						["Fire"] = 1445,
						["Shadow"] = 698,
						["Frost"] = 2842,
					},
					["DOT_Time"] = 36,
					["Damage"] = 19303,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 37.73,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Frost"] = 37,
					},
					["ElementDoneAbsorb"] = {
						221, -- [1]
						["Physical"] = 65,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						221, -- [1]
						["Melee"] = 10141,
						["Physical"] = 8941,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 241,
									["min"] = 241,
									["count"] = 1,
									["amount"] = 241,
								},
							},
							["count"] = 1,
							["amount"] = 241,
						},
						["击倒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 39,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 232,
									["min"] = 111,
									["count"] = 3,
									["amount"] = 468,
								},
							},
							["count"] = 42,
							["amount"] = 468,
						},
					},
					["DamagedWho"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 477,
								},
								["旋风斩"] = {
									["count"] = 294,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 221,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 190,
								},
								["肉搏"] = {
									["count"] = 1180,
								},
							},
							["amount"] = 2362,
						},
						["莱弗提"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 273,
								},
								["旋风斩"] = {
									["count"] = 235,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 84,
								},
								["断筋"] = {
									["count"] = 27,
								},
								["斩杀"] = {
									["count"] = 1339,
								},
								["肉搏"] = {
									["count"] = 1936,
								},
							},
							["amount"] = 3894,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 326,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 52,
								},
								["断筋"] = {
									["count"] = 54,
								},
								["斩杀"] = {
									["count"] = 408,
								},
								["肉搏"] = {
									["count"] = 1370,
								},
							},
							["amount"] = 2210,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 655,
								},
							},
							["amount"] = 655,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 270,
								},
							},
							["amount"] = 270,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 320,
								},
								["嗜血"] = {
									["count"] = 333,
								},
								["旋风斩"] = {
									["count"] = 511,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 178,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["斩杀"] = {
									["count"] = 843,
								},
								["肉搏"] = {
									["count"] = 1819,
								},
							},
							["amount"] = 4046,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 992,
								},
								["旋风斩"] = {
									["count"] = 268,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 44,
								},
								["斩杀"] = {
									["count"] = 1651,
								},
								["肉搏"] = {
									["count"] = 2911,
								},
							},
							["amount"] = 5866,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 698,
								},
								["肉搏"] = {
									["count"] = 509,
								},
							},
							["amount"] = 1207,
						},
						["莱弗提"] = {
							["Details"] = {
								["击倒"] = {
									["count"] = 196,
								},
								["蹬踏"] = {
									["count"] = 63,
								},
								["肉搏"] = {
									["count"] = 1614,
								},
							},
							["amount"] = 1873,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 549,
								},
								["断筋"] = {
									["count"] = 99,
								},
								["肉搏"] = {
									["count"] = 2049,
								},
							},
							["amount"] = 2697,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 88,
								},
							},
							["amount"] = 88,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["自爆绵羊"] = {
									["count"] = 313,
								},
							},
							["amount"] = 313,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["地精龙枪"] = {
									["count"] = 1132,
								},
								["肉搏"] = {
									["count"] = 479,
								},
							},
							["amount"] = 1611,
						},
						["沃莉达"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1599,
								},
								["冰霜新星"] = {
									["count"] = 241,
								},
								["寒冰箭"] = {
									["count"] = 583,
								},
								["冰锥术"] = {
									["count"] = 419,
								},
								["肉搏"] = {
									["count"] = 125,
								},
							},
							["amount"] = 2967,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["击倒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 37,
									["min"] = 37,
									["count"] = 1,
									["amount"] = 37,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 37,
							["amount"] = 13,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 42,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Melee"] = 43,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 0.58,
								},
								["嗜血"] = {
									["count"] = 31.15000000000001,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 37.73,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1000,
								},
								["神圣力量"] = {
									["count"] = 83,
								},
								["嗜血"] = {
									["count"] = 610,
								},
								["治疗药水"] = {
									["count"] = 1112,
								},
							},
							["amount"] = 2805,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["莱弗提"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["嗜血"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.47,
								},
								["肉搏"] = {
									["count"] = 12.48,
								},
							},
							["amount"] = 14.31,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.8999999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.1,
								},
								["破甲攻击"] = {
									["count"] = 0.35,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 5.960000000000001,
								},
							},
							["amount"] = 12.43,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.4,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["断筋"] = {
									["count"] = 0.6,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 9.999999999999998,
								},
							},
							["amount"] = 12.25,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 0.58,
								},
								["嗜血"] = {
									["count"] = 31.15000000000001,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 37.73,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.85,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 1.2,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 6.21,
								},
							},
							["amount"] = 12.42,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.6900000000000001,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 11.43,
								},
							},
							["amount"] = 15.32,
						},
					},
					["WhoDispelled"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["真言术：盾 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护暗影 (驱散魔法)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
								["精神祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1000,
								},
							},
							["count"] = 4,
							["amount"] = 1000,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 10,
									["count"] = 33,
									["amount"] = 610,
								},
							},
							["count"] = 33,
							["amount"] = 610,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1112,
									["min"] = 1112,
									["count"] = 1,
									["amount"] = 1112,
								},
							},
							["count"] = 1,
							["amount"] = 1112,
						},
					},
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 5852,
								},
								["真言术：盾"] = {
									["count"] = 709,
								},
							},
							["amount"] = 6561,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1000,
								},
								["神圣力量"] = {
									["count"] = 83,
								},
								["嗜血"] = {
									["count"] = 610,
								},
								["治疗药水"] = {
									["count"] = 1112,
								},
							},
							["amount"] = 2805,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 106.8,
					["Healing"] = 2805,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["地精龙枪"] = {
									["max"] = 173,
									["min"] = 145,
									["count"] = 7,
									["amount"] = 1132,
								},
								["+暴风雪"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
								["暴风雪"] = {
									["max"] = 149,
									["min"] = 101,
									["count"] = 11,
									["amount"] = 1532,
								},
							},
							["count"] = 22,
							["amount"] = 2664,
						},
					},
					["Dispelled"] = 4,
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 477,
									["min"] = 273,
									["count"] = 7,
									["amount"] = 2401,
								},
							},
							["count"] = 8,
							["amount"] = 2401,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 65,
									["min"] = 65,
									["count"] = 1,
									["amount"] = 65,
								},
								["Tick"] = {
									["max"] = 80,
									["min"] = 30,
									["count"] = 11,
									["amount"] = 625,
								},
							},
							["count"] = 12,
							["amount"] = 690,
						},
						["破甲攻击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
								["Absorb"] = {
									["max"] = 221,
									["min"] = 221,
									["count"] = 1,
									["amount"] = 221,
								},
							},
							["count"] = 2,
							["amount"] = 399,
						},
						["嘲讽"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 511,
									["min"] = 511,
									["count"] = 1,
									["amount"] = 511,
								},
								["Hit"] = {
									["max"] = 294,
									["min"] = 235,
									["count"] = 3,
									["amount"] = 797,
								},
							},
							["count"] = 4,
							["amount"] = 1308,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 54,
									["min"] = 54,
									["count"] = 1,
									["amount"] = 54,
								},
								["Hit"] = {
									["max"] = 27,
									["min"] = 27,
									["count"] = 1,
									["amount"] = 27,
								},
							},
							["count"] = 2,
							["amount"] = 81,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 1,
							["amount"] = 42,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1651,
									["min"] = 1339,
									["count"] = 2,
									["amount"] = 2990,
								},
								["Hit"] = {
									["max"] = 843,
									["min"] = 408,
									["count"] = 2,
									["amount"] = 1251,
								},
							},
							["count"] = 4,
							["amount"] = 4241,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 263,
									["min"] = 70,
									["count"] = 8,
									["amount"] = 911,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 288,
									["min"] = 76,
									["count"] = 24,
									["amount"] = 3458,
								},
								["Miss"] = {
									["count"] = 8,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 655,
									["min"] = 134,
									["count"] = 19,
									["amount"] = 5692,
								},
								["Hit (被格挡)"] = {
									["max"] = 80,
									["min"] = 80,
									["count"] = 1,
									["amount"] = 80,
								},
							},
							["count"] = 63,
							["amount"] = 10141,
						},
					},
					["HealingTaken"] = 9366,
					["RageGain"] = 53,
					["TimeDamage"] = 69.07000000000001,
					["TimeDamaging"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.8999999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.1,
								},
								["破甲攻击"] = {
									["count"] = 0.35,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 5.960000000000001,
								},
							},
							["amount"] = 12.43,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.4,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["断筋"] = {
									["count"] = 0.6,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 9.999999999999998,
								},
							},
							["amount"] = 12.25,
						},
						["莱弗提"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["嗜血"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.47,
								},
								["肉搏"] = {
									["count"] = 12.48,
								},
							},
							["amount"] = 14.31,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.85,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 1.2,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 6.21,
								},
							},
							["amount"] = 12.42,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.6900000000000001,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 11.43,
								},
							},
							["amount"] = 15.32,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["玛尔根·长矛"] = {
									["count"] = 24,
								},
								["瓦亚辛"] = {
									["count"] = 12,
								},
								["莱弗提"] = {
									["count"] = 6,
								},
								["塞尔德林"] = {
									["count"] = 15,
								},
								["洞穴雷霆蜥蜴"] = {
									["count"] = 24,
								},
								["洞穴爬行者"] = {
									["count"] = 30,
								},
								["雷兹尼克"] = {
									["count"] = 12,
								},
								["沃莉达"] = {
									["count"] = 3,
								},
							},
							["amount"] = 126,
						},
					},
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 6.58,
								},
								["嗜血"] = {
									["count"] = 60.08000000000001,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 72.66000000000003,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.4,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 2.78,
								},
								["嗜血"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.12,
								},
								["复仇"] = {
									["count"] = 0.1,
								},
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.009999999999998,
								},
							},
							["amount"] = 26.51,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.55,
								},
								["嗜血"] = {
									["count"] = 0.45,
								},
								["旋风斩"] = {
									["count"] = 0.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.18,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 1.28,
								},
								["肉搏"] = {
									["count"] = 23.59000000000001,
								},
							},
							["amount"] = 35.52,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.68,
								},
								["斩杀"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 11.8,
								},
							},
							["amount"] = 12.7,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.6900000000000001,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 11.43,
								},
							},
							["amount"] = 15.32,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.8999999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.1,
								},
								["破甲攻击"] = {
									["count"] = 0.35,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 5.960000000000001,
								},
							},
							["amount"] = 12.43,
						},
						["莱弗提"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["嗜血"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.47,
								},
								["肉搏"] = {
									["count"] = 12.48,
								},
							},
							["amount"] = 14.31,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.2,
								},
								["断筋"] = {
									["count"] = 0.6,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 13.1,
								},
							},
							["amount"] = 18.65,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 1.65,
								},
								["嗜血"] = {
									["count"] = 1.05,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.98,
								},
								["旋风斩"] = {
									["count"] = 0.35,
								},
								["斩杀"] = {
									["count"] = 0.3,
								},
								["肉搏"] = {
									["count"] = 22.97,
								},
							},
							["amount"] = 31.3,
						},
						["征服者派隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.85,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 1.2,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 7.71,
								},
							},
							["amount"] = 13.92,
						},
						["考尔夫"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1000,
								},
								["神圣力量"] = {
									["count"] = 396,
								},
								["嗜血"] = {
									["count"] = 1220,
								},
								["治疗药水"] = {
									["count"] = 1112,
								},
							},
							["amount"] = 3728,
						},
					},
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 60,
								},
								["怒不可遏"] = {
									["count"] = 51,
								},
								["冲锋"] = {
									["count"] = 60,
								},
							},
							["amount"] = 171,
						},
					},
					["DeathCount"] = 1,
					["Overhealing"] = 76,
					["ElementTaken"] = {
						["Physical"] = 1877,
						["Melee"] = 10658,
						["Shadow"] = 698,
						["Fire"] = 7174,
						["Frost"] = 3443,
						["Nature"] = 1779,
					},
					["DOT_Time"] = 126,
					["Damage"] = 46842,
					["TimeHeal"] = 72.66000000000003,
					["ElementDone"] = {
						221, -- [1]
						["Melee"] = 23639,
						["Physical"] = 22982,
					},
					["ElementHitsDone"] = {
						{
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						}, -- [1]
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 11,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 19,
								},
								["Hit"] = {
									["count"] = 81,
								},
								["Block"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 37,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 156,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 51,
								},
								["Tick"] = {
									["count"] = 41,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 12,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 111,
						},
					},
					["WhoDamaged"] = {
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 88,
								},
							},
							["amount"] = 88,
						},
						["碎腭"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 126,
								},
							},
							["amount"] = 126,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["自爆绵羊"] = {
									["count"] = 460,
								},
								["肉搏"] = {
									["count"] = 13,
								},
							},
							["amount"] = 473,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 43,
								},
								["肉搏"] = {
									["count"] = 615,
								},
							},
							["amount"] = 658,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 374,
								},
							},
							["amount"] = 374,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["毒云术 (伤害/跳)"] = {
									["count"] = 460,
								},
								["闪电之盾"] = {
									["count"] = 508,
								},
							},
							["amount"] = 968,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1940,
								},
							},
							["amount"] = 1940,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 284,
								},
								["烈焰风暴"] = {
									["count"] = 804,
								},
								["灼烧"] = {
									["count"] = 999,
								},
								["炎爆术"] = {
									["count"] = 580,
								},
								["冲击波"] = {
									["count"] = 428,
								},
								["烈焰风暴 (伤害/跳)"] = {
									["count"] = 146,
								},
								["炎爆术 (伤害/跳)"] = {
									["count"] = 199,
								},
							},
							["amount"] = 3440,
						},
						["沃莉达"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1599,
								},
								["冰霜新星"] = {
									["count"] = 241,
								},
								["寒冰箭"] = {
									["count"] = 583,
								},
								["冰锥术"] = {
									["count"] = 419,
								},
								["肉搏"] = {
									["count"] = 125,
								},
							},
							["amount"] = 2967,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 698,
								},
								["肉搏"] = {
									["count"] = 509,
								},
							},
							["amount"] = 1207,
						},
						["莱弗提"] = {
							["Details"] = {
								["击倒"] = {
									["count"] = 196,
								},
								["蹬踏"] = {
									["count"] = 63,
								},
								["肉搏"] = {
									["count"] = 1614,
								},
							},
							["amount"] = 1873,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 854,
								},
								["断筋"] = {
									["count"] = 137,
								},
								["肉搏"] = {
									["count"] = 3474,
								},
							},
							["amount"] = 4465,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["蜥蜴之矢"] = {
									["count"] = 510,
								},
								["雷霆一击"] = {
									["count"] = 301,
								},
								["肉搏"] = {
									["count"] = 1290,
								},
							},
							["amount"] = 2101,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 584,
								},
							},
							["amount"] = 584,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["黑铁炸弹"] = {
									["count"] = 1070,
								},
								["地精龙枪"] = {
									["count"] = 2114,
								},
								["肉搏"] = {
									["count"] = 479,
								},
							},
							["amount"] = 3663,
						},
						["考尔夫"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 601,
								},
								["肉搏"] = {
									["count"] = 101,
								},
							},
							["amount"] = 702,
						},
					},
					["ElementDoneBlock"] = {
						["Melee"] = 129,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 6.58,
								},
								["嗜血"] = {
									["count"] = 60.08000000000001,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 72.66000000000003,
						},
					},
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
							},
							["count"] = 1,
							["amount"] = 76,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["HOT_Time"] = 12,
					["ElementDoneAbsorb"] = {
						221, -- [1]
						["Physical"] = 65,
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["地精龙枪"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 48,
									["min"] = 42,
									["count"] = 3,
									["amount"] = 135,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 135,
							["amount"] = 14,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["烈焰风暴"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["击倒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 37,
									["min"] = 37,
									["count"] = 1,
									["amount"] = 37,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 37,
							["amount"] = 13,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["烈焰风暴 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 88,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 88,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 468,
						["Frost"] = 241,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["烈焰风暴"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["击倒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 241,
									["min"] = 241,
									["count"] = 1,
									["amount"] = 241,
								},
							},
							["count"] = 1,
							["amount"] = 241,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["烈焰风暴 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 232,
									["min"] = 111,
									["count"] = 3,
									["amount"] = 468,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 85,
									["amount"] = 0,
								},
							},
							["count"] = 88,
							["amount"] = 468,
						},
					},
					["ActiveTime"] = 263.1600000000002,
					["PartialBlock"] = {
						["肉搏"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 51,
									["min"] = 51,
									["count"] = 1,
									["amount"] = 51,
								},
							},
							["count"] = 1,
							["amount"] = 51,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 51,
					},
					["ElementTakenResist"] = {
						["Frost"] = 37,
						["Fire"] = 135,
					},
					["WhoDispelled"] = {
						["牛攵"] = {
							["Details"] = {
								["雷霆一击 (驱散魔法)"] = {
									["count"] = 2,
								},
								["冰霜震击 (驱散魔法)"] = {
									["count"] = 1,
								},
								["地缚术 (驱散魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["真言术：盾 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护暗影 (驱散魔法)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
								["精神祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["考尔夫"] = {
							["Details"] = {
								["精神祷言 (净化)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (净化)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 15,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 62,
								},
								["Dodge"] = {
									["count"] = 6,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 3,
								},
							},
							["amount"] = 89,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 28,
								},
							},
							["amount"] = 35,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 13,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 19,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 11,
								},
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 30,
						},
					},
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1000,
								},
							},
							["count"] = 4,
							["amount"] = 1000,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 120,
									["min"] = 2,
									["count"] = 5,
									["amount"] = 396,
								},
							},
							["count"] = 5,
							["amount"] = 396,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 10,
									["count"] = 66,
									["amount"] = 1220,
								},
							},
							["count"] = 66,
							["amount"] = 1220,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1112,
									["min"] = 1112,
									["count"] = 1,
									["amount"] = 1112,
								},
							},
							["count"] = 1,
							["amount"] = 1112,
						},
					},
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 379,
								},
								["真言术：盾"] = {
									["count"] = 709,
								},
								["快速治疗"] = {
									["count"] = 2208,
								},
								["强效治疗术"] = {
									["count"] = 8185,
								},
							},
							["amount"] = 11481,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1000,
								},
								["神圣力量"] = {
									["count"] = 396,
								},
								["嗜血"] = {
									["count"] = 1220,
								},
								["治疗药水"] = {
									["count"] = 1112,
								},
							},
							["amount"] = 3728,
						},
					},
					["GTFOEvents"] = 34,
					["Dispelled"] = 11,
					["Healing"] = 3728,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["烈焰风暴"] = {
									["max"] = 405,
									["min"] = 399,
									["count"] = 2,
									["amount"] = 804,
								},
								["+烈焰风暴"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["火焰新星"] = {
									["max"] = 374,
									["min"] = 374,
									["count"] = 1,
									["amount"] = 374,
								},
								["+暴风雪"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
								["地精龙枪"] = {
									["max"] = 173,
									["min"] = 114,
									["count"] = 14,
									["amount"] = 2114,
								},
								["暴风雪"] = {
									["max"] = 149,
									["min"] = 101,
									["count"] = 11,
									["amount"] = 1532,
								},
							},
							["count"] = 34,
							["amount"] = 4824,
						},
					},
					["DamageTaken"] = 25629,
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 969,
									["min"] = 430,
									["count"] = 3,
									["amount"] = 2109,
								},
								["Hit"] = {
									["max"] = 477,
									["min"] = 273,
									["count"] = 11,
									["amount"] = 3854,
								},
							},
							["count"] = 15,
							["amount"] = 5963,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 65,
									["min"] = 65,
									["count"] = 1,
									["amount"] = 65,
								},
								["Tick"] = {
									["max"] = 80,
									["min"] = 30,
									["count"] = 41,
									["amount"] = 2044,
								},
							},
							["count"] = 42,
							["amount"] = 2109,
						},
						["破甲攻击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 221,
									["min"] = 221,
									["count"] = 1,
									["amount"] = 221,
								},
								["Crit"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
								["Hit"] = {
									["max"] = 85,
									["min"] = 85,
									["count"] = 1,
									["amount"] = 85,
								},
							},
							["count"] = 3,
							["amount"] = 484,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 1,
							["amount"] = 42,
						},
						["顺劈斩"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 569,
									["min"] = 468,
									["count"] = 2,
									["amount"] = 1037,
								},
								["Hit"] = {
									["max"] = 296,
									["min"] = 168,
									["count"] = 8,
									["amount"] = 1955,
								},
							},
							["count"] = 11,
							["amount"] = 2992,
						},
						["嘲讽"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 532,
									["min"] = 511,
									["count"] = 3,
									["amount"] = 1561,
								},
								["Hit"] = {
									["max"] = 294,
									["min"] = 176,
									["count"] = 14,
									["amount"] = 2963,
								},
							},
							["count"] = 17,
							["amount"] = 4524,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 54,
									["min"] = 54,
									["count"] = 1,
									["amount"] = 54,
								},
								["Hit"] = {
									["max"] = 29,
									["min"] = 27,
									["count"] = 8,
									["amount"] = 228,
								},
							},
							["count"] = 9,
							["amount"] = 282,
						},
						["复仇"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 1,
							["amount"] = 44,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1651,
									["min"] = 1339,
									["count"] = 2,
									["amount"] = 2990,
								},
								["Hit"] = {
									["max"] = 843,
									["min"] = 408,
									["count"] = 7,
									["amount"] = 3773,
								},
							},
							["count"] = 9,
							["amount"] = 6763,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 263,
									["min"] = 62,
									["count"] = 11,
									["amount"] = 1364,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 19,
									["amount"] = 0,
								},
								["Hit (被格挡)"] = {
									["max"] = 131,
									["min"] = 80,
									["count"] = 3,
									["amount"] = 333,
								},
								["Hit"] = {
									["max"] = 292,
									["min"] = 61,
									["count"] = 78,
									["amount"] = 11358,
								},
								["Crit"] = {
									["max"] = 655,
									["min"] = 123,
									["count"] = 37,
									["amount"] = 10584,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 153,
							["amount"] = 23639,
						},
					},
					["RageGain"] = 171,
					["HealingTaken"] = 15209,
					["TimeDamage"] = 190.5,
					["TimeDamaging"] = {
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.4,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 2.78,
								},
								["嗜血"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.12,
								},
								["复仇"] = {
									["count"] = 0.1,
								},
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.009999999999998,
								},
							},
							["amount"] = 26.51,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.55,
								},
								["嗜血"] = {
									["count"] = 0.45,
								},
								["旋风斩"] = {
									["count"] = 0.37,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.18,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 1.28,
								},
								["肉搏"] = {
									["count"] = 23.59000000000001,
								},
							},
							["amount"] = 35.52,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.68,
								},
								["斩杀"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 11.8,
								},
							},
							["amount"] = 12.7,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 1.94,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.6900000000000001,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 11.43,
								},
							},
							["amount"] = 15.32,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.8999999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.1,
								},
								["破甲攻击"] = {
									["count"] = 0.35,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 5.960000000000001,
								},
							},
							["amount"] = 12.43,
						},
						["莱弗提"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["嗜血"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.47,
								},
								["肉搏"] = {
									["count"] = 12.48,
								},
							},
							["amount"] = 14.31,
						},
						["塞尔德林"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.2,
								},
								["断筋"] = {
									["count"] = 0.6,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 13.1,
								},
							},
							["amount"] = 18.65,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 1.65,
								},
								["嗜血"] = {
									["count"] = 1.05,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.98,
								},
								["旋风斩"] = {
									["count"] = 0.35,
								},
								["斩杀"] = {
									["count"] = 0.3,
								},
								["肉搏"] = {
									["count"] = 22.97,
								},
							},
							["amount"] = 31.3,
						},
						["征服者派隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.85,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 1.2,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.53,
								},
								["肉搏"] = {
									["count"] = 7.71,
								},
							},
							["amount"] = 13.92,
						},
						["考尔夫"] = {
							["Details"] = {
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
					},
					["GTFOEventDamage"] = 4824,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 51,
								},
							},
							["amount"] = 51,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
					},
					["DamagedWho"] = {
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 655,
								},
							},
							["amount"] = 655,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 706,
								},
								["嗜血"] = {
									["count"] = 853,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 289,
								},
								["复仇"] = {
									["count"] = 44,
								},
								["肉搏"] = {
									["count"] = 1014,
								},
							},
							["amount"] = 2906,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 85,
								},
								["斩杀"] = {
									["count"] = 539,
								},
								["肉搏"] = {
									["count"] = 1353,
								},
							},
							["amount"] = 1977,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 270,
								},
							},
							["amount"] = 270,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 543,
								},
							},
							["amount"] = 543,
						},
						["沃莉达"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 992,
								},
								["旋风斩"] = {
									["count"] = 268,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 44,
								},
								["斩杀"] = {
									["count"] = 1651,
								},
								["肉搏"] = {
									["count"] = 2911,
								},
							},
							["amount"] = 5866,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 477,
								},
								["旋风斩"] = {
									["count"] = 294,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 221,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 190,
								},
								["肉搏"] = {
									["count"] = 1180,
								},
							},
							["amount"] = 2362,
						},
						["莱弗提"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 273,
								},
								["旋风斩"] = {
									["count"] = 235,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 84,
								},
								["断筋"] = {
									["count"] = 27,
								},
								["斩杀"] = {
									["count"] = 1339,
								},
								["肉搏"] = {
									["count"] = 1936,
								},
							},
							["amount"] = 3894,
						},
						["塞尔德林"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 168,
								},
								["嗜血"] = {
									["count"] = 326,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 213,
								},
								["断筋"] = {
									["count"] = 54,
								},
								["斩杀"] = {
									["count"] = 408,
								},
								["肉搏"] = {
									["count"] = 1876,
								},
							},
							["amount"] = 3045,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 1340,
								},
								["嗜血"] = {
									["count"] = 1036,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 410,
								},
								["旋风斩"] = {
									["count"] = 1157,
								},
								["斩杀"] = {
									["count"] = 1091,
								},
								["肉搏"] = {
									["count"] = 4850,
								},
							},
							["amount"] = 9884,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 116,
								},
								["嗜血"] = {
									["count"] = 1673,
								},
								["旋风斩"] = {
									["count"] = 2059,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 559,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 85,
								},
								["斩杀"] = {
									["count"] = 892,
								},
								["肉搏"] = {
									["count"] = 5186,
								},
							},
							["amount"] = 10570,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 320,
								},
								["顺劈斩"] = {
									["count"] = 235,
								},
								["嗜血"] = {
									["count"] = 333,
								},
								["旋风斩"] = {
									["count"] = 511,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 178,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["斩杀"] = {
									["count"] = 843,
								},
								["肉搏"] = {
									["count"] = 2022,
								},
							},
							["amount"] = 4484,
						},
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 386,
								},
							},
							["amount"] = 386,
						},
					},
				},
			},
			["UnitLockout"] = 17772.179,
			["LastActive"] = 18914.18,
		},
		["风吹鸭儿两边"] = {
			["GUID"] = "Player-5458-030A1C32",
			["LastEventHealth"] = {
				3150, -- [1]
				2862, -- [2]
				2862, -- [3]
				2862, -- [4]
				2862, -- [5]
				2573, -- [6]
				2573, -- [7]
				3150, -- [8]
				3150, -- [9]
				3150, -- [10]
				3150, -- [11]
				3150, -- [12]
				3150, -- [13]
				3150, -- [14]
				3150, -- [15]
				3150, -- [16]
				3150, -- [17]
				3150, -- [18]
				2999, -- [19]
				2999, -- [20]
				2999, -- [21]
				2999, -- [22]
				2999, -- [23]
				2999, -- [24]
				2999, -- [25]
				2999, -- [26]
				2999, -- [27]
				2999, -- [28]
				2999, -- [29]
				2999, -- [30]
				2999, -- [31]
				2999, -- [32]
				2999, -- [33]
				2999, -- [34]
				2999, -- [35]
				2999, -- [36]
				2999, -- [37]
				2999, -- [38]
				2999, -- [39]
				2999, -- [40]
				2999, -- [41]
				3150, -- [42]
				3150, -- [43]
				3150, -- [44]
				3150, -- [45]
				3150, -- [46]
				3150, -- [47]
				3150, -- [48]
				3150, -- [49]
				3150, -- [50]
			},
			["LastAttackedBy"] = "塞尔德林",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					25.5, -- [1]
				},
				["DamageTaken"] = {
					7342, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Absorbs"] = {
					3090, -- [1]
				},
				["HealingTaken"] = {
					3090, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					134.53, -- [1]
				},
				["ActiveTime"] = {
					160.03, -- [1]
				},
				["ManaGain"] = {
					330, -- [1]
				},
				["DOT_Time"] = {
					609, -- [1]
				},
				["Damage"] = {
					46478, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						false, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
					},
					["Messages"] = {
						"玛尔根·长矛 射击 风吹鸭儿两边 Hit -546 (Physical)", -- [1]
						"碎腭 肉搏 风吹鸭儿两边 Hit -206 (Physical)", -- [2]
						"碎腭 肉搏 风吹鸭儿两边 Hit -198 (Physical)", -- [3]
						"玛尔根·长矛 瞄准射击 风吹鸭儿两边 Absorb -622 (622 被吸收) (Physical)", -- [4]
						"风吹鸭儿两边 冰锥术 奥金幼龙 Hit -405 (Frost)", -- [5]
						"风吹鸭儿两边 冰锥术 自爆绵羊 Hit -435 (Frost)", -- [6]
						"奥金幼龙 肉搏 风吹鸭儿两边 Dodge (1)", -- [7]
						"玛尔根·长矛 肉搏 风吹鸭儿两边 Absorb -215 (1)", -- [8]
						"玛尔根·长矛 多重射击 风吹鸭儿两边 Hit -99 (215 被吸收) (Arcane)", -- [9]
						"风吹鸭儿两边 魔爆术 考尔夫 Hit -216 (Arcane)", -- [10]
						"风吹鸭儿两边 魔爆术 奥金幼龙 Hit -209 (Arcane)", -- [11]
						"奥金幼龙 肉搏 风吹鸭儿两边 Hit -102 (Physical)", -- [12]
						"风吹鸭儿两边 魔爆术 考尔夫 Hit -218 (Arcane)", -- [13]
						"风吹鸭儿两边 魔爆术 奥金幼龙 Hit -207 (Arcane)", -- [14]
						"风吹鸭儿两边 魔爆术 自爆绵羊 Hit -210 (Arcane)", -- [15]
						"玛尔根·长矛 射击 风吹鸭儿两边 Hit -611 (Physical)", -- [16]
						"风吹鸭儿两边 interrupts 考尔夫 次级治疗波 (法术反制)", -- [17]
						"风吹鸭儿两边 火焰冲击 考尔夫 Hit -420 (Fire)", -- [18]
						"玛尔根·长矛 射击 风吹鸭儿两边 Hit -471 (Physical)", -- [19]
						"风吹鸭儿两边死亡。", -- [20]
					},
					["DeathAt"] = 17943.172,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
					},
					["MessageTimes"] = {
						-14.20100000000093, -- [1]
						-13.95100000000093, -- [2]
						-12.45000000000073, -- [3]
						-9.566999999999098, -- [4]
						-7.766999999999825, -- [5]
						-7.766999999999825, -- [6]
						-7.400000000001455, -- [7]
						-6.082999999998719, -- [8]
						-6.082999999998719, -- [9]
						-5.86699999999837, -- [10]
						-5.86699999999837, -- [11]
						-5.38300000000163, -- [12]
						-4.349999999998545, -- [13]
						-4.349999999998545, -- [14]
						-4.349999999998545, -- [15]
						-3.082999999998719, -- [16]
						-2.86699999999837, -- [17]
						-2.049999999999272, -- [18]
						-0.01599999999962165, -- [19]
						0, -- [20]
					},
					["HealthMax"] = {
						3150, -- [1]
						3150, -- [2]
						3150, -- [3]
						3150, -- [4]
						3150, -- [5]
						3150, -- [6]
						3150, -- [7]
						3150, -- [8]
						3150, -- [9]
						3150, -- [10]
						3150, -- [11]
						3150, -- [12]
						3150, -- [13]
						3150, -- [14]
						3150, -- [15]
						3150, -- [16]
						3150, -- [17]
						3150, -- [18]
						3150, -- [19]
						2450, -- [20]
					},
					["Health"] = {
						2022, -- [1]
						1476, -- [2]
						1270, -- [3]
						1072, -- [4]
						1072, -- [5]
						1072, -- [6]
						1072, -- [7]
						1072, -- [8]
						1072, -- [9]
						1072, -- [10]
						1072, -- [11]
						973, -- [12]
						871, -- [13]
						871, -- [14]
						871, -- [15]
						871, -- [16]
						260, -- [17]
						260, -- [18]
						260, -- [19]
						0, -- [20]
					},
					["KilledBy"] = "玛尔根·长矛",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"MISC", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"MISC", -- [20]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 8,
			["LastHealTime"] = 18886.295,
			["type"] = "Ungrouped",
			["FightsSaved"] = 5,
			["LastEventHealthMax"] = {
				3150, -- [1]
				3150, -- [2]
				3150, -- [3]
				3150, -- [4]
				3150, -- [5]
				3150, -- [6]
				3150, -- [7]
				3150, -- [8]
				3150, -- [9]
				3150, -- [10]
				3150, -- [11]
				3150, -- [12]
				3150, -- [13]
				3150, -- [14]
				3150, -- [15]
				3150, -- [16]
				3150, -- [17]
				3150, -- [18]
				3150, -- [19]
				3150, -- [20]
				3150, -- [21]
				3150, -- [22]
				3150, -- [23]
				3150, -- [24]
				3150, -- [25]
				3150, -- [26]
				3150, -- [27]
				3150, -- [28]
				3150, -- [29]
				3150, -- [30]
				3150, -- [31]
				3150, -- [32]
				3150, -- [33]
				3150, -- [34]
				3150, -- [35]
				3150, -- [36]
				3150, -- [37]
				3150, -- [38]
				3150, -- [39]
				3150, -- [40]
				3150, -- [41]
				3150, -- [42]
				3150, -- [43]
				3150, -- [44]
				3150, -- [45]
				3150, -- [46]
				3150, -- [47]
				3150, -- [48]
				3150, -- [49]
				3150, -- [50]
			},
			["LastDamageTaken"] = 689,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 18886.178,
				["OVERALL"] = 18914.18,
				["DamageTaken"] = 18886.178,
				["DeathCount"] = 17941.172,
				["Absorbs"] = 18886.178,
				["HealingTaken"] = 18886.178,
				["Interrupts"] = 17938.172,
				["ActiveTime"] = 18914.18,
				["TimeDamage"] = 18914.18,
				["ManaGain"] = 18315.177,
				["DOT_Time"] = 18748.17,
				["Damage"] = 18914.18,
			},
			["NextEventNum"] = 42,
			["LastDamageTime"] = 18914.905,
			["LastEvents"] = {
				"洞穴爬行者 肉搏 风吹鸭儿两边 Hit -288 (Physical)", -- [1]
				"风吹鸭儿两边 冰锥术 洞穴爬行者 Hit -411 (Frost)", -- [2]
				"洞穴爬行者 蛛网 风吹鸭儿两边 Resist (Physical)", -- [3]
				"风吹鸭儿两边 寒冰箭 洞穴爬行者 Resist (Frost)", -- [4]
				"洞穴爬行者 肉搏 风吹鸭儿两边 Hit -289 (Physical)", -- [5]
				"风吹鸭儿两边 寒冰箭 洞穴爬行者 Hit -507 (Frost)", -- [6]
				"风吹鸭儿两边 火焰冲击 洞穴爬行者 Hit -411 (Fire)", -- [7]
				"风吹鸭儿两边 寒冰箭 塞尔德林 Hit -489 (Frost)", -- [8]
				"风吹鸭儿两边 寒冰箭 瓦亚辛 Absorb -497 (497 被吸收) (Frost)", -- [9]
				"风吹鸭儿两边 寒冰箭 瓦亚辛 Crit -1006 (Frost)", -- [10]
				"风吹鸭儿两边 寒冰箭 瓦亚辛 Hit -486 (Frost)", -- [11]
				"风吹鸭儿两边 寒冰箭 瓦亚辛 Hit -514 (Frost)", -- [12]
				"风吹鸭儿两边 寒冰箭 瓦亚辛 Hit -508 (Frost)", -- [13]
				"风吹鸭儿两边 寒冰箭 雷兹尼克 Hit -515 (Frost)", -- [14]
				"风吹鸭儿两边 寒冰箭 雷兹尼克 Hit -499 (Frost)", -- [15]
				"风吹鸭儿两边 冰霜新星 塞尔德林 Hit -27 (Frost)", -- [16]
				"风吹鸭儿两边 冰霜新星 莱弗提 Hit -27 (Frost)", -- [17]
				"Environment Falling 风吹鸭儿两边 Hit -151 (Physical)", -- [18]
				"风吹鸭儿两边 寒冰箭 沃莉达 Hit -494 (Frost)", -- [19]
				"风吹鸭儿两边 寒冰箭 沃莉达 Hit -514 (Frost)", -- [20]
				"风吹鸭儿两边 火焰冲击 奥金幼龙 Hit -425 (Fire)", -- [21]
				"风吹鸭儿两边 冰锥术 自爆绵羊 Crit -805 (Frost)", -- [22]
				"风吹鸭儿两边 冰锥术 自爆绵羊 Hit -429 (Frost)", -- [23]
				"自爆绵羊 肉搏 风吹鸭儿两边 Absorb -46 (46 被吸收) (1)", -- [24]
				"风吹鸭儿两边 寒冰箭 雷兹尼克 Hit -505 (Frost)", -- [25]
				"风吹鸭儿两边 寒冰箭 雷兹尼克 Crit -995 (Frost)", -- [26]
				"风吹鸭儿两边 冰霜新星 塞尔德林 Hit -27 (Frost)", -- [27]
				"风吹鸭儿两边 冰霜新星 莱弗提 Hit -26 (Frost)", -- [28]
				"风吹鸭儿两边 寒冰箭 塞尔德林 Hit -497 (Frost)", -- [29]
				"风吹鸭儿两边 寒冰箭 塞尔德林 Hit -517 (Frost)", -- [30]
				"塞尔德林 肉搏 风吹鸭儿两边 Absorb -689 (689 被吸收) (1)", -- [31]
				"风吹鸭儿两边 火焰冲击 塞尔德林 Hit -406 (Fire)", -- [32]
				"风吹鸭儿两边 冰锥术 塞尔德林 Hit -422 (Frost)", -- [33]
				"风吹鸭儿两边 寒冰箭 莱弗提 Hit -487 (Frost)", -- [34]
				"风吹鸭儿两边 寒冰箭 莱弗提 Hit -494 (Frost)", -- [35]
				"风吹鸭儿两边 寒冰箭 莱弗提 Hit -503 (Frost)", -- [36]
				"风吹鸭儿两边 寒冰箭 莱弗提 Hit -497 (Frost)", -- [37]
				"风吹鸭儿两边 冰锥术 莱弗提 Hit -416 (Frost)", -- [38]
				"风吹鸭儿两边 寒冰箭 莱弗提 Hit -496 (Frost)", -- [39]
				"风吹鸭儿两边 冰霜新星 莱弗提 Hit -26 (Frost)", -- [40]
				"风吹鸭儿两边 寒冰箭 莱弗提 Hit -490 (Frost)", -- [41]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -131 (Frost)", -- [42]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -131 (Frost)", -- [43]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -131 (Frost)", -- [44]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -130 (Frost)", -- [45]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -131 (Frost)", -- [46]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -131 (Frost)", -- [47]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -131 (Frost)", -- [48]
				"风吹鸭儿两边 暴风雪 (伤害/跳) 洞穴爬行者 Tick -131 (Frost)", -- [49]
				"风吹鸭儿两边 火焰冲击 洞穴爬行者 Hit -410 (Fire)", -- [50]
			},
			["Name"] = "风吹鸭儿两边",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				18764.971, -- [1]
				18765.354, -- [2]
				18768.555, -- [3]
				18769.621, -- [4]
				18770.205, -- [5]
				18772.838, -- [6]
				18773.005, -- [7]
				18815.074, -- [8]
				18818.758, -- [9]
				18821.558, -- [10]
				18824.208, -- [11]
				18826.958, -- [12]
				18829.592, -- [13]
				18835.892, -- [14]
				18838.992, -- [15]
				18842.409, -- [16]
				18842.409, -- [17]
				18847.576, -- [18]
				18851.743, -- [19]
				18854.56, -- [20]
				18860.977, -- [21]
				18863.627, -- [22]
				18863.627, -- [23]
				18864.127, -- [24]
				18870.927, -- [25]
				18873.894, -- [26]
				18874.978, -- [27]
				18874.978, -- [28]
				18880.611, -- [29]
				18883.261, -- [30]
				18886.295, -- [31]
				18887.012, -- [32]
				18889.195, -- [33]
				18899.229, -- [34]
				18901.812, -- [35]
				18904.413, -- [36]
				18906.879, -- [37]
				18908.813, -- [38]
				18909.146, -- [39]
				18910.33, -- [40]
				18914.905, -- [41]
				18746.47, -- [42]
				18746.47, -- [43]
				18746.47, -- [44]
				18746.47, -- [45]
				18747.453, -- [46]
				18747.453, -- [47]
				18747.453, -- [48]
				18748.47, -- [49]
				18763.321, -- [50]
			},
			["Fights"] = {
				["Fight5"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["max"] = 624,
									["min"] = 55,
									["count"] = 5,
									["amount"] = 1674,
								},
							},
							["count"] = 5,
							["amount"] = 1674,
						},
					},
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["碎腭"] = {
									["count"] = 15,
								},
								["自爆绵羊"] = {
									["count"] = 24,
								},
								["塞尔德林"] = {
									["count"] = 6,
								},
								["考尔夫"] = {
									["count"] = 21,
								},
								["玛尔根·长矛"] = {
									["count"] = 48,
								},
								["雷兹尼克"] = {
									["count"] = 48,
								},
								["斯诺恩·黑骨"] = {
									["count"] = 48,
								},
							},
							["amount"] = 210,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 8,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5035,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 1674,
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 70,
								},
							},
							["amount"] = 72,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementTakenAbsorb"] = {
						["Physical"] = 1301,
						["Fire"] = 158,
						["Arcane"] = 215,
					},
					["ElementTaken"] = {
						["Fire"] = 158,
						["Physical"] = 3450,
						["Melee"] = 1009,
						["Arcane"] = 418,
					},
					["DOT_Time"] = 210,
					["Damage"] = 11479,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 7.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 9999,
						["Fire"] = 420,
						["Arcane"] = 1060,
					},
					["PartialAbsorb"] = {
						["自爆绵羊"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 158,
									["min"] = 158,
									["count"] = 1,
									["amount"] = 158,
								},
							},
							["count"] = 1,
							["amount"] = 158,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 215,
									["min"] = 215,
									["count"] = 1,
									["amount"] = 215,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 215,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 624,
									["min"] = 624,
									["count"] = 1,
									["amount"] = 624,
								},
							},
							["count"] = 4,
							["amount"] = 624,
						},
						["瞄准射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 622,
									["min"] = 55,
									["count"] = 2,
									["amount"] = 677,
								},
							},
							["count"] = 2,
							["amount"] = 677,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["奥金幼龙"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 416,
								},
								["冰锥术"] = {
									["count"] = 405,
								},
							},
							["amount"] = 821,
						},
						["碎腭"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 655,
								},
							},
							["amount"] = 655,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1047,
								},
								["魔爆术"] = {
									["count"] = 210,
								},
								["冰锥术"] = {
									["count"] = 435,
								},
							},
							["amount"] = 1692,
						},
						["塞尔德林"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 262,
								},
							},
							["amount"] = 262,
						},
						["考尔夫"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 434,
								},
								["暴风雪 (伤害/跳)"] = {
									["count"] = 915,
								},
								["火焰冲击"] = {
									["count"] = 420,
								},
							},
							["amount"] = 1769,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2092,
								},
							},
							["amount"] = 2092,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2093,
								},
							},
							["amount"] = 2093,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2095,
								},
							},
							["amount"] = 2095,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 102,
								},
							},
							["amount"] = 102,
						},
						["碎腭"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 637,
								},
							},
							["amount"] = 637,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["自爆绵羊"] = {
									["count"] = 158,
								},
							},
							["amount"] = 158,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 418,
								},
								["射击"] = {
									["count"] = 2252,
								},
								["瞄准射击"] = {
									["count"] = 1198,
								},
								["肉搏"] = {
									["count"] = 270,
								},
							},
							["amount"] = 4138,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["自爆绵羊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 165,
								},
							},
							["amount"] = 165,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1674,
								},
							},
							["amount"] = 1674,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["count"] = 165,
								},
							},
							["amount"] = 165,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 1,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["考尔夫"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.85,
								},
							},
							["amount"] = 1.85,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 3.26,
								},
							},
							["amount"] = 3.26,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.460000000000001,
								},
							},
							["amount"] = 6.460000000000001,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.279999999999999,
								},
							},
							["amount"] = 6.279999999999999,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
						["考尔夫"] = {
							["Details"] = {
								["次级治疗波 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 624,
									["min"] = 55,
									["count"] = 5,
									["amount"] = 1674,
								},
							},
							["count"] = 5,
							["amount"] = 1674,
						},
					},
					["WhoHealed"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1674,
								},
							},
							["amount"] = 1674,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 31.35,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 131,
									["min"] = 130,
									["count"] = 70,
									["amount"] = 9159,
								},
							},
							["count"] = 70,
							["amount"] = 9159,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 420,
									["min"] = 420,
									["count"] = 1,
									["amount"] = 420,
								},
							},
							["count"] = 1,
							["amount"] = 420,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 218,
									["min"] = 207,
									["count"] = 5,
									["amount"] = 1060,
								},
							},
							["count"] = 5,
							["amount"] = 1060,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 435,
									["min"] = 405,
									["count"] = 2,
									["amount"] = 840,
								},
							},
							["count"] = 2,
							["amount"] = 840,
						},
					},
					["HealingTaken"] = 1674,
					["RageGain"] = 0,
					["TimeDamage"] = 23.85,
					["TimeDamaging"] = {
						["自爆绵羊"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.85,
								},
							},
							["amount"] = 1.85,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 3.26,
								},
							},
							["amount"] = 3.26,
						},
						["考尔夫"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.460000000000001,
								},
							},
							["amount"] = 6.460000000000001,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.279999999999999,
								},
							},
							["amount"] = 6.279999999999999,
						},
					},
					["ManaGain"] = 165,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight2"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["洞穴爬行者"] = {
									["count"] = 213,
								},
							},
							["amount"] = 213,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 577,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 0,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 71,
								},
							},
							["amount"] = 74,
						},
					},
					["ElementTakenAbsorb"] = {
						["Nature"] = 0,
					},
					["ElementTaken"] = {
						["Melee"] = 577,
						["Nature"] = 0,
					},
					["DOT_Time"] = 213,
					["Damage"] = 11028,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 821,
						["Frost"] = 10207,
					},
					["PartialAbsorb"] = {
						["蛛网"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 9289,
								},
								["寒冰箭"] = {
									["count"] = 507,
								},
								["冰锥术"] = {
									["count"] = 411,
								},
								["火焰冲击"] = {
									["count"] = 821,
								},
							},
							["amount"] = 11028,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 577,
								},
							},
							["amount"] = 577,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["毒云术 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["蛛网"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 23.39,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 29.56,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["WhoHealed"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 29.56,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 131,
									["min"] = 130,
									["count"] = 71,
									["amount"] = 9289,
								},
							},
							["count"] = 71,
							["amount"] = 9289,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 507,
									["min"] = 507,
									["count"] = 1,
									["amount"] = 507,
								},
							},
							["count"] = 2,
							["amount"] = 507,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 411,
									["min"] = 411,
									["count"] = 1,
									["amount"] = 411,
								},
							},
							["count"] = 1,
							["amount"] = 411,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 411,
									["min"] = 410,
									["count"] = 2,
									["amount"] = 821,
								},
							},
							["count"] = 2,
							["amount"] = 821,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 29.56,
					["TimeDamaging"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 23.39,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 29.56,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["洞穴雷霆蜥蜴"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
					["ElementTaken"] = {
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 0,
								},
								["火焰冲击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Fire"] = 0,
						["Frost"] = 0,
					},
					["TimeSpent"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 0,
								},
								["火焰冲击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 0,
								},
								["火焰冲击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["Fight3"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["max"] = 231,
									["min"] = 50,
									["count"] = 5,
									["amount"] = 431,
								},
							},
							["count"] = 5,
							["amount"] = 431,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 431,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 431,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
						["Nature"] = 431,
					},
					["ElementTaken"] = {
						["Nature"] = 431,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1370,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 7.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 429,
						["Frost"] = 941,
					},
					["PartialAbsorb"] = {
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 4,
									["amount"] = 200,
								},
							},
							["count"] = 4,
							["amount"] = 200,
						},
						["闪电之盾"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 231,
									["min"] = 231,
									["count"] = 1,
									["amount"] = 231,
								},
							},
							["count"] = 1,
							["amount"] = 231,
						},
					},
					["DamagedWho"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 428,
								},
								["寒冰箭"] = {
									["count"] = 486,
								},
								["火焰冲击"] = {
									["count"] = 429,
								},
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 1370,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["毒云术 (伤害/跳)"] = {
									["count"] = 200,
								},
								["闪电之盾"] = {
									["count"] = 231,
								},
							},
							["amount"] = 431,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 431,
								},
							},
							["amount"] = 431,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 0.28,
								},
								["冰锥术"] = {
									["count"] = 1.3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.58,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 231,
									["min"] = 50,
									["count"] = 5,
									["amount"] = 431,
								},
							},
							["count"] = 5,
							["amount"] = 431,
						},
					},
					["WhoHealed"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 431,
								},
							},
							["amount"] = 431,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 12.08,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 428,
									["min"] = 428,
									["count"] = 1,
									["amount"] = 428,
								},
							},
							["count"] = 1,
							["amount"] = 428,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 486,
									["min"] = 486,
									["count"] = 1,
									["amount"] = 486,
								},
							},
							["count"] = 1,
							["amount"] = 486,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 429,
									["min"] = 429,
									["count"] = 1,
									["amount"] = 429,
								},
							},
							["count"] = 1,
							["amount"] = 429,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 27,
									["min"] = 27,
									["count"] = 1,
									["amount"] = 27,
								},
							},
							["count"] = 1,
							["amount"] = 27,
						},
					},
					["HealingTaken"] = 431,
					["RageGain"] = 0,
					["TimeDamage"] = 4.58,
					["TimeDamaging"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.3,
								},
								["寒冰箭"] = {
									["count"] = 0.28,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.58,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight4"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 26,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 26,
					},
					["PartialAbsorb"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["征服者派隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 165,
								},
							},
							["amount"] = 165,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["count"] = 165,
								},
							},
							["amount"] = 165,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["征服者派隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 26,
									["min"] = 26,
									["count"] = 1,
									["amount"] = 26,
								},
							},
							["count"] = 1,
							["amount"] = 26,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["征服者派隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 165,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 2,
									["amount"] = 735,
								},
							},
							["count"] = 2,
							["amount"] = 735,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 886,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 735,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 25,
								},
							},
							["amount"] = 29,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 735,
					},
					["ElementTaken"] = {
						["Melee"] = 735,
						["Physical"] = 151,
					},
					["DOT_Time"] = 0,
					["Damage"] = 14039,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 3,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 497,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 831,
						["Frost"] = 13208,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 2,
									["amount"] = 735,
								},
							},
							["count"] = 2,
							["amount"] = 735,
						},
					},
					["DamagedWho"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3011,
								},
							},
							["amount"] = 3011,
						},
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2967,
								},
								["冰锥术"] = {
									["count"] = 416,
								},
								["冰霜新星"] = {
									["count"] = 79,
								},
							},
							["amount"] = 3462,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 422,
								},
								["寒冰箭"] = {
									["count"] = 1503,
								},
								["火焰冲击"] = {
									["count"] = 406,
								},
								["冰霜新星"] = {
									["count"] = 54,
								},
							},
							["amount"] = 2385,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1234,
								},
							},
							["amount"] = 1234,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 425,
								},
							},
							["amount"] = 425,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2514,
								},
							},
							["amount"] = 2514,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1008,
								},
							},
							["amount"] = 1008,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["塞尔德林"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 689,
								},
							},
							["amount"] = 689,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 46,
								},
							},
							["amount"] = 46,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 151,
								},
							},
							["amount"] = 151,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 735,
								},
							},
							["amount"] = 735,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.83,
								},
								["冰霜新星"] = {
									["count"] = 1.18,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.51,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 10.08,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 2,
									["amount"] = 735,
								},
							},
							["count"] = 2,
							["amount"] = 735,
						},
					},
					["WhoHealed"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 735,
								},
							},
							["amount"] = 735,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 43.09,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 805,
									["min"] = 805,
									["count"] = 1,
									["amount"] = 805,
								},
								["Hit"] = {
									["max"] = 429,
									["min"] = 416,
									["count"] = 3,
									["amount"] = 1267,
								},
							},
							["count"] = 4,
							["amount"] = 2072,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 497,
									["min"] = 497,
									["count"] = 1,
									["amount"] = 497,
								},
								["Crit"] = {
									["max"] = 1006,
									["min"] = 995,
									["count"] = 2,
									["amount"] = 2001,
								},
								["Hit"] = {
									["max"] = 517,
									["min"] = 486,
									["count"] = 17,
									["amount"] = 8505,
								},
							},
							["count"] = 20,
							["amount"] = 11003,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 425,
									["min"] = 406,
									["count"] = 2,
									["amount"] = 831,
								},
							},
							["count"] = 2,
							["amount"] = 831,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 27,
									["min"] = 26,
									["count"] = 5,
									["amount"] = 133,
								},
							},
							["count"] = 5,
							["amount"] = 133,
						},
					},
					["HealingTaken"] = 735,
					["RageGain"] = 0,
					["TimeDamage"] = 40.09,
					["TimeDamaging"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 10.08,
						},
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.83,
								},
								["冰霜新星"] = {
									["count"] = 1.18,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.51,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 2,
									["amount"] = 735,
								},
							},
							["count"] = 2,
							["amount"] = 735,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 886,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 735,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 25,
								},
							},
							["amount"] = 29,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 735,
					},
					["ElementTaken"] = {
						["Melee"] = 735,
						["Physical"] = 151,
					},
					["DOT_Time"] = 0,
					["Damage"] = 14039,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 3,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 497,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 831,
						["Frost"] = 13208,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 2,
									["amount"] = 735,
								},
							},
							["count"] = 2,
							["amount"] = 735,
						},
					},
					["DamagedWho"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3011,
								},
							},
							["amount"] = 3011,
						},
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2967,
								},
								["冰锥术"] = {
									["count"] = 416,
								},
								["冰霜新星"] = {
									["count"] = 79,
								},
							},
							["amount"] = 3462,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 422,
								},
								["寒冰箭"] = {
									["count"] = 1503,
								},
								["火焰冲击"] = {
									["count"] = 406,
								},
								["冰霜新星"] = {
									["count"] = 54,
								},
							},
							["amount"] = 2385,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1234,
								},
							},
							["amount"] = 1234,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 425,
								},
							},
							["amount"] = 425,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2514,
								},
							},
							["amount"] = 2514,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1008,
								},
							},
							["amount"] = 1008,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["塞尔德林"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 689,
								},
							},
							["amount"] = 689,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 46,
								},
							},
							["amount"] = 46,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 151,
								},
							},
							["amount"] = 151,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 735,
								},
							},
							["amount"] = 735,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.83,
								},
								["冰霜新星"] = {
									["count"] = 1.18,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.51,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 10.08,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 2,
									["amount"] = 735,
								},
							},
							["count"] = 2,
							["amount"] = 735,
						},
					},
					["WhoHealed"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 735,
								},
							},
							["amount"] = 735,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 43.09,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 805,
									["min"] = 805,
									["count"] = 1,
									["amount"] = 805,
								},
								["Hit"] = {
									["max"] = 429,
									["min"] = 416,
									["count"] = 3,
									["amount"] = 1267,
								},
							},
							["count"] = 4,
							["amount"] = 2072,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 497,
									["min"] = 497,
									["count"] = 1,
									["amount"] = 497,
								},
								["Crit"] = {
									["max"] = 1006,
									["min"] = 995,
									["count"] = 2,
									["amount"] = 2001,
								},
								["Hit"] = {
									["max"] = 517,
									["min"] = 486,
									["count"] = 17,
									["amount"] = 8505,
								},
							},
							["count"] = 20,
							["amount"] = 11003,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 425,
									["min"] = 406,
									["count"] = 2,
									["amount"] = 831,
								},
							},
							["count"] = 2,
							["amount"] = 831,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 27,
									["min"] = 26,
									["count"] = 5,
									["amount"] = 133,
								},
							},
							["count"] = 5,
							["amount"] = 133,
						},
					},
					["HealingTaken"] = 735,
					["RageGain"] = 0,
					["TimeDamage"] = 40.09,
					["TimeDamaging"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 10.08,
						},
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.83,
								},
								["冰霜新星"] = {
									["count"] = 1.18,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.51,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["碎腭"] = {
									["count"] = 15,
								},
								["自爆绵羊"] = {
									["count"] = 24,
								},
								["玛尔根·长矛"] = {
									["count"] = 48,
								},
								["斯诺恩·黑骨"] = {
									["count"] = 48,
								},
								["塞尔德林"] = {
									["count"] = 6,
								},
								["洞穴雷霆蜥蜴"] = {
									["count"] = 186,
								},
								["洞穴爬行者"] = {
									["count"] = 213,
								},
								["雷兹尼克"] = {
									["count"] = 48,
								},
								["考尔夫"] = {
									["count"] = 21,
								},
							},
							["amount"] = 609,
						},
					},
					["TimeSpent"] = {
						["征服者派隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.85,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.35,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 25.5,
								},
							},
							["amount"] = 25.5,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.3,
								},
								["寒冰箭"] = {
									["count"] = 0.28,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.58,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 23.39,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 29.56,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.279999999999999,
								},
							},
							["amount"] = 6.279999999999999,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 10.08,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.83,
								},
								["冰霜新星"] = {
									["count"] = 1.18,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.51,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 34.03,
								},
								["火焰冲击"] = {
									["count"] = 0.92,
								},
							},
							["amount"] = 34.95,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 3.26,
								},
							},
							["amount"] = 3.26,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.460000000000001,
								},
								["寒冰箭"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12.46,
						},
						["考尔夫"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["HealedWho"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3090,
								},
							},
							["amount"] = 3090,
						},
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 497,
					},
					["Absorbs"] = 3090,
					["DeathCount"] = 1,
					["ElementTaken"] = {
						["Physical"] = 3764,
						["Melee"] = 2321,
						["Arcane"] = 418,
						["Fire"] = 158,
						["Nature"] = 681,
					},
					["DOT_Time"] = 609,
					["Damage"] = 46478,
					["TimeHeal"] = 25.5,
					["ElementDone"] = {
						["Frost"] = 42493,
						["Fire"] = 2925,
						["Arcane"] = 1060,
					},
					["DamagedWho"] = {
						["碎腭"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 655,
								},
							},
							["amount"] = 655,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1047,
								},
								["魔爆术"] = {
									["count"] = 210,
								},
								["冰锥术"] = {
									["count"] = 1669,
								},
							},
							["amount"] = 2926,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2092,
								},
							},
							["amount"] = 2092,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1008,
								},
							},
							["amount"] = 1008,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 428,
								},
								["寒冰箭"] = {
									["count"] = 486,
								},
								["火焰冲击"] = {
									["count"] = 429,
								},
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 1370,
						},
						["征服者派隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2095,
								},
							},
							["amount"] = 2095,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 9289,
								},
								["寒冰箭"] = {
									["count"] = 507,
								},
								["冰锥术"] = {
									["count"] = 411,
								},
								["火焰冲击"] = {
									["count"] = 821,
								},
							},
							["amount"] = 11028,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3011,
								},
							},
							["amount"] = 3011,
						},
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2967,
								},
								["冰锥术"] = {
									["count"] = 416,
								},
								["冰霜新星"] = {
									["count"] = 79,
								},
							},
							["amount"] = 3462,
						},
						["塞尔德林"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 262,
								},
								["冰霜新星"] = {
									["count"] = 54,
								},
								["寒冰箭"] = {
									["count"] = 1503,
								},
								["冰锥术"] = {
									["count"] = 422,
								},
								["火焰冲击"] = {
									["count"] = 406,
								},
							},
							["amount"] = 2647,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 8112,
								},
								["火焰冲击"] = {
									["count"] = 424,
								},
							},
							["amount"] = 8536,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 416,
								},
								["火焰冲击"] = {
									["count"] = 425,
								},
								["冰锥术"] = {
									["count"] = 405,
								},
							},
							["amount"] = 1246,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2093,
								},
								["寒冰箭"] = {
									["count"] = 2514,
								},
							},
							["amount"] = 4607,
						},
						["考尔夫"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 434,
								},
								["暴风雪 (伤害/跳)"] = {
									["count"] = 915,
								},
								["火焰冲击"] = {
									["count"] = 420,
								},
							},
							["amount"] = 1769,
						},
					},
					["WhoDamaged"] = {
						["塞尔德林"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 689,
								},
							},
							["amount"] = 689,
						},
						["碎腭"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 637,
								},
							},
							["amount"] = 637,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["自爆绵羊"] = {
									["count"] = 158,
								},
								["肉搏"] = {
									["count"] = 46,
								},
							},
							["amount"] = 204,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 314,
								},
							},
							["amount"] = 314,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 577,
								},
							},
							["amount"] = 577,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["毒云术 (伤害/跳)"] = {
									["count"] = 450,
								},
								["闪电之盾"] = {
									["count"] = 231,
								},
							},
							["amount"] = 681,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 102,
								},
							},
							["amount"] = 102,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 418,
								},
								["射击"] = {
									["count"] = 2252,
								},
								["瞄准射击"] = {
									["count"] = 1198,
								},
								["肉搏"] = {
									["count"] = 270,
								},
							},
							["amount"] = 4138,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 17,
									["amount"] = 3090,
								},
							},
							["count"] = 17,
							["amount"] = 3090,
						},
					},
					["TimeHealing"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 25.5,
								},
							},
							["amount"] = 25.5,
						},
					},
					["PartialResist"] = {
						["蛛网"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
					},
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["风吹鸭儿两边"] = {
									["count"] = 330,
								},
							},
							["amount"] = 330,
						},
					},
					["ElementTakenAbsorb"] = {
						["Physical"] = 1301,
						["Melee"] = 735,
						["Arcane"] = 215,
						["Fire"] = 158,
						["Nature"] = 681,
					},
					["ActiveTime"] = 160.03,
					["InterruptData"] = {
						["考尔夫"] = {
							["Details"] = {
								["次级治疗波 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 17,
									["amount"] = 3090,
								},
							},
							["count"] = 17,
							["amount"] = 3090,
						},
					},
					["Interrupts"] = 1,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 12,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
					["DamageTaken"] = 7342,
					["ManaGainedFrom"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 330,
								},
							},
							["amount"] = 330,
						},
					},
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 131,
									["min"] = 130,
									["count"] = 203,
									["amount"] = 26560,
								},
							},
							["count"] = 203,
							["amount"] = 26560,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 27,
									["min"] = 26,
									["count"] = 7,
									["amount"] = 186,
								},
							},
							["count"] = 7,
							["amount"] = 186,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 218,
									["min"] = 207,
									["count"] = 5,
									["amount"] = 1060,
								},
							},
							["count"] = 5,
							["amount"] = 1060,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 497,
									["min"] = 497,
									["count"] = 1,
									["amount"] = 497,
								},
								["Crit"] = {
									["max"] = 1006,
									["min"] = 995,
									["count"] = 2,
									["amount"] = 2001,
								},
								["Hit"] = {
									["max"] = 517,
									["min"] = 486,
									["count"] = 19,
									["amount"] = 9498,
								},
							},
							["count"] = 23,
							["amount"] = 11996,
						},
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 805,
									["min"] = 805,
									["count"] = 1,
									["amount"] = 805,
								},
								["Hit"] = {
									["max"] = 435,
									["min"] = 405,
									["count"] = 7,
									["amount"] = 2946,
								},
							},
							["count"] = 8,
							["amount"] = 3751,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 429,
									["min"] = 406,
									["count"] = 7,
									["amount"] = 2925,
								},
							},
							["count"] = 7,
							["amount"] = 2925,
						},
					},
					["HealingTaken"] = 3090,
					["PartialAbsorb"] = {
						["蛛网"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 158,
									["min"] = 158,
									["count"] = 1,
									["amount"] = 158,
								},
							},
							["count"] = 1,
							["amount"] = 158,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 9,
									["amount"] = 450,
								},
							},
							["count"] = 9,
							["amount"] = 450,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 231,
									["min"] = 231,
									["count"] = 1,
									["amount"] = 231,
								},
							},
							["count"] = 1,
							["amount"] = 231,
						},
						["瞄准射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 622,
									["min"] = 55,
									["count"] = 2,
									["amount"] = 677,
								},
							},
							["count"] = 2,
							["amount"] = 677,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 624,
									["min"] = 624,
									["count"] = 1,
									["amount"] = 624,
								},
							},
							["count"] = 4,
							["amount"] = 624,
						},
						["多重射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 215,
									["min"] = 215,
									["count"] = 1,
									["amount"] = 215,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 215,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 689,
									["min"] = 46,
									["count"] = 2,
									["amount"] = 735,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 735,
						},
					},
					["TimeDamage"] = 134.53,
					["TimeDamaging"] = {
						["自爆绵羊"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.85,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.35,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 3.26,
								},
							},
							["amount"] = 3.26,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 23.39,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 29.56,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.3,
								},
								["寒冰箭"] = {
									["count"] = 0.28,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.58,
						},
						["沃莉达"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.279999999999999,
								},
							},
							["amount"] = 6.279999999999999,
						},
						["塞尔德林"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 10.08,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["莱弗提"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 7.83,
								},
								["冰霜新星"] = {
									["count"] = 1.18,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.51,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 34.03,
								},
								["火焰冲击"] = {
									["count"] = 0.92,
								},
							},
							["amount"] = 34.95,
						},
						["征服者派隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.460000000000001,
								},
								["寒冰箭"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12.46,
						},
						["考尔夫"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ManaGain"] = 330,
					["WhoHealed"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 3090,
								},
							},
							["amount"] = 3090,
						},
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 203,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 33,
								},
							},
							["amount"] = 241,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
				},
			},
			["UnitLockout"] = 18527.174,
			["LastActive"] = 18914.18,
		},
		["丫丫是我"] = {
			["GUID"] = "Player-5458-02EE25C9",
			["LastEventHealth"] = {
				3204, -- [1]
				3204, -- [2]
				3204, -- [3]
				3204, -- [4]
				3204, -- [5]
				3204, -- [6]
				3204, -- [7]
				3204, -- [8]
				3204, -- [9]
				3204, -- [10]
				3204, -- [11]
				3204, -- [12]
				3204, -- [13]
				3204, -- [14]
				3204, -- [15]
				3204, -- [16]
				3204, -- [17]
				3204, -- [18]
				3204, -- [19]
				3204, -- [20]
				3204, -- [21]
				3204, -- [22]
				3204, -- [23]
				3017, -- [24]
				3017, -- [25]
				3017, -- [26]
				3017, -- [27]
				3017, -- [28]
				3017, -- [29]
				3017, -- [30]
				3017, -- [31]
				3017, -- [32]
				3017, -- [33]
				3017, -- [34]
				2894, -- [35]
				2894, -- [36]
				4826, -- [37]
				4826, -- [38]
				4826, -- [39]
				4826, -- [40]
				4056, -- [41]
				3914, -- [42]
				3914, -- [43]
				3772, -- [44]
				3772, -- [45]
				3630, -- [46]
				3488, -- [47]
				3346, -- [48]
				3346, -- [49]
				3346, -- [50]
			},
			["LastAttackedBy"] = "莱弗提",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"MISC", -- [37]
				"MISC", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					145.05, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					145.05, -- [1]
				},
				["DOT_Time"] = {
					135, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					7555, -- [1]
				},
				["Damage"] = {
					39300, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
					},
					["Messages"] = {
						"斯诺恩·黑骨 灼烧 丫丫是我 Hit -372 (Fire)", -- [1]
						"丫丫是我 毒蛇钉刺 (伤害/跳) 考尔夫 Tick -101 (Nature)", -- [2]
						"塞尔德林 拦截昏迷 丫丫是我 Hit -41 (Physical)", -- [3]
						"塞尔德林 肉搏 丫丫是我 Hit -367 (Physical)", -- [4]
						"斯诺恩·黑骨 灼烧 丫丫是我 Hit -306 (102 被抵抗) (Fire)", -- [5]
						"丫丫是我 毒蛇钉刺 (伤害/跳) 考尔夫 Tick -101 (Nature)", -- [6]
						"雷兹尼克 地精龙枪 丫丫是我 Resist (Fire)", -- [7]
						"丫丫是我 奥术射击 考尔夫 Hit -157 (Arcane)", -- [8]
						"丫丫是我 自动射击 考尔夫 Crit -724 (Physical)", -- [9]
						"斯诺恩·黑骨 灼烧 丫丫是我 Hit -388 (Fire)", -- [10]
						"丫丫是我 毒蛇钉刺 (伤害/跳) 考尔夫 Tick -101 (Nature)", -- [11]
						"斯诺恩·黑骨 灼烧 丫丫是我 Hit -328 (Fire)", -- [12]
						"丫丫是我 自动射击 考尔夫 Hit -324 (Physical)", -- [13]
						"丫丫是我 奥术射击 考尔夫 Hit -157 (Arcane)", -- [14]
						"斯诺恩·黑骨 灼烧 丫丫是我 Hit -355 (Fire)", -- [15]
						"玛尔根·长矛 瞄准射击 丫丫是我 Hit -440 (Physical)", -- [16]
						"玛尔根·长矛 射击 丫丫是我 Hit -434 (Physical)", -- [17]
						"斯诺恩·黑骨 灼烧 丫丫是我 Hit -381 (Fire)", -- [18]
						"丫丫是我死亡。", -- [19]
					},
					["DeathAt"] = 17950.172,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
					},
					["MessageTimes"] = {
						-14.58399999999892, -- [1]
						-14.53399999999965, -- [2]
						-14.46799999999712, -- [3]
						-13.96700000000055, -- [4]
						-12.95099999999729, -- [5]
						-11.53399999999965, -- [6]
						-10.46700000000055, -- [7]
						-10.28399999999965, -- [8]
						-7.416999999997643, -- [9]
						-6.484000000000378, -- [10]
						-5.849999999998545, -- [11]
						-4.883999999998196, -- [12]
						-4.533999999999651, -- [13]
						-3.86699999999837, -- [14]
						-3.266999999999825, -- [15]
						-2.166999999997643, -- [16]
						-0.3669999999983702, -- [17]
						-0.03299999999944703, -- [18]
						0, -- [19]
					},
					["HealthMax"] = {
						4826, -- [1]
						4826, -- [2]
						4826, -- [3]
						4826, -- [4]
						4826, -- [5]
						4826, -- [6]
						4826, -- [7]
						4826, -- [8]
						4826, -- [9]
						4826, -- [10]
						4826, -- [11]
						4826, -- [12]
						4826, -- [13]
						4826, -- [14]
						4826, -- [15]
						4826, -- [16]
						4826, -- [17]
						4826, -- [18]
						4056, -- [19]
					},
					["Health"] = {
						3127, -- [1]
						3127, -- [2]
						2755, -- [3]
						2714, -- [4]
						2347, -- [5]
						2041, -- [6]
						2041, -- [7]
						2041, -- [8]
						2041, -- [9]
						2041, -- [10]
						1653, -- [11]
						1653, -- [12]
						1325, -- [13]
						1325, -- [14]
						1325, -- [15]
						970, -- [16]
						530, -- [17]
						96, -- [18]
						0, -- [19]
					},
					["KilledBy"] = "斯诺恩·黑骨",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"MISC", -- [19]
					},
				}, -- [1]
			},
			["TimeLast"] = {
				["Dispelled"] = 18824.175,
				["OVERALL"] = 18913.18,
				["DamageTaken"] = 18910.18,
				["DeathCount"] = 17948.172,
				["TimeDamage"] = 18913.18,
				["Healing"] = 17840.166,
				["ActiveTime"] = 18913.18,
				["DOT_Time"] = 18913.18,
				["Damage"] = 18913.18,
			},
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 8,
			["LastEventHealthMax"] = {
				4056, -- [1]
				4056, -- [2]
				4056, -- [3]
				4056, -- [4]
				4056, -- [5]
				4056, -- [6]
				4056, -- [7]
				4056, -- [8]
				4056, -- [9]
				4056, -- [10]
				4056, -- [11]
				4056, -- [12]
				4056, -- [13]
				4056, -- [14]
				4056, -- [15]
				4056, -- [16]
				4056, -- [17]
				4056, -- [18]
				4056, -- [19]
				4056, -- [20]
				4056, -- [21]
				4056, -- [22]
				4056, -- [23]
				4056, -- [24]
				4056, -- [25]
				4056, -- [26]
				4056, -- [27]
				4056, -- [28]
				4056, -- [29]
				4056, -- [30]
				4056, -- [31]
				4056, -- [32]
				4056, -- [33]
				4056, -- [34]
				4056, -- [35]
				4056, -- [36]
				4826, -- [37]
				4826, -- [38]
				4826, -- [39]
				4826, -- [40]
				4056, -- [41]
				4056, -- [42]
				4056, -- [43]
				4056, -- [44]
				4056, -- [45]
				4056, -- [46]
				4056, -- [47]
				4056, -- [48]
				4056, -- [49]
				4056, -- [50]
			},
			["type"] = "Ungrouped",
			["FightsSaved"] = 5,
			["GuardianReverseGUIDs"] = {
				["公主"] = {
					["LatestGuardian"] = 2,
					["GUIDs"] = {
						"Pet-0-5430-0-12645-4512-060116EE12", -- [1]
						"Pet-0-5430-0-12647-4512-010116EE12", -- [2]
						[0] = "Pet-0-5427-230-25008-4512-010116EE12",
					},
				},
			},
			["LastDamageTaken"] = 123,
			["Owner"] = false,
			["Pet"] = {
				"公主 <丫丫是我>", -- [1]
			},
			["NextEventNum"] = 37,
			["LastDamageTime"] = 18913.396,
			["LastEvents"] = {
				"丫丫是我 毒蛇钉刺 (伤害/跳) 雷兹尼克 Tick -101 (Nature)", -- [1]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 雷兹尼克 Tick -101 (Nature)", -- [2]
				"丫丫是我 奥术射击 塞尔德林 Hit -157 (Arcane)", -- [3]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 雷兹尼克 Tick -101 (Nature)", -- [4]
				"丫丫是我 自动射击 塞尔德林 Hit -260 (Physical)", -- [5]
				"丫丫是我 驱散射击 塞尔德林 Hit -129 (Physical)", -- [6]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 雷兹尼克 Tick -101 (Nature)", -- [7]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 雷兹尼克 Tick -101 (Nature)", -- [8]
				"丫丫是我 奥术射击 沃莉达 Hit -157 (Arcane)", -- [9]
				"丫丫是我 自动射击 沃莉达 Crit -919 (Physical)", -- [10]
				"丫丫是我 毒蛇钉刺 奥金幼龙 Immune (Nature)", -- [11]
				"丫丫是我 自动射击 奥金幼龙 Hit -295 (Physical)", -- [12]
				"丫丫是我 奥术射击 雷兹尼克 Hit -157 (Arcane)", -- [13]
				"丫丫是我 自动射击 雷兹尼克 Hit -336 (Physical)", -- [14]
				"丫丫是我 自动射击 雷兹尼克 Hit -342 (Physical)", -- [15]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 雷兹尼克 Tick -101 (Nature)", -- [16]
				"丫丫是我 自动射击 雷兹尼克 Hit -349 (Physical)", -- [17]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 雷兹尼克 Tick -101 (Nature)", -- [18]
				"丫丫是我 奥术射击 塞尔德林 Hit -157 (Arcane)", -- [19]
				"丫丫是我 自动射击 塞尔德林 Hit -265 (Physical)", -- [20]
				"丫丫是我 自动射击 塞尔德林 Hit -257 (Physical)", -- [21]
				"丫丫是我 自动射击 塞尔德林 Crit -647 (Physical)", -- [22]
				"Environment Falling 丫丫是我 Hit -187 (Physical)", -- [23]
				"丫丫是我 奥术射击 塞尔德林 Hit -157 (Arcane)", -- [24]
				"丫丫是我 自动射击 莱弗提 Hit -288 (Physical)", -- [25]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 莱弗提 Tick -101 (Nature)", -- [26]
				"丫丫是我 自动射击 莱弗提 Hit -290 (Physical)", -- [27]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 莱弗提 Tick -101 (Nature)", -- [28]
				"丫丫是我 自动射击 莱弗提 Hit -288 (Physical)", -- [29]
				"丫丫是我 猛禽一击 莱弗提 Crit -502 (Physical)", -- [30]
				"丫丫是我 肉搏 莱弗提 Glancing -50 (Physical)", -- [31]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 莱弗提 Tick -101 (Nature)", -- [32]
				"莱弗提 肉搏 丫丫是我 Hit -123 (Physical)", -- [33]
				"莱弗提 蹬踏 丫丫是我 Parry (Physical)", -- [34]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 莱弗提 Tick -101 (Nature)", -- [35]
				"丫丫是我 自动射击 莱弗提 Hit -298 (Physical)", -- [36]
				"瓦亚辛 dispels 丫丫是我 防护暗影 (驱散魔法)", -- [37]
				"瓦亚辛 dispels 丫丫是我 坚韧祷言 (驱散魔法)", -- [38]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 瓦亚辛 Tick -101 (Nature)", -- [39]
				"丫丫是我 自动射击 瓦亚辛 Hit -378 (Physical)", -- [40]
				"瓦亚辛 暗言术：痛 (伤害/跳) 丫丫是我 Tick -142 (Shadow)", -- [41]
				"丫丫是我 自动射击 瓦亚辛 Hit -383 (Physical)", -- [42]
				"瓦亚辛 暗言术：痛 (伤害/跳) 丫丫是我 Tick -142 (Shadow)", -- [43]
				"丫丫是我 毒蛇钉刺 (伤害/跳) 瓦亚辛 Tick -101 (Nature)", -- [44]
				"瓦亚辛 暗言术：痛 (伤害/跳) 丫丫是我 Tick -142 (Shadow)", -- [45]
				"瓦亚辛 暗言术：痛 (伤害/跳) 丫丫是我 Tick -142 (Shadow)", -- [46]
				"瓦亚辛 暗言术：痛 (伤害/跳) 丫丫是我 Tick -142 (Shadow)", -- [47]
				"丫丫是我 自动射击 雷兹尼克 Hit -334 (Physical)", -- [48]
				"丫丫是我 奥术射击 雷兹尼克 Hit -157 (Arcane)", -- [49]
				"瓦亚辛 暗言术：痛 (伤害/跳) 丫丫是我 Tick -142 (Shadow)", -- [50]
			},
			["Name"] = "丫丫是我",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				18840.992, -- [1]
				18844.009, -- [2]
				18846.793, -- [3]
				18847.009, -- [4]
				18847.293, -- [5]
				18849.159, -- [6]
				18849.993, -- [7]
				18853.01, -- [8]
				18854.876, -- [9]
				18856.376, -- [10]
				18860.727, -- [11]
				18861.243, -- [12]
				18864.927, -- [13]
				18865.494, -- [14]
				18868.444, -- [15]
				18869.561, -- [16]
				18871.327, -- [17]
				18872.577, -- [18]
				18879.228, -- [19]
				18879.728, -- [20]
				18882.611, -- [21]
				18885.561, -- [22]
				18892.445, -- [23]
				18893.262, -- [24]
				18902.179, -- [25]
				18904.213, -- [26]
				18905.029, -- [27]
				18907.196, -- [28]
				18907.846, -- [29]
				18909.08, -- [30]
				18909.996, -- [31]
				18910.18, -- [32]
				18910.563, -- [33]
				18910.563, -- [34]
				18913.196, -- [35]
				18913.396, -- [36]
				18824.858, -- [37]
				18824.858, -- [38]
				18824.891, -- [39]
				18825.141, -- [40]
				18825.458, -- [41]
				18827.958, -- [42]
				18828.475, -- [43]
				18830.375, -- [44]
				18831.458, -- [45]
				18834.508, -- [46]
				18837.475, -- [47]
				18838.509, -- [48]
				18839.509, -- [49]
				18840.476, -- [50]
			},
			["Fights"] = {
				["Fight2"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["洞穴爬行者"] = {
									["count"] = 48,
								},
							},
							["amount"] = 48,
						},
					},
					["TimeSpent"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 17.67,
								},
								["奥术射击"] = {
									["count"] = 2.12,
								},
								["猛禽一击"] = {
									["count"] = 0.1,
								},
								["自动射击"] = {
									["count"] = 8.929999999999998,
								},
								["多重射击"] = {
									["count"] = 2.35,
								},
								["肉搏"] = {
									["count"] = 4.08,
								},
							},
							["amount"] = 35.25000000000001,
						},
					},
					["DamageTaken"] = 201,
					["PartialResist"] = {
						["蛛网"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["盾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["蛛网"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["盾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 35.25000000000001,
					["ElementTaken"] = {
						["Melee"] = 201,
						["Physical"] = 0,
					},
					["DOT_Time"] = 48,
					["Damage"] = 10672,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 100,
									["count"] = 16,
									["amount"] = 1615,
								},
							},
							["count"] = 16,
							["amount"] = 1615,
						},
						["奥术射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 373,
									["min"] = 372,
									["count"] = 2,
									["amount"] = 745,
								},
							},
							["count"] = 2,
							["amount"] = 745,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 270,
									["min"] = 270,
									["count"] = 1,
									["amount"] = 270,
								},
							},
							["count"] = 1,
							["amount"] = 270,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 686,
									["min"] = 686,
									["count"] = 1,
									["amount"] = 686,
								},
								["Hit"] = {
									["max"] = 320,
									["min"] = 279,
									["count"] = 9,
									["amount"] = 2656,
								},
							},
							["count"] = 10,
							["amount"] = 3342,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 987,
									["min"] = 949,
									["count"] = 3,
									["amount"] = 2902,
								},
								["Hit"] = {
									["max"] = 424,
									["min"] = 408,
									["count"] = 3,
									["amount"] = 1254,
								},
							},
							["count"] = 6,
							["amount"] = 4156,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 363,
									["min"] = 121,
									["count"] = 2,
									["amount"] = 484,
								},
								["Hit"] = {
									["max"] = 60,
									["min"] = 60,
									["count"] = 1,
									["amount"] = 60,
								},
							},
							["count"] = 3,
							["amount"] = 544,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 13,
								},
							},
							["amount"] = 17,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 16,
								},
							},
							["amount"] = 16,
						},
					},
					["DamagedWho"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1615,
								},
								["奥术射击"] = {
									["count"] = 745,
								},
								["猛禽一击"] = {
									["count"] = 270,
								},
								["自动射击"] = {
									["count"] = 3342,
								},
								["多重射击"] = {
									["count"] = 4156,
								},
								["肉搏"] = {
									["count"] = 544,
								},
							},
							["amount"] = 10672,
						},
					},
					["TimeDamage"] = 35.25000000000001,
					["WhoDamaged"] = {
						["铁怒狱卒"] = {
							["Details"] = {
								["盾击"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["铁怒监军"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 201,
								},
							},
							["amount"] = 201,
						},
					},
					["ElementDone"] = {
						["Arcane"] = 745,
						["Physical"] = 7768,
						["Melee"] = 544,
						["Nature"] = 1615,
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamaging"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 17.67,
								},
								["奥术射击"] = {
									["count"] = 2.12,
								},
								["猛禽一击"] = {
									["count"] = 0.1,
								},
								["自动射击"] = {
									["count"] = 8.929999999999998,
								},
								["多重射击"] = {
									["count"] = 2.35,
								},
								["肉搏"] = {
									["count"] = 4.08,
								},
							},
							["amount"] = 35.25000000000001,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["洞穴雷霆蜥蜴"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Nature"] = 0,
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 0,
						["Arcane"] = 0,
						["Nature"] = 0,
					},
					["PartialAbsorb"] = {
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0,
								},
								["奥术射击"] = {
									["count"] = 0,
								},
								["自动射击"] = {
									["count"] = 0,
								},
								["多重射击"] = {
									["count"] = 0,
								},
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["蜥蜴之矢"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0,
								},
								["奥术射击"] = {
									["count"] = 0,
								},
								["自动射击"] = {
									["count"] = 0,
								},
								["多重射击"] = {
									["count"] = 0,
								},
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0,
								},
								["奥术射击"] = {
									["count"] = 0,
								},
								["自动射击"] = {
									["count"] = 0,
								},
								["多重射击"] = {
									["count"] = 0,
								},
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight3"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 789,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 789,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 276,
								},
								["多重射击"] = {
									["count"] = 374,
								},
								["驱散射击"] = {
									["count"] = 139,
								},
							},
							["amount"] = 789,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3.38,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["自动射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 276,
									["min"] = 276,
									["count"] = 1,
									["amount"] = 276,
								},
							},
							["count"] = 1,
							["amount"] = 276,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 374,
									["min"] = 374,
									["count"] = 1,
									["amount"] = 374,
								},
							},
							["count"] = 1,
							["amount"] = 374,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 139,
									["min"] = 139,
									["count"] = 1,
									["amount"] = 139,
								},
							},
							["count"] = 1,
							["amount"] = 139,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3.38,
					["TimeDamaging"] = {
						["春天的熊熊"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight5"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["考尔夫"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5111,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 12,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 8,
						},
						["Arcane"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 956,
						["Melee"] = 367,
						["Fire"] = 3788,
					},
					["DOT_Time"] = 24,
					["Damage"] = 5530,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 201,
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 3721,
						["Nature"] = 808,
						["Arcane"] = 1001,
					},
					["PartialAbsorb"] = {
						["地精龙枪"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["考尔夫"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 808,
								},
								["奥术射击"] = {
									["count"] = 1001,
								},
								["自动射击"] = {
									["count"] = 3721,
								},
							},
							["amount"] = 5530,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["玛尔根·长矛"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 440,
								},
								["射击"] = {
									["count"] = 434,
								},
							},
							["amount"] = 874,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 3788,
								},
							},
							["amount"] = 3788,
						},
						["塞尔德林"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 367,
								},
								["拦截昏迷"] = {
									["count"] = 82,
								},
							},
							["amount"] = 449,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["地精龙枪"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 102,
									["min"] = 99,
									["count"] = 2,
									["amount"] = 201,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 201,
							["amount"] = 11,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["考尔夫"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.97,
								},
								["奥术射击"] = {
									["count"] = 7.619999999999999,
								},
								["自动射击"] = {
									["count"] = 12.1,
								},
							},
							["amount"] = 27.69,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 27.69,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 8,
									["amount"] = 808,
								},
							},
							["count"] = 8,
							["amount"] = 808,
						},
						["奥术射击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 373,
									["min"] = 373,
									["count"] = 1,
									["amount"] = 373,
								},
								["Hit"] = {
									["max"] = 157,
									["min"] = 157,
									["count"] = 4,
									["amount"] = 628,
								},
							},
							["count"] = 6,
							["amount"] = 1001,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 782,
									["min"] = 724,
									["count"] = 2,
									["amount"] = 1506,
								},
								["Hit"] = {
									["max"] = 333,
									["min"] = 304,
									["count"] = 7,
									["amount"] = 2215,
								},
							},
							["count"] = 9,
							["amount"] = 3721,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 27.69,
					["TimeDamaging"] = {
						["考尔夫"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.97,
								},
								["奥术射击"] = {
									["count"] = 7.619999999999999,
								},
								["自动射击"] = {
									["count"] = 12.1,
								},
							},
							["amount"] = 27.69,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 9,
								},
								["雷兹尼克"] = {
									["count"] = 21,
								},
								["莱弗提"] = {
									["count"] = 12,
								},
							},
							["amount"] = 42,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1162,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 14,
								},
							},
							["amount"] = 15,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 18,
								},
							},
							["amount"] = 22,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 187,
						["Fire"] = 0,
						["Melee"] = 123,
						["Shadow"] = 852,
					},
					["DOT_Time"] = 42,
					["Damage"] = 11610,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 0,
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 159,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Nature"] = 1414,
						["Physical"] = 8889,
						["Melee"] = 209,
						["Arcane"] = 1098,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 303,
								},
								["奥术射击"] = {
									["count"] = 156,
								},
								["自动射击"] = {
									["count"] = 2267,
								},
								["瞄准射击"] = {
									["count"] = 823,
								},
								["肉搏"] = {
									["count"] = 159,
								},
							},
							["amount"] = 3708,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 404,
								},
								["自动射击"] = {
									["count"] = 1164,
								},
								["肉搏"] = {
									["count"] = 50,
								},
								["猛禽一击"] = {
									["count"] = 502,
								},
							},
							["amount"] = 2120,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 471,
								},
								["驱散射击"] = {
									["count"] = 129,
								},
								["自动射击"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 2029,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 295,
								},
							},
							["amount"] = 295,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 707,
								},
								["自动射击"] = {
									["count"] = 1361,
								},
								["奥术射击"] = {
									["count"] = 314,
								},
							},
							["amount"] = 2382,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 919,
								},
								["奥术射击"] = {
									["count"] = 157,
								},
							},
							["amount"] = 1076,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["火焰卫士"] = {
							["Details"] = {
								["火焰之盾"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 852,
								},
							},
							["amount"] = 852,
						},
						["莱弗提"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 123,
								},
							},
							["amount"] = 123,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 187,
								},
							},
							["amount"] = 187,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰之盾"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.09,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.68,
								},
								["自动射击"] = {
									["count"] = 3.17,
								},
								["肉搏"] = {
									["count"] = 0.92,
								},
								["猛禽一击"] = {
									["count"] = 1.23,
								},
							},
							["amount"] = 10,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 4.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.780000000000001,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.52,
								},
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.02,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.9,
								},
								["自动射击"] = {
									["count"] = 5.07,
								},
								["奥术射击"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 15.47,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["坚韧祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护暗影 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 50.36,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 2,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 14,
									["amount"] = 1414,
								},
							},
							["count"] = 14,
							["amount"] = 1414,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 157,
									["min"] = 156,
									["count"] = 7,
									["amount"] = 1098,
								},
							},
							["count"] = 7,
							["amount"] = 1098,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 502,
									["min"] = 502,
									["count"] = 1,
									["amount"] = 502,
								},
							},
							["count"] = 1,
							["amount"] = 502,
						},
						["毒蛇钉刺"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 823,
									["min"] = 823,
									["count"] = 1,
									["amount"] = 823,
								},
							},
							["count"] = 1,
							["amount"] = 823,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 919,
									["min"] = 647,
									["count"] = 3,
									["amount"] = 2314,
								},
								["Hit"] = {
									["max"] = 383,
									["min"] = 257,
									["count"] = 16,
									["amount"] = 5121,
								},
							},
							["count"] = 19,
							["amount"] = 7435,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 129,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 129,
								},
							},
							["count"] = 1,
							["amount"] = 129,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 1,
									["amount"] = 50,
								},
								["Absorb"] = {
									["max"] = 159,
									["min"] = 159,
									["count"] = 1,
									["amount"] = 159,
								},
							},
							["count"] = 2,
							["amount"] = 209,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 50.36,
					["TimeDamaging"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.09,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.68,
								},
								["自动射击"] = {
									["count"] = 3.17,
								},
								["肉搏"] = {
									["count"] = 0.92,
								},
								["猛禽一击"] = {
									["count"] = 1.23,
								},
							},
							["amount"] = 10,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 4.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.780000000000001,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.52,
								},
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.02,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.9,
								},
								["自动射击"] = {
									["count"] = 5.07,
								},
								["奥术射击"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 15.47,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 9,
								},
								["雷兹尼克"] = {
									["count"] = 21,
								},
								["莱弗提"] = {
									["count"] = 12,
								},
							},
							["amount"] = 42,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1162,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 14,
								},
							},
							["amount"] = 15,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 18,
								},
							},
							["amount"] = 22,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 187,
						["Fire"] = 0,
						["Melee"] = 123,
						["Shadow"] = 852,
					},
					["DOT_Time"] = 42,
					["Damage"] = 11610,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 0,
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 159,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Nature"] = 1414,
						["Physical"] = 8889,
						["Melee"] = 209,
						["Arcane"] = 1098,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 303,
								},
								["奥术射击"] = {
									["count"] = 156,
								},
								["自动射击"] = {
									["count"] = 2267,
								},
								["瞄准射击"] = {
									["count"] = 823,
								},
								["肉搏"] = {
									["count"] = 159,
								},
							},
							["amount"] = 3708,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 404,
								},
								["自动射击"] = {
									["count"] = 1164,
								},
								["肉搏"] = {
									["count"] = 50,
								},
								["猛禽一击"] = {
									["count"] = 502,
								},
							},
							["amount"] = 2120,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 471,
								},
								["驱散射击"] = {
									["count"] = 129,
								},
								["自动射击"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 2029,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 295,
								},
							},
							["amount"] = 295,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 707,
								},
								["自动射击"] = {
									["count"] = 1361,
								},
								["奥术射击"] = {
									["count"] = 314,
								},
							},
							["amount"] = 2382,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 919,
								},
								["奥术射击"] = {
									["count"] = 157,
								},
							},
							["amount"] = 1076,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["火焰卫士"] = {
							["Details"] = {
								["火焰之盾"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 852,
								},
							},
							["amount"] = 852,
						},
						["莱弗提"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 123,
								},
							},
							["amount"] = 123,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 187,
								},
							},
							["amount"] = 187,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰之盾"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.09,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.68,
								},
								["自动射击"] = {
									["count"] = 3.17,
								},
								["肉搏"] = {
									["count"] = 0.92,
								},
								["猛禽一击"] = {
									["count"] = 1.23,
								},
							},
							["amount"] = 10,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 4.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.780000000000001,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.52,
								},
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.02,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.9,
								},
								["自动射击"] = {
									["count"] = 5.07,
								},
								["奥术射击"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 15.47,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["坚韧祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护暗影 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 50.36,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 2,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 14,
									["amount"] = 1414,
								},
							},
							["count"] = 14,
							["amount"] = 1414,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 157,
									["min"] = 156,
									["count"] = 7,
									["amount"] = 1098,
								},
							},
							["count"] = 7,
							["amount"] = 1098,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 502,
									["min"] = 502,
									["count"] = 1,
									["amount"] = 502,
								},
							},
							["count"] = 1,
							["amount"] = 502,
						},
						["毒蛇钉刺"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 823,
									["min"] = 823,
									["count"] = 1,
									["amount"] = 823,
								},
							},
							["count"] = 1,
							["amount"] = 823,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 919,
									["min"] = 647,
									["count"] = 3,
									["amount"] = 2314,
								},
								["Hit"] = {
									["max"] = 383,
									["min"] = 257,
									["count"] = 16,
									["amount"] = 5121,
								},
							},
							["count"] = 19,
							["amount"] = 7435,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 129,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 129,
								},
							},
							["count"] = 1,
							["amount"] = 129,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 1,
									["amount"] = 50,
								},
								["Absorb"] = {
									["max"] = 159,
									["min"] = 159,
									["count"] = 1,
									["amount"] = 159,
								},
							},
							["count"] = 2,
							["amount"] = 209,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 50.36,
					["TimeDamaging"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.09,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.68,
								},
								["自动射击"] = {
									["count"] = 3.17,
								},
								["肉搏"] = {
									["count"] = 0.92,
								},
								["猛禽一击"] = {
									["count"] = 1.23,
								},
							},
							["amount"] = 10,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 4.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.780000000000001,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.52,
								},
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.02,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.9,
								},
								["自动射击"] = {
									["count"] = 5.07,
								},
								["奥术射击"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 15.47,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 9,
								},
								["莱弗提"] = {
									["count"] = 12,
								},
								["洞穴爬行者"] = {
									["count"] = 48,
								},
								["洞穴雷霆蜥蜴"] = {
									["count"] = 21,
								},
								["雷兹尼克"] = {
									["count"] = 21,
								},
								["考尔夫"] = {
									["count"] = 24,
								},
							},
							["amount"] = 135,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 13,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7,
						},
					},
					["DamageTaken"] = 7555,
					["ElementTakenResist"] = {
						["Fire"] = 221,
					},
					["PartialResist"] = {
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["蛛网"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 102,
									["min"] = 99,
									["count"] = 2,
									["amount"] = 201,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 201,
							["amount"] = 11,
						},
						["火焰之盾"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 1,
									["amount"] = 20,
								},
							},
							["count"] = 20,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["盾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["蜥蜴之矢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["蛛网"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地精龙枪"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["火焰之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["盾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 145.05,
					["ElementTaken"] = {
						["Physical"] = 1400,
						["Melee"] = 1148,
						["Fire"] = 3808,
						["Shadow"] = 852,
						["Nature"] = 347,
					},
					["DOT_Time"] = 135,
					["Damage"] = 39300,
					["WhoDispelled"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["坚韧祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护暗影 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Healing"] = 0,
					["Dispelled"] = 2,
					["ElementDoneAbsorb"] = {
						["Physical"] = 159,
					},
					["Attacks"] = {
						["毒蛇钉刺"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 919,
									["min"] = 647,
									["count"] = 7,
									["amount"] = 5248,
								},
								["Hit"] = {
									["max"] = 383,
									["min"] = 257,
									["count"] = 41,
									["amount"] = 12768,
								},
							},
							["count"] = 48,
							["amount"] = 18016,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 823,
									["min"] = 823,
									["count"] = 1,
									["amount"] = 823,
								},
							},
							["count"] = 1,
							["amount"] = 823,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 100,
									["count"] = 45,
									["amount"] = 4544,
								},
							},
							["count"] = 45,
							["amount"] = 4544,
						},
						["奥术射击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 373,
									["min"] = 372,
									["count"] = 3,
									["amount"] = 1118,
								},
								["Hit"] = {
									["max"] = 157,
									["min"] = 156,
									["count"] = 15,
									["amount"] = 2354,
								},
							},
							["count"] = 19,
							["amount"] = 3472,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 502,
									["min"] = 502,
									["count"] = 1,
									["amount"] = 502,
								},
								["Hit"] = {
									["max"] = 270,
									["min"] = 270,
									["count"] = 1,
									["amount"] = 270,
								},
							},
							["count"] = 2,
							["amount"] = 772,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1045,
									["min"] = 949,
									["count"] = 6,
									["amount"] = 5987,
								},
								["Hit"] = {
									["max"] = 435,
									["min"] = 374,
									["count"] = 10,
									["amount"] = 4156,
								},
							},
							["count"] = 16,
							["amount"] = 10143,
						},
						["驱散射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 357,
									["min"] = 357,
									["count"] = 1,
									["amount"] = 357,
								},
								["Hit"] = {
									["max"] = 152,
									["min"] = 129,
									["count"] = 3,
									["amount"] = 420,
								},
							},
							["count"] = 4,
							["amount"] = 777,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 1,
									["amount"] = 50,
								},
								["Absorb"] = {
									["max"] = 159,
									["min"] = 159,
									["count"] = 1,
									["amount"] = 159,
								},
								["Crit"] = {
									["max"] = 363,
									["min"] = 121,
									["count"] = 2,
									["amount"] = 484,
								},
								["Hit"] = {
									["max"] = 60,
									["min"] = 60,
									["count"] = 1,
									["amount"] = 60,
								},
							},
							["count"] = 5,
							["amount"] = 753,
						},
					},
					["TimeSpent"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.52,
								},
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.02,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.09,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.68,
								},
								["自动射击"] = {
									["count"] = 3.17,
								},
								["肉搏"] = {
									["count"] = 0.92,
								},
								["猛禽一击"] = {
									["count"] = 1.23,
								},
							},
							["amount"] = 10,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 17.67,
								},
								["奥术射击"] = {
									["count"] = 2.12,
								},
								["猛禽一击"] = {
									["count"] = 0.1,
								},
								["自动射击"] = {
									["count"] = 8.929999999999998,
								},
								["多重射击"] = {
									["count"] = 2.35,
								},
								["肉搏"] = {
									["count"] = 4.08,
								},
							},
							["amount"] = 35.25000000000001,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 8.65,
								},
								["奥术射击"] = {
									["count"] = 4.72,
								},
								["自动射击"] = {
									["count"] = 8.51,
								},
								["多重射击"] = {
									["count"] = 3.77,
								},
								["驱散射击"] = {
									["count"] = 1.22,
								},
							},
							["amount"] = 26.87,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 4.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.780000000000001,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.9,
								},
								["自动射击"] = {
									["count"] = 5.07,
								},
								["奥术射击"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 15.47,
						},
						["考尔夫"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.97,
								},
								["奥术射击"] = {
									["count"] = 7.619999999999999,
								},
								["自动射击"] = {
									["count"] = 12.1,
								},
							},
							["amount"] = 27.69,
						},
					},
					["DamagedWho"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 152,
								},
							},
							["amount"] = 152,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 276,
								},
								["多重射击"] = {
									["count"] = 374,
								},
								["驱散射击"] = {
									["count"] = 139,
								},
							},
							["amount"] = 789,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 919,
								},
								["奥术射击"] = {
									["count"] = 157,
								},
							},
							["amount"] = 1076,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 295,
								},
							},
							["amount"] = 295,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 303,
								},
								["奥术射击"] = {
									["count"] = 156,
								},
								["自动射击"] = {
									["count"] = 2267,
								},
								["瞄准射击"] = {
									["count"] = 823,
								},
								["肉搏"] = {
									["count"] = 159,
								},
							},
							["amount"] = 3708,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 404,
								},
								["自动射击"] = {
									["count"] = 1164,
								},
								["肉搏"] = {
									["count"] = 50,
								},
								["猛禽一击"] = {
									["count"] = 502,
								},
							},
							["amount"] = 2120,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1615,
								},
								["奥术射击"] = {
									["count"] = 745,
								},
								["猛禽一击"] = {
									["count"] = 270,
								},
								["自动射击"] = {
									["count"] = 3342,
								},
								["多重射击"] = {
									["count"] = 4156,
								},
								["肉搏"] = {
									["count"] = 544,
								},
							},
							["amount"] = 10672,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 707,
								},
								["奥术射击"] = {
									["count"] = 628,
								},
								["自动射击"] = {
									["count"] = 3242,
								},
								["多重射击"] = {
									["count"] = 5613,
								},
								["驱散射击"] = {
									["count"] = 357,
								},
							},
							["amount"] = 10547,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 471,
								},
								["驱散射击"] = {
									["count"] = 129,
								},
								["自动射击"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 2029,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 707,
								},
								["自动射击"] = {
									["count"] = 1361,
								},
								["奥术射击"] = {
									["count"] = 314,
								},
							},
							["amount"] = 2382,
						},
						["考尔夫"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 808,
								},
								["奥术射击"] = {
									["count"] = 1001,
								},
								["自动射击"] = {
									["count"] = 3721,
								},
							},
							["amount"] = 5530,
						},
					},
					["TimeDamage"] = 145.05,
					["WhoDamaged"] = {
						["铁怒狱卒"] = {
							["Details"] = {
								["盾击"] = {
									["count"] = 17,
								},
								["肉搏"] = {
									["count"] = 330,
								},
							},
							["amount"] = 347,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 440,
								},
								["射击"] = {
									["count"] = 434,
								},
							},
							["amount"] = 874,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 3788,
								},
							},
							["amount"] = 3788,
						},
						["莱弗提"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 123,
								},
							},
							["amount"] = 123,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 852,
								},
							},
							["amount"] = 852,
						},
						["铁怒监军"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 127,
								},
							},
							["amount"] = 127,
						},
						["塞尔德林"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 367,
								},
								["拦截昏迷"] = {
									["count"] = 82,
								},
							},
							["amount"] = 449,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["蜥蜴之矢"] = {
									["count"] = 347,
								},
							},
							["amount"] = 347,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 201,
								},
							},
							["amount"] = 201,
						},
						["火焰卫士"] = {
							["Details"] = {
								["火焰之盾"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 427,
								},
							},
							["amount"] = 427,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 19,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 15,
								},
								["Hit"] = {
									["count"] = 56,
								},
							},
							["amount"] = 71,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 45,
								},
							},
							["amount"] = 46,
						},
					},
					["ElementDone"] = {
						["Arcane"] = 3472,
						["Physical"] = 30531,
						["Melee"] = 753,
						["Nature"] = 4544,
					},
					["TimeDamaging"] = {
						["火焰卫士"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["春天的熊熊"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
						["沃莉达"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["奥金幼龙"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.52,
								},
								["毒蛇钉刺"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.02,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.09,
						},
						["莱弗提"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.68,
								},
								["自动射击"] = {
									["count"] = 3.17,
								},
								["肉搏"] = {
									["count"] = 0.92,
								},
								["猛禽一击"] = {
									["count"] = 1.23,
								},
							},
							["amount"] = 10,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 17.67,
								},
								["奥术射击"] = {
									["count"] = 2.12,
								},
								["猛禽一击"] = {
									["count"] = 0.1,
								},
								["自动射击"] = {
									["count"] = 8.929999999999998,
								},
								["多重射击"] = {
									["count"] = 2.35,
								},
								["肉搏"] = {
									["count"] = 4.08,
								},
							},
							["amount"] = 35.25000000000001,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 8.65,
								},
								["奥术射击"] = {
									["count"] = 4.72,
								},
								["自动射击"] = {
									["count"] = 8.51,
								},
								["多重射击"] = {
									["count"] = 3.77,
								},
								["驱散射击"] = {
									["count"] = 1.22,
								},
							},
							["amount"] = 26.87,
						},
						["塞尔德林"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 4.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.780000000000001,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.9,
								},
								["自动射击"] = {
									["count"] = 5.07,
								},
								["奥术射击"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 15.47,
						},
						["考尔夫"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.97,
								},
								["奥术射击"] = {
									["count"] = 7.619999999999999,
								},
								["自动射击"] = {
									["count"] = 12.1,
								},
							},
							["amount"] = 27.69,
						},
					},
				},
			},
			["UnitLockout"] = 18723.169,
			["LastActive"] = 18913.18,
		},
		["法夜"] = {
			["GUID"] = "Player-5458-02E7AC98",
			["LastEventHealth"] = {
				2142, -- [1]
				2142, -- [2]
				2113, -- [3]
				1986, -- [4]
				1282, -- [5]
				1282, -- [6]
				1396, -- [7]
				1396, -- [8]
				1516, -- [9]
				1516, -- [10]
				1635, -- [11]
				1635, -- [12]
				1748, -- [13]
				1748, -- [14]
				2528, -- [15]
				2528, -- [16]
				2247, -- [17]
				2247, -- [18]
				2096, -- [19]
				1854, -- [20]
				1802, -- [21]
				1671, -- [22]
				1618, -- [23]
				1618, -- [24]
				1484, -- [25]
				1432, -- [26]
				1432, -- [27]
				1551, -- [28]
				1551, -- [29]
				1664, -- [30]
				1677, -- [31]
				1677, -- [32]
				1683, -- [33]
				1683, -- [34]
				1683, -- [35]
				1797, -- [36]
				1797, -- [37]
				1910, -- [38]
				1916, -- [39]
				1916, -- [40]
				2029, -- [41]
				2029, -- [42]
				2142, -- [43]
				2142, -- [44]
				2148, -- [45]
				2148, -- [46]
				2261, -- [47]
				2261, -- [48]
				2390, -- [49]
				2390, -- [50]
			},
			["LastAttackedBy"] = "莱弗提",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"MISC", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"HEAL", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"DAMAGE", -- [15]
				"MISC", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"HEAL", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"HEAL", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"HEAL", -- [40]
				"DAMAGE", -- [41]
				"HEAL", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"HEAL", -- [46]
				"DAMAGE", -- [47]
				"HEAL", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					32.83, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["Healing"] = {
					3809, -- [1]
				},
				["DamageTaken"] = {
					9584, -- [1]
				},
				["HealingTaken"] = {
					3809, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					120.2499999999999, -- [1]
				},
				["ActiveTime"] = {
					153.0799999999999, -- [1]
				},
				["ManaGain"] = {
					2964, -- [1]
				},
				["DOT_Time"] = {
					387, -- [1]
				},
				["Damage"] = {
					21606, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						false, -- [32]
					},
					["Messages"] = {
						"法夜 暗影箭 考尔夫 Hit -789 (Shadow)", -- [1]
						"玛尔根·长矛 多重射击 法夜 Hit -315 (Arcane)", -- [2]
						"考尔夫 冰霜震击 法夜 Hit -682 (Frost)", -- [3]
						"考尔夫 肉搏 法夜 Hit -173 (Physical)", -- [4]
						"法夜 痛苦诅咒 (伤害/跳) 考尔夫 Tick -125 (Shadow)", -- [5]
						"法夜 腐蚀术 (伤害/跳) 考尔夫 Tick -174 (Shadow)", -- [6]
						"法夜 生命虹吸 (伤害/跳) 考尔夫 Tick -64 (Shadow)", -- [7]
						"法夜 生命虹吸 法夜 Hit +64", -- [8]
						"法夜 痛苦诅咒 (伤害/跳) 考尔夫 Tick -124 (Shadow)", -- [9]
						"法夜 吸取生命 (伤害/跳) 考尔夫 Tick -113 (Shadow)", -- [10]
						"法夜 吸取生命 法夜 Hit +113", -- [11]
						"法夜 痛苦诅咒 (伤害/跳) 考尔夫 Tick -124 (Shadow)", -- [12]
						"考尔夫 肉搏 法夜 Hit -156 (Physical)", -- [13]
						"法夜 腐蚀术 (伤害/跳) 考尔夫 Tick -174 (Shadow)", -- [14]
						"塞尔德林 肉搏 法夜 Hit -452 (Physical)", -- [15]
						"法夜 生命虹吸 (伤害/跳) 考尔夫 Tick -63 (Shadow)", -- [16]
						"法夜 生命虹吸 法夜 Hit +63", -- [17]
						"塞尔德林 断筋 法夜 Hit -37 (Physical)", -- [18]
						"法夜 痛苦诅咒 (伤害/跳) 考尔夫 Tick -175 (Shadow)", -- [19]
						"考尔夫 肉搏 法夜 Hit -177 (Physical)", -- [20]
						"法夜 生命虹吸 (伤害/跳) 考尔夫 Tick -64 (Shadow)", -- [21]
						"法夜 生命虹吸 法夜 Hit +64", -- [22]
						"考尔夫 肉搏 法夜 Hit -177 (Physical)", -- [23]
						"法夜 痛苦诅咒 (伤害/跳) 考尔夫 Tick -175 (Shadow)", -- [24]
						"塞尔德林 肉搏 法夜 Hit -418 (Physical)", -- [25]
						"塞尔德林 致死打击 法夜 Hit -605 (Physical)", -- [26]
						"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -175 (Shadow)", -- [27]
						"塞尔德林 断筋 法夜 Hit -37 (Physical)", -- [28]
						"塞尔德林 肉搏 法夜 Hit -431 (Physical)", -- [29]
						"斯诺恩·黑骨 灼烧 法夜 Hit -266 (89 被抵抗) (Fire)", -- [30]
						"法夜死亡。", -- [31]
						"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [32]
					},
					["DeathAt"] = 17952.172,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
					},
					["MessageTimes"] = {
						-14.83499999999913, -- [1]
						-14.8179999999993, -- [2]
						-14.46800000000076, -- [3]
						-14.18400000000111, -- [4]
						-13.61800000000221, -- [5]
						-12.13400000000183, -- [6]
						-12.10100000000239, -- [7]
						-12.10100000000239, -- [8]
						-11.61800000000221, -- [9]
						-10.10100000000239, -- [10]
						-10.10100000000239, -- [11]
						-9.617000000002008, -- [12]
						-9.550999999999476, -- [13]
						-9.117000000002008, -- [14]
						-9.117000000002008, -- [15]
						-9.117000000002008, -- [16]
						-9.117000000002008, -- [17]
						-8.001000000000204, -- [18]
						-7.617000000002008, -- [19]
						-7.550999999999476, -- [20]
						-6.117000000002008, -- [21]
						-6.117000000002008, -- [22]
						-6.016999999999825, -- [23]
						-5.617000000002008, -- [24]
						-5.316999999999098, -- [25]
						-4.766999999999825, -- [26]
						-1.950000000000728, -- [27]
						-1.533999999999651, -- [28]
						-1.5, -- [29]
						-0.03399999999965075, -- [30]
						0, -- [31]
						1.049999999999272, -- [32]
					},
					["HealthMax"] = {
						4524, -- [1]
						4524, -- [2]
						4524, -- [3]
						4524, -- [4]
						4524, -- [5]
						4524, -- [6]
						4524, -- [7]
						4524, -- [8]
						4524, -- [9]
						4524, -- [10]
						4524, -- [11]
						4524, -- [12]
						4524, -- [13]
						4524, -- [14]
						4524, -- [15]
						4524, -- [16]
						4524, -- [17]
						4524, -- [18]
						4524, -- [19]
						4524, -- [20]
						4524, -- [21]
						4524, -- [22]
						4524, -- [23]
						4524, -- [24]
						4524, -- [25]
						4524, -- [26]
						4524, -- [27]
						4524, -- [28]
						4524, -- [29]
						4524, -- [30]
						3724, -- [31]
						3724, -- [32]
					},
					["Health"] = {
						3529, -- [1]
						3529, -- [2]
						3214, -- [3]
						3214, -- [4]
						2359, -- [5]
						2365, -- [6]
						2365, -- [7]
						2365, -- [8]
						2429, -- [9]
						2435, -- [10]
						2435, -- [11]
						2548, -- [12]
						2548, -- [13]
						2398, -- [14]
						2398, -- [15]
						2398, -- [16]
						2398, -- [17]
						2009, -- [18]
						2009, -- [19]
						1972, -- [20]
						1801, -- [21]
						1801, -- [22]
						1801, -- [23]
						1688, -- [24]
						1694, -- [25]
						1276, -- [26]
						677, -- [27]
						677, -- [28]
						646, -- [29]
						215, -- [30]
						0, -- [31]
						0, -- [32]
					},
					["KilledBy"] = "斯诺恩·黑骨",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"HEAL", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"HEAL", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"HEAL", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"HEAL", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"MISC", -- [31]
						"DAMAGE", -- [32]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 8,
			["LastHealTime"] = 18913.863,
			["type"] = "Ungrouped",
			["FightsSaved"] = 5,
			["LastEventHealthMax"] = {
				4524, -- [1]
				4524, -- [2]
				4524, -- [3]
				4524, -- [4]
				4524, -- [5]
				4524, -- [6]
				4524, -- [7]
				4524, -- [8]
				4524, -- [9]
				4524, -- [10]
				4524, -- [11]
				4524, -- [12]
				4524, -- [13]
				4524, -- [14]
				4524, -- [15]
				4524, -- [16]
				4524, -- [17]
				4524, -- [18]
				4524, -- [19]
				4524, -- [20]
				4524, -- [21]
				4524, -- [22]
				4524, -- [23]
				4524, -- [24]
				4524, -- [25]
				4524, -- [26]
				4524, -- [27]
				4524, -- [28]
				4524, -- [29]
				4524, -- [30]
				4524, -- [31]
				4524, -- [32]
				4524, -- [33]
				4524, -- [34]
				4524, -- [35]
				4524, -- [36]
				4524, -- [37]
				4524, -- [38]
				4524, -- [39]
				4524, -- [40]
				4524, -- [41]
				4524, -- [42]
				4524, -- [43]
				4524, -- [44]
				4524, -- [45]
				4524, -- [46]
				4524, -- [47]
				4524, -- [48]
				4524, -- [49]
				4524, -- [50]
			},
			["LastDamageTaken"] = 71,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 18913.18,
				["Dispelled"] = 17915.17,
				["OVERALL"] = 18913.18,
				["DamageTaken"] = 18902.179,
				["DeathCount"] = 17950.172,
				["HealingTaken"] = 18913.18,
				["Healing"] = 18913.18,
				["ActiveTime"] = 18913.18,
				["TimeDamage"] = 18913.18,
				["ManaGain"] = 18906.179,
				["DOT_Time"] = 18913.18,
				["Damage"] = 18913.18,
			},
			["NextEventNum"] = 15,
			["LastDamageTime"] = 18913.863,
			["LastEvents"] = {
				"莱弗提 蹬踏 法夜 Hit -35 (Physical)", -- [1]
				"莱弗提 interrupts 法夜 暗影箭 (蹬踏)", -- [2]
				"莱弗提 肉搏 法夜 Hit -127 (Physical)", -- [3]
				"莱弗提 肉搏 法夜 Hit -71 (Physical)", -- [4]
				"法夜 吸取生命 (伤害/跳) 莱弗提 Tick -114 (Shadow)", -- [5]
				"法夜 吸取生命 法夜 Hit +114", -- [6]
				"法夜 吸取生命 (伤害/跳) 莱弗提 Tick -114 (Shadow)", -- [7]
				"法夜 吸取生命 法夜 Hit +114", -- [8]
				"法夜 吸取生命 (伤害/跳) 莱弗提 Tick -113 (Shadow)", -- [9]
				"法夜 吸取生命 法夜 Hit +113", -- [10]
				"法夜 吸取生命 (伤害/跳) 莱弗提 Tick -113 (Shadow)", -- [11]
				"法夜 吸取生命 法夜 Hit +113", -- [12]
				"法夜 吸取生命 (伤害/跳) 莱弗提 Tick -113 (Shadow)", -- [13]
				"法夜 吸取生命 法夜 Hit +113", -- [14]
				"莱弗提 蹬踏 法夜 Hit -35 (Physical)", -- [15]
				"莱弗提 interrupts 法夜 恐惧术 (蹬踏)", -- [16]
				"莱弗提 肉搏 法夜 Miss (1)", -- [17]
				"莱弗提 击倒 法夜 Hit -151 (Physical)", -- [18]
				"莱弗提 肉搏 法夜 Crit -242 (Physical)", -- [19]
				"莱弗提 肉搏 法夜 Hit -58 (Physical)", -- [20]
				"莱弗提 肉搏 法夜 Hit -131 (Physical)", -- [21]
				"塞尔德林 拦截昏迷 法夜 Hit -53 (Physical)", -- [22]
				"莱弗提 肉搏 法夜 Miss (1)", -- [23]
				"莱弗提 肉搏 法夜 Hit -140 (Physical)", -- [24]
				"莱弗提 肉搏 法夜 Hit -64 (Physical)", -- [25]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [26]
				"法夜 吸取生命 法夜 Hit +113", -- [27]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [28]
				"法夜 吸取生命 法夜 Hit +113", -- [29]
				"莱弗提 肉搏 法夜 Miss (1)", -- [30]
				"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [31]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [32]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -114 (Shadow)", -- [33]
				"法夜 吸取生命 法夜 Hit +114", -- [34]
				"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [35]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [36]
				"法夜 吸取生命 法夜 Hit +113", -- [37]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [38]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [39]
				"法夜 吸取生命 法夜 Hit +113", -- [40]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [41]
				"法夜 吸取生命 法夜 Hit +113", -- [42]
				"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [43]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [44]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [45]
				"法夜 吸取生命 法夜 Hit +113", -- [46]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -114 (Shadow)", -- [47]
				"法夜 吸取生命 法夜 Hit +105", -- [48]
				"莱弗提 肉搏 法夜 Hit -116 (Physical)", -- [49]
				"莱弗提 肉搏 法夜 Crit -132 (Physical)", -- [50]
			},
			["Name"] = "法夜",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				18902.496, -- [1]
				18902.496, -- [2]
				18902.846, -- [3]
				18903.113, -- [4]
				18909.846, -- [5]
				18909.846, -- [6]
				18910.863, -- [7]
				18910.863, -- [8]
				18911.863, -- [9]
				18911.863, -- [10]
				18912.863, -- [11]
				18912.863, -- [12]
				18913.863, -- [13]
				18913.863, -- [14]
				18871.727, -- [15]
				18871.727, -- [16]
				18872.478, -- [17]
				18872.944, -- [18]
				18873.227, -- [19]
				18873.978, -- [20]
				18874.728, -- [21]
				18874.961, -- [22]
				18875.478, -- [23]
				18876.228, -- [24]
				18876.978, -- [25]
				18881.611, -- [26]
				18881.611, -- [27]
				18882.611, -- [28]
				18882.611, -- [29]
				18884.278, -- [30]
				18886.445, -- [31]
				18888.645, -- [32]
				18889.162, -- [33]
				18889.162, -- [34]
				18889.428, -- [35]
				18890.162, -- [36]
				18890.162, -- [37]
				18890.645, -- [38]
				18891.162, -- [39]
				18891.162, -- [40]
				18892.145, -- [41]
				18892.145, -- [42]
				18892.429, -- [43]
				18892.645, -- [44]
				18893.379, -- [45]
				18893.379, -- [46]
				18894.379, -- [47]
				18894.379, -- [48]
				18901.346, -- [49]
				18901.596, -- [50]
			},
			["Fights"] = {
				["Fight2"] = {
					["DOTs"] = {
						["吸取灵魂 (伤害/跳)"] = {
							["Details"] = {
								["洞穴爬行者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["洞穴爬行者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["洞穴爬行者"] = {
									["count"] = 42,
								},
							},
							["amount"] = 42,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 63,
					["Damage"] = 1828,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 1828,
					},
					["PartialAbsorb"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["吸取灵魂 (伤害/跳)"] = {
									["count"] = 120,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 522,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1186,
								},
							},
							["amount"] = 1828,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["法夜"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 621,
								},
							},
							["amount"] = 621,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["法夜"] = {
									["count"] = 621,
								},
							},
							["amount"] = 621,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["吸取灵魂 (伤害/跳)"] = {
									["count"] = 4.35,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 17.21,
								},
							},
							["amount"] = 25.08,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 25.08,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["吸取灵魂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 30,
									["min"] = 30,
									["count"] = 4,
									["amount"] = 120,
								},
							},
							["count"] = 4,
							["amount"] = 120,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 174,
									["min"] = 174,
									["count"] = 3,
									["amount"] = 522,
								},
							},
							["count"] = 3,
							["amount"] = 522,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 124,
									["min"] = 74,
									["count"] = 14,
									["amount"] = 1186,
								},
							},
							["count"] = 14,
							["amount"] = 1186,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 25.08,
					["TimeDamaging"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["吸取灵魂 (伤害/跳)"] = {
									["count"] = 4.35,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 17.21,
								},
							},
							["amount"] = 25.08,
						},
					},
					["ManaGain"] = 621,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight5"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["考尔夫"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["考尔夫"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["塞尔德林"] = {
									["count"] = 18,
								},
								["考尔夫"] = {
									["count"] = 18,
								},
							},
							["amount"] = 36,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["考尔夫"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5297,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 31,
								},
							},
							["amount"] = 33,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 1226,
						["Melee"] = 2808,
						["Arcane"] = 315,
						["Fire"] = 266,
						["Frost"] = 682,
					},
					["DOT_Time"] = 93,
					["Damage"] = 5327,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 12.12,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 89,
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 5327,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1045,
								},
							},
							["amount"] = 1629,
						},
						["考尔夫"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 381,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1143,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 341,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1044,
								},
								["暗影箭"] = {
									["count"] = 789,
								},
							},
							["amount"] = 3698,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 266,
								},
							},
							["amount"] = 266,
						},
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 683,
								},
								["冰霜震击"] = {
									["count"] = 682,
								},
							},
							["amount"] = 1365,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 315,
								},
							},
							["amount"] = 315,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1152,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["肉搏"] = {
									["count"] = 2125,
								},
							},
							["amount"] = 3351,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 89,
									["min"] = 89,
									["count"] = 1,
									["amount"] = 89,
								},
							},
							["count"] = 89,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.62,
								},
								["吸取生命"] = {
									["count"] = 3.3,
								},
								["生命虹吸"] = {
									["count"] = 8.2,
								},
							},
							["amount"] = 12.12,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["法夜"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 781,
								},
							},
							["amount"] = 781,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命"] = {
									["count"] = 341,
								},
								["生命虹吸"] = {
									["count"] = 381,
								},
							},
							["amount"] = 1306,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["法夜"] = {
									["count"] = 781,
								},
							},
							["amount"] = 781,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.62,
								},
								["吸取生命"] = {
									["count"] = 3.3,
								},
								["生命虹吸"] = {
									["count"] = 8.2,
								},
							},
							["amount"] = 12.12,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.62,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9.620000000000001,
						},
						["考尔夫"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.55,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.24,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.96,
								},
								["暗影箭"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 18.83,
						},
					},
					["WhoDispelled"] = {
						["牛攵"] = {
							["Details"] = {
								["变形术 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 1,
									["amount"] = 584,
								},
							},
							["count"] = 1,
							["amount"] = 584,
						},
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 114,
									["min"] = 113,
									["count"] = 3,
									["amount"] = 341,
								},
							},
							["count"] = 3,
							["amount"] = 341,
						},
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 64,
									["min"] = 63,
									["count"] = 6,
									["amount"] = 381,
								},
							},
							["count"] = 6,
							["amount"] = 381,
						},
					},
					["WhoHealed"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命"] = {
									["count"] = 341,
								},
								["生命虹吸"] = {
									["count"] = 381,
								},
							},
							["amount"] = 1306,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 40.57000000000001,
					["Healing"] = 1306,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 1,
									["amount"] = 584,
								},
							},
							["count"] = 1,
							["amount"] = 584,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 64,
									["min"] = 63,
									["count"] = 6,
									["amount"] = 381,
								},
							},
							["count"] = 6,
							["amount"] = 381,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 73,
									["count"] = 10,
									["amount"] = 1143,
								},
							},
							["count"] = 10,
							["amount"] = 1143,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 114,
									["min"] = 113,
									["count"] = 3,
									["amount"] = 341,
								},
							},
							["count"] = 3,
							["amount"] = 341,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 174,
									["count"] = 12,
									["amount"] = 2089,
								},
							},
							["count"] = 12,
							["amount"] = 2089,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 789,
									["min"] = 789,
									["count"] = 1,
									["amount"] = 789,
								},
							},
							["count"] = 1,
							["amount"] = 789,
						},
					},
					["HealingTaken"] = 1306,
					["RageGain"] = 0,
					["TimeDamage"] = 28.45,
					["TimeDamaging"] = {
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.62,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9.620000000000001,
						},
						["考尔夫"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.55,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.24,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.96,
								},
								["暗影箭"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 18.83,
						},
					},
					["ManaGain"] = 781,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
						["火焰之雨 (伤害/跳)"] = {
							["Details"] = {
								["洞穴雷霆蜥蜴"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["洞穴雷霆蜥蜴"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
					["ElementTaken"] = {
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["Attacks"] = {
						["火焰之雨 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["火焰之雨 (伤害/跳)"] = {
									["count"] = 0,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 0,
						["Fire"] = 0,
					},
					["TimeSpent"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["火焰之雨 (伤害/跳)"] = {
									["count"] = 0,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["火焰之雨 (伤害/跳)"] = {
									["count"] = 0,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["塞尔德林"] = {
									["count"] = 24,
								},
								["莱弗提"] = {
									["count"] = 15,
								},
								["沃莉达"] = {
									["count"] = 12,
								},
							},
							["amount"] = 51,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 9,
								},
								["自爆绵羊"] = {
									["count"] = 6,
								},
								["塞尔德林"] = {
									["count"] = 45,
								},
							},
							["amount"] = 60,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["塞尔德林"] = {
									["count"] = 45,
								},
								["瓦亚辛"] = {
									["count"] = 18,
								},
							},
							["amount"] = 63,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4064,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 58,
								},
							},
							["amount"] = 62,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 370,
						["Shadow"] = 852,
						["Melee"] = 1759,
						["Physical"] = 1083,
					},
					["DOT_Time"] = 174,
					["Damage"] = 9883,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 20.71,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 9883,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["击倒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1630,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 522,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 545,
								},
							},
							["amount"] = 2697,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 349,
								},
							},
							["amount"] = 349,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 906,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2610,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1715,
								},
							},
							["amount"] = 5815,
						},
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 455,
								},
							},
							["amount"] = 455,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 852,
								},
							},
							["amount"] = 852,
						},
						["莱弗提"] = {
							["Details"] = {
								["击倒"] = {
									["count"] = 151,
								},
								["蹬踏"] = {
									["count"] = 70,
								},
								["肉搏"] = {
									["count"] = 1333,
								},
							},
							["amount"] = 1554,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 588,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 426,
								},
							},
							["amount"] = 1104,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["黑铁炸弹"] = {
									["count"] = 370,
								},
							},
							["amount"] = 370,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 184,
								},
							},
							["amount"] = 184,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["击倒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["吸取生命"] = {
									["count"] = 19.21,
								},
							},
							["amount"] = 20.71,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["法夜"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 1562,
								},
							},
							["amount"] = 1562,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命"] = {
									["count"] = 1919,
								},
							},
							["amount"] = 2503,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["法夜"] = {
									["count"] = 1562,
								},
							},
							["amount"] = 1562,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.53,
								},
							},
							["amount"] = 7.679999999999999,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 0.97,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 2.41,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.38,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 6.98,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 14.45,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.79,
								},
							},
							["amount"] = 36.59999999999999,
						},
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["吸取生命"] = {
									["count"] = 19.21,
								},
							},
							["amount"] = 20.71,
						},
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 5.52,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.51,
								},
							},
							["amount"] = 2.51,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 1,
									["amount"] = 584,
								},
							},
							["count"] = 1,
							["amount"] = 584,
						},
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 114,
									["min"] = 105,
									["count"] = 17,
									["amount"] = 1919,
								},
							},
							["count"] = 17,
							["amount"] = 1919,
						},
					},
					["WhoHealed"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命"] = {
									["count"] = 1919,
								},
							},
							["amount"] = 2503,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 75.42999999999999,
					["Healing"] = 2503,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 1,
									["amount"] = 584,
								},
							},
							["count"] = 1,
							["amount"] = 584,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 824,
									["min"] = 806,
									["count"] = 2,
									["amount"] = 1630,
								},
							},
							["count"] = 2,
							["amount"] = 1630,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 74,
									["count"] = 21,
									["amount"] = 2260,
								},
							},
							["count"] = 21,
							["amount"] = 2260,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 114,
									["min"] = 113,
									["count"] = 17,
									["amount"] = 1928,
								},
							},
							["count"] = 17,
							["amount"] = 1928,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 174,
									["count"] = 20,
									["amount"] = 3481,
								},
							},
							["count"] = 20,
							["amount"] = 3481,
						},
						["腐蚀术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 2503,
					["RageGain"] = 0,
					["TimeDamage"] = 54.72000000000001,
					["TimeDamaging"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.53,
								},
							},
							["amount"] = 7.679999999999999,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 0.97,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 2.41,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.38,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 6.98,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 14.45,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.79,
								},
							},
							["amount"] = 36.59999999999999,
						},
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 5.52,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.51,
								},
							},
							["amount"] = 2.51,
						},
					},
					["ManaGain"] = 1562,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["塞尔德林"] = {
									["count"] = 24,
								},
								["莱弗提"] = {
									["count"] = 15,
								},
								["沃莉达"] = {
									["count"] = 12,
								},
							},
							["amount"] = 51,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 9,
								},
								["自爆绵羊"] = {
									["count"] = 6,
								},
								["塞尔德林"] = {
									["count"] = 45,
								},
							},
							["amount"] = 60,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["塞尔德林"] = {
									["count"] = 45,
								},
								["瓦亚辛"] = {
									["count"] = 18,
								},
							},
							["amount"] = 63,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4064,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 58,
								},
							},
							["amount"] = 62,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 370,
						["Shadow"] = 852,
						["Melee"] = 1759,
						["Physical"] = 1083,
					},
					["DOT_Time"] = 174,
					["Damage"] = 9883,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 20.71,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 9883,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["击倒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1630,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 522,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 545,
								},
							},
							["amount"] = 2697,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 349,
								},
							},
							["amount"] = 349,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 906,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2610,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1715,
								},
							},
							["amount"] = 5815,
						},
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 455,
								},
							},
							["amount"] = 455,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 852,
								},
							},
							["amount"] = 852,
						},
						["莱弗提"] = {
							["Details"] = {
								["击倒"] = {
									["count"] = 151,
								},
								["蹬踏"] = {
									["count"] = 70,
								},
								["肉搏"] = {
									["count"] = 1333,
								},
							},
							["amount"] = 1554,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 588,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 426,
								},
							},
							["amount"] = 1104,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["黑铁炸弹"] = {
									["count"] = 370,
								},
							},
							["amount"] = 370,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 184,
								},
							},
							["amount"] = 184,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["击倒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["吸取生命"] = {
									["count"] = 19.21,
								},
							},
							["amount"] = 20.71,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["法夜"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 1562,
								},
							},
							["amount"] = 1562,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命"] = {
									["count"] = 1919,
								},
							},
							["amount"] = 2503,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["法夜"] = {
									["count"] = 1562,
								},
							},
							["amount"] = 1562,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.53,
								},
							},
							["amount"] = 7.679999999999999,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 0.97,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 2.41,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.38,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 6.98,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 14.45,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.79,
								},
							},
							["amount"] = 36.59999999999999,
						},
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["吸取生命"] = {
									["count"] = 19.21,
								},
							},
							["amount"] = 20.71,
						},
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 5.52,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.51,
								},
							},
							["amount"] = 2.51,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 1,
									["amount"] = 584,
								},
							},
							["count"] = 1,
							["amount"] = 584,
						},
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 114,
									["min"] = 105,
									["count"] = 17,
									["amount"] = 1919,
								},
							},
							["count"] = 17,
							["amount"] = 1919,
						},
					},
					["WhoHealed"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命"] = {
									["count"] = 1919,
								},
							},
							["amount"] = 2503,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 75.42999999999999,
					["Healing"] = 2503,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 1,
									["amount"] = 584,
								},
							},
							["count"] = 1,
							["amount"] = 584,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 824,
									["min"] = 806,
									["count"] = 2,
									["amount"] = 1630,
								},
							},
							["count"] = 2,
							["amount"] = 1630,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 74,
									["count"] = 21,
									["amount"] = 2260,
								},
							},
							["count"] = 21,
							["amount"] = 2260,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 114,
									["min"] = 113,
									["count"] = 17,
									["amount"] = 1928,
								},
							},
							["count"] = 17,
							["amount"] = 1928,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 174,
									["count"] = 20,
									["amount"] = 3481,
								},
							},
							["count"] = 20,
							["amount"] = 3481,
						},
						["腐蚀术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 2503,
					["RageGain"] = 0,
					["TimeDamage"] = 54.72000000000001,
					["TimeDamaging"] = {
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.53,
								},
							},
							["amount"] = 7.679999999999999,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 0.97,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 2.41,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.38,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 6.98,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 14.45,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.79,
								},
							},
							["amount"] = 36.59999999999999,
						},
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 5.52,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.51,
								},
							},
							["amount"] = 2.51,
						},
					},
					["ManaGain"] = 1562,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 2.12,
								},
								["吸取生命"] = {
									["count"] = 22.51,
								},
								["生命虹吸"] = {
									["count"] = 8.2,
								},
							},
							["amount"] = 32.83,
						},
					},
					["DOTs"] = {
						["火焰之雨 (伤害/跳)"] = {
							["Details"] = {
								["洞穴雷霆蜥蜴"] = {
									["count"] = 54,
								},
							},
							["amount"] = 54,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["考尔夫"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["塞尔德林"] = {
									["count"] = 45,
								},
								["瓦亚辛"] = {
									["count"] = 18,
								},
								["洞穴爬行者"] = {
									["count"] = 42,
								},
								["考尔夫"] = {
									["count"] = 30,
								},
							},
							["amount"] = 135,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["沃莉达"] = {
									["count"] = 12,
								},
								["塞尔德林"] = {
									["count"] = 24,
								},
								["莱弗提"] = {
									["count"] = 15,
								},
								["考尔夫"] = {
									["count"] = 9,
								},
							},
							["amount"] = 60,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["瓦亚辛"] = {
									["count"] = 9,
								},
								["自爆绵羊"] = {
									["count"] = 6,
								},
								["塞尔德林"] = {
									["count"] = 63,
								},
								["洞穴雷霆蜥蜴"] = {
									["count"] = 3,
								},
								["洞穴爬行者"] = {
									["count"] = 9,
								},
								["考尔夫"] = {
									["count"] = 18,
								},
							},
							["amount"] = 108,
						},
						["吸取灵魂 (伤害/跳)"] = {
							["Details"] = {
								["洞穴爬行者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["DeathCount"] = 1,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 111,
								},
							},
							["amount"] = 117,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 22,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 9584,
					["ElementTakenResist"] = {
						["Fire"] = 89,
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["灼烧"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 89,
									["min"] = 89,
									["count"] = 1,
									["amount"] = 89,
								},
							},
							["count"] = 89,
							["amount"] = 1,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["击倒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 22,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["法夜"] = {
									["count"] = 2964,
								},
							},
							["amount"] = 2964,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["黑铁炸弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["击倒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 153.0799999999999,
					["WhoHealed"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1168,
								},
								["吸取生命"] = {
									["count"] = 2260,
								},
								["生命虹吸"] = {
									["count"] = 381,
								},
							},
							["amount"] = 3809,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 2532,
						["Melee"] = 4567,
						["Arcane"] = 315,
						["Fire"] = 636,
						["Shadow"] = 852,
						["Frost"] = 682,
					},
					["DOT_Time"] = 387,
					["Damage"] = 21606,
					["HealedWho"] = {
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1168,
								},
								["吸取生命"] = {
									["count"] = 2260,
								},
								["生命虹吸"] = {
									["count"] = 381,
								},
							},
							["amount"] = 3809,
						},
					},
					["TimeHeal"] = 32.83,
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 2,
									["amount"] = 1168,
								},
							},
							["count"] = 2,
							["amount"] = 1168,
						},
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 114,
									["min"] = 105,
									["count"] = 20,
									["amount"] = 2260,
								},
							},
							["count"] = 20,
							["amount"] = 2260,
						},
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 64,
									["min"] = 63,
									["count"] = 6,
									["amount"] = 381,
								},
							},
							["count"] = 6,
							["amount"] = 381,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 17213,
						["Fire"] = 4393,
					},
					["ManaGainedFrom"] = {
						["法夜"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 2964,
								},
							},
							["amount"] = 2964,
						},
					},
					["Healing"] = 3809,
					["WhoDispelled"] = {
						["牛攵"] = {
							["Details"] = {
								["变形术 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 584,
									["min"] = 584,
									["count"] = 2,
									["amount"] = 1168,
								},
							},
							["count"] = 2,
							["amount"] = 1168,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 64,
									["min"] = 63,
									["count"] = 6,
									["amount"] = 381,
								},
							},
							["count"] = 6,
							["amount"] = 381,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 114,
									["min"] = 113,
									["count"] = 20,
									["amount"] = 2269,
								},
							},
							["count"] = 20,
							["amount"] = 2269,
						},
						["腐蚀术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 824,
									["min"] = 789,
									["count"] = 3,
									["amount"] = 2419,
								},
							},
							["count"] = 3,
							["amount"] = 2419,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 73,
									["count"] = 45,
									["amount"] = 4589,
								},
							},
							["count"] = 45,
							["amount"] = 4589,
						},
						["火焰之雨 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 245,
									["min"] = 244,
									["count"] = 18,
									["amount"] = 4393,
								},
							},
							["count"] = 18,
							["amount"] = 4393,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 174,
									["count"] = 36,
									["amount"] = 6267,
								},
							},
							["count"] = 36,
							["amount"] = 6267,
						},
						["吸取灵魂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 30,
									["min"] = 30,
									["count"] = 4,
									["amount"] = 120,
								},
							},
							["count"] = 4,
							["amount"] = 120,
						},
					},
					["HealingTaken"] = 3809,
					["DamagedWho"] = {
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1630,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 522,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 545,
								},
							},
							["amount"] = 2697,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 349,
								},
							},
							["amount"] = 349,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1168,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 906,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3655,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1715,
								},
							},
							["amount"] = 7444,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["火焰之雨 (伤害/跳)"] = {
									["count"] = 4393,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 175,
								},
							},
							["amount"] = 4568,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 455,
								},
							},
							["amount"] = 455,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["吸取灵魂 (伤害/跳)"] = {
									["count"] = 120,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 522,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1186,
								},
							},
							["amount"] = 1828,
						},
						["考尔夫"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 381,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1143,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 341,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1044,
								},
								["暗影箭"] = {
									["count"] = 789,
								},
							},
							["amount"] = 3698,
						},
					},
					["TimeDamage"] = 120.2499999999999,
					["WhoDamaged"] = {
						["玛尔根·长矛"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 315,
								},
							},
							["amount"] = 315,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 852,
								},
							},
							["amount"] = 852,
						},
						["莱弗提"] = {
							["Details"] = {
								["击倒"] = {
									["count"] = 151,
								},
								["蹬踏"] = {
									["count"] = 70,
								},
								["肉搏"] = {
									["count"] = 1333,
								},
							},
							["amount"] = 1554,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 407,
								},
							},
							["amount"] = 407,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 266,
								},
							},
							["amount"] = 266,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1740,
								},
								["断筋"] = {
									["count"] = 111,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 2551,
								},
							},
							["amount"] = 4455,
						},
						["雷兹尼克"] = {
							["Details"] = {
								["黑铁炸弹"] = {
									["count"] = 370,
								},
							},
							["amount"] = 370,
						},
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 683,
								},
								["冰霜震击"] = {
									["count"] = 682,
								},
							},
							["amount"] = 1365,
						},
					},
					["ManaGain"] = 2964,
					["TimeSpent"] = {
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 0.97,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 2.41,
						},
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 2.12,
								},
								["吸取生命"] = {
									["count"] = 22.51,
								},
								["生命虹吸"] = {
									["count"] = 8.2,
								},
							},
							["amount"] = 32.83,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.51,
								},
							},
							["amount"] = 2.51,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.53,
								},
							},
							["amount"] = 7.679999999999999,
						},
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 5.52,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["吸取灵魂 (伤害/跳)"] = {
									["count"] = 4.35,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 17.21,
								},
							},
							["amount"] = 25.08,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["火焰之雨 (伤害/跳)"] = {
									["count"] = 10.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 12,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 2,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 6.98,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 23.45,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.79,
								},
							},
							["amount"] = 46.22000000000001,
						},
						["考尔夫"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.55,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.24,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.96,
								},
								["暗影箭"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 18.83,
						},
					},
					["TimeDamaging"] = {
						["莱弗提"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 5.52,
						},
						["瓦亚辛"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.53,
								},
							},
							["amount"] = 7.679999999999999,
						},
						["自爆绵羊"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 0.97,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.44,
								},
							},
							["amount"] = 2.41,
						},
						["塞尔德林"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 2,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 6.98,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 23.45,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.79,
								},
							},
							["amount"] = 46.22000000000001,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["火焰之雨 (伤害/跳)"] = {
									["count"] = 10.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 12,
						},
						["沃莉达"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.51,
								},
							},
							["amount"] = 2.51,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["吸取灵魂 (伤害/跳)"] = {
									["count"] = 4.35,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 17.21,
								},
							},
							["amount"] = 25.08,
						},
						["考尔夫"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.55,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.24,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 2.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.96,
								},
								["暗影箭"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 18.83,
						},
					},
				},
			},
			["UnitLockout"] = 18725.169,
			["LastActive"] = 18913.18,
		},
		["公主 <丫丫是我>"] = {
			["GUID"] = "Pet-0-5430-0-12647-4512-010116EE12",
			["LastEventHealth"] = {
				3173, -- [1]
				3103, -- [2]
				3103, -- [3]
				3103, -- [4]
				3103, -- [5]
				3103, -- [6]
				3103, -- [7]
				3103, -- [8]
				3478, -- [9]
				3834, -- [10]
				3834, -- [11]
				3834, -- [12]
				3834, -- [13]
				4318, -- [14]
				4318, -- [15]
				4192, -- [16]
				4192, -- [17]
				4192, -- [18]
				4192, -- [19]
				4192, -- [20]
				4192, -- [21]
				4192, -- [22]
				4192, -- [23]
				4192, -- [24]
				4192, -- [25]
				4192, -- [26]
				3590, -- [27]
				3590, -- [28]
				3590, -- [29]
				3590, -- [30]
				3590, -- [31]
				3590, -- [32]
				3590, -- [33]
				2915, -- [34]
				4318, -- [35]
				4318, -- [36]
				4318, -- [37]
				4318, -- [38]
				4318, -- [39]
				4318, -- [40]
				4318, -- [41]
				4318, -- [42]
				4318, -- [43]
				4318, -- [44]
				4318, -- [45]
				4318, -- [46]
				4318, -- [47]
				4318, -- [48]
				4318, -- [49]
				4318, -- [50]
			},
			["LastAttackedBy"] = "考尔夫",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"HEAL", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"MISC", -- [25]
				"MISC", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["HealingTaken"] = {
					731, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					50.65000000000001, -- [1]
				},
				["TimeDamage"] = {
					50.65000000000001, -- [1]
				},
				["DamageTaken"] = {
					871, -- [1]
				},
				["Damage"] = {
					2229, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "公主",
			["level"] = 1,
			["LastDamageAbility"] = "冰霜震击",
			["LastFightIn"] = 8,
			["LastFlags"] = 4648,
			["type"] = "Pet",
			["FightsSaved"] = 5,
			["ownerName"] = "丫丫是我",
			["LastEventHealthMax"] = {
				4318, -- [1]
				4318, -- [2]
				4318, -- [3]
				4318, -- [4]
				4318, -- [5]
				4318, -- [6]
				4318, -- [7]
				4318, -- [8]
				4318, -- [9]
				4318, -- [10]
				4318, -- [11]
				4318, -- [12]
				4318, -- [13]
				4318, -- [14]
				4318, -- [15]
				4318, -- [16]
				4318, -- [17]
				4318, -- [18]
				4318, -- [19]
				4318, -- [20]
				4318, -- [21]
				4318, -- [22]
				4318, -- [23]
				4318, -- [24]
				4318, -- [25]
				4318, -- [26]
				3590, -- [27]
				3590, -- [28]
				3590, -- [29]
				3590, -- [30]
				3590, -- [31]
				3590, -- [32]
				3590, -- [33]
				3590, -- [34]
				4318, -- [35]
				4318, -- [36]
				4318, -- [37]
				4318, -- [38]
				4318, -- [39]
				4318, -- [40]
				4318, -- [41]
				4318, -- [42]
				4318, -- [43]
				4318, -- [44]
				4318, -- [45]
				4318, -- [46]
				4318, -- [47]
				4318, -- [48]
				4318, -- [49]
				4318, -- [50]
			},
			["LastDamageTaken"] = 675,
			["TimeLast"] = {
				["HealingTaken"] = 17861.167,
				["Dispelled"] = 17931.171,
				["ActiveTime"] = 18914.18,
				["TimeDamage"] = 18914.18,
				["OVERALL"] = 18914.18,
				["DamageTaken"] = 17942.172,
				["Damage"] = 18912.18,
			},
			["NextEventNum"] = 1,
			["LastDamageTime"] = 18914.463,
			["LastEvents"] = {
				"洞穴雷霆蜥蜴 雷霆一击 公主 <丫丫是我> Hit -70 (Nature)", -- [1]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Hit -73 (Physical)", -- [2]
				"公主 <丫丫是我> 撕咬 洞穴雷霆蜥蜴 Hit -70 (Physical)", -- [3]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Dodge (1)", -- [4]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Hit -70 (Physical)", -- [5]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Hit -72 (Physical)", -- [6]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Hit -66 (Physical)", -- [7]
				"牛攵 神圣新星 公主 <丫丫是我> Hit +375", -- [8]
				"牛攵 神圣新星 公主 <丫丫是我> Hit +356", -- [9]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Hit -68 (Physical)", -- [10]
				"公主 <丫丫是我> 撕咬 洞穴雷霆蜥蜴 Hit -59 (Physical)", -- [11]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Hit -63 (Physical)", -- [12]
				"公主 <丫丫是我> 肉搏 洞穴雷霆蜥蜴 Hit -65 (Physical)", -- [13]
				"公主 <丫丫是我> 肉搏 考尔夫 Parry (1)", -- [14]
				"考尔夫 肉搏 公主 <丫丫是我> Hit -126 (Physical)", -- [15]
				"公主 <丫丫是我> 撕咬 考尔夫 Hit -66 (Physical)", -- [16]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -72 (Physical)", -- [17]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -71 (Physical)", -- [18]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -68 (Physical)", -- [19]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -68 (Physical)", -- [20]
				"公主 <丫丫是我> 撕咬 考尔夫 Hit -61 (Physical)", -- [21]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -58 (Physical)", -- [22]
				"考尔夫 冰霜震击 公主 <丫丫是我> Resist (Frost)", -- [23]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -19 (Physical)", -- [24]
				"考尔夫 dispels 公主 <丫丫是我> 坚韧祷言 (净化)", -- [25]
				"考尔夫 dispels 公主 <丫丫是我> 精神祷言 (净化)", -- [26]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -72 (Physical)", -- [27]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -35 (Physical)", -- [28]
				"公主 <丫丫是我> 肉搏 考尔夫 Crit -134 (Physical)", -- [29]
				"地缚图腾 地缚术 公主 <丫丫是我> Resist (Nature)", -- [30]
				"公主 <丫丫是我> 肉搏 考尔夫 Hit -72 (Physical)", -- [31]
				"公主 <丫丫是我> 撕咬 考尔夫 Dodge (Physical)", -- [32]
				"考尔夫 冰霜震击 公主 <丫丫是我> Hit -675 (Frost)", -- [33]
				"公主 <丫丫是我> 肉搏 考尔夫 Parry (1)", -- [34]
				"洞穴爬行者 慢性毒药 公主 <丫丫是我> Resist (Nature)", -- [35]
				"公主 <丫丫是我> 肉搏 洞穴爬行者 Hit -69 (Physical)", -- [36]
				"公主 <丫丫是我> 撕咬 洞穴爬行者 Hit -64 (Physical)", -- [37]
				"公主 <丫丫是我> 肉搏 洞穴爬行者 Crit -141 (Physical)", -- [38]
				"公主 <丫丫是我> 肉搏 洞穴爬行者 Hit -66 (Physical)", -- [39]
				"公主 <丫丫是我> 野猪冲锋 莱弗提 Resist (Physical)", -- [40]
				"公主 <丫丫是我> 肉搏 莱弗提 Dodge (1)", -- [41]
				"公主 <丫丫是我> 撕咬 莱弗提 Hit -56 (Physical)", -- [42]
				"公主 <丫丫是我> 肉搏 莱弗提 Hit -63 (Physical)", -- [43]
				"公主 <丫丫是我> 肉搏 莱弗提 Glancing -55 (Physical)", -- [44]
				"公主 <丫丫是我> 肉搏 莱弗提 Hit -66 (Physical)", -- [45]
				"公主 <丫丫是我> 肉搏 莱弗提 Hit -65 (Physical)", -- [46]
				"公主 <丫丫是我> 肉搏 莱弗提 Hit -62 (Physical)", -- [47]
				"公主 <丫丫是我> 撕咬 莱弗提 Hit -55 (Physical)", -- [48]
				"公主 <丫丫是我> 肉搏 莱弗提 Hit -65 (Physical)", -- [49]
				"公主 <丫丫是我> 肉搏 莱弗提 Miss (1)", -- [50]
			},
			["Name"] = "公主",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				17840.666, -- [1]
				17851.55, -- [2]
				17851.55, -- [3]
				17853.567, -- [4]
				17855.567, -- [5]
				17857.567, -- [6]
				17859.584, -- [7]
				17859.884, -- [8]
				17861.401, -- [9]
				17861.584, -- [10]
				17862.884, -- [11]
				17864.284, -- [12]
				17866.284, -- [13]
				17913.004, -- [14]
				17913.004, -- [15]
				17913.82, -- [16]
				17915.004, -- [17]
				17917.02, -- [18]
				17921.487, -- [19]
				17923.487, -- [20]
				17928.371, -- [21]
				17928.521, -- [22]
				17929.588, -- [23]
				17930.538, -- [24]
				17931.238, -- [25]
				17931.238, -- [26]
				17932.538, -- [27]
				17934.538, -- [28]
				17936.538, -- [29]
				17942.039, -- [30]
				17942.089, -- [31]
				17942.089, -- [32]
				17942.505, -- [33]
				17944.089, -- [34]
				18768.205, -- [35]
				18768.271, -- [36]
				18768.621, -- [37]
				18770.271, -- [38]
				18772.271, -- [39]
				18899.479, -- [40]
				18900.429, -- [41]
				18901.246, -- [42]
				18902.429, -- [43]
				18904.429, -- [44]
				18906.463, -- [45]
				18908.446, -- [46]
				18910.463, -- [47]
				18911.78, -- [48]
				18912.463, -- [49]
				18914.463, -- [50]
			},
			["Fights"] = {
				["Fight2"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 340,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 276,
						["Physical"] = 64,
					},
					["PartialAbsorb"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 64,
								},
								["肉搏"] = {
									["count"] = 276,
								},
							},
							["amount"] = 340,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.35,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.85,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 4.85,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 64,
									["min"] = 64,
									["count"] = 1,
									["amount"] = 64,
								},
							},
							["count"] = 1,
							["amount"] = 64,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 141,
									["min"] = 141,
									["count"] = 1,
									["amount"] = 141,
								},
								["Hit"] = {
									["max"] = 69,
									["min"] = 66,
									["count"] = 2,
									["amount"] = 135,
								},
							},
							["count"] = 3,
							["amount"] = 276,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 4.85,
					["TimeDamaging"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.35,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.85,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight5"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 801,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
								["Block"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 126,
						["Frost"] = 675,
					},
					["DOT_Time"] = 0,
					["Damage"] = 796,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 669,
						["Physical"] = 127,
					},
					["PartialAbsorb"] = {
						["地缚术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 669,
								},
								["撕咬"] = {
									["count"] = 127,
								},
							},
							["amount"] = 796,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["考尔夫"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 675,
								},
								["肉搏"] = {
									["count"] = 126,
								},
							},
							["amount"] = 801,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["地缚术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
						["Melee"] = 86,
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["考尔夫"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 2.32,
								},
								["肉搏"] = {
									["count"] = 16.33,
								},
							},
							["amount"] = 18.65,
						},
					},
					["WhoDispelled"] = {
						["考尔夫"] = {
							["Details"] = {
								["精神祷言 (净化)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (净化)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 18.65,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 2,
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 66,
									["min"] = 61,
									["count"] = 2,
									["amount"] = 127,
								},
							},
							["count"] = 3,
							["amount"] = 127,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 72,
									["min"] = 58,
									["count"] = 7,
									["amount"] = 481,
								},
								["Hit (被格挡)"] = {
									["max"] = 35,
									["min"] = 19,
									["count"] = 2,
									["amount"] = 54,
								},
								["Crit"] = {
									["max"] = 134,
									["min"] = 134,
									["count"] = 1,
									["amount"] = 134,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 669,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 18.65,
					["TimeDamaging"] = {
						["考尔夫"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 2.32,
								},
								["肉搏"] = {
									["count"] = 16.33,
								},
							},
							["amount"] = 18.65,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["TimeSpent"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["PartialResist"] = {
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
					["ElementTaken"] = {
						["Nature"] = 0,
					},
					["Damage"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 0,
								},
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 0,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["WhoDamaged"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDone"] = {
						["Melee"] = 0,
						["Physical"] = 0,
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 487,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 376,
						["Physical"] = 111,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["莱弗提"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 376,
								},
								["撕咬"] = {
									["count"] = 111,
								},
							},
							["amount"] = 487,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["莱弗提"] = {
							["Details"] = {
								["野猪冲锋"] = {
									["count"] = 1.5,
								},
								["撕咬"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 10.31,
								},
							},
							["amount"] = 13.95,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 13.95,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["野猪冲锋"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 56,
									["min"] = 55,
									["count"] = 2,
									["amount"] = 111,
								},
							},
							["count"] = 2,
							["amount"] = 111,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 1,
									["amount"] = 55,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 66,
									["min"] = 62,
									["count"] = 5,
									["amount"] = 321,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 376,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 13.95,
					["TimeDamaging"] = {
						["莱弗提"] = {
							["Details"] = {
								["野猪冲锋"] = {
									["count"] = 1.5,
								},
								["撕咬"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 10.31,
								},
							},
							["amount"] = 13.95,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 487,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 376,
						["Physical"] = 111,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["莱弗提"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 376,
								},
								["撕咬"] = {
									["count"] = 111,
								},
							},
							["amount"] = 487,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["莱弗提"] = {
							["Details"] = {
								["野猪冲锋"] = {
									["count"] = 1.5,
								},
								["撕咬"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 10.31,
								},
							},
							["amount"] = 13.95,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 13.95,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["野猪冲锋"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 56,
									["min"] = 55,
									["count"] = 2,
									["amount"] = 111,
								},
							},
							["count"] = 2,
							["amount"] = 111,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 1,
									["amount"] = 55,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 66,
									["min"] = 62,
									["count"] = 5,
									["amount"] = 321,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 376,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 13.95,
					["TimeDamaging"] = {
						["莱弗提"] = {
							["Details"] = {
								["野猪冲锋"] = {
									["count"] = 1.5,
								},
								["撕咬"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 10.31,
								},
							},
							["amount"] = 13.95,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Melee"] = 86,
					},
					["Dispelled"] = 2,
					["TimeSpent"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 1.3,
								},
								["肉搏"] = {
									["count"] = 11.9,
								},
							},
							["amount"] = 13.2,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.35,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.85,
						},
						["莱弗提"] = {
							["Details"] = {
								["野猪冲锋"] = {
									["count"] = 1.5,
								},
								["撕咬"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 10.31,
								},
							},
							["amount"] = 13.95,
						},
						["考尔夫"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 2.32,
								},
								["肉搏"] = {
									["count"] = 16.33,
								},
							},
							["amount"] = 18.65,
						},
					},
					["DamageTaken"] = 871,
					["PartialResist"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["地缚术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["地缚术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 50.65000000000001,
					["ElementTaken"] = {
						["Frost"] = 675,
						["Melee"] = 126,
						["Nature"] = 70,
					},
					["Damage"] = 2229,
					["WhoDispelled"] = {
						["考尔夫"] = {
							["Details"] = {
								["精神祷言 (净化)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (净化)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 23,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 33,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
					},
					["WhoHealed"] = {
						["牛攵"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 731,
								},
							},
							["amount"] = 731,
						},
					},
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 70,
									["min"] = 55,
									["count"] = 7,
									["amount"] = 431,
								},
							},
							["count"] = 8,
							["amount"] = 431,
						},
						["野猪冲锋"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Glancing"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 1,
									["amount"] = 55,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 73,
									["min"] = 58,
									["count"] = 21,
									["amount"] = 1414,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit (被格挡)"] = {
									["max"] = 35,
									["min"] = 19,
									["count"] = 2,
									["amount"] = 54,
								},
								["Crit"] = {
									["max"] = 141,
									["min"] = 134,
									["count"] = 2,
									["amount"] = 275,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 31,
							["amount"] = 1798,
						},
					},
					["HealingTaken"] = 731,
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 129,
								},
								["肉搏"] = {
									["count"] = 477,
								},
							},
							["amount"] = 606,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 64,
								},
								["肉搏"] = {
									["count"] = 276,
								},
							},
							["amount"] = 340,
						},
						["莱弗提"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 376,
								},
								["撕咬"] = {
									["count"] = 111,
								},
							},
							["amount"] = 487,
						},
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 669,
								},
								["撕咬"] = {
									["count"] = 127,
								},
							},
							["amount"] = 796,
						},
					},
					["TimeDamage"] = 50.65000000000001,
					["WhoDamaged"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 70,
								},
							},
							["amount"] = 70,
						},
						["考尔夫"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 675,
								},
								["肉搏"] = {
									["count"] = 126,
								},
							},
							["amount"] = 801,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1798,
						["Physical"] = 431,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 1.3,
								},
								["肉搏"] = {
									["count"] = 11.9,
								},
							},
							["amount"] = 13.2,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.35,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.85,
						},
						["莱弗提"] = {
							["Details"] = {
								["野猪冲锋"] = {
									["count"] = 1.5,
								},
								["撕咬"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 10.31,
								},
							},
							["amount"] = 13.95,
						},
						["考尔夫"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 2.32,
								},
								["肉搏"] = {
									["count"] = 16.33,
								},
							},
							["amount"] = 18.65,
						},
					},
				},
			},
			["UnitLockout"] = 17840.166,
			["LastActive"] = 18914.18,
		},
		["征服者派隆"] = {
			["GUID"] = "Creature-0-5430-0-12645-9026-00004CA84A",
			["TimeLast"] = {
				["ActiveTime"] = 18504.172,
				["TimeDamage"] = 18504.172,
				["OVERALL"] = 18504.172,
				["DamageTaken"] = 18315.177,
				["Damage"] = 18504.172,
			},
			["LastAttackedBy"] = "彩美旬果",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					13.62, -- [1]
				},
				["Damage"] = {
					1437, -- [1]
				},
				["DamageTaken"] = {
					780, -- [1]
				},
				["ActiveTime"] = {
					13.62, -- [1]
				},
			},
			["enClass"] = "MOB",
			["LastDamageTaken"] = 516,
			["level"] = -1,
			["LastDamageAbility"] = "冰锥术",
			["LastFightIn"] = 6,
			["type"] = "Boss",
			["FightsSaved"] = 4,
			["LastEventHealthMax"] = {
				[11] = 11382,
				[13] = 11382,
				[8] = 11382,
				[10] = 11382,
				[12] = 11382,
				[14] = 11382,
				[9] = 11382,
			},
			["LastEventHealth"] = {
				[11] = 11118,
				[13] = 10602,
				[8] = 11118,
				[10] = 11118,
				[12] = 11118,
				[14] = 10602,
				[9] = 11118,
			},
			["Owner"] = false,
			["NextEventNum"] = 18,
			["LastDamageTime"] = 18504.339,
			["LastEvents"] = {
				"征服者派隆 肉搏 九重环奈 Miss (1)", -- [1]
				"征服者派隆 肉搏 九重环奈 Absorb -169 (169 被吸收) (1)", -- [2]
				"征服者派隆 肉搏 九重环奈 Absorb -140 (140 被吸收) (1)", -- [3]
				"彩美旬果 冰霜新星 征服者派隆 Hit -62 (Frost)", -- [4]
				"征服者派隆 肉搏 九重环奈 Absorb -109 (109 被吸收) (1)", -- [5]
				"九重环奈 冰霜新星 征服者派隆 Crit -176 (Frost)", -- [6]
				"风吹鸭儿两边 冰霜新星 征服者派隆 Hit -26 (Frost)", -- [7]
				"征服者派隆 火焰新星 彩美旬果 Resist (Fire)", -- [8]
				"征服者派隆 火焰新星 特变电工 Resist (Fire)", -- [9]
				"征服者派隆 火焰新星 风吹鸭儿两边 Resist (Fire)", -- [10]
				"彩美旬果 冰锥术 征服者派隆 Hit -516 (Frost)", -- [11]
				"征服者派隆 肉搏 彩美旬果 Absorb -288 (288 被吸收) (1)", -- [12]
				"特变电工 肉搏 征服者派隆 Miss (1)", -- [13]
				"征服者派隆 肉搏 彩美旬果 Absorb -160 (160 被吸收) (1)", -- [14]
				"征服者派隆 肉搏 过去之花 Miss (1)", -- [15]
				"征服者派隆 肉搏 过去之花 Absorb -335 (335 被吸收) (1)", -- [16]
				"征服者派隆 肉搏 过去之花 Absorb -236 (236 被吸收) (1)", -- [17]
			},
			["Name"] = "征服者派隆",
			["LastEventTimes"] = {
				18308.71, -- [1]
				18310.31, -- [2]
				18311.91, -- [3]
				18313.31, -- [4]
				18314.544, -- [5]
				18314.544, -- [6]
				18315.027, -- [7]
				18315.961, -- [8]
				18315.961, -- [9]
				18315.961, -- [10]
				18315.961, -- [11]
				18316.16, -- [12]
				18316.344, -- [13]
				18317.727, -- [14]
				18499.139, -- [15]
				18500.705, -- [16]
				18504.339, -- [17]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
			},
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight3"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 571,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 571,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 571,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["过去之花"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 571,
								},
							},
							["amount"] = 571,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["过去之花"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 4.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 335,
									["min"] = 236,
									["count"] = 2,
									["amount"] = 571,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 571,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 4.5,
					["TimeDamaging"] = {
						["过去之花"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight4"] = {
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
					["PartialAbsorb"] = {
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["火焰新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 288,
									["min"] = 109,
									["count"] = 5,
									["amount"] = 866,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 866,
						},
					},
					["WhoDamaged"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
						["九重环奈"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 176,
								},
							},
							["amount"] = 176,
						},
						["彩美旬果"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 516,
								},
								["冰霜新星"] = {
									["count"] = 62,
								},
							},
							["amount"] = 578,
						},
					},
					["TimeSpent"] = {
						["九重环奈"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["彩美旬果"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1.42,
								},
								["肉搏"] = {
									["count"] = 1.7,
								},
							},
							["amount"] = 3.12,
						},
					},
					["DamageTaken"] = 780,
					["ElementDoneAbsorb"] = {
						["Melee"] = 866,
					},
					["ElementDone"] = {
						["Melee"] = 866,
					},
					["DamagedWho"] = {
						["九重环奈"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 418,
								},
							},
							["amount"] = 418,
						},
						["彩美旬果"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 448,
								},
							},
							["amount"] = 448,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeDamage"] = 9.120000000000001,
					["TimeDamaging"] = {
						["九重环奈"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["彩美旬果"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1.42,
								},
								["肉搏"] = {
									["count"] = 1.7,
								},
							},
							["amount"] = 3.12,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 780,
					},
					["ActiveTime"] = 9.120000000000001,
					["Damage"] = 866,
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
					["PartialAbsorb"] = {
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["火焰新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 335,
									["min"] = 109,
									["count"] = 7,
									["amount"] = 1437,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 1437,
						},
					},
					["WhoDamaged"] = {
						["风吹鸭儿两边"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
						["九重环奈"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 176,
								},
							},
							["amount"] = 176,
						},
						["彩美旬果"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 516,
								},
								["冰霜新星"] = {
									["count"] = 62,
								},
							},
							["amount"] = 578,
						},
					},
					["TimeSpent"] = {
						["过去之花"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["九重环奈"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["彩美旬果"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1.42,
								},
								["肉搏"] = {
									["count"] = 1.7,
								},
							},
							["amount"] = 3.12,
						},
					},
					["DamageTaken"] = 780,
					["ElementDoneAbsorb"] = {
						["Melee"] = 1437,
					},
					["ElementDone"] = {
						["Melee"] = 1437,
					},
					["DamagedWho"] = {
						["过去之花"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 571,
								},
							},
							["amount"] = 571,
						},
						["九重环奈"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 418,
								},
							},
							["amount"] = 418,
						},
						["彩美旬果"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 448,
								},
							},
							["amount"] = 448,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 7,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeDamage"] = 13.62,
					["TimeDamaging"] = {
						["过去之花"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["九重环奈"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["彩美旬果"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1.42,
								},
								["肉搏"] = {
									["count"] = 1.7,
								},
							},
							["amount"] = 3.12,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 780,
					},
					["ActiveTime"] = 13.62,
					["Damage"] = 1437,
				},
			},
			["UnitLockout"] = 18504.172,
			["LastActive"] = 18504.172,
		},
		["牛攵"] = {
			["GUID"] = "Player-5458-02E6CBC9",
			["LastEventHealth"] = {
				3347, -- [1]
				3347, -- [2]
				3347, -- [3]
				3347, -- [4]
				3347, -- [5]
				3347, -- [6]
				3347, -- [7]
				3347, -- [8]
				3347, -- [9]
				3347, -- [10]
				3347, -- [11]
				3347, -- [12]
				3347, -- [13]
				3347, -- [14]
				3347, -- [15]
				3347, -- [16]
				2701, -- [17]
				2701, -- [18]
				2701, -- [19]
				2647, -- [20]
				2075, -- [21]
				2075, -- [22]
				1677, -- [23]
				1040, -- [24]
				665, -- [25]
				665, -- [26]
				5, -- [27]
				0, -- [28]
				3267, -- [29]
				3267, -- [30]
				3267, -- [31]
				3267, -- [32]
				3267, -- [33]
				3267, -- [34]
				3267, -- [35]
				3267, -- [36]
				3267, -- [37]
				3267, -- [38]
				3267, -- [39]
				3190, -- [40]
				2529, -- [41]
				2323, -- [42]
				2237, -- [43]
				2237, -- [44]
				1315, -- [45]
				1315, -- [46]
				1226, -- [47]
				1085, -- [48]
				1085, -- [49]
				0, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"MISC", -- [2]
				"MISC", -- [3]
				"HEAL", -- [4]
				"HEAL", -- [5]
				"HEAL", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"DAMAGE", -- [12]
				"MISC", -- [13]
				"MISC", -- [14]
				"MISC", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"MISC", -- [18]
				"MISC", -- [19]
				"DAMAGE", -- [20]
				"HEAL", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"MISC", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"HEAL", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"HEAL", -- [36]
				"HEAL", -- [37]
				"HEAL", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"MISC", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					15, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["Dispels"] = {
					6, -- [1]
				},
				["Healing"] = {
					11503, -- [1]
				},
				["DamageTaken"] = {
					5809, -- [1]
				},
				["Absorbs"] = {
					709, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["Overhealing"] = {
					781, -- [1]
				},
				["TimeDamage"] = {
					10.48, -- [1]
				},
				["FDamage"] = {
					8969, -- [1]
				},
				["ActiveTime"] = {
					25.48, -- [1]
				},
				["Damage"] = {
					1010, -- [1]
				},
			},
			["enClass"] = "PRIEST",
			["unit"] = "牛攵",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
					},
					["Messages"] = {
						"塞尔德林 拦截昏迷 牛攵 Hit -77 (Physical)", -- [1]
						"塞尔德林 肉搏 牛攵 Hit -661 (Physical)", -- [2]
						"莱弗提 肉搏 牛攵 Hit -206 (Physical)", -- [3]
						"莱弗提 肉搏 牛攵 Hit -86 (Physical)", -- [4]
						"塞尔德林 致死打击 牛攵 Hit -872 (Physical)", -- [5]
						"莱弗提 蹬踏 牛攵 Hit -50 (Physical)", -- [6]
						"莱弗提 肉搏 牛攵 Miss (1)", -- [7]
						"莱弗提 肉搏 牛攵 Hit -89 (Physical)", -- [8]
						"Environment Falling 牛攵 Hit -141 (Physical)", -- [9]
						"牛攵 心脏爆炸 牛攵 Hit -8969 (Physical)", -- [10]
						"牛攵 心脏爆炸 牛攵 Hit -8969 (Physical)", -- [11]
						"牛攵死亡。", -- [12]
					},
					["DeathAt"] = 18848.176,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["MessageTimes"] = {
						-6.033999999999651, -- [1]
						-5.533999999999651, -- [2]
						-4.984000000000378, -- [3]
						-4.751000000000204, -- [4]
						-4.416999999997643, -- [5]
						-4.416999999997643, -- [6]
						-3.467000000000553, -- [7]
						-3.234000000000378, -- [8]
						-1.433999999997468, -- [9]
						-0.01699999999982538, -- [10]
						-0.01699999999982538, -- [11]
						0, -- [12]
					},
					["HealthMax"] = {
						3267, -- [1]
						3267, -- [2]
						3267, -- [3]
						3267, -- [4]
						3267, -- [5]
						3267, -- [6]
						3267, -- [7]
						3267, -- [8]
						3267, -- [9]
						3267, -- [10]
						3267, -- [11]
						2567, -- [12]
					},
					["Health"] = {
						3267, -- [1]
						3190, -- [2]
						2529, -- [3]
						2323, -- [4]
						2237, -- [5]
						2237, -- [6]
						1315, -- [7]
						1315, -- [8]
						1226, -- [9]
						1085, -- [10]
						1085, -- [11]
						0, -- [12]
					},
					["KilledBy"] = "Environment",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
					},
					["Messages"] = {
						"牛攵 dispels 特变电工 冰霜震击 (驱散魔法)", -- [1]
						"牛攵 dispels 特变电工 地缚术 (驱散魔法)", -- [2]
						"牛攵 dispels 特变电工 地缚术 (驱散魔法)", -- [3]
						"玛尔根·长矛 瞄准射击 牛攵 Hit -646 (Physical)", -- [4]
						"玛尔根·长矛 强化震荡射击 牛攵 Resist (Physical)", -- [5]
						"考尔夫 dispels 牛攵 坚韧祷言 (净化)", -- [6]
						"考尔夫 dispels 牛攵 奥术光辉 (净化)", -- [7]
						"玛尔根·长矛 射击 牛攵 Hit -572 (Physical)", -- [8]
						"牛攵 强效治疗术 特变电工 Hit +2333", -- [9]
						"斯诺恩·黑骨 灼烧 牛攵 Hit -398 (Fire)", -- [10]
						"玛尔根·长矛 射击 牛攵 Hit -637 (Physical)", -- [11]
						"斯诺恩·黑骨 灼烧 牛攵 Hit -375 (Fire)", -- [12]
						"考尔夫 冰霜震击 牛攵 Hit -660 (Frost)", -- [13]
						"牛攵 dispels 法夜 变形术 (驱散魔法)", -- [14]
						"考尔夫 肉搏 牛攵 Hit -190 (Physical)", -- [15]
						"牛攵死亡。", -- [16]
					},
					["DeathAt"] = 17917.171,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
					},
					["MessageTimes"] = {
						-12.36799999999857, -- [1]
						-12.36799999999857, -- [2]
						-8.550999999999476, -- [3]
						-6.050999999999476, -- [4]
						-5.383999999998196, -- [5]
						-5.383999999998196, -- [6]
						-5.383999999998196, -- [7]
						-4.217000000000553, -- [8]
						-2.734000000000378, -- [9]
						-2.25, -- [10]
						-0.9500000000007276, -- [11]
						-0.6500000000014552, -- [12]
						-0.5169999999998254, -- [13]
						-0.184000000001106, -- [14]
						-0.03299999999944703, -- [15]
						0, -- [16]
					},
					["HealthMax"] = {
						3347, -- [1]
						3347, -- [2]
						3347, -- [3]
						3347, -- [4]
						3347, -- [5]
						3347, -- [6]
						3347, -- [7]
						2647, -- [8]
						2647, -- [9]
						2647, -- [10]
						2647, -- [11]
						2647, -- [12]
						2647, -- [13]
						2647, -- [14]
						2647, -- [15]
						2647, -- [16]
					},
					["Health"] = {
						3347, -- [1]
						3347, -- [2]
						3347, -- [3]
						3347, -- [4]
						2701, -- [5]
						2701, -- [6]
						2701, -- [7]
						2647, -- [8]
						2075, -- [9]
						2075, -- [10]
						1677, -- [11]
						1040, -- [12]
						665, -- [13]
						665, -- [14]
						5, -- [15]
						0, -- [16]
					},
					["KilledBy"] = "考尔夫",
					["MessageType"] = {
						"MISC", -- [1]
						"MISC", -- [2]
						"MISC", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"MISC", -- [6]
						"MISC", -- [7]
						"DAMAGE", -- [8]
						"HEAL", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"MISC", -- [14]
						"DAMAGE", -- [15]
						"MISC", -- [16]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 8,
			["LastEventHealthMax"] = {
				3347, -- [1]
				3347, -- [2]
				3347, -- [3]
				3347, -- [4]
				3347, -- [5]
				3347, -- [6]
				3347, -- [7]
				3347, -- [8]
				3347, -- [9]
				3347, -- [10]
				3347, -- [11]
				3347, -- [12]
				3347, -- [13]
				3347, -- [14]
				3347, -- [15]
				3347, -- [16]
				3347, -- [17]
				3347, -- [18]
				3347, -- [19]
				2647, -- [20]
				2647, -- [21]
				2647, -- [22]
				2647, -- [23]
				2647, -- [24]
				2647, -- [25]
				2647, -- [26]
				2647, -- [27]
				2647, -- [28]
				3267, -- [29]
				3267, -- [30]
				3267, -- [31]
				3267, -- [32]
				3267, -- [33]
				3267, -- [34]
				3267, -- [35]
				3267, -- [36]
				3267, -- [37]
				3267, -- [38]
				3267, -- [39]
				3267, -- [40]
				3267, -- [41]
				3267, -- [42]
				3267, -- [43]
				3267, -- [44]
				3267, -- [45]
				3267, -- [46]
				3267, -- [47]
				3267, -- [48]
				3267, -- [49]
				2567, -- [50]
			},
			["type"] = "Ungrouped",
			["FightsSaved"] = 5,
			["LastHealTime"] = 18825.291,
			["LastDamageTaken"] = 141,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 18825.175,
				["Dispelled"] = 17909.17,
				["Dispels"] = 17915.17,
				["OVERALL"] = 18846.176,
				["DamageTaken"] = 18845.176,
				["Absorbs"] = 18808.174,
				["DeathCount"] = 18846.176,
				["Overhealing"] = 17861.167,
				["ActiveTime"] = 18846.176,
				["FDamage"] = 18846.176,
				["Healing"] = 18825.175,
				["TimeDamage"] = 18846.176,
				["Damage"] = 18771.171,
			},
			["NextEventNum"] = 1,
			["LastDamageTime"] = 18846.676,
			["LastEvents"] = {
				"Environment Falling 牛攵 Hit -149 (Physical)", -- [1]
				"牛攵 dispels 特变电工 雷霆一击 (驱散魔法)", -- [2]
				"牛攵 dispels 特变电工 雷霆一击 (驱散魔法)", -- [3]
				"牛攵 快速治疗 特变电工 Hit +1063", -- [4]
				"牛攵 神圣新星 牛攵 Hit +396 (396 过量治疗)", -- [5]
				"牛攵 神圣新星 公主 <丫丫是我> Hit +375", -- [6]
				"牛攵 神圣新星 洞穴雷霆蜥蜴 Hit -207 (Holy)", -- [7]
				"牛攵 神圣新星 洞穴雷霆蜥蜴 Hit -212 (Holy)", -- [8]
				"牛攵 神圣新星 牛攵 Hit +385 (385 过量治疗)", -- [9]
				"牛攵 神圣新星 特变电工 Hit +379", -- [10]
				"牛攵 神圣新星 公主 <丫丫是我> Hit +356", -- [11]
				"牛攵 神圣新星 洞穴雷霆蜥蜴 Hit -219 (Holy)", -- [12]
				"牛攵 dispels 特变电工 冰霜震击 (驱散魔法)", -- [13]
				"牛攵 dispels 特变电工 地缚术 (驱散魔法)", -- [14]
				"牛攵 dispels 特变电工 地缚术 (驱散魔法)", -- [15]
				"玛尔根·长矛 瞄准射击 牛攵 Hit -646 (Physical)", -- [16]
				"玛尔根·长矛 强化震荡射击 牛攵 Resist (Physical)", -- [17]
				"考尔夫 dispels 牛攵 坚韧祷言 (净化)", -- [18]
				"考尔夫 dispels 牛攵 奥术光辉 (净化)", -- [19]
				"玛尔根·长矛 射击 牛攵 Hit -572 (Physical)", -- [20]
				"牛攵 强效治疗术 特变电工 Hit +2333", -- [21]
				"斯诺恩·黑骨 灼烧 牛攵 Hit -398 (Fire)", -- [22]
				"玛尔根·长矛 射击 牛攵 Hit -637 (Physical)", -- [23]
				"斯诺恩·黑骨 灼烧 牛攵 Hit -375 (Fire)", -- [24]
				"考尔夫 冰霜震击 牛攵 Hit -660 (Frost)", -- [25]
				"牛攵 dispels 法夜 变形术 (驱散魔法)", -- [26]
				"考尔夫 肉搏 牛攵 Hit -190 (Physical)", -- [27]
				"牛攵死亡。", -- [28]
				"洞穴爬行者 慢性毒药 牛攵 Resist (Nature)", -- [29]
				"牛攵 快速治疗 特变电工 Hit +1145", -- [30]
				"牛攵 射击 洞穴爬行者 Hit -86 (Holy)", -- [31]
				"牛攵 射击 洞穴爬行者 Hit -101 (Holy)", -- [32]
				"牛攵 射击 洞穴爬行者 Hit -79 (Holy)", -- [33]
				"牛攵 射击 洞穴爬行者 Hit -106 (Holy)", -- [34]
				"牛攵 强效治疗术 特变电工 Hit +1183", -- [35]
				"牛攵 强效治疗术 特变电工 Hit +1165", -- [36]
				"牛攵 强效治疗术 特变电工 Hit +1176", -- [37]
				"牛攵 强效治疗术 特变电工 Hit +2328", -- [38]
				"塞尔德林 拦截昏迷 牛攵 Hit -77 (Physical)", -- [39]
				"塞尔德林 肉搏 牛攵 Hit -661 (Physical)", -- [40]
				"莱弗提 肉搏 牛攵 Hit -206 (Physical)", -- [41]
				"莱弗提 肉搏 牛攵 Hit -86 (Physical)", -- [42]
				"塞尔德林 致死打击 牛攵 Hit -872 (Physical)", -- [43]
				"莱弗提 蹬踏 牛攵 Hit -50 (Physical)", -- [44]
				"莱弗提 肉搏 牛攵 Miss (1)", -- [45]
				"莱弗提 肉搏 牛攵 Hit -89 (Physical)", -- [46]
				"Environment Falling 牛攵 Hit -141 (Physical)", -- [47]
				"牛攵 心脏爆炸 牛攵 Hit -8969 (Physical)", -- [48]
				"牛攵 心脏爆炸 牛攵 Hit -8969 (Physical)", -- [49]
				"牛攵死亡。", -- [50]
			},
			["Name"] = "牛攵",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				17776.046, -- [1]
				17833.532, -- [2]
				17850.433, -- [3]
				17853.567, -- [4]
				17859.884, -- [5]
				17859.884, -- [6]
				17859.884, -- [7]
				17859.884, -- [8]
				17861.401, -- [9]
				17861.401, -- [10]
				17861.401, -- [11]
				17861.401, -- [12]
				17903.186, -- [13]
				17903.186, -- [14]
				17907.003, -- [15]
				17909.503, -- [16]
				17910.17, -- [17]
				17910.17, -- [18]
				17910.17, -- [19]
				17911.337, -- [20]
				17912.82, -- [21]
				17913.304, -- [22]
				17914.604, -- [23]
				17914.904, -- [24]
				17915.037, -- [25]
				17915.37, -- [26]
				17915.521, -- [27]
				17915.554, -- [28]
				18743.936, -- [29]
				18759.487, -- [30]
				18767.604, -- [31]
				18769.088, -- [32]
				18770.605, -- [33]
				18772.105, -- [34]
				18815.657, -- [35]
				18819.374, -- [36]
				18822.375, -- [37]
				18825.291, -- [38]
				18840.659, -- [39]
				18841.159, -- [40]
				18841.709, -- [41]
				18841.942, -- [42]
				18842.276, -- [43]
				18842.276, -- [44]
				18843.226, -- [45]
				18843.459, -- [46]
				18845.259, -- [47]
				18846.676, -- [48]
				18846.676, -- [49]
				18846.693, -- [50]
			},
			["Fights"] = {
				["Fight2"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 372,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Holy"] = 372,
					},
					["PartialAbsorb"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 372,
								},
							},
							["amount"] = 372,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1145,
								},
							},
							["amount"] = 1145,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 5.98,
						},
						["特变电工"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["快速治疗"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1145,
									["min"] = 1145,
									["count"] = 1,
									["amount"] = 1145,
								},
							},
							["count"] = 1,
							["amount"] = 1145,
						},
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.48,
					["Healing"] = 1145,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 106,
									["min"] = 79,
									["count"] = 4,
									["amount"] = 372,
								},
							},
							["count"] = 4,
							["amount"] = 372,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 5.98,
					["TimeDamaging"] = {
						["洞穴爬行者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 5.98,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight5"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3478,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 660,
						["Physical"] = 1855,
						["Melee"] = 190,
						["Fire"] = 773,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 4,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 190,
								},
								["冰霜震击"] = {
									["count"] = 660,
								},
							},
							["amount"] = 850,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 773,
								},
							},
							["amount"] = 773,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 646,
								},
								["射击"] = {
									["count"] = 1209,
								},
							},
							["amount"] = 1855,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 2333,
								},
							},
							["amount"] = 2333,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
						["考尔夫"] = {
							["Details"] = {
								["奥术光辉 (净化)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (净化)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["强效治疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2333,
									["min"] = 2333,
									["count"] = 1,
									["amount"] = 2333,
								},
							},
							["count"] = 1,
							["amount"] = 2333,
						},
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 2333,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 2,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
						["法夜"] = {
							["Details"] = {
								["变形术 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["特变电工"] = {
							["Details"] = {
								["冰霜震击 (驱散魔法)"] = {
									["count"] = 1,
								},
								["地缚术 (驱散魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
				},
				["CurrentFightData"] = {
					["TimeHealing"] = {
						["公主 <丫丫是我>"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["特变电工"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 0,
								},
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
						["神圣新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["TimeSpent"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["特变电工"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 0,
								},
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["公主 <丫丫是我>"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DamageTaken"] = 0,
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 0,
					["ElementTaken"] = {
						["Physical"] = 0,
					},
					["Damage"] = 0,
					["Heals"] = {
						["快速治疗"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Dispels"] = 0,
					["Overhealing"] = 0,
					["Healing"] = 0,
					["ElementDone"] = {
						["Holy"] = 0,
					},
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["神圣新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["TimeHeal"] = 0,
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["TimeDamage"] = 0,
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["HealedWho"] = {
						["公主 <丫丫是我>"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["特变电工"] = {
							["Details"] = {
								["快速治疗"] = {
									["count"] = 0,
								},
								["神圣新星"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DispelledWho"] = {
						["特变电工"] = {
							["Details"] = {
								["雷霆一击 (驱散魔法)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
				},
				["LastFightData"] = {
					["Absorbed"] = {
						["真言术：盾"] = {
							["Details"] = {
								["特变电工"] = {
									["max"] = 241,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 709,
								},
							},
							["count"] = 4,
							["amount"] = 709,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2182,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 709,
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 1042,
						["Physical"] = 1140,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 7.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
						["心脏爆炸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 8969,
									["min"] = 8969,
									["count"] = 1,
									["amount"] = 8969,
								},
							},
							["count"] = 1,
							["amount"] = 8969,
						},
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 141,
								},
							},
							["amount"] = 141,
						},
						["莱弗提"] = {
							["Details"] = {
								["蹬踏"] = {
									["count"] = 50,
								},
								["肉搏"] = {
									["count"] = 381,
								},
							},
							["amount"] = 431,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 872,
								},
								["拦截昏迷"] = {
									["count"] = 77,
								},
								["肉搏"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1610,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 6,
								},
								["真言术：盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 5852,
								},
								["真言术：盾"] = {
									["count"] = 709,
								},
							},
							["amount"] = 6561,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 8969,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 6,
								},
								["真言术：盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["强效治疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2328,
									["min"] = 1165,
									["count"] = 4,
									["amount"] = 5852,
								},
							},
							["count"] = 4,
							["amount"] = 5852,
						},
						["真言术：盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 241,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 709,
								},
							},
							["count"] = 4,
							["amount"] = 709,
						},
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 9,
					["Healing"] = 5852,
					["FDamagedWho"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 8969,
								},
							},
							["amount"] = 8969,
						},
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["Absorbed"] = {
						["真言术：盾"] = {
							["Details"] = {
								["特变电工"] = {
									["max"] = 241,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 709,
								},
							},
							["count"] = 4,
							["amount"] = 709,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2182,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 709,
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 1042,
						["Physical"] = 1140,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 7.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
						["心脏爆炸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 8969,
									["min"] = 8969,
									["count"] = 1,
									["amount"] = 8969,
								},
							},
							["count"] = 1,
							["amount"] = 8969,
						},
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 141,
								},
							},
							["amount"] = 141,
						},
						["莱弗提"] = {
							["Details"] = {
								["蹬踏"] = {
									["count"] = 50,
								},
								["肉搏"] = {
									["count"] = 381,
								},
							},
							["amount"] = 431,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 872,
								},
								["拦截昏迷"] = {
									["count"] = 77,
								},
								["肉搏"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1610,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 6,
								},
								["真言术：盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 5852,
								},
								["真言术：盾"] = {
									["count"] = 709,
								},
							},
							["amount"] = 6561,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 8969,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["强效治疗术"] = {
									["count"] = 6,
								},
								["真言术：盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["强效治疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2328,
									["min"] = 1165,
									["count"] = 4,
									["amount"] = 5852,
								},
							},
							["count"] = 4,
							["amount"] = 5852,
						},
						["真言术：盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 241,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 709,
								},
							},
							["count"] = 4,
							["amount"] = 709,
						},
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 9,
					["Healing"] = 5852,
					["FDamagedWho"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 8969,
								},
							},
							["amount"] = 8969,
						},
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["FDamagedWho"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 8969,
								},
							},
							["amount"] = 8969,
						},
					},
					["TimeHealing"] = {
						["公主 <丫丫是我>"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 1.5,
								},
								["真言术：盾"] = {
									["count"] = 1.5,
								},
								["快速治疗"] = {
									["count"] = 3,
								},
								["强效治疗术"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 13.5,
						},
					},
					["OverHeals"] = {
						["神圣新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 396,
									["min"] = 385,
									["count"] = 2,
									["amount"] = 781,
								},
							},
							["count"] = 2,
							["amount"] = 781,
						},
					},
					["ElementDone"] = {
						["Holy"] = 1010,
					},
					["FDamage"] = 8969,
					["TimeSpent"] = {
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 1.5,
								},
								["真言术：盾"] = {
									["count"] = 1.5,
								},
								["快速治疗"] = {
									["count"] = 3,
								},
								["强效治疗术"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 13.5,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 5.98,
						},
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["公主 <丫丫是我>"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 5809,
					["Absorbed"] = {
						["真言术：盾"] = {
							["Details"] = {
								["特变电工"] = {
									["max"] = 241,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 709,
								},
							},
							["count"] = 4,
							["amount"] = 709,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["蹬踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["慢性毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 25.48,
					["Absorbs"] = 709,
					["ElementTaken"] = {
						["Frost"] = 660,
						["Physical"] = 3144,
						["Melee"] = 1232,
						["Fire"] = 773,
					},
					["WhoDispelled"] = {
						["考尔夫"] = {
							["Details"] = {
								["奥术光辉 (净化)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (净化)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Damage"] = 1010,
					["Dispelled"] = 2,
					["Heals"] = {
						["神圣新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 379,
									["min"] = 356,
									["count"] = 3,
									["amount"] = 1110,
								},
							},
							["count"] = 3,
							["amount"] = 1110,
						},
						["真言术：盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 241,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 709,
								},
							},
							["count"] = 4,
							["amount"] = 709,
						},
						["快速治疗"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1145,
									["min"] = 1063,
									["count"] = 2,
									["amount"] = 2208,
								},
							},
							["count"] = 2,
							["amount"] = 2208,
						},
						["强效治疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2333,
									["min"] = 1165,
									["count"] = 5,
									["amount"] = 8185,
								},
							},
							["count"] = 5,
							["amount"] = 8185,
						},
					},
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
					},
					["Dispels"] = 6,
					["Overhealing"] = 781,
					["Healing"] = 11503,
					["FAttacks"] = {
						["心脏爆炸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 8969,
									["min"] = 8969,
									["count"] = 1,
									["amount"] = 8969,
								},
							},
							["count"] = 1,
							["amount"] = 8969,
						},
					},
					["TimeDamaging"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["牛攵"] = {
							["Details"] = {
								["心脏爆炸"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 5.98,
						},
					},
					["Attacks"] = {
						["神圣新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 219,
									["min"] = 207,
									["count"] = 3,
									["amount"] = 638,
								},
							},
							["count"] = 3,
							["amount"] = 638,
						},
						["射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 106,
									["min"] = 79,
									["count"] = 4,
									["amount"] = 372,
								},
							},
							["count"] = 4,
							["amount"] = 372,
						},
					},
					["TimeHeal"] = 15,
					["DamagedWho"] = {
						["洞穴雷霆蜥蜴"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 638,
								},
							},
							["amount"] = 638,
						},
						["洞穴爬行者"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 372,
								},
							},
							["amount"] = 372,
						},
					},
					["TimeDamage"] = 10.48,
					["WhoDamaged"] = {
						["莱弗提"] = {
							["Details"] = {
								["蹬踏"] = {
									["count"] = 50,
								},
								["肉搏"] = {
									["count"] = 381,
								},
							},
							["amount"] = 431,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 290,
								},
							},
							["amount"] = 290,
						},
						["塞尔德林"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 872,
								},
								["拦截昏迷"] = {
									["count"] = 77,
								},
								["肉搏"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1610,
						},
						["考尔夫"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 190,
								},
								["冰霜震击"] = {
									["count"] = 660,
								},
							},
							["amount"] = 850,
						},
						["玛尔根·长矛"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 646,
								},
								["射击"] = {
									["count"] = 1209,
								},
							},
							["amount"] = 1855,
						},
						["斯诺恩·黑骨"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 773,
								},
							},
							["amount"] = 773,
						},
					},
					["HealedWho"] = {
						["公主 <丫丫是我>"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 731,
								},
							},
							["amount"] = 731,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣新星"] = {
									["count"] = 379,
								},
								["真言术：盾"] = {
									["count"] = 709,
								},
								["快速治疗"] = {
									["count"] = 2208,
								},
								["强效治疗术"] = {
									["count"] = 8185,
								},
							},
							["amount"] = 11481,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DispelledWho"] = {
						["法夜"] = {
							["Details"] = {
								["变形术 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["特变电工"] = {
							["Details"] = {
								["雷霆一击 (驱散魔法)"] = {
									["count"] = 2,
								},
								["冰霜震击 (驱散魔法)"] = {
									["count"] = 1,
								},
								["地缚术 (驱散魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
					},
				},
			},
			["UnitLockout"] = 18743.17,
			["LastActive"] = 18846.176,
		},
		["审讯官格斯塔恩"] = {
			["GUID"] = "Creature-0-5428-230-7042-9018-00004CA625",
			["TimeLast"] = {
				["ActiveTime"] = 17502.18,
				["TimeDamage"] = 17502.18,
				["OVERALL"] = 17502.18,
				["DOT_Time"] = 17502.18,
				["Damage"] = 17502.18,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
			},
			["TimeWindows"] = {
				["Damage"] = {
					560, -- [1]
				},
				["TimeDamage"] = {
					7.5, -- [1]
				},
				["DOT_Time"] = {
					15, -- [1]
				},
				["ActiveTime"] = {
					7.5, -- [1]
				},
			},
			["enClass"] = "MOB",
			["level"] = -1,
			["LastFightIn"] = 1,
			["type"] = "Boss",
			["FightsSaved"] = 5,
			["Owner"] = false,
			["NextEventNum"] = 6,
			["LastDamageTime"] = 17503.163,
			["LastEvents"] = {
				"审讯官格斯塔恩 暗言术：痛 (伤害/跳) 悯然 Absorb -112 (112 被吸收) (Shadow)", -- [1]
				"审讯官格斯塔恩 暗言术：痛 (伤害/跳) 悯然 Absorb -112 (112 被吸收) (Shadow)", -- [2]
				"审讯官格斯塔恩 暗言术：痛 (伤害/跳) 悯然 Absorb -112 (112 被吸收) (Shadow)", -- [3]
				"审讯官格斯塔恩 暗言术：痛 (伤害/跳) 悯然 Absorb -112 (112 被吸收) (Shadow)", -- [4]
				"审讯官格斯塔恩 暗言术：痛 (伤害/跳) 悯然 Absorb -112 (112 被吸收) (Shadow)", -- [5]
			},
			["Name"] = "审讯官格斯塔恩",
			["LastEventTimes"] = {
				17491.129, -- [1]
				17494.146, -- [2]
				17497.129, -- [3]
				17500.18, -- [4]
				17503.163, -- [5]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["悯然"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["TimeSpent"] = {
						["悯然"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 560,
					},
					["Attacks"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 112,
									["min"] = 112,
									["count"] = 5,
									["amount"] = 560,
								},
							},
							["count"] = 5,
							["amount"] = 560,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 560,
					},
					["DamagedWho"] = {
						["悯然"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 560,
								},
							},
							["amount"] = 560,
						},
					},
					["ActiveTime"] = 7.5,
					["TimeDamaging"] = {
						["悯然"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["TimeDamage"] = 7.5,
					["DOT_Time"] = 15,
					["Damage"] = 560,
				},
			},
			["UnitLockout"] = 17502.18,
			["LastActive"] = 17502.18,
		},
		["塞尔德林"] = {
			["GUID"] = "Creature-0-5427-230-25008-16059-00004CAA0E",
			["LastEventHealth"] = {
				2076, -- [1]
				2076, -- [2]
				3824, -- [3]
				3650, -- [4]
				3244, -- [5]
				3167, -- [6]
				3167, -- [7]
				3093, -- [8]
				3021, -- [9]
				3021, -- [10]
				3021, -- [11]
				2311, -- [12]
				2257, -- [13]
				2257, -- [14]
				1805, -- [15]
				1805, -- [16]
				1731, -- [17]
				1731, -- [18]
				1210, -- [19]
				1210, -- [20]
				1210, -- [21]
				1022, -- [22]
				1022, -- [23]
				588, -- [24]
				588, -- [25]
				588, -- [26]
				266, -- [27]
				105, -- [28]
				0, -- [29]
				[46] = 3723,
				[48] = 3610,
				[50] = 2723,
				[37] = 5266,
				[39] = 5239,
				[41] = 4563,
				[43] = 4485,
				[45] = 4220,
				[47] = 3610,
				[49] = 3240,
				[36] = 5266,
				[38] = 5239,
				[40] = 4889,
				[42] = 4485,
				[44] = 4220,
			},
			["LastEventType"] = {
				"HEAL", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"MISC", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["HealingTaken"] = {
					1748, -- [1]
				},
				["ActiveTime"] = {
					45.06999999999999, -- [1]
				},
				["TimeDamage"] = {
					43.56999999999999, -- [1]
				},
				["Healing"] = {
					1748, -- [1]
				},
				["DamageTaken"] = {
					15165, -- [1]
				},
				["Damage"] = {
					11668, -- [1]
				},
			},
			["enClass"] = "MOB",
			["unit"] = "party1target",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
					},
					["Messages"] = {
						"特变电工 肉搏 塞尔德林 Hit -193 (Physical)", -- [1]
						"特变电工 嗜血 塞尔德林 Hit -326 (Physical)", -- [2]
						"特变电工 肉搏 塞尔德林 Glancing -78 (Physical)", -- [3]
						"丫丫是我 自动射击 塞尔德林 Hit -265 (Physical)", -- [4]
						"塞尔德林 肉搏 特变电工 Hit -505 (Physical)", -- [5]
						"塞尔德林 断筋 特变电工 Hit -38 (Physical)", -- [6]
						"风吹鸭儿两边 寒冰箭 塞尔德林 Hit -497 (Frost)", -- [7]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [8]
						"丫丫是我 自动射击 塞尔德林 Hit -257 (Physical)", -- [9]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [10]
						"风吹鸭儿两边 寒冰箭 塞尔德林 Hit -517 (Frost)", -- [11]
						"丫丫是我 自动射击 塞尔德林 Crit -647 (Physical)", -- [12]
						"塞尔德林 喝下治疗药水 塞尔德林 Hit +1748", -- [13]
						"塞尔德林 肉搏 风吹鸭儿两边 Absorb -689 (689 被吸收) (1)", -- [14]
						"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [15]
						"风吹鸭儿两边 火焰冲击 塞尔德林 Hit -406 (Fire)", -- [16]
						"特变电工 肉搏 塞尔德林 Hit -77 (Physical)", -- [17]
						"特变电工 肉搏 塞尔德林 Miss (1)", -- [18]
						"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [19]
						"特变电工 肉搏 塞尔德林 Glancing -72 (Physical)", -- [20]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -114 (Shadow)", -- [21]
						"风吹鸭儿两边 冰锥术 塞尔德林 Hit -422 (Frost)", -- [22]
						"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [23]
						"特变电工 断筋 塞尔德林 Crit -54 (Physical)", -- [24]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [25]
						"特变电工 肉搏 塞尔德林 Crit -339 (Physical)", -- [26]
						"特变电工 肉搏 塞尔德林 Miss (1)", -- [27]
						"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [28]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [29]
						"特变电工 斩杀 塞尔德林 Hit -408 (Physical)", -- [30]
						"特变电工 肉搏 塞尔德林 Glancing -75 (Physical)", -- [31]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [32]
						"特变电工 肉搏 塞尔德林 Hit -186 (Physical)", -- [33]
						"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [34]
						"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [35]
						"特变电工 重伤 (伤害/跳) 塞尔德林 Tick -52 (Physical)", -- [36]
						"丫丫是我 奥术射击 塞尔德林 Hit -157 (Arcane)", -- [37]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [38]
						"特变电工 肉搏 塞尔德林 Crit -161 (Physical)", -- [39]
						"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -114 (Shadow)", -- [40]
						"塞尔德林死亡。", -- [41]
					},
					["DeathAt"] = 18896.179,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
					},
					["MessageTimes"] = {
						-14.98500000000058, -- [1]
						-14.83499999999913, -- [2]
						-14.80099999999948, -- [3]
						-14.65100000000166, -- [4]
						-14.55099999999948, -- [5]
						-14.55099999999948, -- [6]
						-13.76800000000003, -- [7]
						-12.76800000000003, -- [8]
						-11.76800000000003, -- [9]
						-11.76800000000003, -- [10]
						-11.11800000000221, -- [11]
						-8.817999999999302, -- [12]
						-8.083999999998923, -- [13]
						-8.083999999998923, -- [14]
						-7.934000000001106, -- [15]
						-7.367000000002008, -- [16]
						-7.050999999999476, -- [17]
						-6.800999999999476, -- [18]
						-5.734000000000378, -- [19]
						-5.266999999999825, -- [20]
						-5.217000000000553, -- [21]
						-5.184000000001106, -- [22]
						-4.951000000000931, -- [23]
						-4.667000000001281, -- [24]
						-4.217000000000553, -- [25]
						-4.167000000001281, -- [26]
						-3.766999999999825, -- [27]
						-3.734000000000378, -- [28]
						-3.217000000000553, -- [29]
						-3.167000000001281, -- [30]
						-2.384000000001834, -- [31]
						-2.234000000000378, -- [32]
						-2.033999999999651, -- [33]
						-1.950000000000728, -- [34]
						-1.734000000000378, -- [35]
						-1.134000000001834, -- [36]
						-1.117000000002008, -- [37]
						-1, -- [38]
						-0.2000000000007276, -- [39]
						0, -- [40]
						0, -- [41]
					},
					["HealthMax"] = {
						10682, -- [1]
						10682, -- [2]
						10682, -- [3]
						10682, -- [4]
						10682, -- [5]
						10682, -- [6]
						10682, -- [7]
						10682, -- [8]
						10682, -- [9]
						10682, -- [10]
						10682, -- [11]
						10682, -- [12]
						10682, -- [13]
						10682, -- [14]
						10682, -- [15]
						10682, -- [16]
						10682, -- [17]
						10682, -- [18]
						10682, -- [19]
						10682, -- [20]
						10682, -- [21]
						10682, -- [22]
						10682, -- [23]
						10682, -- [24]
						10682, -- [25]
						10682, -- [26]
						10682, -- [27]
						10682, -- [28]
						10682, -- [29]
						10682, -- [30]
						10682, -- [31]
						10682, -- [32]
						10682, -- [33]
						10682, -- [34]
						10682, -- [35]
						10682, -- [36]
						10682, -- [37]
						10682, -- [38]
						10682, -- [39]
						10682, -- [40]
						10682, -- [41]
					},
					["Health"] = {
						5239, -- [1]
						4889, -- [2]
						4563, -- [3]
						4485, -- [4]
						4485, -- [5]
						4220, -- [6]
						4220, -- [7]
						3723, -- [8]
						3610, -- [9]
						3610, -- [10]
						3240, -- [11]
						2723, -- [12]
						2076, -- [13]
						2076, -- [14]
						3824, -- [15]
						3650, -- [16]
						3244, -- [17]
						3167, -- [18]
						3167, -- [19]
						3093, -- [20]
						3021, -- [21]
						3021, -- [22]
						3021, -- [23]
						2311, -- [24]
						2257, -- [25]
						2257, -- [26]
						1805, -- [27]
						1805, -- [28]
						1731, -- [29]
						1731, -- [30]
						1210, -- [31]
						1210, -- [32]
						1210, -- [33]
						1022, -- [34]
						1022, -- [35]
						588, -- [36]
						588, -- [37]
						588, -- [38]
						266, -- [39]
						105, -- [40]
						0, -- [41]
					},
					["KilledBy"] = "法夜",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"MISC", -- [41]
					},
				}, -- [1]
			},
			["level"] = -1,
			["LastDamageAbility"] = "吸取生命 (伤害/跳)",
			["LastFightIn"] = 8,
			["LastHealTime"] = 18886.295,
			["type"] = "Boss",
			["FightsSaved"] = 5,
			["LastEventHealthMax"] = {
				10682, -- [1]
				10682, -- [2]
				10682, -- [3]
				10682, -- [4]
				10682, -- [5]
				10682, -- [6]
				10682, -- [7]
				10682, -- [8]
				10682, -- [9]
				10682, -- [10]
				10682, -- [11]
				10682, -- [12]
				10682, -- [13]
				10682, -- [14]
				10682, -- [15]
				10682, -- [16]
				10682, -- [17]
				10682, -- [18]
				10682, -- [19]
				10682, -- [20]
				10682, -- [21]
				10682, -- [22]
				10682, -- [23]
				10682, -- [24]
				10682, -- [25]
				10682, -- [26]
				10682, -- [27]
				10682, -- [28]
				10682, -- [29]
				[46] = 10682,
				[48] = 10682,
				[50] = 10682,
				[37] = 10682,
				[39] = 10682,
				[41] = 10682,
				[43] = 10682,
				[45] = 10682,
				[47] = 10682,
				[49] = 10682,
				[36] = 10682,
				[38] = 10682,
				[40] = 10682,
				[42] = 10682,
				[44] = 10682,
			},
			["LastDamageTaken"] = 114,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 18886.178,
				["OVERALL"] = 18894.179,
				["DamageTaken"] = 18894.179,
				["HealingTaken"] = 18886.178,
				["TimeDamage"] = 18886.178,
				["DeathCount"] = 18894.179,
				["Healing"] = 18886.178,
				["ActiveTime"] = 18886.178,
				["Damage"] = 18886.178,
			},
			["NextEventNum"] = 30,
			["LastDamageTime"] = 18886.295,
			["LastEvents"] = {
				"塞尔德林 喝下治疗药水 塞尔德林 Hit +1748", -- [1]
				"塞尔德林 肉搏 风吹鸭儿两边 Absorb -689 (689 被吸收) (1)", -- [2]
				"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [3]
				"风吹鸭儿两边 火焰冲击 塞尔德林 Hit -406 (Fire)", -- [4]
				"特变电工 肉搏 塞尔德林 Hit -77 (Physical)", -- [5]
				"特变电工 肉搏 塞尔德林 Miss (1)", -- [6]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [7]
				"特变电工 肉搏 塞尔德林 Glancing -72 (Physical)", -- [8]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -114 (Shadow)", -- [9]
				"风吹鸭儿两边 冰锥术 塞尔德林 Hit -422 (Frost)", -- [10]
				"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [11]
				"特变电工 断筋 塞尔德林 Crit -54 (Physical)", -- [12]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [13]
				"特变电工 肉搏 塞尔德林 Crit -339 (Physical)", -- [14]
				"特变电工 肉搏 塞尔德林 Miss (1)", -- [15]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [16]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [17]
				"特变电工 斩杀 塞尔德林 Hit -408 (Physical)", -- [18]
				"特变电工 肉搏 塞尔德林 Glancing -75 (Physical)", -- [19]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [20]
				"特变电工 肉搏 塞尔德林 Hit -186 (Physical)", -- [21]
				"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [22]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -74 (Shadow)", -- [23]
				"特变电工 重伤 (伤害/跳) 塞尔德林 Tick -52 (Physical)", -- [24]
				"丫丫是我 奥术射击 塞尔德林 Hit -157 (Arcane)", -- [25]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [26]
				"特变电工 肉搏 塞尔德林 Crit -161 (Physical)", -- [27]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -114 (Shadow)", -- [28]
				"塞尔德林死亡。", -- [29]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -124 (Shadow)", -- [30]
				"法夜 腐蚀术 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [31]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -175 (Shadow)", -- [32]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -175 (Shadow)", -- [33]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -175 (Shadow)", -- [34]
				"法夜 痛苦诅咒 (伤害/跳) 塞尔德林 Tick -174 (Shadow)", -- [35]
				"塞尔德林 拦截昏迷 法夜 Hit -53 (Physical)", -- [36]
				"风吹鸭儿两边 冰霜新星 塞尔德林 Hit -27 (Frost)", -- [37]
				"丫丫是我 奥术射击 塞尔德林 Hit -157 (Arcane)", -- [38]
				"特变电工 肉搏 塞尔德林 Hit -193 (Physical)", -- [39]
				"特变电工 嗜血 塞尔德林 Hit -326 (Physical)", -- [40]
				"特变电工 肉搏 塞尔德林 Glancing -78 (Physical)", -- [41]
				"丫丫是我 自动射击 塞尔德林 Hit -265 (Physical)", -- [42]
				"塞尔德林 肉搏 特变电工 Hit -505 (Physical)", -- [43]
				"塞尔德林 断筋 特变电工 Hit -38 (Physical)", -- [44]
				"风吹鸭儿两边 寒冰箭 塞尔德林 Hit -497 (Frost)", -- [45]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [46]
				"丫丫是我 自动射击 塞尔德林 Hit -257 (Physical)", -- [47]
				"法夜 吸取生命 (伤害/跳) 塞尔德林 Tick -113 (Shadow)", -- [48]
				"风吹鸭儿两边 寒冰箭 塞尔德林 Hit -517 (Frost)", -- [49]
				"丫丫是我 自动射击 塞尔德林 Crit -647 (Physical)", -- [50]
			},
			["Name"] = "塞尔德林",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				18886.295, -- [1]
				18886.295, -- [2]
				18886.445, -- [3]
				18887.012, -- [4]
				18887.328, -- [5]
				18887.578, -- [6]
				18888.645, -- [7]
				18889.112, -- [8]
				18889.162, -- [9]
				18889.195, -- [10]
				18889.428, -- [11]
				18889.712, -- [12]
				18890.162, -- [13]
				18890.212, -- [14]
				18890.612, -- [15]
				18890.645, -- [16]
				18891.162, -- [17]
				18891.212, -- [18]
				18891.995, -- [19]
				18892.145, -- [20]
				18892.345, -- [21]
				18892.429, -- [22]
				18892.645, -- [23]
				18893.245, -- [24]
				18893.262, -- [25]
				18893.379, -- [26]
				18894.179, -- [27]
				18894.379, -- [28]
				18894.379, -- [29]
				18863.294, -- [30]
				18863.794, -- [31]
				18865.31, -- [32]
				18867.294, -- [33]
				18869.311, -- [34]
				18871.311, -- [35]
				18874.961, -- [36]
				18874.978, -- [37]
				18879.228, -- [38]
				18879.394, -- [39]
				18879.544, -- [40]
				18879.578, -- [41]
				18879.728, -- [42]
				18879.828, -- [43]
				18879.828, -- [44]
				18880.611, -- [45]
				18881.611, -- [46]
				18882.611, -- [47]
				18882.611, -- [48]
				18883.261, -- [49]
				18885.561, -- [50]
			},
			["Fights"] = {
				["Fight5"] = {
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 11,
						},
					},
					["DamagedWho"] = {
						["丫丫是我"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 367,
								},
								["拦截昏迷"] = {
									["count"] = 82,
								},
							},
							["amount"] = 449,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 305,
								},
								["断筋"] = {
									["count"] = 38,
								},
								["肉搏"] = {
									["count"] = 1425,
								},
							},
							["amount"] = 1768,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1152,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["肉搏"] = {
									["count"] = 2125,
								},
							},
							["amount"] = 3351,
						},
					},
					["ElementDone"] = {
						["Melee"] = 3917,
						["Physical"] = 1651,
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 605,
									["min"] = 305,
									["count"] = 3,
									["amount"] = 1457,
								},
							},
							["count"] = 4,
							["amount"] = 1457,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 2,
									["amount"] = 82,
								},
							},
							["count"] = 2,
							["amount"] = 82,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 37,
									["min"] = 19,
									["count"] = 4,
									["amount"] = 112,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 112,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 824,
									["min"] = 497,
									["count"] = 2,
									["amount"] = 1321,
								},
								["Hit"] = {
									["max"] = 452,
									["min"] = 217,
									["count"] = 8,
									["amount"] = 2596,
								},
							},
							["count"] = 10,
							["amount"] = 3917,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
					},
					["DamageTaken"] = 2726,
					["TimeSpent"] = {
						["丫丫是我"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 2.17,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.9,
								},
								["断筋"] = {
									["count"] = 2.98,
								},
								["肉搏"] = {
									["count"] = 7.17,
								},
							},
							["amount"] = 12.05,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.05,
								},
								["断筋"] = {
									["count"] = 2.62,
								},
								["肉搏"] = {
									["count"] = 4.53,
								},
							},
							["amount"] = 9.2,
						},
					},
					["PartialResist"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["顺劈斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["TimeDamaging"] = {
						["丫丫是我"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 2.17,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.9,
								},
								["断筋"] = {
									["count"] = 2.98,
								},
								["肉搏"] = {
									["count"] = 7.17,
								},
							},
							["amount"] = 12.05,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.05,
								},
								["断筋"] = {
									["count"] = 2.62,
								},
								["肉搏"] = {
									["count"] = 4.53,
								},
							},
							["amount"] = 9.2,
						},
					},
					["PartialAbsorb"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["顺劈斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 23.42,
					["WhoDamaged"] = {
						["特变电工"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 168,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 161,
								},
								["肉搏"] = {
									["count"] = 506,
								},
							},
							["amount"] = 835,
						},
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1045,
								},
							},
							["amount"] = 1629,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 262,
								},
							},
							["amount"] = 262,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 329,
						["Frost"] = 262,
						["Melee"] = 506,
						["Shadow"] = 1629,
					},
					["TimeDamage"] = 23.42,
					["Damage"] = 5568,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["Fight1"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 12439,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 14,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 38,
								},
							},
							["amount"] = 39,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 1979,
						["Melee"] = 1370,
						["Arcane"] = 471,
						["Fire"] = 406,
						["Physical"] = 2398,
						["Shadow"] = 5815,
					},
					["DOT_Time"] = 0,
					["Damage"] = 6100,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 689,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 3825,
						["Physical"] = 2275,
					},
					["PartialAbsorb"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 872,
								},
								["拦截昏迷"] = {
									["count"] = 77,
								},
								["肉搏"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1610,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 549,
								},
								["断筋"] = {
									["count"] = 99,
								},
								["肉搏"] = {
									["count"] = 2049,
								},
							},
							["amount"] = 2697,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 588,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 426,
								},
							},
							["amount"] = 1104,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 689,
								},
							},
							["amount"] = 689,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["丫丫是我"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 471,
								},
								["驱散射击"] = {
									["count"] = 129,
								},
								["自动射击"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 2029,
						},
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 326,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 52,
								},
								["断筋"] = {
									["count"] = 54,
								},
								["斩杀"] = {
									["count"] = 408,
								},
								["肉搏"] = {
									["count"] = 1370,
								},
							},
							["amount"] = 2210,
						},
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 906,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2610,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1715,
								},
							},
							["amount"] = 5815,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 422,
								},
								["寒冰箭"] = {
									["count"] = 1503,
								},
								["火焰冲击"] = {
									["count"] = 406,
								},
								["冰霜新星"] = {
									["count"] = 54,
								},
							},
							["amount"] = 2385,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1748,
								},
							},
							["amount"] = 1748,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.12,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.12,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.93,
								},
								["肉搏"] = {
									["count"] = 6.6,
								},
							},
							["amount"] = 11.03,
						},
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["喝下治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1748,
									["min"] = 1748,
									["count"] = 1,
									["amount"] = 1748,
								},
							},
							["count"] = 1,
							["amount"] = 1748,
						},
					},
					["WhoHealed"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1748,
								},
							},
							["amount"] = 1748,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 21.65,
					["Healing"] = 1748,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 872,
									["min"] = 549,
									["count"] = 3,
									["amount"] = 2009,
								},
							},
							["count"] = 3,
							["amount"] = 2009,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 38,
									["min"] = 30,
									["count"] = 4,
									["amount"] = 136,
								},
							},
							["count"] = 4,
							["amount"] = 136,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 77,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 130,
								},
							},
							["count"] = 2,
							["amount"] = 130,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 689,
									["min"] = 689,
									["count"] = 1,
									["amount"] = 689,
								},
								["Hit"] = {
									["max"] = 661,
									["min"] = 367,
									["count"] = 7,
									["amount"] = 3136,
								},
							},
							["count"] = 8,
							["amount"] = 3825,
						},
					},
					["HealingTaken"] = 1748,
					["RageGain"] = 0,
					["TimeDamage"] = 20.15,
					["TimeDamaging"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.12,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.12,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.93,
								},
								["肉搏"] = {
									["count"] = 6.6,
								},
							},
							["amount"] = 11.03,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 12439,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 14,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 38,
								},
							},
							["amount"] = 39,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 1979,
						["Melee"] = 1370,
						["Arcane"] = 471,
						["Fire"] = 406,
						["Physical"] = 2398,
						["Shadow"] = 5815,
					},
					["DOT_Time"] = 0,
					["Damage"] = 6100,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 689,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 3825,
						["Physical"] = 2275,
					},
					["PartialAbsorb"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 872,
								},
								["拦截昏迷"] = {
									["count"] = 77,
								},
								["肉搏"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1610,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 549,
								},
								["断筋"] = {
									["count"] = 99,
								},
								["肉搏"] = {
									["count"] = 2049,
								},
							},
							["amount"] = 2697,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 588,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 426,
								},
							},
							["amount"] = 1104,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 689,
								},
							},
							["amount"] = 689,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["丫丫是我"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 471,
								},
								["驱散射击"] = {
									["count"] = 129,
								},
								["自动射击"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 2029,
						},
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 326,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 52,
								},
								["断筋"] = {
									["count"] = 54,
								},
								["斩杀"] = {
									["count"] = 408,
								},
								["肉搏"] = {
									["count"] = 1370,
								},
							},
							["amount"] = 2210,
						},
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 584,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 906,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2610,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1715,
								},
							},
							["amount"] = 5815,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 422,
								},
								["寒冰箭"] = {
									["count"] = 1503,
								},
								["火焰冲击"] = {
									["count"] = 406,
								},
								["冰霜新星"] = {
									["count"] = 54,
								},
							},
							["amount"] = 2385,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1748,
								},
							},
							["amount"] = 1748,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.12,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.12,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.93,
								},
								["肉搏"] = {
									["count"] = 6.6,
								},
							},
							["amount"] = 11.03,
						},
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["喝下治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1748,
									["min"] = 1748,
									["count"] = 1,
									["amount"] = 1748,
								},
							},
							["count"] = 1,
							["amount"] = 1748,
						},
					},
					["WhoHealed"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1748,
								},
							},
							["amount"] = 1748,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 21.65,
					["Healing"] = 1748,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 872,
									["min"] = 549,
									["count"] = 3,
									["amount"] = 2009,
								},
							},
							["count"] = 3,
							["amount"] = 2009,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 38,
									["min"] = 30,
									["count"] = 4,
									["amount"] = 136,
								},
							},
							["count"] = 4,
							["amount"] = 136,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 77,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 130,
								},
							},
							["count"] = 2,
							["amount"] = 130,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 689,
									["min"] = 689,
									["count"] = 1,
									["amount"] = 689,
								},
								["Hit"] = {
									["max"] = 661,
									["min"] = 367,
									["count"] = 7,
									["amount"] = 3136,
								},
							},
							["count"] = 8,
							["amount"] = 3825,
						},
					},
					["HealingTaken"] = 1748,
					["RageGain"] = 0,
					["TimeDamage"] = 20.15,
					["TimeDamaging"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.12,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.12,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.93,
								},
								["肉搏"] = {
									["count"] = 6.6,
								},
							},
							["amount"] = 11.03,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["TimeSpent"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.12,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.12,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.4,
								},
								["断筋"] = {
									["count"] = 5.91,
								},
								["肉搏"] = {
									["count"] = 13.77,
								},
							},
							["amount"] = 23.08,
						},
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丫丫是我"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 2.17,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.55,
								},
								["断筋"] = {
									["count"] = 2.62,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.03,
								},
							},
							["amount"] = 13.7,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 15165,
					["ElementDoneAbsorb"] = {
						["Melee"] = 689,
					},
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["顺劈斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 21,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["顺劈斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 45.06999999999999,
					["ElementTaken"] = {
						["Shadow"] = 7444,
						["Melee"] = 1876,
						["Arcane"] = 471,
						["Fire"] = 406,
						["Physical"] = 2727,
						["Frost"] = 2241,
					},
					["Damage"] = 11668,
					["TimeHeal"] = 1.5,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 18,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 18,
								},
							},
							["amount"] = 20,
						},
					},
					["WhoHealed"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1748,
								},
							},
							["amount"] = 1748,
						},
					},
					["Healing"] = 1748,
					["HealedWho"] = {
						["塞尔德林"] = {
							["Details"] = {
								["喝下治疗药水"] = {
									["count"] = 1748,
								},
							},
							["amount"] = 1748,
						},
					},
					["Heals"] = {
						["喝下治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1748,
									["min"] = 1748,
									["count"] = 1,
									["amount"] = 1748,
								},
							},
							["count"] = 1,
							["amount"] = 1748,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 872,
									["min"] = 305,
									["count"] = 6,
									["amount"] = 3466,
								},
							},
							["count"] = 7,
							["amount"] = 3466,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 77,
									["min"] = 41,
									["count"] = 4,
									["amount"] = 212,
								},
							},
							["count"] = 4,
							["amount"] = 212,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 38,
									["min"] = 19,
									["count"] = 8,
									["amount"] = 248,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 248,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 689,
									["min"] = 689,
									["count"] = 1,
									["amount"] = 689,
								},
								["Crit"] = {
									["max"] = 824,
									["min"] = 497,
									["count"] = 2,
									["amount"] = 1321,
								},
								["Hit"] = {
									["max"] = 661,
									["min"] = 217,
									["count"] = 15,
									["amount"] = 5732,
								},
							},
							["count"] = 18,
							["amount"] = 7742,
						},
					},
					["HealingTaken"] = 1748,
					["DamagedWho"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 872,
								},
								["拦截昏迷"] = {
									["count"] = 77,
								},
								["肉搏"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1610,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 854,
								},
								["断筋"] = {
									["count"] = 137,
								},
								["肉搏"] = {
									["count"] = 3474,
								},
							},
							["amount"] = 4465,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 689,
								},
							},
							["amount"] = 689,
						},
						["丫丫是我"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 367,
								},
								["拦截昏迷"] = {
									["count"] = 82,
								},
							},
							["amount"] = 449,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1740,
								},
								["断筋"] = {
									["count"] = 111,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 2551,
								},
							},
							["amount"] = 4455,
						},
					},
					["TimeDamage"] = 43.56999999999999,
					["WhoDamaged"] = {
						["丫丫是我"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 471,
								},
								["驱散射击"] = {
									["count"] = 129,
								},
								["自动射击"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 2029,
						},
						["特变电工"] = {
							["Details"] = {
								["顺劈斩"] = {
									["count"] = 168,
								},
								["嗜血"] = {
									["count"] = 326,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 213,
								},
								["断筋"] = {
									["count"] = 54,
								},
								["斩杀"] = {
									["count"] = 408,
								},
								["肉搏"] = {
									["count"] = 1876,
								},
							},
							["amount"] = 3045,
						},
						["法夜"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1168,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 906,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3655,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1715,
								},
							},
							["amount"] = 7444,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 262,
								},
								["冰霜新星"] = {
									["count"] = 54,
								},
								["寒冰箭"] = {
									["count"] = 1503,
								},
								["冰锥术"] = {
									["count"] = 422,
								},
								["火焰冲击"] = {
									["count"] = 406,
								},
							},
							["amount"] = 2647,
						},
					},
					["ElementDone"] = {
						["Melee"] = 7742,
						["Physical"] = 3926,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 44,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 46,
						},
						["Melee"] = {
							["Details"] = {
								["Glancing"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 17,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 14,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 8,
						},
					},
					["TimeDamaging"] = {
						["牛攵"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.12,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.12,
						},
						["特变电工"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.4,
								},
								["断筋"] = {
									["count"] = 5.91,
								},
								["肉搏"] = {
									["count"] = 13.77,
								},
							},
							["amount"] = 23.08,
						},
						["风吹鸭儿两边"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丫丫是我"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 2.17,
						},
						["法夜"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.55,
								},
								["断筋"] = {
									["count"] = 2.62,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.03,
								},
							},
							["amount"] = 13.7,
						},
					},
				},
			},
			["UnitLockout"] = 18874.178,
			["LastActive"] = 18894.179,
		},
	},
	["FightNum"] = 9,
	["CombatTimes"] = {
		{
			17379.173, -- [1]
			17395.174, -- [2]
			"02:25:19", -- [3]
			"02:25:34", -- [4]
			"铁怒监军", -- [5]
		}, -- [1]
		{
			17518.181, -- [1]
			17526.181, -- [2]
			"02:27:38", -- [3]
			"02:27:45", -- [4]
			"铁怒狱卒", -- [5]
		}, -- [2]
		{
			17760.178, -- [1]
			17764.178, -- [2]
			"02:31:40", -- [3]
			"02:31:43", -- [4]
			"火焰卫士", -- [5]
		}, -- [3]
		{
			17827.182, -- [1]
			17867.168, -- [2]
			"02:32:47", -- [3]
			"02:33:26", -- [4]
			"洞穴雷霆蜥蜴", -- [5]
		}, -- [4]
		{
			17900.17, -- [1]
			17968.304, -- [2]
			"02:34:00", -- [3]
			"02:35:08", -- [4]
			"塞尔德林", -- [5]
		}, -- [5]
		{
			18309.177, -- [1]
			18322.178, -- [2]
			"02:40:49", -- [3]
			"02:41:01", -- [4]
			"征服者派隆", -- [5]
		}, -- [6]
		{
			18484.171, -- [1]
			18510.173, -- [2]
			"02:43:44", -- [3]
			"02:44:09", -- [4]
			"春天的熊熊", -- [5]
		}, -- [7]
		{
			18719.168, -- [1]
			18775.172, -- [2]
			"02:47:39", -- [3]
			"02:48:34", -- [4]
			"洞穴爬行者", -- [5]
		}, -- [8]
		{
			18808.174, -- [1]
			18916.18, -- [2]
			"02:49:08", -- [3]
			"02:50:55", -- [4]
			"塞尔德林", -- [5]
		}, -- [9]
	},
	["FoughtWho"] = {
		"塞尔德林 02:49:08-02:50:55", -- [1]
		"洞穴爬行者 02:47:39-02:48:34", -- [2]
		"春天的熊熊 02:43:44-02:44:09", -- [3]
		"征服者派隆 02:40:49-02:41:01", -- [4]
		"塞尔德林 02:34:00-02:35:08", -- [5]
	},
}
