
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["TimeLast"] = {
				["DeathCount"] = 41502.107,
				["RageGain"] = 41560.111,
				["DOT_Time"] = 41557.111,
				["ActiveTime"] = 41587.097,
				["TimeDamage"] = 41587.097,
				["OVERALL"] = 41596.097,
				["DamageTaken"] = 41596.097,
				["Damage"] = 41587.097,
			},
			["LastAttackedBy"] = "武动乾坤",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"MISC", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["RageGain"] = {
					83, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					40.81999999999999, -- [1]
				},
				["DOT_Time"] = {
					45, -- [1]
				},
				["TimeDamage"] = {
					40.81999999999999, -- [1]
				},
				["DamageTaken"] = {
					12205, -- [1]
				},
				["Damage"] = {
					10660, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						false, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
					},
					["Messages"] = {
						"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -96 (Physical)", -- [1]
						"特变电工 拦截昏迷 乃总-黑龙费尔默 Hit -63 (Physical)", -- [2]
						"特变电工 断筋 乃总-黑龙费尔默 Crit -100 (Physical)", -- [3]
						"特变电工 肉搏 乃总-黑龙费尔默 Hit -456 (Physical)", -- [4]
						"武动乾坤 寒冰箭 特变电工 Hit -56 (Frost)", -- [5]
						"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [6]
						"特变电工 肉搏 乃总-黑龙费尔默 Hit -370 (Physical)", -- [7]
						"特变电工 旋风斩 乃总-黑龙费尔默 Hit -389 (Physical)", -- [8]
						"武动乾坤 寒冰箭 特变电工 Hit -671 (Frost)", -- [9]
						"乃总-黑龙费尔默 肉搏 特变电工 Hit -113 (Physical)", -- [10]
						"乃总-黑龙费尔默 邪恶攻击 特变电工 Crit -385 (Physical)", -- [11]
						"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [12]
						"特变电工 断筋 乃总-黑龙费尔默 Dodge (Physical)", -- [13]
						"乃总-黑龙费尔默 邪恶攻击 特变电工 Hit -145 (Physical)", -- [14]
						"乃总-黑龙费尔默 肉搏 特变电工 Dodge (1)", -- [15]
						"武动乾坤 寒冰箭 特变电工 Reflect (Frost)", -- [16]
						"乃总-黑龙费尔默 肉搏 特变电工 Hit -107 (Physical)", -- [17]
						"瞬狱影杀阵-逐风者 冰霜新星 特变电工 Hit -98 (Frost)", -- [18]
						"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [19]
						"瞬狱影杀阵-逐风者 火焰冲击 特变电工 Crit -944 (Fire)", -- [20]
						"瞬狱影杀阵-逐风者 冰锥术 特变电工 Hit -566 (Frost)", -- [21]
						"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [22]
						"特变电工 肉搏 瞬狱影杀阵-逐风者 Dodge (1)", -- [23]
						"特变电工 致死打击 瞬狱影杀阵-逐风者 Absorb -635 (635 被吸收) (Physical)", -- [24]
						"瞬狱影杀阵-逐风者 魔爆术 特变电工 Hit -310 (Arcane)", -- [25]
						"武动乾坤 寒冰箭 特变电工 Hit -607 (Frost)", -- [26]
						"特变电工死亡。", -- [27]
					},
					["DeathAt"] = 41504.107,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["MessageTimes"] = {
						-14.58499999999913, -- [1]
						-14.20099999999366, -- [2]
						-13.55099999999948, -- [3]
						-13.41799999999785, -- [4]
						-12.33399999999529, -- [5]
						-10.51799999999639, -- [6]
						-9.567999999999302, -- [7]
						-9.48399999999674, -- [8]
						-9.10099999999511, -- [9]
						-8.21799999999348, -- [10]
						-8.21799999999348, -- [11]
						-7.516999999999825, -- [12]
						-7.43399999999383, -- [13]
						-7.150999999998021, -- [14]
						-6.81699999999546, -- [15]
						-6.550999999999476, -- [16]
						-6.416999999994005, -- [17]
						-4.56699999999546, -- [18]
						-4.516999999999825, -- [19]
						-3.049999999995634, -- [20]
						-1.549999999995634, -- [21]
						-1.516999999999825, -- [22]
						-1.049999999995634, -- [23]
						-0.9169999999940046, -- [24]
						-0.04999999999563443, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
					},
					["Health"] = {
						3679, -- [1]
						3679, -- [2]
						3679, -- [3]
						3679, -- [4]
						3679, -- [5]
						3623, -- [6]
						3623, -- [7]
						3623, -- [8]
						3623, -- [9]
						2952, -- [10]
						2952, -- [11]
						2454, -- [12]
						2454, -- [13]
						2454, -- [14]
						2309, -- [15]
						2309, -- [16]
						2309, -- [17]
						2202, -- [18]
						2104, -- [19]
						2104, -- [20]
						1160, -- [21]
						1160, -- [22]
						594, -- [23]
						594, -- [24]
						594, -- [25]
						284, -- [26]
						0, -- [27]
					},
					["KilledBy"] = "武动乾坤",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"MISC", -- [27]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						false, -- [30]
					},
					["Messages"] = {
						"特变电工 断筋 兜兜颛颛-逐风者 Crit -77 (Physical)", -- [1]
						"特变电工 肉搏 兜兜颛颛-逐风者 Hit -424 (Physical)", -- [2]
						"特变电工 肉搏 兜兜颛颛-逐风者 Hit -379 (Physical)", -- [3]
						"瞬狱影杀阵-逐风者 冰霜新星 特变电工 Hit -90 (Frost)", -- [4]
						"玉青-逐风者 断筋 特变电工 Crit -59 (Physical)", -- [5]
						"玉青-逐风者 肉搏 特变电工 Hit -279 (Physical)", -- [6]
						"特变电工 断筋 兜兜颛颛-逐风者 Hit -44 (Physical)", -- [7]
						"特变电工 重伤 (伤害/跳) 兜兜颛颛-逐风者 Tick -85 (Physical)", -- [8]
						"武动乾坤 冰锥术 特变电工 Crit -1008 (Frost)", -- [9]
						"特变电工 肉搏 (正义之手) 兜兜颛颛-逐风者 Hit -554 (Physical)", -- [10]
						"玉青-逐风者 重伤 (伤害/跳) 特变电工 Tick -70 (Physical)", -- [11]
						"瞬狱影杀阵-逐风者 冰锥术 特变电工 Hit -577 (Frost)", -- [12]
						"特变电工 断筋 兜兜颛颛-逐风者 Hit -43 (Physical)", -- [13]
						"武动乾坤 冰霜新星 特变电工 Hit -85 (Frost)", -- [14]
						"兜兜颛颛-逐风者 肉搏 特变电工 Miss (1)", -- [15]
						"兜兜颛颛-逐风者 出血 特变电工 Hit -144 (Physical)", -- [16]
						"特变电工 重伤 (伤害/跳) 兜兜颛颛-逐风者 Tick -85 (Physical)", -- [17]
						"瞬狱影杀阵-逐风者 魔爆术 特变电工 Hit -321 (Arcane)", -- [18]
						"特变电工 致死打击 兜兜颛颛-逐风者 Crit -1502 (Physical)", -- [19]
						"罚死-黑龙费尔默 火球术 特变电工 Hit -981 (Fire)", -- [20]
						"武动乾坤 魔爆术 特变电工 Hit -53 (Arcane)", -- [21]
						"玉青-逐风者 重伤 (伤害/跳) 特变电工 Tick -77 (Physical)", -- [22]
						"瞬狱影杀阵-逐风者 魔爆术 特变电工 Hit -311 (Arcane)", -- [23]
						"特变电工 肉搏 兜兜颛颛-逐风者 Hit -482 (Physical)", -- [24]
						"武动乾坤 魔爆术 特变电工 Hit -289 (Arcane)", -- [25]
						"罚死-黑龙费尔默 火球术 (伤害/跳) 特变电工 Tick -18 (Fire)", -- [26]
						"瞬狱影杀阵-逐风者 魔爆术 特变电工 Hit -310 (Arcane)", -- [27]
						"罚死-黑龙费尔默 火球术 特变电工 Hit -999 (Fire)", -- [28]
						"特变电工死亡。", -- [29]
						"特变电工 重伤 (伤害/跳) 兜兜颛颛-逐风者 Tick -133 (Physical)", -- [30]
					},
					["DeathAt"] = 41453.103,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
					},
					["MessageTimes"] = {
						-9.154999999998836, -- [1]
						-9.137000000002445, -- [2]
						-9.118999999998778, -- [3]
						-8.671000000002095, -- [4]
						-8.305000000000291, -- [5]
						-7.938000000001921, -- [6]
						-6.15400000000227, -- [7]
						-6.137999999999011, -- [8]
						-5.870999999999185, -- [9]
						-5.304000000003725, -- [10]
						-5.288000000000466, -- [11]
						-4.571000000003551, -- [12]
						-4.47099999999773, -- [13]
						-4.35399999999936, -- [14]
						-3.387999999999011, -- [15]
						-3.387999999999011, -- [16]
						-3.137000000002445, -- [17]
						-3.054000000003725, -- [18]
						-2.97099999999773, -- [19]
						-2.90400000000227, -- [20]
						-2.836999999999534, -- [21]
						-2.27100000000064, -- [22]
						-1.554000000003725, -- [23]
						-1.504000000000815, -- [24]
						-1.336999999999534, -- [25]
						-0.8870000000024447, -- [26]
						-0.05400000000372529, -- [27]
						-0.02100000000064028, -- [28]
						0, -- [29]
						0.1549999999988359, -- [30]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
					},
					["Health"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4879, -- [5]
						4820, -- [6]
						4541, -- [7]
						4541, -- [8]
						4541, -- [9]
						3533, -- [10]
						3533, -- [11]
						3463, -- [12]
						2886, -- [13]
						2886, -- [14]
						2801, -- [15]
						2801, -- [16]
						2657, -- [17]
						2657, -- [18]
						2336, -- [19]
						2336, -- [20]
						1355, -- [21]
						1302, -- [22]
						1225, -- [23]
						914, -- [24]
						914, -- [25]
						625, -- [26]
						607, -- [27]
						297, -- [28]
						0, -- [29]
						0, -- [30]
					},
					["KilledBy"] = "罚死-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"MISC", -- [29]
						"DAMAGE", -- [30]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "火焰冲击",
			["LastFightIn"] = 4,
			["type"] = "Self",
			["LastDamageTaken"] = 575,
			["LastEventHealth"] = {
				3679, -- [1]
				3679, -- [2]
				3679, -- [3]
				3623, -- [4]
				3623, -- [5]
				3623, -- [6]
				3623, -- [7]
				2952, -- [8]
				2952, -- [9]
				2454, -- [10]
				2454, -- [11]
				2454, -- [12]
				2309, -- [13]
				2309, -- [14]
				2309, -- [15]
				2202, -- [16]
				2104, -- [17]
				2104, -- [18]
				1160, -- [19]
				1160, -- [20]
				594, -- [21]
				594, -- [22]
				594, -- [23]
				284, -- [24]
				0, -- [25]
				4969, -- [26]
				4969, -- [27]
				4969, -- [28]
				4969, -- [29]
				4969, -- [30]
				4969, -- [31]
				4632, -- [32]
				4632, -- [33]
				4632, -- [34]
				4632, -- [35]
				4632, -- [36]
				4969, -- [37]
				4969, -- [38]
				4969, -- [39]
				4969, -- [40]
				4969, -- [41]
				4874, -- [42]
				4687, -- [43]
				4611, -- [44]
				4489, -- [45]
				4302, -- [46]
				4201, -- [47]
				4201, -- [48]
				3679, -- [49]
				3679, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4969, -- [1]
				4969, -- [2]
				4969, -- [3]
				4969, -- [4]
				4969, -- [5]
				4969, -- [6]
				4969, -- [7]
				4969, -- [8]
				4969, -- [9]
				4969, -- [10]
				4969, -- [11]
				4969, -- [12]
				4969, -- [13]
				4969, -- [14]
				4969, -- [15]
				4969, -- [16]
				4969, -- [17]
				4969, -- [18]
				4969, -- [19]
				4969, -- [20]
				4969, -- [21]
				4969, -- [22]
				4969, -- [23]
				4969, -- [24]
				4969, -- [25]
				4969, -- [26]
				4969, -- [27]
				4969, -- [28]
				4969, -- [29]
				4969, -- [30]
				4969, -- [31]
				4969, -- [32]
				4969, -- [33]
				4969, -- [34]
				4969, -- [35]
				4969, -- [36]
				4969, -- [37]
				4969, -- [38]
				4969, -- [39]
				4969, -- [40]
				4969, -- [41]
				4969, -- [42]
				4969, -- [43]
				4969, -- [44]
				4969, -- [45]
				4969, -- [46]
				4969, -- [47]
				4969, -- [48]
				4969, -- [49]
				4969, -- [50]
			},
			["NextEventNum"] = 47,
			["LastDamageTime"] = 41587.747,
			["LastEvents"] = {
				"特变电工 断筋 乃总-黑龙费尔默 Crit -100 (Physical)", -- [1]
				"特变电工 肉搏 乃总-黑龙费尔默 Hit -456 (Physical)", -- [2]
				"武动乾坤 寒冰箭 特变电工 Hit -56 (Frost)", -- [3]
				"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [4]
				"特变电工 肉搏 乃总-黑龙费尔默 Hit -370 (Physical)", -- [5]
				"特变电工 旋风斩 乃总-黑龙费尔默 Hit -389 (Physical)", -- [6]
				"武动乾坤 寒冰箭 特变电工 Hit -671 (Frost)", -- [7]
				"乃总-黑龙费尔默 肉搏 特变电工 Hit -113 (Physical)", -- [8]
				"乃总-黑龙费尔默 邪恶攻击 特变电工 Crit -385 (Physical)", -- [9]
				"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [10]
				"特变电工 断筋 乃总-黑龙费尔默 Dodge (Physical)", -- [11]
				"乃总-黑龙费尔默 邪恶攻击 特变电工 Hit -145 (Physical)", -- [12]
				"乃总-黑龙费尔默 肉搏 特变电工 Dodge (1)", -- [13]
				"武动乾坤 寒冰箭 特变电工 Reflect (Frost)", -- [14]
				"乃总-黑龙费尔默 肉搏 特变电工 Hit -107 (Physical)", -- [15]
				"瞬狱影杀阵-逐风者 冰霜新星 特变电工 Hit -98 (Frost)", -- [16]
				"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [17]
				"瞬狱影杀阵-逐风者 火焰冲击 特变电工 Crit -944 (Fire)", -- [18]
				"瞬狱影杀阵-逐风者 冰锥术 特变电工 Hit -566 (Frost)", -- [19]
				"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -118 (Physical)", -- [20]
				"特变电工 肉搏 瞬狱影杀阵-逐风者 Dodge (1)", -- [21]
				"特变电工 致死打击 瞬狱影杀阵-逐风者 Absorb -635 (635 被吸收) (Physical)", -- [22]
				"瞬狱影杀阵-逐风者 魔爆术 特变电工 Hit -310 (Arcane)", -- [23]
				"武动乾坤 寒冰箭 特变电工 Hit -607 (Frost)", -- [24]
				"特变电工死亡。", -- [25]
				"特变电工 肉搏 武动乾坤 Absorb -823 (823 被吸收) (1)", -- [26]
				"特变电工 肉搏 武动乾坤 Absorb -20 (1)", -- [27]
				"特变电工 断筋 武动乾坤 Hit -17 (20 被吸收) (Physical)", -- [28]
				"特变电工 重伤 (伤害/跳) 武动乾坤 Tick -76 (Physical)", -- [29]
				"武动乾坤 冰冻 特变电工 Immune (Frost)", -- [30]
				"特变电工 拳击 武动乾坤 Hit -41 (Physical)", -- [31]
				"特变电工 肉搏 武动乾坤 Hit -397 (Physical)", -- [32]
				"武动乾坤 冰冻 特变电工 Immune (Frost)", -- [33]
				"武动乾坤 冰冻 特变电工 Immune (Frost)", -- [34]
				"特变电工 旋风斩 武动乾坤 Hit -413 (Physical)", -- [35]
				"特变电工 重伤 (伤害/跳) 武动乾坤 Tick -75 (Physical)", -- [36]
				"特变电工 重伤 (伤害/跳) 武动乾坤 Tick -76 (Physical)", -- [37]
				"特变电工 重伤 (伤害/跳) 武动乾坤 Tick -76 (Physical)", -- [38]
				"特变电工 肉搏 英雄请留命 Absorb -356 (356 被吸收) (1)", -- [39]
				"特变电工 肉搏 英雄请留命 Absorb -324 (324 被吸收) (1)", -- [40]
				"武动乾坤 冰霜新星 特变电工 Hit -95 (Frost)", -- [41]
				"英雄请留命 暗言术：痛 (伤害/跳) 特变电工 Tick -187 (Shadow)", -- [42]
				"英雄请留命 射击 特变电工 Hit -76 (Shadow)", -- [43]
				"英雄请留命 射击 特变电工 Hit -122 (Shadow)", -- [44]
				"英雄请留命 暗言术：痛 (伤害/跳) 特变电工 Tick -187 (Shadow)", -- [45]
				"武动乾坤 火焰冲击 特变电工 Hit -575 (Fire)", -- [46]
				"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -96 (Physical)", -- [47]
				"武动乾坤 火焰冲击 特变电工 Hit -522 (Fire)", -- [48]
				"特变电工 重伤 (伤害/跳) 乃总-黑龙费尔默 Tick -96 (Physical)", -- [49]
				"特变电工 拦截昏迷 乃总-黑龙费尔默 Hit -63 (Physical)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				41489.456, -- [1]
				41489.589, -- [2]
				41490.673, -- [3]
				41492.489, -- [4]
				41493.439, -- [5]
				41493.523, -- [6]
				41493.906, -- [7]
				41494.789, -- [8]
				41494.789, -- [9]
				41495.49, -- [10]
				41495.573, -- [11]
				41495.856, -- [12]
				41496.19, -- [13]
				41496.456, -- [14]
				41496.59, -- [15]
				41498.44, -- [16]
				41498.49, -- [17]
				41499.957, -- [18]
				41501.457, -- [19]
				41501.49, -- [20]
				41501.957, -- [21]
				41502.09, -- [22]
				41502.957, -- [23]
				41503.007, -- [24]
				41503.007, -- [25]
				41545.877, -- [26]
				41545.943, -- [27]
				41545.943, -- [28]
				41548.91, -- [29]
				41549.244, -- [30]
				41549.244, -- [31]
				41550.894, -- [32]
				41550.894, -- [33]
				41551.277, -- [34]
				41551.277, -- [35]
				41551.911, -- [36]
				41554.911, -- [37]
				41557.911, -- [38]
				41583.93, -- [39]
				41587.747, -- [40]
				41590.163, -- [41]
				41591.897, -- [42]
				41592.914, -- [43]
				41594.814, -- [44]
				41594.914, -- [45]
				41596.319, -- [46]
				41485.422, -- [47]
				41486.989, -- [48]
				41488.422, -- [49]
				41488.806, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1242,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 95,
						["Fire"] = 575,
						["Shadow"] = 572,
					},
					["DOT_Time"] = 0,
					["Damage"] = 680,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 680,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 680,
					},
					["PartialAbsorb"] = {
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["英雄请留命"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 680,
								},
							},
							["amount"] = 680,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["武动乾坤"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 575,
								},
								["冰霜新星"] = {
									["count"] = 95,
								},
							},
							["amount"] = 670,
						},
						["英雄请留命"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 374,
								},
								["射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 572,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["英雄请留命"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 356,
									["min"] = 324,
									["count"] = 2,
									["amount"] = 680,
								},
							},
							["count"] = 2,
							["amount"] = 680,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3,
					["TimeDamaging"] = {
						["英雄请留命"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["武动乾坤"] = {
									["count"] = 12,
								},
								["乃总-黑龙费尔默"] = {
									["count"] = 21,
								},
								["兜兜颛颛-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 45,
						},
					},
					["TimeSpent"] = {
						["武动乾坤"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.38,
								},
								["拳击"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.13,
								},
								["肉搏"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 8.91,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.13,
								},
								["肉搏"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 0.6,
						},
						["兜兜颛颛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.35,
								},
								["断筋"] = {
									["count"] = 3.83,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.83,
								},
								["肉搏"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 10.69,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.35,
						},
						["英雄请留命"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 10.5,
								},
								["旋风斩"] = {
									["count"] = 0.08,
								},
								["拦截昏迷"] = {
									["count"] = 0.38,
								},
								["断筋"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 14.27,
						},
					},
					["DamageTaken"] = 12205,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 63,
								},
							},
							["amount"] = 83,
						},
					},
					["PartialResist"] = {
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["火球术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火球术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["火球术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火球术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 40.81999999999999,
					["ElementTaken"] = {
						["Frost"] = 3940,
						["Melee"] = 897,
						["Arcane"] = 1594,
						["Fire"] = 4039,
						["Shadow"] = 572,
						["Physical"] = 1163,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 63,
								},
							},
							["amount"] = 63,
						},
					},
					["Damage"] = 10660,
					["ElementDoneAbsorb"] = {
						["Melee"] = 1522,
						["Physical"] = 691,
					},
					["DOT_Time"] = 45,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Reflect"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 15,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1502,
									["min"] = 1502,
									["count"] = 1,
									["amount"] = 1502,
								},
								["Absorb"] = {
									["max"] = 635,
									["min"] = 635,
									["count"] = 1,
									["amount"] = 635,
								},
							},
							["count"] = 2,
							["amount"] = 2137,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 1,
									["amount"] = 41,
								},
							},
							["count"] = 1,
							["amount"] = 41,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 413,
									["min"] = 389,
									["count"] = 2,
									["amount"] = 802,
								},
							},
							["count"] = 2,
							["amount"] = 802,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 134,
									["min"] = 75,
									["count"] = 15,
									["amount"] = 1500,
								},
							},
							["count"] = 15,
							["amount"] = 1500,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 63,
									["min"] = 63,
									["count"] = 1,
									["amount"] = 63,
								},
							},
							["count"] = 1,
							["amount"] = 63,
						},
						["断筋"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 36,
									["min"] = 36,
									["count"] = 1,
									["amount"] = 36,
								},
								["Crit"] = {
									["max"] = 100,
									["min"] = 77,
									["count"] = 2,
									["amount"] = 177,
								},
								["Hit"] = {
									["max"] = 44,
									["min"] = 17,
									["count"] = 4,
									["amount"] = 140,
								},
							},
							["count"] = 8,
							["amount"] = 353,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 554,
									["min"] = 554,
									["count"] = 1,
									["amount"] = 554,
								},
							},
							["count"] = 1,
							["amount"] = 554,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 823,
									["min"] = 19,
									["count"] = 5,
									["amount"] = 1542,
								},
								["Crit"] = {
									["max"] = 775,
									["min"] = 775,
									["count"] = 1,
									["amount"] = 775,
								},
								["Hit"] = {
									["max"] = 482,
									["min"] = 370,
									["count"] = 7,
									["amount"] = 2893,
								},
							},
							["count"] = 14,
							["amount"] = 5210,
						},
					},
					["RageGain"] = 83,
					["DamagedWho"] = {
						["武动乾坤"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 303,
								},
								["旋风斩"] = {
									["count"] = 413,
								},
								["断筋"] = {
									["count"] = 17,
								},
								["拳击"] = {
									["count"] = 41,
								},
								["肉搏"] = {
									["count"] = 1240,
								},
							},
							["amount"] = 2014,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 635,
								},
							},
							["amount"] = 635,
						},
						["兜兜颛颛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1502,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 437,
								},
								["断筋"] = {
									["count"] = 164,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 554,
								},
								["肉搏"] = {
									["count"] = 1285,
								},
							},
							["amount"] = 3942,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 404,
								},
								["断筋"] = {
									["count"] = 72,
								},
							},
							["amount"] = 476,
						},
						["英雄请留命"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 680,
								},
							},
							["amount"] = 680,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 760,
								},
								["旋风斩"] = {
									["count"] = 389,
								},
								["拦截昏迷"] = {
									["count"] = 63,
								},
								["断筋"] = {
									["count"] = 100,
								},
								["肉搏"] = {
									["count"] = 1601,
								},
							},
							["amount"] = 2913,
						},
					},
					["TimeDamage"] = 40.81999999999999,
					["TimeDamaging"] = {
						["武动乾坤"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.38,
								},
								["拳击"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.13,
								},
								["肉搏"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 8.91,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.13,
								},
								["肉搏"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 0.6,
						},
						["兜兜颛颛-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.35,
								},
								["断筋"] = {
									["count"] = 3.83,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.83,
								},
								["肉搏"] = {
									["count"] = 1.51,
								},
							},
							["amount"] = 10.69,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.35,
						},
						["英雄请留命"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 10.5,
								},
								["旋风斩"] = {
									["count"] = 0.08,
								},
								["拦截昏迷"] = {
									["count"] = 0.38,
								},
								["断筋"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 2.58,
								},
							},
							["amount"] = 14.27,
						},
					},
					["WhoDamaged"] = {
						["武动乾坤"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 267,
								},
								["魔爆术"] = {
									["count"] = 342,
								},
								["寒冰箭"] = {
									["count"] = 1334,
								},
								["火焰冲击"] = {
									["count"] = 1097,
								},
								["冰锥术"] = {
									["count"] = 1008,
								},
							},
							["amount"] = 4048,
						},
						["罚死-黑龙费尔默"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1980,
								},
								["火球术 (伤害/跳)"] = {
									["count"] = 18,
								},
							},
							["amount"] = 1998,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1252,
								},
								["火焰冲击"] = {
									["count"] = 944,
								},
								["冰锥术"] = {
									["count"] = 1143,
								},
								["冰霜新星"] = {
									["count"] = 188,
								},
							},
							["amount"] = 3527,
						},
						["兜兜颛颛-逐风者"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 144,
								},
							},
							["amount"] = 144,
						},
						["玉青-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 59,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 147,
								},
								["肉搏"] = {
									["count"] = 279,
								},
							},
							["amount"] = 485,
						},
						["英雄请留命"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 374,
								},
								["射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 572,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 813,
								},
								["肉搏"] = {
									["count"] = 618,
								},
							},
							["amount"] = 1431,
						},
					},
					["ElementDone"] = {
						["Melee"] = 5210,
						["Physical"] = 5450,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 15,
								},
							},
							["amount"] = 30,
						},
					},
				},
			},
			["UnitLockout"] = 41442.102,
			["LastActive"] = 41596.097,
		},
		["旧巷与猫-黑龙费尔默"] = {
			["GUID"] = "Player-5450-030777A2",
			["LastEventHealth"] = {
				5139, -- [1]
				4599, -- [2]
				4052, -- [3]
				3496, -- [4]
				2522, -- [5]
				1976, -- [6]
				874, -- [7]
				321, -- [8]
				0, -- [9]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"MISC", -- [9]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					5477, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "旧巷与猫-黑龙费尔默",
			["level"] = 60,
			["LastDamageAbility"] = "火焰冲击",
			["LastFightIn"] = 3,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
					},
					["Messages"] = {
						"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Hit -546 (Frost)", -- [1]
						"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Crit -1102 (Frost)", -- [2]
						"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Hit -553 (Frost)", -- [3]
						"武动乾坤 火焰冲击 旧巷与猫-黑龙费尔默 Hit -525 (Fire)", -- [4]
						"旧巷与猫-黑龙费尔默死亡。", -- [5]
					},
					["DeathAt"] = 41566.112,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
					},
					["MessageTimes"] = {
						-7.567000000002736, -- [1]
						-4.516999999999825, -- [2]
						-1.432999999997264, -- [3]
						-0.03299999999580905, -- [4]
						0, -- [5]
					},
					["HealthMax"] = {
						5139, -- [1]
						5139, -- [2]
						5139, -- [3]
						5139, -- [4]
						5139, -- [5]
					},
					["Health"] = {
						2522, -- [1]
						1976, -- [2]
						874, -- [3]
						321, -- [4]
						0, -- [5]
					},
					["KilledBy"] = "武动乾坤",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"MISC", -- [5]
					},
				}, -- [1]
			},
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 525,
			["Owner"] = false,
			["TimeLast"] = {
				["OVERALL"] = 41564.111,
				["DamageTaken"] = 41564.111,
				["DeathCount"] = 41564.111,
			},
			["NextEventNum"] = 10,
			["LastEventHealthMax"] = {
				5139, -- [1]
				5139, -- [2]
				5139, -- [3]
				5139, -- [4]
				5139, -- [5]
				5139, -- [6]
				5139, -- [7]
				5139, -- [8]
				5139, -- [9]
			},
			["LastEvents"] = {
				"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Hit -540 (Frost)", -- [1]
				"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Hit -547 (Frost)", -- [2]
				"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Hit -556 (Frost)", -- [3]
				"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Crit -1108 (Frost)", -- [4]
				"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Hit -546 (Frost)", -- [5]
				"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Crit -1102 (Frost)", -- [6]
				"武动乾坤 寒冰箭 旧巷与猫-黑龙费尔默 Hit -553 (Frost)", -- [7]
				"武动乾坤 火焰冲击 旧巷与猫-黑龙费尔默 Hit -525 (Fire)", -- [8]
				"旧巷与猫-黑龙费尔默死亡。", -- [9]
			},
			["Name"] = "旧巷与猫-黑龙费尔默",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
			},
			["LastEventTimes"] = {
				41538.376, -- [1]
				41540.926, -- [2]
				41543.493, -- [3]
				41546.01, -- [4]
				41556.844, -- [5]
				41559.894, -- [6]
				41562.978, -- [7]
				41564.378, -- [8]
				41564.411, -- [9]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["武动乾坤"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 525,
								},
								["寒冰箭"] = {
									["count"] = 4952,
								},
							},
							["amount"] = 5477,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 525,
						["Frost"] = 4952,
					},
					["DamageTaken"] = 5477,
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
					},
				},
			},
			["UnitLockout"] = 41538.11,
			["LastActive"] = 41564.111,
		},
		["啦啦女-黑龙费尔默"] = {
			["GUID"] = "Player-5450-02EBC1CA",
			["LastEventHealth"] = {
				3050, -- [1]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					138, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "啦啦女-黑龙费尔默",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 2,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 138,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 41532.109,
				["OVERALL"] = 41532.109,
			},
			["NextEventNum"] = 2,
			["LastEventHealthMax"] = {
				3050, -- [1]
			},
			["LastEvents"] = {
				"Environment Falling 啦啦女-黑龙费尔默 Hit -138 (Physical)", -- [1]
			},
			["Name"] = "啦啦女-黑龙费尔默",
			["LastEventIncoming"] = {
				true, -- [1]
			},
			["LastEventTimes"] = {
				41532.142, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 138,
								},
							},
							["amount"] = 138,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 138,
					},
					["DamageTaken"] = 138,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 41532.109,
			["LastActive"] = 41532.109,
		},
		["节奏大师 <Mayfly>"] = {
			["GUID"] = "Pet-0-5429-30-25386-2850-03012A4A82",
			["LastEventHealth"] = {
				3305, -- [1]
				3211, -- [2]
				2709, -- [3]
				2548, -- [4]
				2072, -- [5]
				1993, -- [6]
				1523, -- [7]
				1096, -- [8]
				784, -- [9]
				3305, -- [10]
				3305, -- [11]
				3305, -- [12]
				3305, -- [13]
			},
			["LastAttackedBy"] = "武动乾坤",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
			},
			["TimeWindows"] = {
				["Damage"] = {
					42, -- [1]
				},
				["TimeDamage"] = {
					5.4, -- [1]
				},
				["DamageTaken"] = {
					2798, -- [1]
				},
				["ActiveTime"] = {
					5.4, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "节奏大师",
			["level"] = 1,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 2,
			["type"] = "Pet",
			["ownerName"] = "Mayfly",
			["LastEventHealthMax"] = {
				3305, -- [1]
				3305, -- [2]
				3305, -- [3]
				3305, -- [4]
				3305, -- [5]
				3305, -- [6]
				3305, -- [7]
				3305, -- [8]
				3305, -- [9]
				3305, -- [10]
				3305, -- [11]
				3305, -- [12]
				3305, -- [13]
			},
			["LastDamageTaken"] = 277,
			["TimeLast"] = {
				["ActiveTime"] = 41488.106,
				["TimeDamage"] = 41488.106,
				["OVERALL"] = 41488.106,
				["DamageTaken"] = 41452.112,
				["Damage"] = 41479.105,
			},
			["NextEventNum"] = 14,
			["LastDamageTime"] = 41488.539,
			["LastEvents"] = {
				"瞬狱影杀阵-逐风者 冰霜新星 节奏大师 <Mayfly> Hit -94 (Frost)", -- [1]
				"武动乾坤 冰锥术 节奏大师 <Mayfly> Hit -502 (Frost)", -- [2]
				"武动乾坤 冰霜新星 节奏大师 <Mayfly> Crit -161 (Frost)", -- [3]
				"瞬狱影杀阵-逐风者 魔爆术 节奏大师 <Mayfly> Crit -476 (Arcane)", -- [4]
				"武动乾坤 魔爆术 节奏大师 <Mayfly> Crit -79 (Arcane)", -- [5]
				"瞬狱影杀阵-逐风者 魔爆术 节奏大师 <Mayfly> Crit -470 (Arcane)", -- [6]
				"武动乾坤 魔爆术 节奏大师 <Mayfly> Crit -427 (Arcane)", -- [7]
				"瞬狱影杀阵-逐风者 魔爆术 节奏大师 <Mayfly> Hit -312 (Arcane)", -- [8]
				"武动乾坤 魔爆术 节奏大师 <Mayfly> Hit -277 (Arcane)", -- [9]
				"节奏大师 <Mayfly> 肉搏 灵魂摆渡人-逐风者 Hit -42 (Physical)", -- [10]
				"节奏大师 <Mayfly> 肉搏 灵魂摆渡人-逐风者 Immune (1)", -- [11]
				"节奏大师 <Mayfly> 肉搏 灵魂摆渡人-逐风者 Immune (1)", -- [12]
				"节奏大师 <Mayfly> 肉搏 灵魂摆渡人-逐风者 Immune (1)", -- [13]
			},
			["Name"] = "节奏大师",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
			},
			["LastEventTimes"] = {
				41443.286, -- [1]
				41446.086, -- [2]
				41447.603, -- [3]
				41448.903, -- [4]
				41449.12, -- [5]
				41450.403, -- [6]
				41450.62, -- [7]
				41451.903, -- [8]
				41452.125, -- [9]
				41479.655, -- [10]
				41486.139, -- [11]
				41487.489, -- [12]
				41488.539, -- [13]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["DamagedWho"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 42,
								},
							},
							["amount"] = 42,
						},
					},
					["ElementDone"] = {
						["Melee"] = 42,
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 4,
							["amount"] = 42,
						},
					},
					["ElementHitsTaken"] = {
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 2798,
					["TimeSpent"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 5.4,
								},
							},
							["amount"] = 5.4,
						},
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["TimeDamaging"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 5.4,
								},
							},
							["amount"] = 5.4,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 5.4,
					["WhoDamaged"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1258,
								},
								["冰霜新星"] = {
									["count"] = 94,
								},
							},
							["amount"] = 1352,
						},
						["武动乾坤"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 783,
								},
								["冰霜新星"] = {
									["count"] = 161,
								},
								["冰锥术"] = {
									["count"] = 502,
								},
							},
							["amount"] = 1446,
						},
					},
					["ElementTaken"] = {
						["Arcane"] = 2041,
						["Frost"] = 757,
					},
					["TimeDamage"] = 5.4,
					["Damage"] = 42,
				},
			},
			["UnitLockout"] = 41443.102,
			["LastActive"] = 41488.106,
		},
		["Mayfly"] = {
			["GUID"] = "Player-5458-0309D3AF",
			["LastEventHealth"] = {
				4584, -- [1]
				4584, -- [2]
				4536, -- [3]
				4435, -- [4]
				4333, -- [5]
				4333, -- [6]
				4128, -- [7]
				4039, -- [8]
				3032, -- [9]
				2483, -- [10]
				2310, -- [11]
				1852, -- [12]
				1799, -- [13]
				1480, -- [14]
				1190, -- [15]
				1194, -- [16]
				719, -- [17]
				4584, -- [18]
				4584, -- [19]
				4584, -- [20]
				4584, -- [21]
				4584, -- [22]
				4584, -- [23]
			},
			["LastAttackedBy"] = "武动乾坤",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					7.55, -- [1]
				},
				["TimeDamage"] = {
					7.55, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					4445, -- [1]
				},
				["Damage"] = {
					1736, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = "Mayfly",
			["level"] = 60,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 2,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				4584, -- [1]
				4584, -- [2]
				4584, -- [3]
				4584, -- [4]
				4584, -- [5]
				4584, -- [6]
				4584, -- [7]
				4584, -- [8]
				4584, -- [9]
				4584, -- [10]
				4584, -- [11]
				4584, -- [12]
				4584, -- [13]
				4584, -- [14]
				4584, -- [15]
				4584, -- [16]
				4584, -- [17]
				4584, -- [18]
				4584, -- [19]
				4584, -- [20]
				4584, -- [21]
				4584, -- [22]
				4584, -- [23]
			},
			["TimeLast"] = {
				["TimeDamage"] = 41488.106,
				["ActiveTime"] = 41488.106,
				["Healing"] = 41443.102,
				["OVERALL"] = 41488.106,
				["DamageTaken"] = 41452.112,
				["Damage"] = 41480.105,
			},
			["LastDamageTaken"] = 276,
			["Owner"] = false,
			["Pet"] = {
				"节奏大师 <Mayfly>", -- [1]
			},
			["NextEventNum"] = 24,
			["LastDamageTime"] = 41488.222,
			["LastEvents"] = {
				"Environment Falling Mayfly Hit -281 (Physical)", -- [1]
				"武动乾坤 寒冰箭 Mayfly Hit -51 (Frost)", -- [2]
				"兜兜颛颛-逐风者 肉搏 Mayfly Hit -105 (Physical)", -- [3]
				"兜兜颛颛-逐风者 肉搏 Mayfly Crit -102 (Physical)", -- [4]
				"兜兜颛颛-逐风者 出血 Mayfly Hit -167 (Physical)", -- [5]
				"兜兜颛颛-逐风者 灼热武器 Mayfly Hit -41 (Fire)", -- [6]
				"瞬狱影杀阵-逐风者 冰霜新星 Mayfly Hit -92 (Frost)", -- [7]
				"武动乾坤 冰锥术 Mayfly Crit -1010 (Frost)", -- [8]
				"瞬狱影杀阵-逐风者 冰锥术 Mayfly Hit -549 (Frost)", -- [9]
				"武动乾坤 冰霜新星 Mayfly Crit -173 (Frost)", -- [10]
				"瞬狱影杀阵-逐风者 魔爆术 Mayfly Crit -461 (Arcane)", -- [11]
				"武动乾坤 魔爆术 Mayfly Hit -53 (Arcane)", -- [12]
				"瞬狱影杀阵-逐风者 魔爆术 Mayfly Hit -319 (Arcane)", -- [13]
				"武动乾坤 魔爆术 Mayfly Hit -290 (Arcane)", -- [14]
				"Mayfly 肉搏 瞬狱影杀阵-逐风者 Absorb -304 (304 被吸收) (1)", -- [15]
				"瞬狱影杀阵-逐风者 魔爆术 Mayfly Crit -475 (Arcane)", -- [16]
				"武动乾坤 魔爆术 Mayfly Hit -276 (Arcane)", -- [17]
				"Mayfly 自动射击 灵魂摆渡人-逐风者 Hit -297 (Physical)", -- [18]
				"Mayfly 多重射击 灵魂摆渡人-逐风者 Hit -493 (Physical)", -- [19]
				"Mayfly 多重射击 乃总-黑龙费尔默 Hit -489 (Physical)", -- [20]
				"Mayfly 驱散射击 灵魂摆渡人-逐风者 Hit -153 (Physical)", -- [21]
				"Mayfly 自动射击 灵魂摆渡人-逐风者 Immune (Physical)", -- [22]
				"Mayfly 自动射击 灵魂摆渡人-逐风者 Immune (Physical)", -- [23]
			},
			["Name"] = "Mayfly",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
			},
			["LastEventTimes"] = {
				41403.033, -- [1]
				41437.619, -- [2]
				41440.019, -- [3]
				41440.935, -- [4]
				41442.219, -- [5]
				41442.219, -- [6]
				41443.286, -- [7]
				41446.086, -- [8]
				41447.386, -- [9]
				41447.603, -- [10]
				41448.903, -- [11]
				41449.12, -- [12]
				41450.403, -- [13]
				41450.62, -- [14]
				41450.836, -- [15]
				41451.903, -- [16]
				41452.125, -- [17]
				41479.005, -- [18]
				41479.022, -- [19]
				41479.272, -- [20]
				41480.555, -- [21]
				41486.422, -- [22]
				41488.222, -- [23]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 4.5,
								},
								["多重射击"] = {
									["count"] = 0.02,
								},
								["驱散射击"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 5.8,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 0.25,
						},
					},
					["DamageTaken"] = 4445,
					["ElementDoneAbsorb"] = {
						["Melee"] = 304,
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 7.55,
					["ElementTaken"] = {
						["Frost"] = 1875,
						["Melee"] = 207,
						["Arcane"] = 1874,
						["Fire"] = 41,
						["Physical"] = 448,
					},
					["Damage"] = 1736,
					["Healing"] = 0,
					["Attacks"] = {
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 153,
									["min"] = 153,
									["count"] = 1,
									["amount"] = 153,
								},
							},
							["count"] = 1,
							["amount"] = 153,
						},
						["自动射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 297,
									["min"] = 297,
									["count"] = 1,
									["amount"] = 297,
								},
							},
							["count"] = 3,
							["amount"] = 297,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 493,
									["min"] = 489,
									["count"] = 2,
									["amount"] = 982,
								},
							},
							["count"] = 2,
							["amount"] = 982,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 304,
									["min"] = 304,
									["count"] = 1,
									["amount"] = 304,
								},
							},
							["count"] = 1,
							["amount"] = 304,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["DamagedWho"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 297,
								},
								["多重射击"] = {
									["count"] = 493,
								},
								["驱散射击"] = {
									["count"] = 153,
								},
							},
							["amount"] = 943,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 304,
								},
							},
							["amount"] = 304,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 489,
								},
							},
							["amount"] = 489,
						},
					},
					["TimeDamage"] = 7.55,
					["WhoDamaged"] = {
						["武动乾坤"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 619,
								},
								["寒冰箭"] = {
									["count"] = 51,
								},
								["冰霜新星"] = {
									["count"] = 173,
								},
								["冰锥术"] = {
									["count"] = 1010,
								},
							},
							["amount"] = 1853,
						},
						["兜兜颛颛-逐风者"] = {
							["Details"] = {
								["灼热武器"] = {
									["count"] = 41,
								},
								["出血"] = {
									["count"] = 167,
								},
								["肉搏"] = {
									["count"] = 207,
								},
							},
							["amount"] = 415,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1255,
								},
								["冰锥术"] = {
									["count"] = 549,
								},
								["冰霜新星"] = {
									["count"] = 92,
								},
							},
							["amount"] = 1896,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 281,
								},
							},
							["amount"] = 281,
						},
					},
					["ElementDone"] = {
						["Melee"] = 304,
						["Physical"] = 1432,
					},
					["TimeDamaging"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 4.5,
								},
								["多重射击"] = {
									["count"] = 0.02,
								},
								["驱散射击"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 5.8,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 0.25,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 41402.099,
			["LastActive"] = 41488.106,
		},
		["水煮电线杆"] = {
			["GUID"] = "Player-5458-02F4E49D",
			["LastEventHealth"] = {
				1838, -- [1]
				1838, -- [2]
				1838, -- [3]
			},
			["LastAttackedBy"] = "灵魂摆渡人-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
			},
			["TimeWindows"] = {
				["Damage"] = {
					188, -- [1]
				},
				["TimeDamage"] = {
					1.5, -- [1]
				},
				["DamageTaken"] = {
					534, -- [1]
				},
				["ActiveTime"] = {
					1.5, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "水煮电线杆",
			["level"] = 60,
			["LastDamageAbility"] = "火焰冲击",
			["LastFightIn"] = 2,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				2530, -- [1]
				2530, -- [2]
				2530, -- [3]
			},
			["LastDamageTaken"] = 534,
			["Owner"] = false,
			["TimeLast"] = {
				["ActiveTime"] = 41478.105,
				["TimeDamage"] = 41478.105,
				["OVERALL"] = 41478.105,
				["DamageTaken"] = 41472.104,
				["Damage"] = 41478.105,
			},
			["NextEventNum"] = 4,
			["LastDamageTime"] = 41478.255,
			["LastEvents"] = {
				"灵魂摆渡人-逐风者 火焰冲击 水煮电线杆 Absorb -534 (534 被吸收) (Fire)", -- [1]
				"水煮电线杆 冰霜新星 灵魂摆渡人-逐风者 Hit -91 (Frost)", -- [2]
				"水煮电线杆 冰霜新星 乃总-黑龙费尔默 Hit -97 (Frost)", -- [3]
			},
			["Name"] = "水煮电线杆",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
			},
			["LastEventTimes"] = {
				41472.538, -- [1]
				41478.255, -- [2]
				41478.255, -- [3]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamagedWho"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 91,
								},
							},
							["amount"] = 91,
						},
						["乃总-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 97,
								},
							},
							["amount"] = 97,
						},
					},
					["ElementDone"] = {
						["Frost"] = 188,
					},
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 97,
									["min"] = 91,
									["count"] = 2,
									["amount"] = 188,
								},
							},
							["count"] = 2,
							["amount"] = 188,
						},
					},
					["ElementTakenAbsorb"] = {
						["Fire"] = 534,
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 534,
					["TimeDamaging"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["PartialResist"] = {
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 1.5,
					["PartialAbsorb"] = {
						["火焰冲击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 534,
									["min"] = 534,
									["count"] = 1,
									["amount"] = 534,
								},
							},
							["count"] = 1,
							["amount"] = 534,
						},
					},
					["ActiveTime"] = 1.5,
					["WhoDamaged"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 534,
								},
							},
							["amount"] = 534,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 534,
					},
					["TimeSpent"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Damage"] = 188,
				},
			},
			["UnitLockout"] = 41472.104,
			["LastActive"] = 41478.105,
		},
	},
	["FightNum"] = 5,
	["CombatTimes"] = {
		{
			41294.109, -- [1]
			41340.111, -- [2]
			"01:20:56", -- [3]
			"01:21:42", -- [4]
			"桌子", -- [5]
		}, -- [1]
		{
			41437.102, -- [1]
			41454.103, -- [2]
			"01:23:20", -- [3]
			"01:23:36", -- [4]
			"武动乾坤", -- [5]
		}, -- [2]
		{
			41460.104, -- [1]
			41538.11, -- [2]
			"01:23:43", -- [3]
			"01:25:00", -- [4]
			"兜兜颛颛-逐风者", -- [5]
		}, -- [3]
		{
			41538.11, -- [1]
			41577.096, -- [2]
			"01:25:00", -- [3]
			"01:25:39", -- [4]
			"武动乾坤", -- [5]
		}, -- [4]
		{
			41583.096, -- [1]
			41598.217, -- [2]
			"01:25:46", -- [3]
			"01:26:00", -- [4]
			"英雄请留命", -- [5]
		}, -- [5]
	},
	["FoughtWho"] = {
	},
}
