
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["古剑战神"] = {
			["GUID"] = "Player-5458-033E35D2",
			["LastEventHealth"] = {
				3373, -- [1]
				3336, -- [2]
				3131, -- [3]
				3131, -- [4]
				3202, -- [5]
				3104, -- [6]
				3037, -- [7]
				3037, -- [8]
				2631, -- [9]
				2631, -- [10]
				2631, -- [11]
				2430, -- [12]
				2501, -- [13]
				2055, -- [14]
				2055, -- [15]
				1922, -- [16]
				1922, -- [17]
				1500, -- [18]
				3788, -- [19]
				3482, -- [20]
				3482, -- [21]
				3482, -- [22]
				2955, -- [23]
				3036, -- [24]
				2921, -- [25]
				2921, -- [26]
				2546, -- [27]
				2627, -- [28]
				2411, -- [29]
				2089, -- [30]
				1694, -- [31]
				1567, -- [32]
				1529, -- [33]
				1611, -- [34]
				1202, -- [35]
				1075, -- [36]
				783, -- [37]
				745, -- [38]
				827, -- [39]
				4062, -- [40]
				4000, -- [41]
				4000, -- [42]
				4000, -- [43]
				4000, -- [44]
				3664, -- [45]
				3628, -- [46]
				3628, -- [47]
				3628, -- [48]
				3628, -- [49]
				3373, -- [50]
			},
			["LastAttackedBy"] = "哎哟喂-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"HEAL", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"HEAL", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"HEAL", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"HEAL", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"HEAL", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"HEAL", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					45.16, -- [1]
				},
				["Healing"] = {
					5663, -- [1]
				},
				["DamageTaken"] = {
					35022, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["RageGain"] = {
					237, -- [1]
				},
				["HOT_Time"] = {
					84, -- [1]
				},
				["TimeDamage"] = {
					102.87, -- [1]
				},
				["HealingTaken"] = {
					5663, -- [1]
				},
				["ActiveTime"] = {
					148.03, -- [1]
				},
				["DOT_Time"] = {
					57, -- [1]
				},
				["Damage"] = {
					31656, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "古剑战神",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
					},
					["Messages"] = {
						"龙九爷-黑龙费尔默 冰霜箭 古剑战神 Hit -35 (Frost)", -- [1]
						"猫头鹰 爪击 古剑战神 Hit -22 (Physical)", -- [2]
						"麦积烟雨 奥术射击 古剑战神 Hit -178 (Arcane)", -- [3]
						"龙九爷-黑龙费尔默 自动射击 古剑战神 Hit -75 (Physical)", -- [4]
						"猫头鹰 肉搏 古剑战神 Hit -41 (Physical)", -- [5]
						"猫头鹰 尖啸 古剑战神 Hit -15 (Physical)", -- [6]
						"古剑战神 肉搏 猫头鹰 Hit -162 (Physical)", -- [7]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -128 (Nature)", -- [8]
						"猫头鹰 尖啸 古剑战神 Parry (Physical)", -- [9]
						"猫头鹰 肉搏 古剑战神 Hit -47 (Physical)", -- [10]
						"古剑战神 肉搏 猫头鹰 Dodge (1)", -- [11]
						"猫头鹰 爪击 古剑战神 Hit -26 (Physical)", -- [12]
						"猫头鹰 肉搏 古剑战神 Hit -51 (Physical)", -- [13]
						"豹 肉搏 古剑战神 Dodge (1)", -- [14]
						"豹 爪击 古剑战神 Hit -33 (Physical)", -- [15]
						"麦积烟雨 奥术射击 古剑战神 Crit -517 (Arcane)", -- [16]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -127 (Nature)", -- [17]
						"麦积烟雨 自动射击 古剑战神 Hit -184 (Physical)", -- [18]
						"豹 肉搏 古剑战神 Dodge (1)", -- [19]
						"猫头鹰 肉搏 古剑战神 Hit -59 (Physical)", -- [20]
						"豹 爪击 古剑战神 Hit -32 (Physical)", -- [21]
						"猫头鹰 爪击 古剑战神 Crit -67 (Physical)", -- [22]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -126 (Nature)", -- [23]
						"麦积烟雨 多重射击 古剑战神 Hit -157 (Physical)", -- [24]
						"豹 肉搏 古剑战神 Hit -51 (Physical)", -- [25]
						"麦积烟雨 自动射击 古剑战神 Hit -159 (Physical)", -- [26]
						"豹 爪击 古剑战神 Hit -40 (Physical)", -- [27]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -127 (Nature)", -- [28]
						"麦积烟雨 自动射击 古剑战神 Hit -211 (Physical)", -- [29]
						"豹 肉搏 古剑战神 Hit -52 (Physical)", -- [30]
						"猫头鹰 肉搏 古剑战神 Hit -62 (Physical)", -- [31]
						"古剑战神 血之狂热 古剑战神 Tick +71", -- [32]
						"豹 爪击 古剑战神 Hit -36 (Physical)", -- [33]
						"猫头鹰 爪击 古剑战神 Hit -42 (Physical)", -- [34]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -127 (Nature)", -- [35]
						"豹 肉搏 古剑战神 Hit -44 (Physical)", -- [36]
						"麦积烟雨 奥术射击 古剑战神 Hit -218 (Arcane)", -- [37]
						"古剑战神 血之狂热 古剑战神 Tick +71", -- [38]
						"猫头鹰 肉搏 古剑战神 Hit -46 (Physical)", -- [39]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -126 (Nature)", -- [40]
						"豹 爪击 古剑战神 Miss (Physical)", -- [41]
						"麦积烟雨 自动射击 古剑战神 Hit -223 (Physical)", -- [42]
						"古剑战神死亡。", -- [43]
					},
					["DeathAt"] = 7155.259,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
					},
					["MessageTimes"] = {
						-14.96800000000076, -- [1]
						-14.6840000000002, -- [2]
						-14.45100000000002, -- [3]
						-13.80100000000039, -- [4]
						-12.60000000000036, -- [5]
						-12.2510000000002, -- [6]
						-11.88400000000002, -- [7]
						-10.6840000000002, -- [8]
						-10.63400000000002, -- [9]
						-10.60000000000036, -- [10]
						-10.21700000000055, -- [11]
						-9.017000000000735, -- [12]
						-8.601000000000568, -- [13]
						-8.217000000000553, -- [14]
						-8.217000000000553, -- [15]
						-8.134000000000015, -- [16]
						-7.667000000000371, -- [17]
						-7.53400000000056, -- [18]
						-6.817000000000007, -- [19]
						-6.584000000000742, -- [20]
						-6.584000000000742, -- [21]
						-6.584000000000742, -- [22]
						-6.5, -- [23]
						-5.417000000000371, -- [24]
						-5.417000000000371, -- [25]
						-5.25, -- [26]
						-4.950000000000728, -- [27]
						-4.684000000000197, -- [28]
						-2.667000000000371, -- [29]
						-2.600000000000364, -- [30]
						-2.583000000000538, -- [31]
						-2.583000000000538, -- [32]
						-1.733000000000175, -- [33]
						-1.733000000000175, -- [34]
						-1.667000000000371, -- [35]
						-1.182999999999993, -- [36]
						-0.8330000000005384, -- [37]
						-0.5830000000005384, -- [38]
						-0.5830000000005384, -- [39]
						-0.5, -- [40]
						-0.1170000000001892, -- [41]
						-0.03300000000035652, -- [42]
						0, -- [43]
					},
					["HealthMax"] = {
						7189, -- [1]
						7189, -- [2]
						7189, -- [3]
						7189, -- [4]
						7189, -- [5]
						7189, -- [6]
						7189, -- [7]
						7189, -- [8]
						7189, -- [9]
						7189, -- [10]
						7189, -- [11]
						7189, -- [12]
						7189, -- [13]
						7189, -- [14]
						7189, -- [15]
						7189, -- [16]
						7189, -- [17]
						7189, -- [18]
						7189, -- [19]
						7189, -- [20]
						7189, -- [21]
						7189, -- [22]
						7189, -- [23]
						7099, -- [24]
						7099, -- [25]
						7099, -- [26]
						7099, -- [27]
						7099, -- [28]
						7099, -- [29]
						7099, -- [30]
						7099, -- [31]
						7099, -- [32]
						7099, -- [33]
						7099, -- [34]
						7099, -- [35]
						7099, -- [36]
						7099, -- [37]
						7099, -- [38]
						7099, -- [39]
						7099, -- [40]
						7099, -- [41]
						7099, -- [42]
						7099, -- [43]
					},
					["Health"] = {
						3379, -- [1]
						3344, -- [2]
						3322, -- [3]
						3144, -- [4]
						3069, -- [5]
						3028, -- [6]
						3013, -- [7]
						3013, -- [8]
						2885, -- [9]
						2885, -- [10]
						2838, -- [11]
						2838, -- [12]
						2812, -- [13]
						2761, -- [14]
						2761, -- [15]
						2728, -- [16]
						2211, -- [17]
						2084, -- [18]
						1900, -- [19]
						1900, -- [20]
						1900, -- [21]
						1900, -- [22]
						1742, -- [23]
						1616, -- [24]
						1616, -- [25]
						1408, -- [26]
						1249, -- [27]
						1209, -- [28]
						872, -- [29]
						661, -- [30]
						661, -- [31]
						661, -- [32]
						618, -- [33]
						618, -- [34]
						540, -- [35]
						413, -- [36]
						369, -- [37]
						151, -- [38]
						151, -- [39]
						176, -- [40]
						50, -- [41]
						50, -- [42]
						0, -- [43]
					},
					["KilledBy"] = "麦积烟雨",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"HEAL", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"HEAL", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"MISC", -- [43]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
					},
					["Messages"] = {
						"要水吗兄弟-逐风者 寒冰箭 古剑战神 Hit -816 (Frost)", -- [1]
						"哎哟喂-火妖鲁西弗隆 多重射击 古剑战神 Hit -297 (Physical)", -- [2]
						"阿莱克斯·巴罗夫的仆从 肉搏 古剑战神 Dodge (1)", -- [3]
						"阿莱克斯·巴罗夫的仆从 肉搏 古剑战神 Hit -19 (Physical)", -- [4]
						"阿莱克斯·巴罗夫的仆从 肉搏 古剑战神 Block (1)", -- [5]
						"古剑战神 重伤 (伤害/跳) 要水吗兄弟-逐风者 Absorb -71 (71 被吸收) (Physical)", -- [6]
						"古剑战神 肉搏 龙九爷-黑龙费尔默 Hit -204 (Physical)", -- [7]
						"哎哟喂-火妖鲁西弗隆 奥术射击 古剑战神 Hit -217 (Arcane)", -- [8]
						"古剑战神 断筋 龙九爷-黑龙费尔默 Hit -35 (Physical)", -- [9]
						"哎哟喂-火妖鲁西弗隆 自动射击 古剑战神 Crit -736 (Physical)", -- [10]
						"古剑战神 肉搏 龙九爷-黑龙费尔默 Hit -580 (Physical)", -- [11]
						"古剑战神 治疗药水 古剑战神 Hit +1131", -- [12]
						"哎哟喂-火妖鲁西弗隆 多重射击 古剑战神 Crit -1015 (Physical)", -- [13]
						"古剑战神 致死打击 龙九爷-黑龙费尔默 Hit -727 (Physical)", -- [14]
						"麦积烟雨 毒蛇钉刺 古剑战神 Miss (Nature)", -- [15]
						"麦积烟雨 自动射击 古剑战神 Hit -197 (Physical)", -- [16]
						"古剑战神 斩杀 龙九爷-黑龙费尔默 Hit -696 (Physical)", -- [17]
						"古剑战神 血之狂热 古剑战神 Tick +82", -- [18]
						"哎哟喂-火妖鲁西弗隆 自动射击 古剑战神 Hit -297 (Physical)", -- [19]
						"古剑战神死亡。", -- [20]
					},
					["DeathAt"] = 7055.269,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
					},
					["MessageTimes"] = {
						-14.70100000000002, -- [1]
						-14.41799999999967, -- [2]
						-13.88400000000002, -- [3]
						-13.88400000000002, -- [4]
						-13.88400000000002, -- [5]
						-13.63400000000002, -- [6]
						-6.434000000000197, -- [7]
						-4.567000000000007, -- [8]
						-4.199999999999818, -- [9]
						-3.5, -- [10]
						-2.782999999999447, -- [11]
						-2.516999999999825, -- [12]
						-2.216999999999644, -- [13]
						-1.916999999999462, -- [14]
						-1.367000000000189, -- [15]
						-0.5829999999996289, -- [16]
						-0.3170000000000073, -- [17]
						-0.2169999999996435, -- [18]
						-0.01699999999982538, -- [19]
						0, -- [20]
					},
					["HealthMax"] = {
						8267, -- [1]
						8267, -- [2]
						8267, -- [3]
						8267, -- [4]
						8267, -- [5]
						8267, -- [6]
						8267, -- [7]
						8177, -- [8]
						8177, -- [9]
						8177, -- [10]
						8177, -- [11]
						8177, -- [12]
						8177, -- [13]
						8177, -- [14]
						8177, -- [15]
						8177, -- [16]
						8177, -- [17]
						8177, -- [18]
						8177, -- [19]
						7099, -- [20]
					},
					["Health"] = {
						4063, -- [1]
						3247, -- [2]
						2950, -- [3]
						2950, -- [4]
						2950, -- [5]
						2931, -- [6]
						1117, -- [7]
						1117, -- [8]
						900, -- [9]
						900, -- [10]
						164, -- [11]
						164, -- [12]
						164, -- [13]
						280, -- [14]
						280, -- [15]
						280, -- [16]
						83, -- [17]
						83, -- [18]
						165, -- [19]
						0, -- [20]
					},
					["KilledBy"] = "哎哟喂-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"HEAL", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"HEAL", -- [18]
						"DAMAGE", -- [19]
						"MISC", -- [20]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "奥术射击",
			["LastFightIn"] = 13,
			["type"] = "Ungrouped",
			["LastHealTime"] = 8191.513,
			["LastEventHealthMax"] = {
				7099, -- [1]
				7099, -- [2]
				7099, -- [3]
				7099, -- [4]
				7099, -- [5]
				7099, -- [6]
				7099, -- [7]
				7099, -- [8]
				7099, -- [9]
				7099, -- [10]
				7099, -- [11]
				7099, -- [12]
				7099, -- [13]
				7099, -- [14]
				7099, -- [15]
				7099, -- [16]
				7099, -- [17]
				7099, -- [18]
				8163, -- [19]
				8163, -- [20]
				8163, -- [21]
				8163, -- [22]
				8163, -- [23]
				8163, -- [24]
				8163, -- [25]
				8163, -- [26]
				8163, -- [27]
				8163, -- [28]
				8163, -- [29]
				8163, -- [30]
				8163, -- [31]
				8163, -- [32]
				8163, -- [33]
				8163, -- [34]
				8163, -- [35]
				8163, -- [36]
				8163, -- [37]
				8163, -- [38]
				8163, -- [39]
				7099, -- [40]
				7099, -- [41]
				7099, -- [42]
				7099, -- [43]
				7099, -- [44]
				7099, -- [45]
				7099, -- [46]
				7099, -- [47]
				7099, -- [48]
				7099, -- [49]
				7099, -- [50]
			},
			["LastDamageTaken"] = 217,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 8191.263,
				["OVERALL"] = 8191.263,
				["DamageTaken"] = 8191.263,
				["DeathCount"] = 7153.259,
				["HealingTaken"] = 8191.263,
				["RageGain"] = 8191.263,
				["HOT_Time"] = 8191.263,
				["TimeDamage"] = 8184.263,
				["Healing"] = 8191.263,
				["ActiveTime"] = 8191.263,
				["DOT_Time"] = 8169.262,
				["Damage"] = 8182.262,
			},
			["NextEventNum"] = 40,
			["LastDamageTime"] = 8185.163000000001,
			["LastEvents"] = {
				"黑椒牛柳灬-逐风者 肉搏 古剑战神 Hit -37 (Physical)", -- [1]
				"麦积烟雨 自动射击 古剑战神 Hit -205 (Physical)", -- [2]
				"古剑战神 致死打击 黑椒牛柳灬-逐风者 Hit -705 (Physical)", -- [3]
				"古剑战神 血之狂热 古剑战神 Tick +71", -- [4]
				"黑椒牛柳灬-逐风者 肉搏 古剑战神 Hit -98 (Physical)", -- [5]
				"盗克盗-逐风者 肉搏 古剑战神 Hit -67 (Physical)", -- [6]
				"古剑战神 英勇打击 黑椒牛柳灬-逐风者 Hit -737 (Physical)", -- [7]
				"哎哟喂-火妖鲁西弗隆 多重射击 古剑战神 Hit -406 (Physical)", -- [8]
				"盗克盗-逐风者 肉搏 古剑战神 Miss (1)", -- [9]
				"盗克盗-逐风者 肉搏 古剑战神 Dodge (1)", -- [10]
				"麦积烟雨 自动射击 古剑战神 Hit -201 (Physical)", -- [11]
				"古剑战神 血之狂热 古剑战神 Tick +71", -- [12]
				"盗克盗-逐风者 邪恶攻击 古剑战神 Crit -446 (Physical)", -- [13]
				"盗克盗-逐风者 肉搏 古剑战神 Miss (1)", -- [14]
				"盗克盗-逐风者 肉搏 古剑战神 Crit -133 (Physical)", -- [15]
				"盗克盗-逐风者 邪恶攻击 古剑战神 Crit -422 (Physical)", -- [16]
				"盗克盗-逐风者 肉搏 古剑战神 Parry (1)", -- [17]
				"古剑战神 生命赐福 古剑战神 Hit +1224", -- [18]
				"哎哟喂-火妖鲁西弗隆 自动射击 古剑战神 Hit -306 (Physical)", -- [19]
				"古剑战神 肉搏 盗克盗-逐风者 Hit -601 (Physical)", -- [20]
				"麦积烟雨 自动射击 古剑战神 Hit -220 (Physical)", -- [21]
				"盗克盗-逐风者 刺骨 古剑战神 Hit -307 (Physical)", -- [22]
				"古剑战神 血之狂热 古剑战神 Tick +81", -- [23]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -115 (Nature)", -- [24]
				"古剑战神 拦截昏迷 哎哟喂-火妖鲁西弗隆 Resist (Physical)", -- [25]
				"盗克盗-逐风者 致命毒药 V (伤害/跳) 古剑战神 Tick -38 (Nature)", -- [26]
				"古剑战神 血之狂热 古剑战神 Tick +81", -- [27]
				"哎哟喂-火妖鲁西弗隆 奥术射击 古剑战神 Hit -216 (Arcane)", -- [28]
				"哎哟喂-火妖鲁西弗隆 自动射击 古剑战神 Hit -322 (Physical)", -- [29]
				"哎哟喂-火妖鲁西弗隆 驱散射击 古剑战神 Crit -395 (Physical)", -- [30]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -127 (Nature)", -- [31]
				"盗克盗-逐风者 致命毒药 V (伤害/跳) 古剑战神 Tick -38 (Nature)", -- [32]
				"古剑战神 血之狂热 古剑战神 Tick +82", -- [33]
				"哎哟喂-火妖鲁西弗隆 多重射击 古剑战神 Hit -409 (Physical)", -- [34]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 古剑战神 Tick -127 (Nature)", -- [35]
				"哎哟喂-火妖鲁西弗隆 自动射击 古剑战神 Hit -292 (Physical)", -- [36]
				"盗克盗-逐风者 致命毒药 V (伤害/跳) 古剑战神 Tick -38 (Nature)", -- [37]
				"古剑战神 血之狂热 古剑战神 Tick +82", -- [38]
				"哎哟喂-火妖鲁西弗隆 奥术射击 古剑战神 Hit -217 (Arcane)", -- [39]
				"黑椒牛柳灬-逐风者 肉搏 古剑战神 Crit -62 (Physical)", -- [40]
				"黑椒牛柳灬-逐风者 灼热武器 古剑战神 Resist (Fire)", -- [41]
				"黑椒牛柳灬-逐风者 肉搏 古剑战神 Crit -205 (Physical)", -- [42]
				"黑椒牛柳灬-逐风者 速效毒药 VI 古剑战神 Hit -131 (Nature)", -- [43]
				"古剑战神 撕裂 黑椒牛柳灬-逐风者 Parry (Physical)", -- [44]
				"豹 爪击 古剑战神 Hit -36 (Physical)", -- [45]
				"古剑战神 肉搏 黑椒牛柳灬-逐风者 Hit -574 (Physical)", -- [46]
				"黑椒牛柳灬-逐风者 出血 古剑战神 Hit -97 (Physical)", -- [47]
				"黑椒牛柳灬-逐风者 灼热武器 古剑战神 Hit -21 (20 被抵抗) (Fire)", -- [48]
				"黑椒牛柳灬-逐风者 速效毒药 VI 古剑战神 Hit -137 (Nature)", -- [49]
				"盗克盗-逐风者 邪恶攻击 古剑战神 Parry (Physical)", -- [50]
			},
			["Name"] = "古剑战神",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				8178.162, -- [1]
				8178.262, -- [2]
				8178.596000000001, -- [3]
				8179.062, -- [4]
				8179.129, -- [5]
				8179.329, -- [6]
				8179.362, -- [7]
				8179.379, -- [8]
				8179.512, -- [9]
				8180.746, -- [10]
				8180.779, -- [11]
				8181.062, -- [12]
				8181.079, -- [13]
				8181.596000000001, -- [14]
				8182.179, -- [15]
				8182.279, -- [16]
				8182.279, -- [17]
				8182.546, -- [18]
				8182.646, -- [19]
				8182.829, -- [20]
				8183.263, -- [21]
				8183.279, -- [22]
				8184.279, -- [23]
				8184.779, -- [24]
				8185.163000000001, -- [25]
				8185.196, -- [26]
				8186.279, -- [27]
				8186.413000000001, -- [28]
				8186.846000000001, -- [29]
				8187.513, -- [30]
				8187.763, -- [31]
				8188.196, -- [32]
				8189.513, -- [33]
				8190.68, -- [34]
				8190.78, -- [35]
				8190.980000000001, -- [36]
				8191.196, -- [37]
				8191.513, -- [38]
				8192.184, -- [39]
				8176.746, -- [40]
				8177.062, -- [41]
				8177.062, -- [42]
				8177.062, -- [43]
				8177.079, -- [44]
				8177.145, -- [45]
				8177.279, -- [46]
				8177.645, -- [47]
				8177.645, -- [48]
				8177.645, -- [49]
				8177.946, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["黑椒牛柳灬-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["一曲悠扬"] = {
									["count"] = 6,
								},
								["混子战仕-黑龙费尔默"] = {
									["count"] = 9,
								},
								["麦积烟雨"] = {
									["count"] = 12,
								},
								["要水吗兄弟-逐风者"] = {
									["count"] = 9,
								},
								["哎哟喂-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
								["黑椒牛柳灬-逐风者"] = {
									["count"] = 9,
								},
								["大懒猪"] = {
									["count"] = 3,
								},
							},
							["amount"] = 51,
						},
					},
					["TimeSpent"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.52,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.02,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.77,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.309999999999999,
						},
						["古剑战神"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 40.68,
								},
								["生命赐福"] = {
									["count"] = 2.98,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 45.16,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.58,
								},
							},
							["amount"] = 14.41,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.05,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 3.9,
								},
								["肉搏"] = {
									["count"] = 3.43,
								},
							},
							["amount"] = 12.38,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.17,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.17,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.02,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 1.83,
								},
							},
							["amount"] = 8.32,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.85,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.63,
								},
								["英勇打击"] = {
									["count"] = 0.77,
								},
								["撕裂"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 2.18,
								},
								["断筋"] = {
									["count"] = 0.8,
								},
								["拦截昏迷"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 3.99,
								},
							},
							["amount"] = 17.04,
						},
						["猫头鹰"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.29,
								},
							},
							["amount"] = 9.29,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8.43,
						},
						["哎哟喂"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["大懒猪"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 8.52,
						},
					},
					["HealedWho"] = {
						["古剑战神"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 2068,
								},
								["生命赐福"] = {
									["count"] = 2464,
								},
								["治疗药水"] = {
									["count"] = 1131,
								},
							},
							["amount"] = 5663,
						},
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 265,
						["Physical"] = 1006,
					},
					["DeathCount"] = 2,
					["HOT_Time"] = 84,
					["ElementTaken"] = {
						["Physical"] = 15735,
						["Melee"] = 2703,
						["Arcane"] = 2622,
						["Fire"] = 328,
						["Frost"] = 5734,
						["Nature"] = 7900,
					},
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["古剑战神"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
					},
					["Damage"] = 31656,
					["TimeHeal"] = 45.16,
					["ElementDone"] = {
						["Physical"] = 17316,
						["Melee"] = 14157,
						["Fire"] = 183,
					},
					["DamagedWho"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1334,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 287,
								},
								["拦截昏迷"] = {
									["count"] = 51,
								},
								["断筋"] = {
									["count"] = 102,
								},
								["铁皮手雷"] = {
									["count"] = 183,
								},
								["肉搏"] = {
									["count"] = 1646,
								},
							},
							["amount"] = 3603,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 601,
								},
							},
							["amount"] = 601,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 915,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 92,
								},
								["拦截昏迷"] = {
									["count"] = 40,
								},
								["旋风斩"] = {
									["count"] = 478,
								},
								["肉搏"] = {
									["count"] = 1202,
								},
							},
							["amount"] = 2727,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1265,
								},
								["断筋"] = {
									["count"] = 69,
								},
								["斩杀"] = {
									["count"] = 2952,
								},
								["肉搏"] = {
									["count"] = 1178,
								},
							},
							["amount"] = 5464,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 501,
								},
								["压制"] = {
									["count"] = 386,
								},
								["肉搏"] = {
									["count"] = 398,
								},
							},
							["amount"] = 1285,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 264,
								},
								["旋风斩"] = {
									["count"] = 432,
								},
								["断筋"] = {
									["count"] = 28,
								},
								["斩杀"] = {
									["count"] = 1084,
								},
								["肉搏"] = {
									["count"] = 1162,
								},
							},
							["amount"] = 2970,
						},
						["哎哟喂"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 339,
								},
							},
							["amount"] = 339,
						},
						["猫头鹰"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 738,
								},
							},
							["amount"] = 738,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 213,
								},
								["断筋"] = {
									["count"] = 132,
								},
								["旋风斩"] = {
									["count"] = 661,
								},
								["肉搏"] = {
									["count"] = 1156,
								},
							},
							["amount"] = 2162,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 68,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 390,
								},
								["肉搏"] = {
									["count"] = 826,
								},
							},
							["amount"] = 1284,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2042,
								},
								["压制"] = {
									["count"] = 504,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 70,
								},
								["英勇打击"] = {
									["count"] = 737,
								},
								["旋风斩"] = {
									["count"] = 919,
								},
								["拦截昏迷"] = {
									["count"] = 50,
								},
								["断筋"] = {
									["count"] = 98,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 321,
								},
								["肉搏"] = {
									["count"] = 3645,
								},
							},
							["amount"] = 8386,
						},
						["大懒猪"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 107,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["旋风斩"] = {
									["count"] = 343,
								},
								["肉搏"] = {
									["count"] = 1605,
								},
							},
							["amount"] = 2097,
						},
					},
					["WhoDamaged"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 179,
								},
								["冰锥术"] = {
									["count"] = 611,
								},
								["冰霜新星"] = {
									["count"] = 189,
								},
							},
							["amount"] = 979,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["致命毒药 V (伤害/跳)"] = {
									["count"] = 114,
								},
								["刺骨"] = {
									["count"] = 307,
								},
								["邪恶攻击"] = {
									["count"] = 868,
								},
								["肉搏"] = {
									["count"] = 200,
								},
							},
							["amount"] = 1489,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 786,
								},
								["闪电箭"] = {
									["count"] = 1756,
								},
								["闪电之盾"] = {
									["count"] = 385,
								},
								["铁皮手雷"] = {
									["count"] = 181,
								},
								["闪电链"] = {
									["count"] = 1457,
								},
							},
							["amount"] = 4565,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1953,
								},
								["奥术射击"] = {
									["count"] = 847,
								},
								["驱散射击"] = {
									["count"] = 395,
								},
								["自动射击"] = {
									["count"] = 2151,
								},
								["多重射击"] = {
									["count"] = 3305,
								},
								["肉搏"] = {
									["count"] = 406,
								},
							},
							["amount"] = 9057,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 245,
								},
								["奥术射击"] = {
									["count"] = 644,
								},
								["驱散射击"] = {
									["count"] = 57,
								},
								["自动射击"] = {
									["count"] = 1724,
								},
								["多重射击"] = {
									["count"] = 910,
								},
								["冰霜箭"] = {
									["count"] = 35,
								},
							},
							["amount"] = 3615,
						},
						["猫头鹰"] = {
							["Details"] = {
								["尖啸"] = {
									["count"] = 40,
								},
								["爪击"] = {
									["count"] = 184,
								},
								["肉搏"] = {
									["count"] = 471,
								},
							},
							["amount"] = 695,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 139,
								},
								["灼热武器"] = {
									["count"] = 147,
								},
								["速效毒药 VI"] = {
									["count"] = 952,
								},
								["出血"] = {
									["count"] = 558,
								},
								["肉搏"] = {
									["count"] = 531,
								},
							},
							["amount"] = 2327,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 36,
								},
								["断筋"] = {
									["count"] = 29,
								},
							},
							["amount"] = 65,
						},
						["阿莱克斯·巴罗夫的仆从"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 85,
								},
							},
							["amount"] = 85,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 740,
								},
							},
							["amount"] = 740,
						},
						["大懒猪"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 58,
								},
								["肉搏"] = {
									["count"] = 396,
								},
							},
							["amount"] = 454,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 252,
								},
								["奥术射击"] = {
									["count"] = 1131,
								},
								["自动射击"] = {
									["count"] = 2562,
								},
								["多重射击"] = {
									["count"] = 1074,
								},
								["驱散射击"] = {
									["count"] = 226,
								},
							},
							["amount"] = 5245,
						},
						["豹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 614,
								},
								["爪击"] = {
									["count"] = 372,
								},
							},
							["amount"] = 986,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1013,
								},
								["寒冰箭"] = {
									["count"] = 1610,
								},
								["冰锥术"] = {
									["count"] = 1810,
								},
								["冰霜新星"] = {
									["count"] = 287,
								},
							},
							["amount"] = 4720,
						},
					},
					["TimeHealing"] = {
						["古剑战神"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 40.68,
								},
								["生命赐福"] = {
									["count"] = 2.98,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 45.16,
						},
					},
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 34,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 34,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热武器"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 1,
									["amount"] = 20,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 5,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["致命毒药 V (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["毒蛇钉刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 16,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 48,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 48,
						},
					},
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 34,
									["amount"] = 0,
								},
							},
							["count"] = 34,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["致命毒药 V (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["毒蛇钉刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 48,
									["amount"] = 0,
								},
							},
							["count"] = 48,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 148.03,
					["ElementTakenResist"] = {
						["Fire"] = 20,
					},
					["PartialBlock"] = {
						["多重射击"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 116,
									["min"] = 116,
									["count"] = 1,
									["amount"] = 116,
								},
							},
							["count"] = 1,
							["amount"] = 116,
						},
						["肉搏"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 22,
									["min"] = 22,
									["count"] = 1,
									["amount"] = 22,
								},
							},
							["count"] = 1,
							["amount"] = 22,
						},
					},
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 83,
									["min"] = 71,
									["count"] = 28,
									["amount"] = 2068,
								},
							},
							["count"] = 28,
							["amount"] = 2068,
						},
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1240,
									["min"] = 1224,
									["count"] = 2,
									["amount"] = 2464,
								},
							},
							["count"] = 2,
							["amount"] = 2464,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1131,
									["min"] = 1131,
									["count"] = 1,
									["amount"] = 1131,
								},
							},
							["count"] = 1,
							["amount"] = 1131,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 22,
						["Physical"] = 116,
					},
					["HealingTaken"] = 5663,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 72,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 11,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 88,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 29,
								},
								["Dodge"] = {
									["count"] = 5,
								},
								["Block"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 49,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 12,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 21,
						},
						["Nature"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 22,
								},
							},
							["amount"] = 34,
						},
					},
					["Healing"] = 5663,
					["DamageTaken"] = 35022,
					["RageGainedFrom"] = {
						["古剑战神"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 132,
								},
								["冲锋"] = {
									["count"] = 105,
								},
							},
							["amount"] = 237,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1334,
									["min"] = 1334,
									["count"] = 1,
									["amount"] = 1334,
								},
								["Hit"] = {
									["max"] = 727,
									["min"] = 538,
									["count"] = 5,
									["amount"] = 3307,
								},
							},
							["count"] = 7,
							["amount"] = 4641,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 915,
									["min"] = 915,
									["count"] = 1,
									["amount"] = 915,
								},
								["Hit"] = {
									["max"] = 504,
									["min"] = 386,
									["count"] = 2,
									["amount"] = 890,
								},
							},
							["count"] = 3,
							["amount"] = 1805,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 71,
									["min"] = 71,
									["count"] = 3,
									["amount"] = 213,
								},
								["Tick"] = {
									["max"] = 144,
									["min"] = 88,
									["count"] = 14,
									["amount"] = 1461,
								},
							},
							["count"] = 17,
							["amount"] = 1674,
						},
						["撕裂"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 737,
									["min"] = 501,
									["count"] = 2,
									["amount"] = 1238,
								},
							},
							["count"] = 2,
							["amount"] = 1238,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 35,
									["min"] = 35,
									["count"] = 2,
									["amount"] = 70,
								},
							},
							["count"] = 2,
							["amount"] = 70,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 183,
									["min"] = 183,
									["count"] = 1,
									["amount"] = 183,
								},
							},
							["count"] = 1,
							["amount"] = 183,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 661,
									["min"] = 661,
									["count"] = 1,
									["amount"] = 661,
								},
								["Hit"] = {
									["max"] = 598,
									["min"] = 321,
									["count"] = 6,
									["amount"] = 2511,
								},
							},
							["count"] = 7,
							["amount"] = 3172,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 51,
									["min"] = 40,
									["count"] = 4,
									["amount"] = 183,
								},
							},
							["count"] = 5,
							["amount"] = 183,
						},
						["断筋"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 93,
									["min"] = 39,
									["count"] = 2,
									["amount"] = 132,
								},
								["Crit"] = {
									["max"] = 102,
									["min"] = 68,
									["count"] = 3,
									["amount"] = 268,
								},
								["Hit"] = {
									["max"] = 35,
									["min"] = 28,
									["count"] = 3,
									["amount"] = 97,
								},
							},
							["count"] = 10,
							["amount"] = 497,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 980,
									["min"] = 696,
									["count"] = 2,
									["amount"] = 1676,
								},
								["Crit"] = {
									["max"] = 1276,
									["min"] = 1084,
									["count"] = 2,
									["amount"] = 2360,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 4036,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 243,
									["min"] = 22,
									["count"] = 2,
									["amount"] = 265,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 601,
									["min"] = 162,
									["count"] = 22,
									["amount"] = 9326,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1105,
									["min"] = 710,
									["count"] = 5,
									["amount"] = 4566,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 36,
							["amount"] = 14157,
						},
					},
					["RageGain"] = 237,
					["WhoHealed"] = {
						["古剑战神"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 2068,
								},
								["生命赐福"] = {
									["count"] = 2464,
								},
								["治疗药水"] = {
									["count"] = 1131,
								},
							},
							["amount"] = 5663,
						},
					},
					["TimeDamage"] = 102.87,
					["TimeDamaging"] = {
						["猫头鹰"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.58,
								},
							},
							["amount"] = 14.41,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.05,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 3.9,
								},
								["肉搏"] = {
									["count"] = 3.43,
								},
							},
							["amount"] = 12.38,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.17,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.17,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.02,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.97,
								},
								["肉搏"] = {
									["count"] = 1.83,
								},
							},
							["amount"] = 8.32,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.85,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.63,
								},
								["英勇打击"] = {
									["count"] = 0.77,
								},
								["撕裂"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 2.18,
								},
								["断筋"] = {
									["count"] = 0.8,
								},
								["拦截昏迷"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 3.99,
								},
							},
							["amount"] = 17.04,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.52,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.02,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.77,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.309999999999999,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.29,
								},
							},
							["amount"] = 9.29,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.73,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8.43,
						},
						["哎哟喂"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["大懒猪"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 5.52,
								},
							},
							["amount"] = 8.52,
						},
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["古剑战神"] = {
									["count"] = 132,
								},
							},
							["amount"] = 132,
						},
						["冲锋"] = {
							["Details"] = {
								["古剑战神"] = {
									["count"] = 105,
								},
							},
							["amount"] = 105,
						},
					},
					["DOT_Time"] = 57,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 24,
								},
								["Tick"] = {
									["count"] = 16,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 61,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 22,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 36,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 6810.269,
			["LastActive"] = 8191.263,
		},
		["糖猫-黑龙费尔默"] = {
			["GUID"] = "Player-5450-03288FDE",
			["LastEventHealth"] = {
				3030, -- [1]
				2988, -- [2]
				2988, -- [3]
				2947, -- [4]
				2947, -- [5]
				2947, -- [6]
				2947, -- [7]
				2749, -- [8]
				2749, -- [9]
				1862, -- [10]
				1305, -- [11]
				1049, -- [12]
				1049, -- [13]
				0, -- [14]
				3030, -- [15]
				3030, -- [16]
				2628, -- [17]
				2628, -- [18]
				2628, -- [19]
				2628, -- [20]
				2628, -- [21]
				2628, -- [22]
				2628, -- [23]
				2628, -- [24]
				2598, -- [25]
				2494, -- [26]
				2220, -- [27]
				1771, -- [28]
				1771, -- [29]
				1710, -- [30]
				1710, -- [31]
				1710, -- [32]
				1620, -- [33]
				1424, -- [34]
				1377, -- [35]
				1136, -- [36]
			},
			["LastAttackedBy"] = "猫头鹰",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"MISC", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					4.81, -- [1]
				},
				["DamageTaken"] = {
					5891, -- [1]
				},
				["Absorbs"] = {
					688, -- [1]
				},
				["HealingTaken"] = {
					688, -- [1]
				},
				["TimeDamage"] = {
					9, -- [1]
				},
				["ActiveTime"] = {
					13.81, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["DOT_Time"] = {
					6, -- [1]
				},
				["Damage"] = {
					2345, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "糖猫-黑龙费尔默",
			["LastHealTime"] = 8229.799,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
					},
					["Messages"] = {
						"糖猫-黑龙费尔默 寒冰箭 哎哟喂-火妖鲁西弗隆 Hit -656 (Frost)", -- [1]
						"黑椒牛柳灬-逐风者 灼热武器 糖猫-黑龙费尔默 Hit -41 (Fire)", -- [2]
						"黑椒牛柳灬-逐风者 肉搏 糖猫-黑龙费尔默 Miss (1)", -- [3]
						"黑椒牛柳灬-逐风者 肉搏 糖猫-黑龙费尔默 Miss (1)", -- [4]
						"黑椒牛柳灬-逐风者 出血 糖猫-黑龙费尔默 Hit -157 (Physical)", -- [5]
						"黑椒牛柳灬-逐风者 灼热武器 糖猫-黑龙费尔默 Hit -41 (Fire)", -- [6]
						"糖猫-黑龙费尔默 寒冰箭 哎哟喂-火妖鲁西弗隆 Hit -669 (Frost)", -- [7]
						"哎哟喂-火妖鲁西弗隆 多重射击 糖猫-黑龙费尔默 Hit -818 (Physical)", -- [8]
						"哎哟喂-火妖鲁西弗隆 自动射击 糖猫-黑龙费尔默 Hit -557 (Physical)", -- [9]
						"哎哟喂-火妖鲁西弗隆 奥术射击 糖猫-黑龙费尔默 Hit -256 (Arcane)", -- [10]
						"黑椒牛柳灬-逐风者 肉搏 糖猫-黑龙费尔默 Miss (1)", -- [11]
						"哎哟喂-火妖鲁西弗隆 自动射击 糖猫-黑龙费尔默 Crit -1332 (Physical)", -- [12]
						"糖猫-黑龙费尔默死亡。", -- [13]
					},
					["DeathAt"] = 7679.261,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["MessageTimes"] = {
						-7.399999999999636, -- [1]
						-5.882999999999811, -- [2]
						-5.817000000000007, -- [3]
						-4.882999999999811, -- [4]
						-4.882999999999811, -- [5]
						-4.882999999999811, -- [6]
						-4.783000000000357, -- [7]
						-3.149999999999636, -- [8]
						-2.932999999999993, -- [9]
						-2.382999999999811, -- [10]
						-0.9830000000001746, -- [11]
						-0.01600000000053115, -- [12]
						0, -- [13]
					},
					["HealthMax"] = {
						3030, -- [1]
						3030, -- [2]
						3030, -- [3]
						3030, -- [4]
						3030, -- [5]
						3030, -- [6]
						3030, -- [7]
						3030, -- [8]
						3030, -- [9]
						3030, -- [10]
						3030, -- [11]
						3030, -- [12]
						3030, -- [13]
					},
					["Health"] = {
						2988, -- [1]
						2988, -- [2]
						2947, -- [3]
						2947, -- [4]
						2947, -- [5]
						2947, -- [6]
						2749, -- [7]
						2749, -- [8]
						1862, -- [9]
						1305, -- [10]
						1049, -- [11]
						1049, -- [12]
						0, -- [13]
					},
					["KilledBy"] = "哎哟喂-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"MISC", -- [13]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "爪击",
			["LastFightIn"] = 15,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 57,
			["TimeLast"] = {
				["TimeHeal"] = 8229.266,
				["OVERALL"] = 8234.266,
				["DamageTaken"] = 8234.266,
				["Absorbs"] = 8229.266,
				["DeathCount"] = 7677.261,
				["TimeDamage"] = 8231.266,
				["ActiveTime"] = 8231.266,
				["HealingTaken"] = 8229.266,
				["DOT_Time"] = 8231.266,
				["Damage"] = 8231.266,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3030, -- [1]
				3030, -- [2]
				3030, -- [3]
				3030, -- [4]
				3030, -- [5]
				3030, -- [6]
				3030, -- [7]
				3030, -- [8]
				3030, -- [9]
				3030, -- [10]
				3030, -- [11]
				3030, -- [12]
				3030, -- [13]
				3030, -- [14]
				3030, -- [15]
				3030, -- [16]
				3030, -- [17]
				3030, -- [18]
				3030, -- [19]
				3030, -- [20]
				3030, -- [21]
				3030, -- [22]
				3030, -- [23]
				3030, -- [24]
				3030, -- [25]
				3030, -- [26]
				3030, -- [27]
				3030, -- [28]
				3030, -- [29]
				3030, -- [30]
				3030, -- [31]
				3030, -- [32]
				3030, -- [33]
				3030, -- [34]
				3030, -- [35]
				3030, -- [36]
			},
			["NextEventNum"] = 37,
			["LastDamageTime"] = 8231.916000000001,
			["LastEvents"] = {
				"糖猫-黑龙费尔默 冰霜新星 黑椒牛柳灬-逐风者 Hit -85 (Frost)", -- [1]
				"糖猫-黑龙费尔默 寒冰箭 哎哟喂-火妖鲁西弗隆 Hit -656 (Frost)", -- [2]
				"黑椒牛柳灬-逐风者 灼热武器 糖猫-黑龙费尔默 Hit -41 (Fire)", -- [3]
				"黑椒牛柳灬-逐风者 肉搏 糖猫-黑龙费尔默 Miss (1)", -- [4]
				"黑椒牛柳灬-逐风者 肉搏 糖猫-黑龙费尔默 Miss (1)", -- [5]
				"黑椒牛柳灬-逐风者 出血 糖猫-黑龙费尔默 Hit -157 (Physical)", -- [6]
				"黑椒牛柳灬-逐风者 灼热武器 糖猫-黑龙费尔默 Hit -41 (Fire)", -- [7]
				"糖猫-黑龙费尔默 寒冰箭 哎哟喂-火妖鲁西弗隆 Hit -669 (Frost)", -- [8]
				"哎哟喂-火妖鲁西弗隆 多重射击 糖猫-黑龙费尔默 Hit -818 (Physical)", -- [9]
				"哎哟喂-火妖鲁西弗隆 自动射击 糖猫-黑龙费尔默 Hit -557 (Physical)", -- [10]
				"哎哟喂-火妖鲁西弗隆 奥术射击 糖猫-黑龙费尔默 Hit -256 (Arcane)", -- [11]
				"黑椒牛柳灬-逐风者 肉搏 糖猫-黑龙费尔默 Miss (1)", -- [12]
				"哎哟喂-火妖鲁西弗隆 自动射击 糖猫-黑龙费尔默 Crit -1332 (Physical)", -- [13]
				"糖猫-黑龙费尔默死亡。", -- [14]
				"糖猫-黑龙费尔默 寒冰箭 龙九爷-黑龙费尔默 Hit -607 (Frost)", -- [15]
				"Environment Falling 糖猫-黑龙费尔默 Hit -452 (Physical)", -- [16]
				"糖猫-黑龙费尔默 冰霜新星 从天而降的妖-逐风者 Resist (Frost)", -- [17]
				"猫头鹰 肉搏 糖猫-黑龙费尔默 Absorb -96 (96 被吸收) (1)", -- [18]
				"龙九爷-黑龙费尔默 自动射击 糖猫-黑龙费尔默 Absorb -386 (386 被吸收) (Physical)", -- [19]
				"猫头鹰 爪击 糖猫-黑龙费尔默 Absorb -49 (49 被吸收) (Physical)", -- [20]
				"猫头鹰 肉搏 糖猫-黑龙费尔默 Absorb -106 (106 被吸收) (1)", -- [21]
				"猫头鹰 尖啸 糖猫-黑龙费尔默 Absorb -43 (43 被吸收) (Physical)", -- [22]
				"猫头鹰 肉搏 糖猫-黑龙费尔默 Absorb -8 (1)", -- [23]
				"猫头鹰 尖啸 糖猫-黑龙费尔默 Hit -30 (8 被吸收) (Physical)", -- [24]
				"猫头鹰 肉搏 糖猫-黑龙费尔默 Hit -104 (Physical)", -- [25]
				"盗克盗-逐风者 邪恶攻击 糖猫-黑龙费尔默 Hit -274 (Physical)", -- [26]
				"盗克盗-逐风者 肉搏 糖猫-黑龙费尔默 Crit -449 (Physical)", -- [27]
				"盗克盗-逐风者 肉搏 糖猫-黑龙费尔默 Dodge (1)", -- [28]
				"猫头鹰 爪击 糖猫-黑龙费尔默 Hit -61 (Physical)", -- [29]
				"糖猫-黑龙费尔默 暴风雪 (伤害/跳) 盗克盗-逐风者 Tick -164 (Frost)", -- [30]
				"糖猫-黑龙费尔默 暴风雪 (伤害/跳) 猫头鹰 Tick -164 (Frost)", -- [31]
				"猫头鹰 肉搏 糖猫-黑龙费尔默 Hit -90 (Physical)", -- [32]
				"盗克盗-逐风者 肉搏 糖猫-黑龙费尔默 Crit -196 (Physical)", -- [33]
				"猫头鹰 爪击 糖猫-黑龙费尔默 Hit -47 (Physical)", -- [34]
				"盗克盗-逐风者 肉搏 糖猫-黑龙费尔默 Hit -241 (Physical)", -- [35]
				"猫头鹰 爪击 糖猫-黑龙费尔默 Hit -57 (Physical)", -- [36]
			},
			["Name"] = "糖猫-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
			},
			["LastEventTimes"] = {
				7464.914, -- [1]
				7670.561000000001, -- [2]
				7672.078, -- [3]
				7672.144, -- [4]
				7673.078, -- [5]
				7673.078, -- [6]
				7673.078, -- [7]
				7673.178, -- [8]
				7674.811000000001, -- [9]
				7675.028, -- [10]
				7675.578, -- [11]
				7676.978, -- [12]
				7677.945, -- [13]
				7677.961, -- [14]
				7745.599, -- [15]
				8206.564, -- [16]
				8214.348, -- [17]
				8221.399, -- [18]
				8221.532000000001, -- [19]
				8221.715, -- [20]
				8227.366, -- [21]
				8227.382, -- [22]
				8229.799, -- [23]
				8229.799, -- [24]
				8230.066, -- [25]
				8230.305, -- [26]
				8230.333, -- [27]
				8230.699, -- [28]
				8231.399, -- [29]
				8231.916000000001, -- [30]
				8231.916000000001, -- [31]
				8232.766, -- [32]
				8232.999, -- [33]
				8233.016, -- [34]
				8233.699, -- [35]
				8234.633, -- [36]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["糖猫-黑龙费尔默"] = {
									["max"] = 386,
									["min"] = 8,
									["count"] = 6,
									["amount"] = 688,
								},
							},
							["count"] = 6,
							["amount"] = 688,
						},
					},
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["猫头鹰"] = {
									["count"] = 3,
								},
								["盗克盗-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2689,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 688,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 202,
						["Physical"] = 486,
					},
					["ElementTaken"] = {
						["Melee"] = 1290,
						["Physical"] = 1399,
					},
					["DOT_Time"] = 6,
					["Damage"] = 328,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 4.81,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 328,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 43,
									["min"] = 8,
									["count"] = 2,
									["amount"] = 51,
								},
							},
							["count"] = 2,
							["amount"] = 51,
						},
						["自动射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 386,
									["min"] = 386,
									["count"] = 1,
									["amount"] = 386,
								},
							},
							["count"] = 1,
							["amount"] = 386,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 49,
									["min"] = 49,
									["count"] = 1,
									["amount"] = 49,
								},
							},
							["count"] = 4,
							["amount"] = 49,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 106,
									["min"] = 96,
									["count"] = 2,
									["amount"] = 202,
								},
							},
							["count"] = 9,
							["amount"] = 202,
						},
					},
					["DamagedWho"] = {
						["猫头鹰"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 164,
								},
							},
							["amount"] = 164,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 164,
								},
							},
							["amount"] = 164,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["猫头鹰"] = {
							["Details"] = {
								["尖啸"] = {
									["count"] = 73,
								},
								["爪击"] = {
									["count"] = 214,
								},
								["肉搏"] = {
									["count"] = 404,
								},
							},
							["amount"] = 691,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 886,
								},
								["邪恶攻击"] = {
									["count"] = 274,
								},
							},
							["amount"] = 1160,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 386,
								},
							},
							["amount"] = 386,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 452,
								},
							},
							["amount"] = 452,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.81,
								},
							},
							["amount"] = 4.81,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 688,
								},
							},
							["amount"] = 688,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.81,
								},
							},
							["amount"] = 4.81,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 386,
									["min"] = 8,
									["count"] = 6,
									["amount"] = 688,
								},
							},
							["count"] = 6,
							["amount"] = 688,
						},
					},
					["WhoHealed"] = {
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 688,
								},
							},
							["amount"] = 688,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.810000000000001,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 164,
									["min"] = 164,
									["count"] = 2,
									["amount"] = 328,
								},
							},
							["count"] = 2,
							["amount"] = 328,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 688,
					["RageGain"] = 0,
					["TimeDamage"] = 3,
					["TimeDamaging"] = {
						["盗克盗-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.81,
								},
							},
							["amount"] = 4.81,
						},
					},
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["猫头鹰"] = {
									["count"] = 3,
								},
								["盗克盗-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["盗克盗-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.81,
								},
							},
							["amount"] = 4.81,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 5891,
					["PartialResist"] = {
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["自动射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 386,
									["min"] = 386,
									["count"] = 1,
									["amount"] = 386,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 386,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 49,
									["min"] = 49,
									["count"] = 1,
									["amount"] = 49,
								},
							},
							["count"] = 4,
							["amount"] = 49,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 43,
									["min"] = 8,
									["count"] = 2,
									["amount"] = 51,
								},
							},
							["count"] = 2,
							["amount"] = 51,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 106,
									["min"] = 96,
									["count"] = 2,
									["amount"] = 202,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 202,
						},
					},
					["ActiveTime"] = 13.81,
					["ElementTaken"] = {
						["Physical"] = 4263,
						["Fire"] = 82,
						["Melee"] = 1290,
						["Arcane"] = 256,
					},
					["DOT_Time"] = 6,
					["Damage"] = 2345,
					["WhoHealed"] = {
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 688,
								},
							},
							["amount"] = 688,
						},
					},
					["TimeHeal"] = 4.81,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
					},
					["HealedWho"] = {
						["糖猫-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 688,
								},
							},
							["amount"] = 688,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 386,
									["min"] = 8,
									["count"] = 6,
									["amount"] = 688,
								},
							},
							["count"] = 6,
							["amount"] = 688,
						},
					},
					["WhoDamaged"] = {
						["猫头鹰"] = {
							["Details"] = {
								["尖啸"] = {
									["count"] = 73,
								},
								["爪击"] = {
									["count"] = 214,
								},
								["肉搏"] = {
									["count"] = 404,
								},
							},
							["amount"] = 691,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 452,
								},
							},
							["amount"] = 452,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 886,
								},
								["邪恶攻击"] = {
									["count"] = 274,
								},
							},
							["amount"] = 1160,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1889,
								},
								["多重射击"] = {
									["count"] = 818,
								},
								["奥术射击"] = {
									["count"] = 256,
								},
							},
							["amount"] = 2963,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 386,
								},
							},
							["amount"] = 386,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["灼热武器"] = {
									["count"] = 82,
								},
								["出血"] = {
									["count"] = 157,
								},
							},
							["amount"] = 239,
						},
					},
					["Absorbs"] = 688,
					["ElementTakenAbsorb"] = {
						["Melee"] = 202,
						["Physical"] = 486,
					},
					["ElementDone"] = {
						["Frost"] = 2345,
					},
					["HealingTaken"] = 688,
					["DamagedWho"] = {
						["猫头鹰"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 164,
								},
							},
							["amount"] = 164,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 164,
								},
							},
							["amount"] = 164,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 85,
								},
							},
							["amount"] = 85,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 607,
								},
							},
							["amount"] = 607,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1325,
								},
							},
							["amount"] = 1325,
						},
					},
					["TimeDamage"] = 9,
					["TimeDamaging"] = {
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 13,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 164,
									["min"] = 164,
									["count"] = 2,
									["amount"] = 328,
								},
							},
							["count"] = 2,
							["amount"] = 328,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 669,
									["min"] = 607,
									["count"] = 3,
									["amount"] = 1932,
								},
							},
							["count"] = 3,
							["amount"] = 1932,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 85,
									["min"] = 85,
									["count"] = 1,
									["amount"] = 85,
								},
							},
							["count"] = 2,
							["amount"] = 85,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["糖猫-黑龙费尔默"] = {
									["max"] = 386,
									["min"] = 8,
									["count"] = 6,
									["amount"] = 688,
								},
							},
							["count"] = 6,
							["amount"] = 688,
						},
					},
				},
			},
			["UnitLockout"] = 7464.263,
			["LastActive"] = 8234.266,
		},
		["猛将兄-老马布兰契"] = {
			["GUID"] = "Player-5447-02EAD7F6",
			["TimeLast"] = {
				["TimeHeal"] = 7822.271,
				["ActiveTime"] = 8188.263,
				["Overhealing"] = 7256.266000000001,
				["OVERALL"] = 8191.263,
				["DamageTaken"] = 8189.263,
				["DeathCount"] = 7050.268,
				["Absorbs"] = 7663.26,
				["RageGain"] = 8191.263,
				["HOT_Time"] = 7821.271,
				["TimeDamage"] = 8188.263,
				["HealingTaken"] = 7822.271,
				["Healing"] = 7822.271,
				["DOT_Time"] = 8188.263,
				["Damage"] = 8188.263,
			},
			["LastAttackedBy"] = "要水吗兄弟-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"HEAL", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"HEAL", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					61.48, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Healing"] = {
					8140, -- [1]
				},
				["DamageTaken"] = {
					28161, -- [1]
				},
				["Overhealing"] = {
					83, -- [1]
				},
				["Absorbs"] = {
					679, -- [1]
				},
				["RageGain"] = {
					252, -- [1]
				},
				["HOT_Time"] = {
					141, -- [1]
				},
				["ActiveTime"] = {
					175.25, -- [1]
				},
				["TimeDamage"] = {
					113.77, -- [1]
				},
				["HealingTaken"] = {
					8819, -- [1]
				},
				["DOT_Time"] = {
					132, -- [1]
				},
				["Damage"] = {
					30992, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "猛将兄-老马布兰契",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
					},
					["Messages"] = {
						"阿莱克斯·巴罗夫的仆从 肉搏 猛将兄-老马布兰契 Hit -30 (Physical)", -- [1]
						"阿莱克斯·巴罗夫的仆从 肉搏 猛将兄-老马布兰契 Hit -29 (Physical)", -- [2]
						"阿莱克斯·巴罗夫的仆从 肉搏 猛将兄-老马布兰契 Crit -66 (Physical)", -- [3]
						"龙九爷-黑龙费尔默 自动射击 猛将兄-老马布兰契 Hit -104 (Physical)", -- [4]
						"猛将兄-老马布兰契 重伤 (伤害/跳) 龙九爷-黑龙费尔默 Tick -98 (Physical)", -- [5]
						"龙九爷-黑龙费尔默 自动射击 猛将兄-老马布兰契 Hit -109 (Physical)", -- [6]
						"猛将兄-老马布兰契 血之狂热 猛将兄-老马布兰契 Tick +62", -- [7]
						"龙九爷-黑龙费尔默 自动射击 猛将兄-老马布兰契 Hit -107 (Physical)", -- [8]
						"猛将兄-老马布兰契 钻石水瓶 猛将兄-老马布兰契 Tick +9", -- [9]
						"哎哟喂-火妖鲁西弗隆 多重射击 猛将兄-老马布兰契 Hit -408 (Physical)", -- [10]
						"猛将兄-老马布兰契 血之狂热 猛将兄-老马布兰契 Tick +63", -- [11]
						"猛将兄-老马布兰契 重伤 (伤害/跳) 龙九爷-黑龙费尔默 Tick -99 (Physical)", -- [12]
						"猛将兄-老马布兰契 拦截昏迷 黑椒牛柳灬-逐风者 Hit -61 (Physical)", -- [13]
						"龙九爷-黑龙费尔默 自动射击 猛将兄-老马布兰契 Crit -313 (Physical)", -- [14]
						"龙九爷-黑龙费尔默 奥术射击 猛将兄-老马布兰契 Hit -172 (Arcane)", -- [15]
						"猛将兄-老马布兰契 旋风斩 豹 Hit -523 (Physical)", -- [16]
						"猛将兄-老马布兰契 旋风斩 龙九爷-黑龙费尔默 Hit -577 (Physical)", -- [17]
						"龙九爷-黑龙费尔默 驱散射击 猛将兄-老马布兰契 Miss (Physical)", -- [18]
						"猛将兄-老马布兰契 血之狂热 猛将兄-老马布兰契 Tick +63", -- [19]
						"龙九爷-黑龙费尔默 毒蛇钉刺 (伤害/跳) 猛将兄-老马布兰契 Tick -128 (Nature)", -- [20]
						"麦积烟雨 自动射击 猛将兄-老马布兰契 Hit -225 (Physical)", -- [21]
						"豹 肉搏 猛将兄-老马布兰契 Hit -59 (Physical)", -- [22]
						"豹 爪击 猛将兄-老马布兰契 Hit -41 (Physical)", -- [23]
						"猛将兄-老马布兰契 钻石水瓶 猛将兄-老马布兰契 Tick +9", -- [24]
						"猛将兄-老马布兰契 血之狂热 猛将兄-老马布兰契 Tick +62", -- [25]
						"豹 肉搏 猛将兄-老马布兰契 Hit -56 (Physical)", -- [26]
						"猛将兄-老马布兰契 断筋 龙九爷-黑龙费尔默 Crit -94 (Physical)", -- [27]
						"豹 爪击 猛将兄-老马布兰契 Hit -40 (Physical)", -- [28]
						"麦积烟雨 自动射击 猛将兄-老马布兰契 Hit -225 (Physical)", -- [29]
						"龙九爷-黑龙费尔默 毒蛇钉刺 (伤害/跳) 猛将兄-老马布兰契 Tick -128 (Nature)", -- [30]
						"猛将兄-老马布兰契死亡。", -- [31]
					},
					["DeathAt"] = 7052.269,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
					},
					["MessageTimes"] = {
						-14.96799999999985, -- [1]
						-14.96799999999985, -- [2]
						-14.96799999999985, -- [3]
						-14.61800000000039, -- [4]
						-13.71799999999985, -- [5]
						-13.21799999999985, -- [6]
						-12.96799999999985, -- [7]
						-11.81800000000021, -- [8]
						-11.16800000000058, -- [9]
						-11.10100000000057, -- [10]
						-10.96799999999985, -- [11]
						-10.71799999999985, -- [12]
						-10.63500000000022, -- [13]
						-10.45100000000002, -- [14]
						-10.45100000000002, -- [15]
						-3.434000000000197, -- [16]
						-3.434000000000197, -- [17]
						-3.317000000000007, -- [18]
						-3.101000000000568, -- [19]
						-3.03400000000056, -- [20]
						-2.701000000000022, -- [21]
						-2.333999999999833, -- [22]
						-2.03400000000056, -- [23]
						-1.167000000000371, -- [24]
						-1.117000000000189, -- [25]
						-0.9340000000001965, -- [26]
						-0.4170000000003711, -- [27]
						-0.4170000000003711, -- [28]
						-0.3170000000000073, -- [29]
						-0.01699999999982538, -- [30]
						0, -- [31]
					},
					["HealthMax"] = {
						6249, -- [1]
						6249, -- [2]
						6249, -- [3]
						6249, -- [4]
						6249, -- [5]
						6249, -- [6]
						6249, -- [7]
						6249, -- [8]
						6249, -- [9]
						6249, -- [10]
						6249, -- [11]
						6249, -- [12]
						6249, -- [13]
						6249, -- [14]
						6249, -- [15]
						6249, -- [16]
						6249, -- [17]
						6249, -- [18]
						6249, -- [19]
						6249, -- [20]
						6249, -- [21]
						6249, -- [22]
						6249, -- [23]
						6249, -- [24]
						6249, -- [25]
						6249, -- [26]
						6249, -- [27]
						6249, -- [28]
						6249, -- [29]
						6249, -- [30]
						6249, -- [31]
					},
					["Health"] = {
						3723, -- [1]
						3723, -- [2]
						3723, -- [3]
						3598, -- [4]
						3494, -- [5]
						3494, -- [6]
						3385, -- [7]
						3447, -- [8]
						3340, -- [9]
						3340, -- [10]
						2941, -- [11]
						3004, -- [12]
						3004, -- [13]
						3004, -- [14]
						3004, -- [15]
						689, -- [16]
						689, -- [17]
						689, -- [18]
						689, -- [19]
						752, -- [20]
						624, -- [21]
						399, -- [22]
						340, -- [23]
						299, -- [24]
						299, -- [25]
						299, -- [26]
						314, -- [27]
						314, -- [28]
						274, -- [29]
						49, -- [30]
						0, -- [31]
					},
					["KilledBy"] = "龙九爷-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"HEAL", -- [9]
						"DAMAGE", -- [10]
						"HEAL", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"HEAL", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"HEAL", -- [24]
						"HEAL", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"MISC", -- [31]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暴风雪 (伤害/跳)",
			["LastFightIn"] = 13,
			["type"] = "Ungrouped",
			["LastHealTime"] = 7822.938,
			["LastEventHealth"] = {
				726, -- [1]
				667, -- [2]
				667, -- [3]
				438, -- [4]
				359, -- [5]
				422, -- [6]
				422, -- [7]
				381, -- [8]
				164, -- [9]
				164, -- [10]
				104, -- [11]
				1614, -- [12]
				1489, -- [13]
				1489, -- [14]
				1295, -- [15]
				1295, -- [16]
				1295, -- [17]
				1295, -- [18]
				1295, -- [19]
				1053, -- [20]
				1053, -- [21]
				667, -- [22]
				612, -- [23]
				612, -- [24]
				612, -- [25]
				612, -- [26]
				486, -- [27]
				432, -- [28]
				305, -- [29]
				305, -- [30]
				305, -- [31]
				249, -- [32]
				6249, -- [33]
				6249, -- [34]
				6249, -- [35]
				6249, -- [36]
				6249, -- [37]
				5568, -- [38]
				4979, -- [39]
				4979, -- [40]
				4979, -- [41]
				6135, -- [42]
				6135, -- [43]
				5798, -- [44]
				5798, -- [45]
				5406, -- [46]
				5406, -- [47]
				726, -- [48]
				726, -- [49]
				726, -- [50]
			},
			["LastDamageTaken"] = 187,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				6249, -- [1]
				6249, -- [2]
				6249, -- [3]
				6249, -- [4]
				6249, -- [5]
				6249, -- [6]
				6249, -- [7]
				6249, -- [8]
				6249, -- [9]
				6249, -- [10]
				6249, -- [11]
				6249, -- [12]
				6249, -- [13]
				6249, -- [14]
				6249, -- [15]
				6249, -- [16]
				6249, -- [17]
				6249, -- [18]
				6249, -- [19]
				6249, -- [20]
				6249, -- [21]
				6249, -- [22]
				6249, -- [23]
				6249, -- [24]
				6249, -- [25]
				6249, -- [26]
				6249, -- [27]
				6249, -- [28]
				6249, -- [29]
				6249, -- [30]
				6249, -- [31]
				6249, -- [32]
				6249, -- [33]
				6249, -- [34]
				6249, -- [35]
				6249, -- [36]
				6249, -- [37]
				6249, -- [38]
				6249, -- [39]
				6249, -- [40]
				6249, -- [41]
				6249, -- [42]
				6249, -- [43]
				6249, -- [44]
				6249, -- [45]
				6249, -- [46]
				6249, -- [47]
				6249, -- [48]
				6249, -- [49]
				6249, -- [50]
			},
			["NextEventNum"] = 48,
			["LastDamageTime"] = 8189.196,
			["LastEvents"] = {
				"豹 肉搏 猛将兄-老马布兰契 Hit -59 (Physical)", -- [1]
				"猛将兄-老马布兰契 致死打击 龙九爷-黑龙费尔默 Crit -1663 (Physical)", -- [2]
				"麦积烟雨 自动射击 猛将兄-老马布兰契 Hit -229 (Physical)", -- [3]
				"猫头鹰 肉搏 猛将兄-老马布兰契 Hit -79 (Physical)", -- [4]
				"猛将兄-老马布兰契 血之狂热 猛将兄-老马布兰契 Tick +63", -- [5]
				"豹 爪击 猛将兄-老马布兰契 Dodge (Physical)", -- [6]
				"猫头鹰 爪击 猛将兄-老马布兰契 Hit -41 (Physical)", -- [7]
				"麦积烟雨 奥术射击 猛将兄-老马布兰契 Hit -217 (Arcane)", -- [8]
				"猛将兄-老马布兰契 肉搏 龙九爷-黑龙费尔默 Hit -536 (Physical)", -- [9]
				"豹 肉搏 猛将兄-老马布兰契 Hit -60 (Physical)", -- [10]
				"猛将兄-老马布兰契 治疗药水 猛将兄-老马布兰契 Hit +1510", -- [11]
				"麦积烟雨 毒蛇钉刺 (伤害/跳) 猛将兄-老马布兰契 Tick -125 (Nature)", -- [12]
				"猫头鹰 肉搏 猛将兄-老马布兰契 Hit -67 (Physical)", -- [13]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 猛将兄-老马布兰契 Tick -127 (Nature)", -- [14]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 哎哟喂 Tick -154 (Physical)", -- [15]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 豹 Tick -154 (Physical)", -- [16]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 猫头鹰 Tick -153 (Physical)", -- [17]
				"豹 肉搏 猛将兄-老马布兰契 Parry (1)", -- [18]
				"麦积烟雨 自动射击 猛将兄-老马布兰契 Hit -242 (Physical)", -- [19]
				"麦积烟雨 多重射击 猛将兄-老马布兰契 Hit -386 (Physical)", -- [20]
				"豹 爪击 猛将兄-老马布兰契 Dodge (Physical)", -- [21]
				"豹 肉搏 猛将兄-老马布兰契 Hit -55 (Physical)", -- [22]
				"猛将兄-老马布兰契 旋风斩 哎哟喂-火妖鲁西弗隆 Dodge (Physical)", -- [23]
				"猛将兄-老马布兰契 旋风斩 豹 Parry (Physical)", -- [24]
				"猛将兄-老马布兰契 旋风斩 麦积烟雨 Hit -520 (Physical)", -- [25]
				"麦积烟雨 毒蛇钉刺 (伤害/跳) 猛将兄-老马布兰契 Tick -126 (Nature)", -- [26]
				"豹 肉搏 猛将兄-老马布兰契 Hit -54 (Physical)", -- [27]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 猛将兄-老马布兰契 Tick -127 (Nature)", -- [28]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 豹 Tick -153 (Physical)", -- [29]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 哎哟喂 Tick -153 (Physical)", -- [30]
				"豹 肉搏 猛将兄-老马布兰契 Hit -56 (Physical)", -- [31]
				"麦积烟雨 肉搏 猛将兄-老马布兰契 Hit -213 (Physical)", -- [32]
				"Environment Falling 猛将兄-老马布兰契 Hit -553 (Physical)", -- [33]
				"猛将兄-老马布兰契 冲锋击昏 我想问题不大-黑龙费尔默 Resist (Physical)", -- [34]
				"猛将兄-老马布兰契 肉搏 我想问题不大-黑龙费尔默 Hit -266 (Physical)", -- [35]
				"猛将兄-老马布兰契 断筋 我想问题不大-黑龙费尔默 Crit -50 (Physical)", -- [36]
				"我想问题不大-黑龙费尔默 闪电之盾 猛将兄-老马布兰契 Hit -344 (Nature)", -- [37]
				"火焰新星图腾 V 火焰新星 猛将兄-老马布兰契 Hit -589 (Fire)", -- [38]
				"猛将兄-老马布兰契 旋风斩 我想问题不大-黑龙费尔默 Crit -572 (Physical)", -- [39]
				"猛将兄-老马布兰契 肉搏 我想问题不大-黑龙费尔默 Crit -576 (Physical)", -- [40]
				"我想问题不大-黑龙费尔默 闪电之盾 猛将兄-老马布兰契 Hit -378 (Nature)", -- [41]
				"猛将兄-老马布兰契 肉搏 麦积烟雨 Hit -363 (Physical)", -- [42]
				"猛将兄-老马布兰契 断筋 麦积烟雨 Hit -31 (Physical)", -- [43]
				"猛将兄-老马布兰契 肉搏 麦积烟雨 Parry (1)", -- [44]
				"干锅肥肠 多重射击 猛将兄-老马布兰契 Hit -392 (Physical)", -- [45]
				"猛将兄-老马布兰契 撕裂 (伤害/跳) 麦积烟雨 Tick -28 (Physical)", -- [46]
				"要水吗兄弟-逐风者 暴风雪 (伤害/跳) 猛将兄-老马布兰契 Tick -187 (Frost)", -- [47]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 豹 Tick -154 (Physical)", -- [48]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 哎哟喂 Tick -154 (Physical)", -- [49]
				"猛将兄-老马布兰契 重伤 (伤害/跳) 猫头鹰 Tick -153 (Physical)", -- [50]
			},
			["Name"] = "猛将兄-老马布兰契",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				7821.504, -- [1]
				7821.538000000001, -- [2]
				7821.838, -- [3]
				7821.905, -- [4]
				7822.205, -- [5]
				7822.654, -- [6]
				7822.654, -- [7]
				7822.688, -- [8]
				7822.821, -- [9]
				7822.905, -- [10]
				7822.938, -- [11]
				7823.788000000001, -- [12]
				7823.905, -- [13]
				7823.905, -- [14]
				7824.155, -- [15]
				7824.155, -- [16]
				7824.155, -- [17]
				7824.305, -- [18]
				7824.305, -- [19]
				7824.938, -- [20]
				7825.071, -- [21]
				7825.705, -- [22]
				7826.588, -- [23]
				7826.588, -- [24]
				7826.588, -- [25]
				7826.788000000001, -- [26]
				7826.872, -- [27]
				7826.905, -- [28]
				7827.138, -- [29]
				7827.138, -- [30]
				7828.272, -- [31]
				7828.322, -- [32]
				7852.857, -- [33]
				8122.242, -- [34]
				8123.259, -- [35]
				8123.259, -- [36]
				8123.292, -- [37]
				8124.809, -- [38]
				8125.009, -- [39]
				8126.775000000001, -- [40]
				8126.792, -- [41]
				8184.463, -- [42]
				8184.679, -- [43]
				8187.980000000001, -- [44]
				8189.03, -- [45]
				8189.196, -- [46]
				8189.896, -- [47]
				7821.138, -- [48]
				7821.138, -- [49]
				7821.138, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["猫头鹰"] = {
									["count"] = 18,
								},
								["我想问题不大-黑龙费尔默"] = {
									["count"] = 12,
								},
								["豹"] = {
									["count"] = 12,
								},
								["黑椒牛柳灬-逐风者"] = {
									["count"] = 3,
								},
								["哎哟喂"] = {
									["count"] = 15,
								},
								["哎哟喂-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
								["龙九爷-黑龙费尔默"] = {
									["count"] = 18,
								},
								["要水吗兄弟-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 96,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["哎哟喂-火妖鲁西弗隆"] = {
									["count"] = 30,
								},
								["龙九爷-黑龙费尔默"] = {
									["count"] = 3,
								},
								["麦积烟雨"] = {
									["count"] = 3,
								},
							},
							["amount"] = 36,
						},
					},
					["TimeSpent"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.32,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.07,
								},
								["旋风斩"] = {
									["count"] = 1.9,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 10.59,
								},
								["疯狂之眼"] = {
									["count"] = 0.78,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 2.63,
								},
								["肉搏"] = {
									["count"] = 1.92,
								},
							},
							["amount"] = 23.38999999999999,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.4,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["断筋"] = {
									["count"] = 3.23,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.95,
								},
							},
							["amount"] = 19.08,
						},
						["猫头鹰"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.38,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.98,
								},
							},
							["amount"] = 4.359999999999999,
						},
						["哎哟喂"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.33,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.33,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.76,
								},
								["压制"] = {
									["count"] = 0.93,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.87,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.22,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 5.38,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.43,
								},
							},
							["amount"] = 23.09,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.100000000000001,
								},
								["肉搏"] = {
									["count"] = 3.77,
								},
							},
							["amount"] = 11.87,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["刺耳怒吼"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.08,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 6.15,
						},
						["猛将兄-老马布兰契"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 21.33,
								},
								["穴居虫之壳"] = {
									["count"] = 1.5,
								},
								["钻石水瓶"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["治疗药水"] = {
									["count"] = 0.73,
								},
								["血之狂热"] = {
									["count"] = 31.92,
								},
							},
							["amount"] = 61.48,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.37,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.22,
								},
								["断筋"] = {
									["count"] = 1.09,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.13,
								},
							},
							["amount"] = 9.81,
						},
						["豹"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.65,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.15,
						},
						["大懒猪"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.65,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 3.22,
						},
					},
					["HealedWho"] = {
						["猛将兄-老马布兰契"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 5000,
								},
								["穴居虫之壳"] = {
									["count"] = 679,
								},
								["钻石水瓶"] = {
									["count"] = 27,
								},
								["神圣力量"] = {
									["count"] = 103,
								},
								["治疗药水"] = {
									["count"] = 1510,
								},
								["血之狂热"] = {
									["count"] = 1500,
								},
							},
							["amount"] = 8819,
						},
					},
					["RageGainedFrom"] = {
						["猛将兄-老马布兰契"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 120,
								},
								["血性狂暴"] = {
									["count"] = 132,
								},
							},
							["amount"] = 252,
						},
					},
					["Absorbs"] = 679,
					["DeathCount"] = 1,
					["HOT_Time"] = 141,
					["ElementTaken"] = {
						["Physical"] = 9474,
						["Melee"] = 4976,
						["Arcane"] = 2629,
						["Fire"] = 1275,
						["Frost"] = 5451,
						["Nature"] = 4356,
					},
					["HOTs"] = {
						["钻石水瓶"] = {
							["Details"] = {
								["猛将兄-老马布兰契"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["血之狂热"] = {
							["Details"] = {
								["猛将兄-老马布兰契"] = {
									["count"] = 72,
								},
							},
							["amount"] = 72,
						},
						["急救"] = {
							["Details"] = {
								["猛将兄-老马布兰契"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
					},
					["Damage"] = 30992,
					["TimeHeal"] = 61.48,
					["ElementDone"] = {
						["Melee"] = 12617,
						["Physical"] = 18375,
					},
					["DamagedWho"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 102,
								},
								["拦截昏迷"] = {
									["count"] = 51,
								},
								["肉搏"] = {
									["count"] = 660,
								},
							},
							["amount"] = 813,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 463,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 334,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 196,
								},
								["断筋"] = {
									["count"] = 92,
								},
								["拦截昏迷"] = {
									["count"] = 79,
								},
								["肉搏"] = {
									["count"] = 1636,
								},
							},
							["amount"] = 2800,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1663,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 661,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 29,
								},
								["断筋"] = {
									["count"] = 288,
								},
								["旋风斩"] = {
									["count"] = 1097,
								},
								["肉搏"] = {
									["count"] = 2615,
								},
							},
							["amount"] = 6353,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 98,
								},
								["拦截昏迷"] = {
									["count"] = 61,
								},
								["断筋"] = {
									["count"] = 79,
								},
								["肉搏"] = {
									["count"] = 498,
								},
							},
							["amount"] = 736,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1375,
								},
								["旋风斩"] = {
									["count"] = 572,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 301,
								},
								["拦截昏迷"] = {
									["count"] = 31,
								},
								["断筋"] = {
									["count"] = 202,
								},
								["斩杀"] = {
									["count"] = 403,
								},
								["肉搏"] = {
									["count"] = 2364,
								},
							},
							["amount"] = 5248,
						},
						["猫头鹰"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1137,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 777,
								},
							},
							["amount"] = 1914,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 127,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 393,
								},
								["肉搏"] = {
									["count"] = 2260,
								},
							},
							["amount"] = 2780,
						},
						["大懒猪"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 32,
								},
								["斩杀"] = {
									["count"] = 505,
								},
								["肉搏"] = {
									["count"] = 458,
								},
							},
							["amount"] = 995,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1410,
								},
								["旋风斩"] = {
									["count"] = 1086,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
								["断筋"] = {
									["count"] = 70,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 1364,
								},
							},
							["amount"] = 4011,
						},
						["豹"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 614,
								},
								["旋风斩"] = {
									["count"] = 1593,
								},
							},
							["amount"] = 2207,
						},
						["哎哟喂"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 725,
								},
								["肉搏"] = {
									["count"] = 762,
								},
								["旋风斩"] = {
									["count"] = 1648,
								},
							},
							["amount"] = 3135,
						},
					},
					["WhoDamaged"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 669,
								},
								["暴风雪 (伤害/跳)"] = {
									["count"] = 163,
								},
								["冰霜新星"] = {
									["count"] = 189,
								},
							},
							["amount"] = 1021,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 392,
								},
							},
							["amount"] = 392,
						},
						["哎哟喂"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 363,
								},
								["肉搏"] = {
									["count"] = 872,
								},
							},
							["amount"] = 1235,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 635,
								},
								["奥术射击"] = {
									["count"] = 216,
								},
								["摔绊"] = {
									["count"] = 207,
								},
								["多重射击"] = {
									["count"] = 408,
								},
								["自动射击"] = {
									["count"] = 626,
								},
								["驱散射击"] = {
									["count"] = 312,
								},
								["肉搏"] = {
									["count"] = 963,
								},
							},
							["amount"] = 3367,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 500,
								},
								["奥术射击"] = {
									["count"] = 1091,
								},
								["自动射击"] = {
									["count"] = 1092,
								},
							},
							["amount"] = 2683,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["灼热武器"] = {
									["count"] = 81,
								},
								["出血"] = {
									["count"] = 238,
								},
								["肉搏"] = {
									["count"] = 488,
								},
							},
							["amount"] = 807,
						},
						["猫头鹰"] = {
							["Details"] = {
								["尖啸"] = {
									["count"] = 70,
								},
								["爪击"] = {
									["count"] = 168,
								},
								["肉搏"] = {
									["count"] = 443,
								},
							},
							["amount"] = 681,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["闪电链"] = {
									["count"] = 1020,
								},
								["冰霜震击"] = {
									["count"] = 767,
								},
								["火舌攻击"] = {
									["count"] = 392,
								},
								["闪电之盾"] = {
									["count"] = 1070,
								},
								["铁皮手雷"] = {
									["count"] = 213,
								},
								["肉搏"] = {
									["count"] = 275,
								},
							},
							["amount"] = 3737,
						},
						["阿莱克斯·巴罗夫的仆从"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 125,
								},
							},
							["amount"] = 125,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 732,
								},
							},
							["amount"] = 732,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 460,
								},
								["冰霜新星"] = {
									["count"] = 279,
								},
								["寒冰箭"] = {
									["count"] = 1283,
								},
								["肉搏"] = {
									["count"] = 679,
								},
								["冰锥术"] = {
									["count"] = 2310,
								},
							},
							["amount"] = 5011,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1131,
								},
								["奥术射击"] = {
									["count"] = 653,
								},
								["摔绊"] = {
									["count"] = 31,
								},
								["驱散射击"] = {
									["count"] = 553,
								},
								["自动射击"] = {
									["count"] = 2427,
								},
								["多重射击"] = {
									["count"] = 1736,
								},
								["肉搏"] = {
									["count"] = 440,
								},
							},
							["amount"] = 6971,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 119,
								},
								["肉搏"] = {
									["count"] = 691,
								},
							},
							["amount"] = 810,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 589,
								},
							},
							["amount"] = 589,
						},
					},
					["Absorbed"] = {
						["穴居虫之壳"] = {
							["Details"] = {
								["猛将兄-老马布兰契"] = {
									["max"] = 679,
									["min"] = 679,
									["count"] = 1,
									["amount"] = 679,
								},
							},
							["count"] = 1,
							["amount"] = 679,
						},
					},
					["ElementDoneBlock"] = {
						["Physical"] = 5,
					},
					["TimeHealing"] = {
						["猛将兄-老马布兰契"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 21.33,
								},
								["穴居虫之壳"] = {
									["count"] = 1.5,
								},
								["钻石水瓶"] = {
									["count"] = 4.5,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["治疗药水"] = {
									["count"] = 0.73,
								},
								["血之狂热"] = {
									["count"] = 31.92,
								},
							},
							["amount"] = 61.48,
						},
					},
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
					},
					["PartialResist"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 18,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["火舌攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 21,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 51,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 51,
						},
					},
					["PartialAbsorb"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["火舌攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 679,
									["min"] = 679,
									["count"] = 1,
									["amount"] = 679,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 679,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 51,
									["amount"] = 0,
								},
							},
							["count"] = 51,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 175.25,
					["ElementTakenAbsorb"] = {
						["Frost"] = 679,
					},
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 20,
									["amount"] = 5000,
								},
							},
							["count"] = 20,
							["amount"] = 5000,
						},
						["穴居虫之壳"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 679,
									["min"] = 679,
									["count"] = 1,
									["amount"] = 679,
								},
							},
							["count"] = 1,
							["amount"] = 679,
						},
						["钻石水瓶"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 9,
									["min"] = 9,
									["count"] = 3,
									["amount"] = 27,
								},
							},
							["count"] = 3,
							["amount"] = 27,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 103,
									["min"] = 103,
									["count"] = 1,
									["amount"] = 103,
								},
							},
							["count"] = 1,
							["amount"] = 103,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1510,
									["min"] = 1510,
									["count"] = 1,
									["amount"] = 1510,
								},
							},
							["count"] = 1,
							["amount"] = 1510,
						},
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 63,
									["min"] = 62,
									["count"] = 24,
									["amount"] = 1500,
								},
							},
							["count"] = 24,
							["amount"] = 1500,
						},
					},
					["Overhealing"] = 83,
					["ElementDoneAbsorb"] = {
						["Melee"] = 557,
						["Physical"] = 380,
					},
					["DOT_Time"] = 132,
					["Healing"] = 8140,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 43,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 62,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 35,
								},
								["Miss"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 51,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 10,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 16,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 18,
								},
							},
							["amount"] = 22,
						},
					},
					["DamageTaken"] = 28161,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1663,
									["min"] = 900,
									["count"] = 3,
									["amount"] = 3973,
								},
								["Hit"] = {
									["max"] = 475,
									["min"] = 463,
									["count"] = 2,
									["amount"] = 938,
								},
							},
							["count"] = 5,
							["amount"] = 4911,
						},
						["压制"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 36,
									["min"] = 28,
									["count"] = 12,
									["amount"] = 391,
								},
							},
							["count"] = 12,
							["amount"] = 391,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["疯狂之眼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 99,
									["min"] = 98,
									["count"] = 3,
									["amount"] = 295,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Tick"] = {
									["max"] = 162,
									["min"] = 98,
									["count"] = 27,
									["amount"] = 3470,
								},
							},
							["count"] = 32,
							["amount"] = 3765,
						},
						["刺耳怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 577,
									["min"] = 327,
									["count"] = 6,
									["amount"] = 3033,
								},
								["Hit (被格挡)"] = {
									["max"] = 342,
									["min"] = 342,
									["count"] = 1,
									["amount"] = 342,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1137,
									["min"] = 572,
									["count"] = 4,
									["amount"] = 3758,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 7133,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 61,
									["min"] = 31,
									["count"] = 6,
									["amount"] = 275,
								},
							},
							["count"] = 6,
							["amount"] = 275,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 85,
									["min"] = 85,
									["count"] = 1,
									["amount"] = 85,
								},
								["Hit"] = {
									["max"] = 43,
									["min"] = 28,
									["count"] = 7,
									["amount"] = 244,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 102,
									["min"] = 50,
									["count"] = 9,
									["amount"] = 663,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 992,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 505,
									["min"] = 403,
									["count"] = 2,
									["amount"] = 908,
								},
							},
							["count"] = 2,
							["amount"] = 908,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 486,
									["min"] = 71,
									["count"] = 2,
									["amount"] = 557,
								},
								["Hit"] = {
									["max"] = 660,
									["min"] = 266,
									["count"] = 17,
									["amount"] = 7779,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1143,
									["min"] = 576,
									["count"] = 5,
									["amount"] = 4281,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 27,
							["amount"] = 12617,
						},
					},
					["RageGain"] = 252,
					["HealingTaken"] = 8819,
					["TimeDamage"] = 113.77,
					["TimeDamaging"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.32,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.07,
								},
								["旋风斩"] = {
									["count"] = 1.9,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 10.59,
								},
								["疯狂之眼"] = {
									["count"] = 0.78,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 2.63,
								},
								["肉搏"] = {
									["count"] = 1.92,
								},
							},
							["amount"] = 23.38999999999999,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.4,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["断筋"] = {
									["count"] = 3.23,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.95,
								},
							},
							["amount"] = 19.08,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["刺耳怒吼"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.08,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 6.15,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.76,
								},
								["压制"] = {
									["count"] = 0.93,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.87,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.22,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 5.38,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.43,
								},
							},
							["amount"] = 23.09,
						},
						["猫头鹰"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.38,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.98,
								},
							},
							["amount"] = 4.359999999999999,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.100000000000001,
								},
								["肉搏"] = {
									["count"] = 3.77,
								},
							},
							["amount"] = 11.87,
						},
						["大懒猪"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.65,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 3.22,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.37,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.22,
								},
								["断筋"] = {
									["count"] = 1.09,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.13,
								},
							},
							["amount"] = 9.81,
						},
						["豹"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.65,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.15,
						},
						["哎哟喂"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.33,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.33,
						},
					},
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["猛将兄-老马布兰契"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
						["血性狂暴"] = {
							["Details"] = {
								["猛将兄-老马布兰契"] = {
									["count"] = 132,
								},
							},
							["amount"] = 132,
						},
					},
					["WhoHealed"] = {
						["猛将兄-老马布兰契"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 5000,
								},
								["穴居虫之壳"] = {
									["count"] = 679,
								},
								["钻石水瓶"] = {
									["count"] = 27,
								},
								["神圣力量"] = {
									["count"] = 103,
								},
								["治疗药水"] = {
									["count"] = 1510,
								},
								["血之狂热"] = {
									["count"] = 1500,
								},
							},
							["amount"] = 8819,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 3,
								},
								["Resist"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 39,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 24,
								},
							},
							["amount"] = 100,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 17,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 27,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 6873.273,
			["LastActive"] = 8191.263,
		},
		["最后亿次光临"] = {
			["GUID"] = "Player-5458-035CE1A8",
			["LastEventHealth"] = {
				6149, -- [1]
				6149, -- [2]
				6149, -- [3]
				5816, -- [4]
				5816, -- [5]
				5711, -- [6]
				5711, -- [7]
				5631, -- [8]
				5547, -- [9]
				5418, -- [10]
				5225, -- [11]
				5225, -- [12]
				5225, -- [13]
				5225, -- [14]
				5139, -- [15]
				5034, -- [16]
				4905, -- [17]
				4905, -- [18]
				4683, -- [19]
				4683, -- [20]
				4599, -- [21]
				4571, -- [22]
				3773, -- [23]
				4308, -- [24]
				3887, -- [25]
				3887, -- [26]
				3783, -- [27]
				3783, -- [28]
				3707, -- [29]
				5705, -- [30]
				5705, -- [31]
				5705, -- [32]
				6061, -- [33]
				5745, -- [34]
				5745, -- [35]
				4569, -- [36]
				4569, -- [37]
				4569, -- [38]
				4464, -- [39]
				4464, -- [40]
				4464, -- [41]
				4273, -- [42]
				4273, -- [43]
				4273, -- [44]
				2029, -- [45]
				2029, -- [46]
				2029, -- [47]
				2074, -- [48]
				2074, -- [49]
				2074, -- [50]
			},
			["LastAttackedBy"] = "干锅肥肠",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Healing"] = {
					100, -- [1]
				},
				["DamageTaken"] = {
					9793, -- [1]
				},
				["RageGain"] = {
					68, -- [1]
				},
				["ActiveTime"] = {
					44.08, -- [1]
				},
				["HealingTaken"] = {
					100, -- [1]
				},
				["TimeDamage"] = {
					42.58, -- [1]
				},
				["DOT_Time"] = {
					21, -- [1]
				},
				["Damage"] = {
					6019, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "最后亿次光临",
			["level"] = 60,
			["LastDamageAbility"] = "奥术射击",
			["LastFightIn"] = 12,
			["type"] = "Ungrouped",
			["LastHealTime"] = 7685.562,
			["LastEventHealthMax"] = {
				6149, -- [1]
				6149, -- [2]
				6149, -- [3]
				6149, -- [4]
				6149, -- [5]
				6149, -- [6]
				6149, -- [7]
				6149, -- [8]
				6149, -- [9]
				6149, -- [10]
				6149, -- [11]
				6149, -- [12]
				6149, -- [13]
				6149, -- [14]
				6149, -- [15]
				6149, -- [16]
				6149, -- [17]
				6149, -- [18]
				6149, -- [19]
				6149, -- [20]
				6149, -- [21]
				6149, -- [22]
				6149, -- [23]
				6149, -- [24]
				6149, -- [25]
				6149, -- [26]
				6149, -- [27]
				6149, -- [28]
				6149, -- [29]
				6149, -- [30]
				6149, -- [31]
				6149, -- [32]
				6149, -- [33]
				6149, -- [34]
				6149, -- [35]
				6149, -- [36]
				6149, -- [37]
				6149, -- [38]
				6149, -- [39]
				6149, -- [40]
				6149, -- [41]
				6149, -- [42]
				6149, -- [43]
				6149, -- [44]
				6149, -- [45]
				6149, -- [46]
				6149, -- [47]
				6149, -- [48]
				6149, -- [49]
				6149, -- [50]
			},
			["LastDamageTaken"] = 250,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 7685.262,
				["OVERALL"] = 8056.271,
				["DamageTaken"] = 8056.271,
				["RageGain"] = 7816.271,
				["HealingTaken"] = 7685.262,
				["TimeDamage"] = 7822.271,
				["Healing"] = 7685.262,
				["ActiveTime"] = 7822.271,
				["DOT_Time"] = 7677.261,
				["Damage"] = 7822.271,
			},
			["NextEventNum"] = 24,
			["LastDamageTime"] = 7823.121,
			["LastEvents"] = {
				"最后亿次光临 肉搏 盗克盗-逐风者 Hit -208 (Physical)", -- [1]
				"最后亿次光临 断筋 盗克盗-逐风者 Hit -37 (Physical)", -- [2]
				"盗克盗-逐风者 邪恶攻击 最后亿次光临 Crit -333 (Physical)", -- [3]
				"盗克盗-逐风者 肉搏 最后亿次光临 Block (1)", -- [4]
				"盗克盗-逐风者 肉搏 最后亿次光临 Crit -105 (Physical)", -- [5]
				"最后亿次光临 肉搏 盗克盗-逐风者 Hit -191 (Physical)", -- [6]
				"龙九爷-黑龙费尔默 自动射击 最后亿次光临 Hit -80 (Physical)", -- [7]
				"龙九爷-黑龙费尔默 自动射击 最后亿次光临 Hit -84 (Physical)", -- [8]
				"龙九爷-黑龙费尔默 毒蛇钉刺 (伤害/跳) 最后亿次光临 Tick -129 (Nature)", -- [9]
				"龙九爷-黑龙费尔默 多重射击 最后亿次光临 Hit -193 (Physical)", -- [10]
				"龙九爷-黑龙费尔默 自动射击 最后亿次光临 Miss (Physical)", -- [11]
				"最后亿次光临 旋风斩 盗克盗-逐风者 Hit -215 (Physical)", -- [12]
				"最后亿次光临 肉搏 盗克盗-逐风者 Hit -202 (Physical)", -- [13]
				"龙九爷-黑龙费尔默 自动射击 最后亿次光临 Hit -86 (Physical)", -- [14]
				"龙九爷-黑龙费尔默 冰霜箭 最后亿次光临 Crit -105 (Frost)", -- [15]
				"龙九爷-黑龙费尔默 毒蛇钉刺 (伤害/跳) 最后亿次光临 Tick -129 (Nature)", -- [16]
				"龙九爷-黑龙费尔默 奥术射击 最后亿次光临 Hit -173 (Arcane)", -- [17]
				"龙九爷-黑龙费尔默 冰霜箭 最后亿次光临 Hit -49 (Frost)", -- [18]
				"最后亿次光临 斩杀 盗克盗-逐风者 Hit -520 (Physical)", -- [19]
				"龙九爷-黑龙费尔默 自动射击 最后亿次光临 Hit -84 (Physical)", -- [20]
				"龙九爷-黑龙费尔默 毒蛇钉刺 (伤害/跳) 最后亿次光临 Tick -128 (Nature)", -- [21]
				"要水吗兄弟-逐风者 寒冰箭 最后亿次光临 Hit -798 (Frost)", -- [22]
				"干锅肥肠 奥术射击 最后亿次光临 Hit -250 (Arcane)", -- [23]
				"哎哟喂-火妖鲁西弗隆 奥术射击 最后亿次光临 Crit -421 (Arcane)", -- [24]
				"哎哟喂 肉搏 最后亿次光临 Block (1)", -- [25]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 最后亿次光临 Tick -104 (Nature)", -- [26]
				"哎哟喂 爪击 最后亿次光临 Miss (Physical)", -- [27]
				"哎哟喂-火妖鲁西弗隆 自动射击 最后亿次光临 Hit -44 (Physical)", -- [28]
				"哎哟喂-火妖鲁西弗隆 多重射击 最后亿次光临 Hit -134 (Physical)", -- [29]
				"最后亿次光临 断筋 盗克盗-逐风者 Hit -37 (Physical)", -- [30]
				"最后亿次光临 肉搏 盗克盗-逐风者 Hit -183 (Physical)", -- [31]
				"最后亿次光临 肉搏 盗克盗-逐风者 Hit -192 (Physical)", -- [32]
				"我想问题不大-黑龙费尔默 闪电之盾 最后亿次光临 Hit -316 (Nature)", -- [33]
				"最后亿次光临 肉搏 我想问题不大-黑龙费尔默 Crit -250 (Physical)", -- [34]
				"要水吗兄弟-逐风者 冰锥术 最后亿次光临 Crit -1176 (Frost)", -- [35]
				"最后亿次光临 断筋 我想问题不大-黑龙费尔默 Hit -23 (Physical)", -- [36]
				"我想问题不大-黑龙费尔默 肉搏 最后亿次光临 Hit -57 (Physical)", -- [37]
				"我想问题不大-黑龙费尔默 火舌攻击 最后亿次光临 Hit -48 (44 被抵抗) (Fire)", -- [38]
				"最后亿次光临 肉搏 我想问题不大-黑龙费尔默 Hit -116 (Physical)", -- [39]
				"最后亿次光临 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Tick -36 (Physical)", -- [40]
				"我想问题不大-黑龙费尔默 铁皮手雷 最后亿次光临 Hit -191 (Fire)", -- [41]
				"最后亿次光临 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Immune (Physical)", -- [42]
				"我想问题不大-黑龙费尔默 地震术 最后亿次光临 Resist (Nature)", -- [43]
				"我想问题不大-黑龙费尔默 闪电链 最后亿次光临 Crit -2244 (Nature)", -- [44]
				"最后亿次光临 肉搏 我想问题不大-黑龙费尔默 Immune (1)", -- [45]
				"最后亿次光临 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Immune (Physical)", -- [46]
				"最后亿次光临 肉搏 我想问题不大-黑龙费尔默 Immune (1)", -- [47]
				"最后亿次光临 拦截昏迷 我想问题不大-黑龙费尔默 Resist (Physical)", -- [48]
				"最后亿次光临 神圣力量 最后亿次光临 Hit +100", -- [49]
				"最后亿次光临 肉搏 我想问题不大-黑龙费尔默 Hit -146 (Physical)", -- [50]
			},
			["Name"] = "最后亿次光临",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				7813.637, -- [1]
				7813.871, -- [2]
				7814.687, -- [3]
				7814.821, -- [4]
				7815.171, -- [5]
				7815.637, -- [6]
				7817.621, -- [7]
				7819.021, -- [8]
				7819.554, -- [9]
				7820.588, -- [10]
				7821.288000000001, -- [11]
				7821.621, -- [12]
				7821.688, -- [13]
				7822.205, -- [14]
				7822.221000000001, -- [15]
				7822.555, -- [16]
				7822.855000000001, -- [17]
				7822.871, -- [18]
				7823.121, -- [19]
				7823.621, -- [20]
				7825.555, -- [21]
				8055.971000000001, -- [22]
				8056.354, -- [23]
				7150.775000000001, -- [24]
				7151.359, -- [25]
				7151.709, -- [26]
				7152.025000000001, -- [27]
				7152.342000000001, -- [28]
				7153.059, -- [29]
				7644.959, -- [30]
				7645.009, -- [31]
				7647.026, -- [32]
				7668.094, -- [33]
				7668.577, -- [34]
				7668.694, -- [35]
				7668.811000000001, -- [36]
				7670.344, -- [37]
				7670.344, -- [38]
				7670.577, -- [39]
				7671.594, -- [40]
				7672.244000000001, -- [41]
				7674.611, -- [42]
				7674.711, -- [43]
				7674.711, -- [44]
				7676.095, -- [45]
				7677.611, -- [46]
				7678.111, -- [47]
				7685.065000000001, -- [48]
				7685.562, -- [49]
				7685.562, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["最后亿次光临"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["PartialBlock"] = {
						["爪击"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 31,
									["min"] = 29,
									["count"] = 2,
									["amount"] = 60,
								},
							},
							["count"] = 2,
							["amount"] = 60,
						},
						["自动射击"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 142,
									["min"] = 142,
									["count"] = 1,
									["amount"] = 142,
								},
							},
							["count"] = 1,
							["amount"] = 142,
						},
						["多重射击"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 142,
									["min"] = 142,
									["count"] = 1,
									["amount"] = 142,
								},
							},
							["count"] = 1,
							["amount"] = 142,
						},
						["肉搏"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 142,
									["min"] = 29,
									["count"] = 3,
									["amount"] = 279,
								},
							},
							["count"] = 3,
							["amount"] = 279,
						},
					},
					["HealingTaken"] = 100,
					["TimeSpent"] = {
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 5.7,
								},
							},
							["amount"] = 5.7,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.73,
								},
								["斩杀"] = {
									["count"] = 1.43,
								},
								["肉搏"] = {
									["count"] = 4.62,
								},
							},
							["amount"] = 9.280000000000001,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 2.8,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.54,
								},
								["撕裂"] = {
									["count"] = 2.05,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 6.36,
								},
							},
							["amount"] = 16.37,
						},
						["最后亿次光临"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.23,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.02,
								},
								["肉搏"] = {
									["count"] = 5.48,
								},
							},
							["amount"] = 11.23,
						},
					},
					["DamageTaken"] = 9793,
					["RageGainedFrom"] = {
						["最后亿次光临"] = {
							["Details"] = {
								["盾牌专精"] = {
									["count"] = 8,
								},
								["冲锋"] = {
									["count"] = 60,
								},
							},
							["amount"] = 68,
						},
					},
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火舌攻击"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 44,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 27,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 27,
						},
					},
					["WhoHealed"] = {
						["最后亿次光临"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 100,
								},
							},
							["amount"] = 100,
						},
					},
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火舌攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 27,
									["amount"] = 0,
								},
							},
							["count"] = 27,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 44.08,
					["HealedWho"] = {
						["最后亿次光临"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 100,
								},
							},
							["amount"] = 100,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 1845,
						["Melee"] = 1062,
						["Arcane"] = 985,
						["Fire"] = 321,
						["Frost"] = 2292,
						["Nature"] = 3288,
					},
					["RageGained"] = {
						["盾牌专精"] = {
							["Details"] = {
								["最后亿次光临"] = {
									["count"] = 8,
								},
							},
							["amount"] = 8,
						},
						["冲锋"] = {
							["Details"] = {
								["最后亿次光临"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
					},
					["Damage"] = 6019,
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 100,
									["min"] = 100,
									["count"] = 1,
									["amount"] = 100,
								},
							},
							["count"] = 1,
							["amount"] = 100,
						},
					},
					["TimeHeal"] = 1.5,
					["DOT_Time"] = 21,
					["ElementTakenResist"] = {
						["Fire"] = 44,
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["我想问题不大-黑龙费尔默"] = {
									["count"] = 9,
								},
								["黑椒牛柳灬-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 21,
						},
					},
					["Healing"] = 100,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 14,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 22,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 20,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 279,
						["Physical"] = 344,
					},
					["Attacks"] = {
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 215,
									["min"] = 215,
									["count"] = 1,
									["amount"] = 215,
								},
							},
							["count"] = 1,
							["amount"] = 215,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 37,
									["min"] = 23,
									["count"] = 3,
									["amount"] = 97,
								},
							},
							["count"] = 3,
							["amount"] = 97,
						},
						["压制"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 273,
									["min"] = 264,
									["count"] = 2,
									["amount"] = 537,
								},
							},
							["count"] = 2,
							["amount"] = 537,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Tick"] = {
									["max"] = 43,
									["min"] = 36,
									["count"] = 5,
									["amount"] = 205,
								},
							},
							["count"] = 7,
							["amount"] = 205,
						},
						["撕裂"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 49,
									["min"] = 49,
									["count"] = 1,
									["amount"] = 49,
								},
							},
							["count"] = 2,
							["amount"] = 49,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 520,
									["min"] = 520,
									["count"] = 1,
									["amount"] = 520,
								},
								["Crit"] = {
									["max"] = 1141,
									["min"] = 1141,
									["count"] = 1,
									["amount"] = 1141,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 1661,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 232,
									["min"] = 116,
									["count"] = 14,
									["amount"] = 2544,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 461,
									["min"] = 250,
									["count"] = 2,
									["amount"] = 711,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 3255,
						},
					},
					["RageGain"] = 68,
					["DamagedWho"] = {
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 23,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 512,
								},
							},
							["amount"] = 571,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 453,
								},
							},
							["amount"] = 453,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 537,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 169,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["斩杀"] = {
									["count"] = 1141,
								},
								["肉搏"] = {
									["count"] = 1314,
								},
							},
							["amount"] = 3210,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 215,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["斩杀"] = {
									["count"] = 520,
								},
								["肉搏"] = {
									["count"] = 976,
								},
							},
							["amount"] = 1785,
						},
					},
					["TimeDamage"] = 42.58,
					["WhoDamaged"] = {
						["猫头鹰"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 39,
								},
							},
							["amount"] = 39,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 105,
								},
								["邪恶攻击"] = {
									["count"] = 333,
								},
							},
							["amount"] = 438,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 393,
								},
								["灼热武器"] = {
									["count"] = 82,
								},
								["速效毒药 VI"] = {
									["count"] = 134,
								},
								["出血"] = {
									["count"] = 231,
								},
								["肉搏"] = {
									["count"] = 465,
								},
							},
							["amount"] = 1305,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 386,
								},
								["奥术射击"] = {
									["count"] = 314,
								},
								["自动射击"] = {
									["count"] = 334,
								},
								["多重射击"] = {
									["count"] = 193,
								},
								["冰霜箭"] = {
									["count"] = 154,
								},
							},
							["amount"] = 1381,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["闪电链"] = {
									["count"] = 2244,
								},
								["火舌攻击"] = {
									["count"] = 48,
								},
								["闪电之盾"] = {
									["count"] = 316,
								},
								["铁皮手雷"] = {
									["count"] = 191,
								},
								["肉搏"] = {
									["count"] = 57,
								},
							},
							["amount"] = 2856,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 250,
								},
							},
							["amount"] = 250,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 798,
								},
								["冰锥术"] = {
									["count"] = 1176,
								},
							},
							["amount"] = 1974,
						},
						["哎哟喂"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 70,
								},
							},
							["amount"] = 70,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 164,
								},
							},
							["amount"] = 164,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 25,
								},
								["肉搏"] = {
									["count"] = 326,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 158,
								},
							},
							["amount"] = 509,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 208,
								},
								["奥术射击"] = {
									["count"] = 421,
								},
								["多重射击"] = {
									["count"] = 134,
								},
								["自动射击"] = {
									["count"] = 44,
								},
							},
							["amount"] = 807,
						},
					},
					["ElementDone"] = {
						["Melee"] = 3255,
						["Physical"] = 2764,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 10,
								},
								["Hit"] = {
									["count"] = 11,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Block"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 35,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 11,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 4,
								},
							},
							["amount"] = 30,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeDamaging"] = {
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.23,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.02,
								},
								["肉搏"] = {
									["count"] = 5.48,
								},
							},
							["amount"] = 11.23,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 5.7,
								},
							},
							["amount"] = 5.7,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 2.8,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.54,
								},
								["撕裂"] = {
									["count"] = 2.05,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 6.36,
								},
							},
							["amount"] = 16.37,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.73,
								},
								["斩杀"] = {
									["count"] = 1.43,
								},
								["肉搏"] = {
									["count"] = 4.62,
								},
							},
							["amount"] = 9.280000000000001,
						},
					},
				},
			},
			["UnitLockout"] = 7029.267,
			["LastActive"] = 8056.271,
		},
		["筱雪人-老马布兰契"] = {
			["GUID"] = "Player-5447-039032B9",
			["LastEventHealth"] = {
				3130, -- [1]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					238, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "筱雪人-老马布兰契",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 6,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 238,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 7416.26,
				["OVERALL"] = 7416.26,
			},
			["NextEventNum"] = 2,
			["LastEventHealthMax"] = {
				3130, -- [1]
			},
			["LastEvents"] = {
				"Environment Falling 筱雪人-老马布兰契 Hit -238 (Physical)", -- [1]
			},
			["Name"] = "筱雪人-老马布兰契",
			["LastEventIncoming"] = {
				true, -- [1]
			},
			["LastEventTimes"] = {
				7417.177000000001, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 238,
								},
							},
							["amount"] = 238,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 238,
					},
					["DamageTaken"] = 238,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 7416.26,
			["LastActive"] = 7416.26,
		},
		["棉花糖 <平头哥丿-黑龙费尔默>"] = {
			["GUID"] = "Pet-0-5427-0-223-5828-0401749488",
			["LastEventHealth"] = {
				1923, -- [1]
				1923, -- [2]
				1923, -- [3]
				1632, -- [4]
				2763, -- [5]
				2763, -- [6]
				2672, -- [7]
				2743, -- [8]
				2743, -- [9]
				2743, -- [10]
				2743, -- [11]
				2743, -- [12]
				2743, -- [13]
				3589, -- [14]
				3496, -- [15]
				3496, -- [16]
				3496, -- [17]
				3496, -- [18]
				3140, -- [19]
				2782, -- [20]
				2782, -- [21]
				2782, -- [22]
				2355, -- [23]
				2355, -- [24]
				3589, -- [25]
				3589, -- [26]
				3589, -- [27]
				3589, -- [28]
				3589, -- [29]
				3589, -- [30]
				3589, -- [31]
				3589, -- [32]
				3589, -- [33]
				2254, -- [34]
				2254, -- [35]
				2254, -- [36]
				2254, -- [37]
				2254, -- [38]
				2254, -- [39]
				2254, -- [40]
				2254, -- [41]
				2254, -- [42]
				2254, -- [43]
				2254, -- [44]
				2254, -- [45]
				1923, -- [46]
				1923, -- [47]
				1923, -- [48]
				1923, -- [49]
				1923, -- [50]
			},
			["LastAttackedBy"] = "盗克盗-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["Damage"] = {
					2628, -- [1]
				},
				["TimeDamage"] = {
					51.10999999999999, -- [1]
				},
				["DamageTaken"] = {
					3112, -- [1]
				},
				["ActiveTime"] = {
					51.10999999999999, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "棉花糖",
			["level"] = 1,
			["LastDamageAbility"] = "剑刃乱舞",
			["LastFightIn"] = 9,
			["type"] = "Pet",
			["ownerName"] = "平头哥丿-黑龙费尔默",
			["LastEventHealthMax"] = {
				3589, -- [1]
				3589, -- [2]
				3589, -- [3]
				3589, -- [4]
				3589, -- [5]
				3589, -- [6]
				3589, -- [7]
				3589, -- [8]
				3589, -- [9]
				3589, -- [10]
				3589, -- [11]
				3589, -- [12]
				3589, -- [13]
				3589, -- [14]
				3589, -- [15]
				3589, -- [16]
				3589, -- [17]
				3589, -- [18]
				3589, -- [19]
				3589, -- [20]
				3589, -- [21]
				3589, -- [22]
				3589, -- [23]
				3589, -- [24]
				3589, -- [25]
				3589, -- [26]
				3589, -- [27]
				3589, -- [28]
				3589, -- [29]
				3589, -- [30]
				3589, -- [31]
				3589, -- [32]
				3589, -- [33]
				3589, -- [34]
				3589, -- [35]
				3589, -- [36]
				3589, -- [37]
				3589, -- [38]
				3589, -- [39]
				3589, -- [40]
				3589, -- [41]
				3589, -- [42]
				3589, -- [43]
				3589, -- [44]
				3589, -- [45]
				3589, -- [46]
				3589, -- [47]
				3589, -- [48]
				3589, -- [49]
				3589, -- [50]
			},
			["LastDamageTaken"] = 143,
			["TimeLast"] = {
				["ActiveTime"] = 7822.271,
				["TimeDamage"] = 7822.271,
				["OVERALL"] = 7822.271,
				["DamageTaken"] = 7822.271,
				["Damage"] = 7822.271,
			},
			["NextEventNum"] = 25,
			["LastDamageTime"] = 7822.888,
			["LastEvents"] = {
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -39 (Physical)", -- [1]
				"龙九爷-黑龙费尔默 多重射击 棉花糖 <平头哥丿-黑龙费尔默> Hit -291 (Physical)", -- [2]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -30 (Physical)", -- [3]
				"大懒猪 旋风斩 棉花糖 <平头哥丿-黑龙费尔默> Hit -329 (Physical)", -- [4]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 一曲悠扬 Hit -58 (Physical)", -- [5]
				"一曲悠扬 冰霜新星 棉花糖 <平头哥丿-黑龙费尔默> Hit -91 (Frost)", -- [6]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 一曲悠扬 Hit -68 (Physical)", -- [7]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 龙九爷-黑龙费尔默 Hit -57 (Physical)", -- [8]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 龙九爷-黑龙费尔默 Hit -55 (Physical)", -- [9]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 龙九爷-黑龙费尔默 Crit -119 (Physical)", -- [10]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 龙九爷-黑龙费尔默 Hit -58 (Physical)", -- [11]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 龙九爷-黑龙费尔默 Hit -59 (Physical)", -- [12]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 龙九爷-黑龙费尔默 Hit -45 (Physical)", -- [13]
				"要水吗兄弟-逐风者 冰霜新星 棉花糖 <平头哥丿-黑龙费尔默> Hit -93 (Frost)", -- [14]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 要水吗兄弟-逐风者 Absorb -71 (71 被吸收) (1)", -- [15]
				"要水吗兄弟-逐风者 冰冻 棉花糖 <平头哥丿-黑龙费尔默> Resist (Frost)", -- [16]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 要水吗兄弟-逐风者 Absorb -115 (115 被吸收) (Physical)", -- [17]
				"麦积烟雨 多重射击 棉花糖 <平头哥丿-黑龙费尔默> Hit -356 (Physical)", -- [18]
				"盗克盗-逐风者 剑刃乱舞 棉花糖 <平头哥丿-黑龙费尔默> Hit -358 (Physical)", -- [19]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 盗克盗-逐风者 Hit -70 (Physical)", -- [20]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 盗克盗-逐风者 Hit -55 (Physical)", -- [21]
				"盗克盗-逐风者 剑刃乱舞 棉花糖 <平头哥丿-黑龙费尔默> Hit -427 (Physical)", -- [22]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 盗克盗-逐风者 Hit -59 (Physical)", -- [23]
				"盗克盗-逐风者 剑刃乱舞 棉花糖 <平头哥丿-黑龙费尔默> Hit -143 (Physical)", -- [24]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 一曲悠扬 Hit -97 (Physical)", -- [25]
				"一曲悠扬 冰霜新星 棉花糖 <平头哥丿-黑龙费尔默> Hit -87 (Frost)", -- [26]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 混子战仕-黑龙费尔默 Hit -73 (Physical)", -- [27]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 麦积烟雨 Hit -83 (Physical)", -- [28]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 麦积烟雨 Hit -51 (Physical)", -- [29]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 黑椒牛柳灬-逐风者 Hit -94 (Physical)", -- [30]
				"猫头鹰 尖啸 棉花糖 <平头哥丿-黑龙费尔默> Miss (Physical)", -- [31]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 混子战仕-黑龙费尔默 Hit -55 (Physical)", -- [32]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 混子战仕-黑龙费尔默 Dodge (Physical)", -- [33]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -52 (Physical)", -- [34]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 大懒猪 Hit -51 (Physical)", -- [35]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -55 (Physical)", -- [36]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 大懒猪 Hit -40 (Physical)", -- [37]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -57 (Physical)", -- [38]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 大懒猪 Hit -50 (Physical)", -- [39]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -55 (Physical)", -- [40]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 大懒猪 Hit -43 (Physical)", -- [41]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -42 (Physical)", -- [42]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 大懒猪 Hit -46 (Physical)", -- [43]
				"大懒猪 肉搏 棉花糖 <平头哥丿-黑龙费尔默> Hit -331 (Physical)", -- [44]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -46 (Physical)", -- [45]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -39 (Physical)", -- [46]
				"大懒猪 断筋 棉花糖 <平头哥丿-黑龙费尔默> Block (Physical)", -- [47]
				"棉花糖 <平头哥丿-黑龙费尔默> 爪击 大懒猪 Hit -41 (Physical)", -- [48]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -31 (Physical)", -- [49]
				"棉花糖 <平头哥丿-黑龙费尔默> 肉搏 大懒猪 Hit -33 (Physical)", -- [50]
			},
			["Name"] = "棉花糖",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				7553.953, -- [1]
				7555.203, -- [2]
				7555.253000000001, -- [3]
				7555.603, -- [4]
				7605.357, -- [5]
				7606.14, -- [6]
				7606.357, -- [7]
				7749.966, -- [8]
				7750.266000000001, -- [9]
				7751.283, -- [10]
				7751.883, -- [11]
				7752.566, -- [12]
				7753.5, -- [13]
				7812.42, -- [14]
				7812.537, -- [15]
				7812.554, -- [16]
				7812.554, -- [17]
				7813.887, -- [18]
				7821.471000000001, -- [19]
				7821.588, -- [20]
				7821.588, -- [21]
				7822.521, -- [22]
				7822.888, -- [23]
				7823.071, -- [24]
				7013.533, -- [25]
				7013.683, -- [26]
				7038.368, -- [27]
				7072.687, -- [28]
				7072.687, -- [29]
				7077.237, -- [30]
				7081.187, -- [31]
				7259.699000000001, -- [32]
				7260.516000000001, -- [33]
				7542.185, -- [34]
				7542.185, -- [35]
				7543.502, -- [36]
				7543.819, -- [37]
				7544.802000000001, -- [38]
				7545.436000000001, -- [39]
				7546.102, -- [40]
				7547.052000000001, -- [41]
				7547.42, -- [42]
				7548.669, -- [43]
				7548.719, -- [44]
				7548.719, -- [45]
				7550.036, -- [46]
				7550.336, -- [47]
				7551.103, -- [48]
				7551.336, -- [49]
				7552.636, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialBlock"] = {
						["旋风斩"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 5,
									["min"] = 5,
									["count"] = 1,
									["amount"] = 5,
								},
							},
							["count"] = 1,
							["amount"] = 5,
						},
						["断筋"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Block"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 10,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 3112,
					["ElementTakenResist"] = {
						["Frost"] = 10,
						["Arcane"] = 157,
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 10,
									["min"] = 10,
									["count"] = 1,
									["amount"] = 10,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 4,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["50% 抵抗"] = {
									["max"] = 157,
									["min"] = 157,
									["count"] = 1,
									["amount"] = 157,
								},
							},
							["count"] = 157,
							["amount"] = 2,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 51.10999999999999,
					["ElementTaken"] = {
						["Physical"] = 1904,
						["Frost"] = 417,
						["Melee"] = 331,
						["Arcane"] = 460,
					},
					["Damage"] = 2628,
					["ElementTakenBlock"] = {
						["Physical"] = 5,
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 251,
						["Physical"] = 205,
					},
					["Attacks"] = {
						["爪击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 115,
									["min"] = 60,
									["count"] = 2,
									["amount"] = 175,
								},
								["Hit"] = {
									["max"] = 58,
									["min"] = 40,
									["count"] = 13,
									["amount"] = 644,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 89,
									["min"] = 89,
									["count"] = 1,
									["amount"] = 89,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 908,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 91,
									["min"] = 30,
									["count"] = 4,
									["amount"] = 281,
								},
								["Crit"] = {
									["max"] = 119,
									["min"] = 119,
									["count"] = 1,
									["amount"] = 119,
								},
								["Hit"] = {
									["max"] = 97,
									["min"] = 30,
									["count"] = 23,
									["amount"] = 1320,
								},
							},
							["count"] = 35,
							["amount"] = 1720,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 7,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 23,
								},
							},
							["amount"] = 35,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 13,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 18,
						},
					},
					["DamagedWho"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 258,
								},
								["肉搏"] = {
									["count"] = 449,
								},
							},
							["amount"] = 707,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 55,
								},
								["肉搏"] = {
									["count"] = 129,
								},
							},
							["amount"] = 184,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 52,
								},
							},
							["amount"] = 52,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 158,
								},
								["肉搏"] = {
									["count"] = 235,
								},
							},
							["amount"] = 393,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 128,
								},
							},
							["amount"] = 128,
						},
						["大懒猪"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 271,
								},
								["肉搏"] = {
									["count"] = 479,
								},
							},
							["amount"] = 750,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 51,
								},
								["肉搏"] = {
									["count"] = 83,
								},
							},
							["amount"] = 134,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 115,
								},
								["肉搏"] = {
									["count"] = 71,
								},
							},
							["amount"] = 186,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 94,
								},
							},
							["amount"] = 94,
						},
					},
					["TimeDamage"] = 51.10999999999999,
					["WhoDamaged"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 460,
								},
								["冰霜新星"] = {
									["count"] = 178,
								},
							},
							["amount"] = 638,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["剑刃乱舞"] = {
									["count"] = 928,
								},
							},
							["amount"] = 928,
						},
						["大懒猪"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 329,
								},
								["肉搏"] = {
									["count"] = 331,
								},
							},
							["amount"] = 660,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 356,
								},
							},
							["amount"] = 356,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 291,
								},
							},
							["amount"] = 291,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 146,
								},
								["冰霜新星"] = {
									["count"] = 93,
								},
							},
							["amount"] = 239,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1720,
						["Physical"] = 908,
					},
					["TimeSpent"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.57,
								},
								["肉搏"] = {
									["count"] = 16.29,
								},
							},
							["amount"] = 18.86,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.8,
								},
							},
							["amount"] = 2.8,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.83,
								},
								["肉搏"] = {
									["count"] = 3.2,
								},
							},
							["amount"] = 5.03,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.82,
						},
						["大懒猪"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.22,
								},
								["肉搏"] = {
									["count"] = 10.36,
								},
							},
							["amount"] = 14.58,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["TimeDamaging"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.57,
								},
								["肉搏"] = {
									["count"] = 16.29,
								},
							},
							["amount"] = 18.86,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.8,
								},
							},
							["amount"] = 2.8,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.83,
								},
								["肉搏"] = {
									["count"] = 3.2,
								},
							},
							["amount"] = 5.03,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.82,
						},
						["大懒猪"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.22,
								},
								["肉搏"] = {
									["count"] = 10.36,
								},
							},
							["amount"] = 14.58,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
				},
			},
			["UnitLockout"] = 6946.261,
			["LastActive"] = 7822.271,
		},
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["LastEventHealth"] = {
				1062, -- [1]
				1062, -- [2]
				1005, -- [3]
				953, -- [4]
				953, -- [5]
				953, -- [6]
				953, -- [7]
				953, -- [8]
				852, -- [9]
				852, -- [10]
				521, -- [11]
				405, -- [12]
				240, -- [13]
				70, -- [14]
				70, -- [15]
				27, -- [16]
				0, -- [17]
				6969, -- [18]
				6467, -- [19]
				6467, -- [20]
				6449, -- [21]
				6449, -- [22]
				6738, -- [23]
				6738, -- [24]
				5642, -- [25]
				5642, -- [26]
				5642, -- [27]
				4813, -- [28]
				4761, -- [29]
				4761, -- [30]
				4619, -- [31]
				2950, -- [32]
				1135, -- [33]
				0, -- [34]
				6969, -- [35]
				3568, -- [36]
				3419, -- [37]
				2944, -- [38]
				2905, -- [39]
				2871, -- [40]
				2819, -- [41]
				2473, -- [42]
				2417, -- [43]
				2417, -- [44]
				2373, -- [45]
				2373, -- [46]
				1278, -- [47]
				1242, -- [48]
				1189, -- [49]
				1189, -- [50]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"MISC", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"MISC", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					12.5, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["HOT_Time"] = {
					18, -- [1]
				},
				["Healing"] = {
					6199, -- [1]
				},
				["DamageTaken"] = {
					104105, -- [1]
				},
				["DeathCount"] = {
					11, -- [1]
				},
				["HealingTaken"] = {
					6199, -- [1]
				},
				["RageGain"] = {
					585, -- [1]
				},
				["GTFOEvents"] = {
					15, -- [1]
				},
				["ActiveTime"] = {
					295.9500000000001, -- [1]
				},
				["TimeDamage"] = {
					283.4499999999999, -- [1]
				},
				["GTFOEventDamage"] = {
					2039, -- [1]
				},
				["DOT_Time"] = {
					165, -- [1]
				},
				["Damage"] = {
					88957, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 15,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
					},
					["Messages"] = {
						"特变电工 肉搏 哎哟喂-火妖鲁西弗隆 Hit -375 (Physical)", -- [1]
						"我想问题不大-黑龙费尔默 冰霜震击 特变电工 Hit -1096 (Frost)", -- [2]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Crit -291 (Physical)", -- [3]
						"黑椒牛柳灬-逐风者 出血 特变电工 Crit -365 (Physical)", -- [4]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -173 (Nature)", -- [5]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -52 (Physical)", -- [6]
						"特变电工 致死打击 黑椒牛柳灬-逐风者 Crit -1682 (Physical)", -- [7]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -142 (Physical)", -- [8]
						"我想问题不大-黑龙费尔默 闪电箭 特变电工 Hit -1669 (Nature)", -- [9]
						"我想问题不大-黑龙费尔默 闪电链 特变电工 Hit -1815 (Nature)", -- [10]
						"我想问题不大-黑龙费尔默 地震术 特变电工 Crit -2722 (Nature)", -- [11]
						"特变电工死亡。", -- [12]
					},
					["DeathAt"] = 8236.266,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["MessageTimes"] = {
						-6.217000000000553, -- [1]
						-6.050000000001091, -- [2]
						-4.75, -- [3]
						-4.75, -- [4]
						-4.75, -- [5]
						-3.033000000001266, -- [6]
						-2.833000000000538, -- [7]
						-2.149999999999636, -- [8]
						-1.266999999999825, -- [9]
						-0.3330000000005384, -- [10]
						-0.05000000000109139, -- [11]
						0, -- [12]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
					},
					["Health"] = {
						6738, -- [1]
						6738, -- [2]
						5642, -- [3]
						5642, -- [4]
						5642, -- [5]
						4813, -- [6]
						4761, -- [7]
						4761, -- [8]
						4619, -- [9]
						2950, -- [10]
						1135, -- [11]
						0, -- [12]
					},
					["KilledBy"] = "我想问题不大-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						false, -- [36]
						true, -- [37]
						true, -- [38]
						false, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						true, -- [47]
					},
					["Messages"] = {
						"盗克盗-逐风者 肉搏 特变电工 Dodge (1)", -- [1]
						"特变电工 旋风斩 豹 Hit -424 (Physical)", -- [2]
						"特变电工 旋风斩 盗克盗-逐风者 Hit -510 (Physical)", -- [3]
						"特变电工 旋风斩 黑椒牛柳灬-逐风者 Hit -524 (Physical)", -- [4]
						"哎哟喂-火妖鲁西弗隆 多重射击 特变电工 Crit -1035 (Physical)", -- [5]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -285 (Physical)", -- [6]
						"哎哟喂 肉搏 特变电工 Dodge (1)", -- [7]
						"哎哟喂-火妖鲁西弗隆 奥术射击 特变电工 Hit -216 (Arcane)", -- [8]
						"特变电工 肉搏 盗克盗-逐风者 Crit -1200 (Physical)", -- [9]
						"特变电工 断筋 盗克盗-逐风者 Hit -44 (Physical)", -- [10]
						"哎哟喂 爪击 特变电工 Hit -40 (Physical)", -- [11]
						"盗克盗-逐风者 剑刃乱舞 特变电工 Hit -502 (Physical)", -- [12]
						"哎哟喂 肉搏 特变电工 Hit -61 (Physical)", -- [13]
						"豹 肉搏 特变电工 Hit -55 (Physical)", -- [14]
						"特变电工 致死打击 盗克盗-逐风者 Crit -1529 (Physical)", -- [15]
						"盗克盗-逐风者 剑刃乱舞 特变电工 Hit -149 (Physical)", -- [16]
						"盗克盗-逐风者 剑刃乱舞 特变电工 Hit -475 (Physical)", -- [17]
						"哎哟喂 爪击 特变电工 Hit -39 (Physical)", -- [18]
						"豹 爪击 特变电工 Hit -34 (Physical)", -- [19]
						"哎哟喂 肉搏 特变电工 Hit -52 (Physical)", -- [20]
						"盗克盗-逐风者 剑刃乱舞 特变电工 Hit -346 (Physical)", -- [21]
						"豹 肉搏 特变电工 Hit -56 (Physical)", -- [22]
						"特变电工 斩杀 盗克盗-逐风者 Hit -899 (Physical)", -- [23]
						"哎哟喂 爪击 特变电工 Hit -44 (Physical)", -- [24]
						"哎哟喂 肉搏 特变电工 Dodge (1)", -- [25]
						"豹 肉搏 特变电工 Hit -50 (Physical)", -- [26]
						"哎哟喂 爪击 特变电工 Hit -36 (Physical)", -- [27]
						"哎哟喂 肉搏 特变电工 Hit -53 (Physical)", -- [28]
						"豹 肉搏 特变电工 Miss (1)", -- [29]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [30]
						"特变电工 肉搏 麦积烟雨 Dodge (1)", -- [31]
						"哎哟喂 肉搏 特变电工 Hit -57 (Physical)", -- [32]
						"豹 肉搏 特变电工 Hit -52 (Physical)", -- [33]
						"豹 爪击 特变电工 Dodge (Physical)", -- [34]
						"哎哟喂 爪击 特变电工 Parry (Physical)", -- [35]
						"特变电工 压制 麦积烟雨 Crit -1165 (Physical)", -- [36]
						"哎哟喂 肉搏 特变电工 Hit -52 (Physical)", -- [37]
						"豹 肉搏 特变电工 Hit -49 (Physical)", -- [38]
						"特变电工 英勇打击 麦积烟雨 Dodge (Physical)", -- [39]
						"干锅肥肠 多重射击 特变电工 Hit -331 (Physical)", -- [40]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -116 (Nature)", -- [41]
						"干锅肥肠 自动射击 特变电工 Hit -165 (Physical)", -- [42]
						"要水吗兄弟-逐风者 暴风雪 (伤害/跳) 特变电工 Tick -170 (Frost)", -- [43]
						"哎哟喂 肉搏 特变电工 Miss (1)", -- [44]
						"哎哟喂 肉搏 特变电工 Hit -43 (Physical)", -- [45]
						"我想问题不大-黑龙费尔默 闪电箭 特变电工 Hit -972 (Nature)", -- [46]
						"特变电工死亡。", -- [47]
					},
					["DeathAt"] = 8193.264000000001,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
					},
					["MessageTimes"] = {
						-14.43399999999929, -- [1]
						-14.30099999999948, -- [2]
						-14.30099999999948, -- [3]
						-14.30099999999948, -- [4]
						-12.61699999999928, -- [5]
						-12.38399999999911, -- [6]
						-12.08399999999983, -- [7]
						-11.78399999999965, -- [8]
						-11.63299999999981, -- [9]
						-11.5669999999991, -- [10]
						-11.28399999999965, -- [11]
						-10.99999999999909, -- [12]
						-10.59999999999945, -- [13]
						-10.0669999999991, -- [14]
						-10.04999999999927, -- [15]
						-9.899999999999636, -- [16]
						-9.799999999999272, -- [17]
						-9.666999999999462, -- [18]
						-9.266999999999825, -- [19]
						-9.083999999999833, -- [20]
						-8.799999999999272, -- [21]
						-8.666999999999462, -- [22]
						-8.566999999999098, -- [23]
						-8.049999999999272, -- [24]
						-7.582999999999629, -- [25]
						-7.249999999999091, -- [26]
						-6.432999999999083, -- [27]
						-6.082999999999629, -- [28]
						-5.849999999999454, -- [29]
						-5.816999999999098, -- [30]
						-5.065999999999804, -- [31]
						-4.565999999999804, -- [32]
						-4.432999999999083, -- [33]
						-4.382999999999811, -- [34]
						-3.982999999999265, -- [35]
						-3.949999999999818, -- [36]
						-3.065999999999804, -- [37]
						-3.032999999999447, -- [38]
						-2.96599999999944, -- [39]
						-2.948999999999614, -- [40]
						-2.815999999999804, -- [41]
						-2.782999999999447, -- [42]
						-2.199999999999818, -- [43]
						-1.565999999999804, -- [44]
						-0.0499999999992724, -- [45]
						-0.01599999999962165, -- [46]
						0, -- [47]
					},
					["HealthMax"] = {
						8014, -- [1]
						8014, -- [2]
						8014, -- [3]
						8014, -- [4]
						8014, -- [5]
						8014, -- [6]
						8014, -- [7]
						8014, -- [8]
						8014, -- [9]
						8014, -- [10]
						8014, -- [11]
						8014, -- [12]
						8014, -- [13]
						8014, -- [14]
						8014, -- [15]
						8014, -- [16]
						8014, -- [17]
						8014, -- [18]
						8014, -- [19]
						8014, -- [20]
						8014, -- [21]
						8014, -- [22]
						8014, -- [23]
						8014, -- [24]
						8014, -- [25]
						8014, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
						6969, -- [30]
						6969, -- [31]
						6969, -- [32]
						6969, -- [33]
						6969, -- [34]
						6969, -- [35]
						6969, -- [36]
						6969, -- [37]
						6969, -- [38]
						6969, -- [39]
						6969, -- [40]
						6969, -- [41]
						6969, -- [42]
						6969, -- [43]
						6969, -- [44]
						6969, -- [45]
						6969, -- [46]
						6969, -- [47]
					},
					["Health"] = {
						5762, -- [1]
						5762, -- [2]
						5762, -- [3]
						5762, -- [4]
						5762, -- [5]
						4727, -- [6]
						4442, -- [7]
						4442, -- [8]
						4226, -- [9]
						4226, -- [10]
						4226, -- [11]
						4186, -- [12]
						3684, -- [13]
						3623, -- [14]
						3623, -- [15]
						3568, -- [16]
						3419, -- [17]
						2944, -- [18]
						2905, -- [19]
						2871, -- [20]
						2819, -- [21]
						2473, -- [22]
						2417, -- [23]
						2417, -- [24]
						2373, -- [25]
						2373, -- [26]
						1278, -- [27]
						1242, -- [28]
						1189, -- [29]
						1189, -- [30]
						1062, -- [31]
						1062, -- [32]
						1005, -- [33]
						953, -- [34]
						953, -- [35]
						953, -- [36]
						953, -- [37]
						953, -- [38]
						852, -- [39]
						852, -- [40]
						521, -- [41]
						405, -- [42]
						240, -- [43]
						70, -- [44]
						70, -- [45]
						27, -- [46]
						0, -- [47]
					},
					["KilledBy"] = "我想问题不大-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"MISC", -- [47]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
					},
					["Messages"] = {
						"特变电工 冲锋击昏 我想问题不大-黑龙费尔默 Resist (Physical)", -- [1]
						"我想问题不大-黑龙费尔默 闪电之盾 特变电工 Hit -343 (Nature)", -- [2]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -61 (Physical)", -- [3]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Hit -102 (Fire)", -- [4]
						"我想问题不大-黑龙费尔默 冰霜震击 特变电工 Hit -763 (Frost)", -- [5]
						"特变电工 断筋 我想问题不大-黑龙费尔默 Hit -23 (Physical)", -- [6]
						"盗克盗-逐风者 肉搏 特变电工 Hit -172 (Physical)", -- [7]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -311 (Physical)", -- [8]
						"盗克盗-逐风者 肉搏 特变电工 Miss (1)", -- [9]
						"盗克盗-逐风者 邪恶攻击 特变电工 Hit -194 (Physical)", -- [10]
						"哎哟喂-火妖鲁西弗隆 多重射击 特变电工 Hit -416 (Physical)", -- [11]
						"豹 肉搏 特变电工 Hit -52 (Physical)", -- [12]
						"豹 爪击 特变电工 Hit -42 (Physical)", -- [13]
						"龙九爷-黑龙费尔默 奥术射击 特变电工 Hit -173 (Arcane)", -- [14]
						"盗克盗-逐风者 肉搏 特变电工 Hit -157 (Physical)", -- [15]
						"盗克盗-逐风者 肉搏 特变电工 Hit -70 (Physical)", -- [16]
						"麦积烟雨 自动射击 特变电工 Hit -227 (Physical)", -- [17]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [18]
						"盗克盗-逐风者 肉搏 特变电工 Crit -290 (Physical)", -- [19]
						"麦积烟雨 奥术射击 特变电工 Hit -218 (Arcane)", -- [20]
						"哎哟喂 肉搏 特变电工 Hit -59 (Physical)", -- [21]
						"哎哟喂 爪击 特变电工 Hit -45 (Physical)", -- [22]
						"豹 肉搏 特变电工 Hit -51 (Physical)", -- [23]
						"豹 爪击 特变电工 Hit -44 (Physical)", -- [24]
						"我想问题不大-黑龙费尔默 冰霜震击 特变电工 Crit -1640 (Frost)", -- [25]
						"盗克盗-逐风者 肉搏 特变电工 Hit -73 (Physical)", -- [26]
						"盗克盗-逐风者 邪恶攻击 特变电工 Hit -217 (Physical)", -- [27]
						"龙九爷-黑龙费尔默 自动射击 特变电工 Hit -107 (Physical)", -- [28]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 特变电工 Tick -126 (Nature)", -- [29]
						"哎哟喂 肉搏 特变电工 Hit -55 (Physical)", -- [30]
						"麦积烟雨 自动射击 特变电工 Hit -222 (Physical)", -- [31]
						"豹 肉搏 特变电工 Hit -55 (Physical)", -- [32]
						"哎哟喂 爪击 特变电工 Miss (Physical)", -- [33]
						"豹 爪击 特变电工 Hit -37 (Physical)", -- [34]
						"麦积烟雨 多重射击 特变电工 Crit -809 (Physical)", -- [35]
						"特变电工死亡。", -- [36]
					},
					["DeathAt"] = 8128.259,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
					},
					["MessageTimes"] = {
						-8.006000000000313, -- [1]
						-7.972999999999956, -- [2]
						-7.773000000000138, -- [3]
						-7.773000000000138, -- [4]
						-7.773000000000138, -- [5]
						-7.539999999999964, -- [6]
						-5.805999999999585, -- [7]
						-5.139000000000124, -- [8]
						-4.956000000000131, -- [9]
						-4.78899999999976, -- [10]
						-3.456000000000131, -- [11]
						-3.405999999999949, -- [12]
						-3.405999999999949, -- [13]
						-3.338999999999942, -- [14]
						-3.322000000000116, -- [15]
						-3.256000000000313, -- [16]
						-3.122000000000298, -- [17]
						-2.639000000000124, -- [18]
						-2.454999999999927, -- [19]
						-2.389000000000124, -- [20]
						-2.189000000000306, -- [21]
						-2.189000000000306, -- [22]
						-2.006000000000313, -- [23]
						-1.771999999999935, -- [24]
						-1.771999999999935, -- [25]
						-1.53899999999976, -- [26]
						-1.338999999999942, -- [27]
						-1.189000000000306, -- [28]
						-0.9390000000003056, -- [29]
						-0.6719999999995707, -- [30]
						-0.6220000000002983, -- [31]
						-0.5889999999999418, -- [32]
						-0.5559999999995853, -- [33]
						-0.1559999999999491, -- [34]
						-0.02199999999993452, -- [35]
						0, -- [36]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						6969, -- [21]
						6969, -- [22]
						6969, -- [23]
						6969, -- [24]
						6969, -- [25]
						6969, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
						6969, -- [30]
						6969, -- [31]
						6969, -- [32]
						6969, -- [33]
						6969, -- [34]
						6969, -- [35]
						6969, -- [36]
					},
					["Health"] = {
						6969, -- [1]
						6969, -- [2]
						6626, -- [3]
						6626, -- [4]
						6626, -- [5]
						5700, -- [6]
						5700, -- [7]
						5528, -- [8]
						5217, -- [9]
						5217, -- [10]
						5023, -- [11]
						4607, -- [12]
						4607, -- [13]
						4513, -- [14]
						4340, -- [15]
						4183, -- [16]
						4113, -- [17]
						3886, -- [18]
						3759, -- [19]
						3469, -- [20]
						3251, -- [21]
						3251, -- [22]
						3147, -- [23]
						3096, -- [24]
						3096, -- [25]
						1412, -- [26]
						1339, -- [27]
						1122, -- [28]
						1015, -- [29]
						889, -- [30]
						834, -- [31]
						612, -- [32]
						612, -- [33]
						557, -- [34]
						520, -- [35]
						0, -- [36]
					},
					["KilledBy"] = "麦积烟雨",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"MISC", -- [36]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
					},
					["Messages"] = {
						"我想问题不大-黑龙费尔默 闪电之盾 特变电工 Hit -344 (Nature)", -- [1]
						"特变电工 断筋 我想问题不大-黑龙费尔默 Hit -23 (Physical)", -- [2]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Hit -335 (Physical)", -- [3]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -76 (Physical)", -- [4]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Hit -112 (Fire)", -- [5]
						"我想问题不大-黑龙费尔默 冰霜震击 特变电工 Hit -823 (Frost)", -- [6]
						"特变电工 致死打击 我想问题不大-黑龙费尔默 Crit -849 (Physical)", -- [7]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -59 (Physical)", -- [8]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Hit -92 (Fire)", -- [9]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Hit -301 (Physical)", -- [10]
						"我想问题不大-黑龙费尔默 闪电之盾 特变电工 Hit -309 (Nature)", -- [11]
						"特变电工 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Tick -100 (Physical)", -- [12]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Dodge (1)", -- [13]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -49 (Physical)", -- [14]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Hit -91 (Fire)", -- [15]
						"火焰新星图腾 V 火焰新星 特变电工 Hit -459 (Fire)", -- [16]
						"我想问题不大-黑龙费尔默 冰霜震击 特变电工 Hit -690 (Frost)", -- [17]
						"特变电工 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Tick -101 (Physical)", -- [18]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Hit -280 (Physical)", -- [19]
						"我想问题不大-黑龙费尔默 闪电之盾 特变电工 Hit -378 (Nature)", -- [20]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -34 (Physical)", -- [21]
						"特变电工 拳击 我想问题不大-黑龙费尔默 Hit -11 (Physical)", -- [22]
						"我想问题不大-黑龙费尔默 铁皮手雷 特变电工 Crit -330 (Fire)", -- [23]
						"特变电工 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Tick -100 (Physical)", -- [24]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Crit -824 (Physical)", -- [25]
						"特变电工 旋风斩 我想问题不大-黑龙费尔默 Hit -339 (Physical)", -- [26]
						"我想问题不大-黑龙费尔默 闪电链 特变电工 Crit -2429 (Nature)", -- [27]
						"我想问题不大-黑龙费尔默 地震术 特变电工 Hit -945 (Nature)", -- [28]
						"特变电工死亡。", -- [29]
					},
					["DeathAt"] = 8027.269,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
					},
					["MessageTimes"] = {
						-13.86499999999978, -- [1]
						-13.1210000000001, -- [2]
						-12.90399999999954, -- [3]
						-12.80400000000009, -- [4]
						-12.80400000000009, -- [5]
						-12.17099999999937, -- [6]
						-11.6210000000001, -- [7]
						-10.10399999999936, -- [8]
						-10.08699999999953, -- [9]
						-9.386999999999716, -- [10]
						-9.371000000000095, -- [11]
						-8.586999999999534, -- [12]
						-8.403999999999542, -- [13]
						-6.686999999999898, -- [14]
						-6.686999999999898, -- [15]
						-6.670000000000073, -- [16]
						-6.054000000000087, -- [17]
						-5.586999999999534, -- [18]
						-5.369999999999891, -- [19]
						-5.35399999999936, -- [20]
						-4.969999999999345, -- [21]
						-3.186999999999898, -- [22]
						-2.802999999999884, -- [23]
						-2.586999999999534, -- [24]
						-1.869999999999891, -- [25]
						-1.686999999999898, -- [26]
						-0.05299999999988359, -- [27]
						-0.009999999999308784, -- [28]
						0, -- [29]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						6969, -- [21]
						6969, -- [22]
						6969, -- [23]
						6969, -- [24]
						6969, -- [25]
						6969, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
					},
					["Health"] = {
						6969, -- [1]
						6625, -- [2]
						6625, -- [3]
						6625, -- [4]
						6625, -- [5]
						6437, -- [6]
						5614, -- [7]
						5614, -- [8]
						5614, -- [9]
						5463, -- [10]
						5463, -- [11]
						5154, -- [12]
						5154, -- [13]
						5154, -- [14]
						5154, -- [15]
						5154, -- [16]
						4555, -- [17]
						3865, -- [18]
						3865, -- [19]
						3865, -- [20]
						3487, -- [21]
						3453, -- [22]
						3453, -- [23]
						3123, -- [24]
						3123, -- [25]
						3123, -- [26]
						3123, -- [27]
						694, -- [28]
						0, -- [29]
					},
					["KilledBy"] = "我想问题不大-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"MISC", -- [29]
					},
				}, -- [4]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						false, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
					},
					["Messages"] = {
						"特变电工 拦截昏迷 要水吗兄弟-逐风者 Immune (Physical)", -- [1]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -276 (Physical)", -- [2]
						"要水吗兄弟-逐风者 肉搏 特变电工 Parry (1)", -- [3]
						"特变电工 肉搏 要水吗兄弟-逐风者 Dodge (1)", -- [4]
						"特变电工 致死打击 要水吗兄弟-逐风者 Dodge (Physical)", -- [5]
						"哎哟喂-火妖鲁西弗隆 多重射击 特变电工 Hit -410 (Physical)", -- [6]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -276 (Physical)", -- [7]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [8]
						"要水吗兄弟-逐风者 冰锥术 特变电工 Hit -619 (Frost)", -- [9]
						"特变电工 旋风斩 哎哟喂 Dodge (Physical)", -- [10]
						"要水吗兄弟-逐风者 冰冻 特变电工 Immune (Frost)", -- [11]
						"特变电工 旋风斩 要水吗兄弟-逐风者 Hit -443 (Physical)", -- [12]
						"哎哟喂 肉搏 特变电工 Hit -57 (Physical)", -- [13]
						"哎哟喂-火妖鲁西弗隆 瞄准射击 特变电工 Crit -1433 (Physical)", -- [14]
						"特变电工 肉搏 要水吗兄弟-逐风者 Immune (1)", -- [15]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [16]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -271 (Physical)", -- [17]
						"哎哟喂 肉搏 特变电工 Miss (1)", -- [18]
						"哎哟喂 爪击 特变电工 Dodge (Physical)", -- [19]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -282 (Physical)", -- [20]
						"特变电工 斩杀 龙九爷-黑龙费尔默 Hit -1023 (Physical)", -- [21]
						"哎哟喂 肉搏 特变电工 Hit -54 (Physical)", -- [22]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [23]
						"哎哟喂 爪击 特变电工 Hit -38 (Physical)", -- [24]
						"麦积烟雨 多重射击 特变电工 Crit -800 (Physical)", -- [25]
						"哎哟喂 肉搏 特变电工 Hit -57 (Physical)", -- [26]
						"特变电工 肉搏 哎哟喂 Parry (1)", -- [27]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -294 (Physical)", -- [28]
						"哎哟喂 肉搏 特变电工 Hit -52 (Physical)", -- [29]
						"要水吗兄弟-逐风者 冰冻 特变电工 Immune (Frost)", -- [30]
						"特变电工 断筋 要水吗兄弟-逐风者 Absorb -48 (48 被吸收) (Physical)", -- [31]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [32]
						"哎哟喂 肉搏 特变电工 Hit -58 (Physical)", -- [33]
						"哎哟喂-火妖鲁西弗隆 多重射击 特变电工 Hit -397 (Physical)", -- [34]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -278 (Physical)", -- [35]
						"特变电工 肉搏 要水吗兄弟-逐风者 Absorb -580 (580 被吸收) (1)", -- [36]
						"要水吗兄弟-逐风者 冰冻 特变电工 Immune (Frost)", -- [37]
						"哎哟喂 肉搏 特变电工 Hit -55 (Physical)", -- [38]
						"哎哟喂-火妖鲁西弗隆 奥术射击 特变电工 Hit -216 (Arcane)", -- [39]
						"特变电工死亡。", -- [40]
					},
					["DeathAt"] = 7831.272,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
					},
					["MessageTimes"] = {
						-14.45100000000002, -- [1]
						-13.68499999999949, -- [2]
						-12.23399999999947, -- [3]
						-12.20100000000002, -- [4]
						-12.0010000000002, -- [5]
						-11.51800000000003, -- [6]
						-11.35099999999966, -- [7]
						-11.0010000000002, -- [8]
						-9.800999999999476, -- [9]
						-9.068000000000211, -- [10]
						-9.068000000000211, -- [11]
						-9.068000000000211, -- [12]
						-8.634000000000015, -- [13]
						-8.233999999999469, -- [14]
						-8.184000000000196, -- [15]
						-8.001000000000204, -- [16]
						-7.951000000000022, -- [17]
						-7.134000000000015, -- [18]
						-7.016999999999825, -- [19]
						-5.867000000000189, -- [20]
						-5.800999999999476, -- [21]
						-5.634000000000015, -- [22]
						-5.001000000000204, -- [23]
						-4.599999999999454, -- [24]
						-4.384000000000015, -- [25]
						-4.117000000000189, -- [26]
						-3.934000000000197, -- [27]
						-3.65099999999984, -- [28]
						-3.216999999999644, -- [29]
						-3.184000000000197, -- [30]
						-3.184000000000197, -- [31]
						-2, -- [32]
						-1.716999999999644, -- [33]
						-1.216999999999644, -- [34]
						-0.8170000000000073, -- [35]
						-0.4340000000001965, -- [36]
						-0.4340000000001965, -- [37]
						-0.1999999999998181, -- [38]
						-0.01699999999982538, -- [39]
						0, -- [40]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						6969, -- [21]
						6969, -- [22]
						6969, -- [23]
						6969, -- [24]
						6969, -- [25]
						6969, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
						6969, -- [30]
						6969, -- [31]
						6969, -- [32]
						6969, -- [33]
						6969, -- [34]
						6969, -- [35]
						6969, -- [36]
						6969, -- [37]
						6969, -- [38]
						6969, -- [39]
						6969, -- [40]
					},
					["Health"] = {
						6265, -- [1]
						6265, -- [2]
						5989, -- [3]
						5989, -- [4]
						5989, -- [5]
						5989, -- [6]
						5579, -- [7]
						5303, -- [8]
						5176, -- [9]
						4557, -- [10]
						4557, -- [11]
						4557, -- [12]
						4557, -- [13]
						4500, -- [14]
						3067, -- [15]
						3067, -- [16]
						2940, -- [17]
						2669, -- [18]
						2669, -- [19]
						2669, -- [20]
						2387, -- [21]
						2387, -- [22]
						2333, -- [23]
						2206, -- [24]
						2168, -- [25]
						1368, -- [26]
						1311, -- [27]
						1311, -- [28]
						1017, -- [29]
						1017, -- [30]
						1017, -- [31]
						965, -- [32]
						838, -- [33]
						780, -- [34]
						383, -- [35]
						105, -- [36]
						105, -- [37]
						105, -- [38]
						50, -- [39]
						0, -- [40]
					},
					["KilledBy"] = "哎哟喂-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"MISC", -- [40]
					},
				}, -- [5]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						false, -- [28]
						true, -- [29]
						false, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
					},
					["Messages"] = {
						"我想问题不大-黑龙费尔默 冰霜震击 特变电工 Hit -757 (Frost)", -- [1]
						"特变电工 断筋 我想问题不大-黑龙费尔默 Crit -50 (Physical)", -- [2]
						"我想问题不大-黑龙费尔默 闪电之盾 特变电工 Hit -333 (Nature)", -- [3]
						"我想问题不大-黑龙费尔默 闪电箭 特变电工 Hit -947 (Nature)", -- [4]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Hit -319 (Physical)", -- [5]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -53 (Physical)", -- [6]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Hit -96 (Fire)", -- [7]
						"特变电工 致死打击 我想问题不大-黑龙费尔默 Miss (Physical)", -- [8]
						"特变电工 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Tick -104 (Physical)", -- [9]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -72 (Physical)", -- [10]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Hit -96 (Fire)", -- [11]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Hit -315 (Physical)", -- [12]
						"我想问题不大-黑龙费尔默 闪电之盾 特变电工 Hit -334 (Nature)", -- [13]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -70 (Physical)", -- [14]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Hit -96 (Fire)", -- [15]
						"特变电工 旋风斩 我想问题不大-黑龙费尔默 Hit -282 (Physical)", -- [16]
						"火焰新星图腾 V 火焰新星 特变电工 Hit -545 (Fire)", -- [17]
						"我想问题不大-黑龙费尔默 地震术 特变电工 Hit -783 (Nature)", -- [18]
						"特变电工 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Tick -105 (Physical)", -- [19]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -63 (Physical)", -- [20]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Crit -192 (Fire)", -- [21]
						"特变电工 致死打击 我想问题不大-黑龙费尔默 Hit -363 (Physical)", -- [22]
						"我想问题不大-黑龙费尔默 闪电之盾 特变电工 Hit -334 (Nature)", -- [23]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Hit -290 (Physical)", -- [24]
						"我想问题不大-黑龙费尔默 火舌攻击 特变电工 Resist (Fire)", -- [25]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Hit -54 (Physical)", -- [26]
						"特变电工 缴械 我想问题不大-黑龙费尔默 Dodge (Physical)", -- [27]
						"特变电工 重伤 (伤害/跳) 我想问题不大-黑龙费尔默 Tick -104 (Physical)", -- [28]
						"我想问题不大-黑龙费尔默 肉搏 特变电工 Miss (1)", -- [29]
						"特变电工 压制 我想问题不大-黑龙费尔默 Crit -652 (Physical)", -- [30]
						"特变电工 肉搏 我想问题不大-黑龙费尔默 Miss (1)", -- [31]
						"一曲悠扬 寒冰箭 特变电工 Crit -1613 (Frost)", -- [32]
						"灼热图腾 VI 攻击 特变电工 Hit -76 (Fire)", -- [33]
						"特变电工死亡。", -- [34]
					},
					["DeathAt"] = 7760.267,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["MessageTimes"] = {
						-13.06899999999951, -- [1]
						-12.80199999999968, -- [2]
						-12.78399999999965, -- [3]
						-12.76899999999932, -- [4]
						-12.41899999999987, -- [5]
						-11.36899999999969, -- [6]
						-11.35199999999986, -- [7]
						-11.30199999999968, -- [8]
						-9.784999999999854, -- [9]
						-9.668999999999869, -- [10]
						-9.668999999999869, -- [11]
						-8.918999999999869, -- [12]
						-8.884999999999309, -- [13]
						-7.969000000000051, -- [14]
						-7.969000000000051, -- [15]
						-7.951999999999316, -- [16]
						-7.55199999999968, -- [17]
						-7.05199999999968, -- [18]
						-6.784999999999855, -- [19]
						-6.251999999999498, -- [20]
						-6.251999999999498, -- [21]
						-5.284999999999855, -- [22]
						-5.268999999999323, -- [23]
						-4.917999999999665, -- [24]
						-4.55199999999968, -- [25]
						-4.55199999999968, -- [26]
						-3.784999999999855, -- [27]
						-3.784999999999855, -- [28]
						-2.351999999999862, -- [29]
						-1.601999999999862, -- [30]
						-0.9020000000000437, -- [31]
						-0.7349999999996726, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						6969, -- [21]
						6969, -- [22]
						6969, -- [23]
						6969, -- [24]
						6969, -- [25]
						6969, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
						6969, -- [30]
						6969, -- [31]
						6969, -- [32]
						6969, -- [33]
						6969, -- [34]
					},
					["Health"] = {
						6458, -- [1]
						5701, -- [2]
						5701, -- [3]
						5701, -- [4]
						4421, -- [5]
						4421, -- [6]
						4421, -- [7]
						4272, -- [8]
						4272, -- [9]
						4272, -- [10]
						4272, -- [11]
						4104, -- [12]
						4104, -- [13]
						3770, -- [14]
						3770, -- [15]
						3770, -- [16]
						3604, -- [17]
						3059, -- [18]
						2276, -- [19]
						2276, -- [20]
						2276, -- [21]
						2021, -- [22]
						2021, -- [23]
						1687, -- [24]
						1687, -- [25]
						1687, -- [26]
						1633, -- [27]
						1633, -- [28]
						1633, -- [29]
						1633, -- [30]
						1633, -- [31]
						1633, -- [32]
						20, -- [33]
						0, -- [34]
					},
					["KilledBy"] = "灼热图腾 VI",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"MISC", -- [34]
					},
				}, -- [6]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						false, -- [38]
						false, -- [39]
						true, -- [40]
						true, -- [41]
					},
					["Messages"] = {
						"要水吗兄弟-逐风者 冰霜新星 特变电工 Hit -97 (Frost)", -- [1]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -138 (Nature)", -- [2]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Crit -202 (Physical)", -- [3]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -30 (Physical)", -- [4]
						"黑椒牛柳灬-逐风者 出血 特变电工 Hit -92 (Physical)", -- [5]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Miss (1)", -- [6]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -108 (Physical)", -- [7]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -34 (Physical)", -- [8]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -41 (Fire)", -- [9]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -37 (Physical)", -- [10]
						"要水吗兄弟-逐风者 寒冰箭 特变电工 Hit -784 (Frost)", -- [11]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -107 (Physical)", -- [12]
						"麦积烟雨 自动射击 特变电工 Hit -204 (Physical)", -- [13]
						"黑椒牛柳灬-逐风者 出血 特变电工 Hit -115 (Physical)", -- [14]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -41 (Fire)", -- [15]
						"麦积烟雨 奥术射击 特变电工 Hit -198 (Arcane)", -- [16]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -35 (Physical)", -- [17]
						"豹 肉搏 特变电工 Hit -54 (Physical)", -- [18]
						"豹 爪击 特变电工 Hit -37 (Physical)", -- [19]
						"特变电工 生命赐福 特变电工 Hit +1202", -- [20]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -31 (Physical)", -- [21]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -96 (Physical)", -- [22]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -118 (Nature)", -- [23]
						"要水吗兄弟-逐风者 火焰冲击 特变电工 Hit -706 (Fire)", -- [24]
						"豹 肉搏 特变电工 Hit -48 (Physical)", -- [25]
						"麦积烟雨 多重射击 特变电工 Hit -319 (Physical)", -- [26]
						"麦积烟雨 自动射击 特变电工 Hit -185 (Physical)", -- [27]
						"要水吗兄弟-逐风者 寒冰箭 特变电工 Hit -995 (Frost)", -- [28]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -45 (Fire)", -- [29]
						"大懒猪 肉搏 特变电工 Hit -297 (Physical)", -- [30]
						"大懒猪 断筋 特变电工 Hit -30 (Physical)", -- [31]
						"豹 爪击 特变电工 Hit -47 (Physical)", -- [32]
						"豹 肉搏 特变电工 Hit -53 (Physical)", -- [33]
						"要水吗兄弟-逐风者 冰锥术 特变电工 Hit -625 (Frost)", -- [34]
						"大懒猪 斩杀 特变电工 Dodge (Physical)", -- [35]
						"豹 爪击 特变电工 Hit -44 (Physical)", -- [36]
						"黑椒牛柳灬-逐风者 割裂 (伤害/跳) 特变电工 Tick -108 (Physical)", -- [37]
						"特变电工 旋风斩 大懒猪 Miss (Physical)", -- [38]
						"特变电工 旋风斩 豹 Miss (Physical)", -- [39]
						"麦积烟雨 自动射击 特变电工 Crit -521 (Physical)", -- [40]
						"特变电工死亡。", -- [41]
					},
					["DeathAt"] = 7528.268,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
					},
					["MessageTimes"] = {
						-11.61200000000008, -- [1]
						-10.5619999999999, -- [2]
						-10.52700000000004, -- [3]
						-9.811999999999898, -- [4]
						-9.561999999999898, -- [5]
						-8.412000000000262, -- [6]
						-7.912000000000262, -- [7]
						-7.011999999999716, -- [8]
						-7.011999999999716, -- [9]
						-5.610999999999876, -- [10]
						-5.394999999999527, -- [11]
						-5.310999999999694, -- [12]
						-5.028000000000247, -- [13]
						-4.877999999999702, -- [14]
						-4.877999999999702, -- [15]
						-4.71100000000024, -- [16]
						-4.21100000000024, -- [17]
						-4.010999999999513, -- [18]
						-3.694999999999709, -- [19]
						-3.46100000000024, -- [20]
						-2.795000000000073, -- [21]
						-2.694999999999709, -- [22]
						-2.694999999999709, -- [23]
						-2.661000000000058, -- [24]
						-2.610999999999876, -- [25]
						-2.560999999999694, -- [26]
						-2.377999999999702, -- [27]
						-2.360999999999876, -- [28]
						-2.228000000000066, -- [29]
						-2.127999999999702, -- [30]
						-2.127999999999702, -- [31]
						-2.095000000000255, -- [32]
						-1.193999999999505, -- [33]
						-1.110999999999876, -- [34]
						-0.6109999999998763, -- [35]
						-0.4780000000000655, -- [36]
						-0.2280000000000655, -- [37]
						-0.2280000000000655, -- [38]
						-0.2280000000000655, -- [39]
						-0.02800000000024738, -- [40]
						0, -- [41]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						8014, -- [21]
						8014, -- [22]
						8014, -- [23]
						8014, -- [24]
						8014, -- [25]
						8014, -- [26]
						8014, -- [27]
						8014, -- [28]
						8014, -- [29]
						8014, -- [30]
						8014, -- [31]
						8014, -- [32]
						8014, -- [33]
						8014, -- [34]
						8014, -- [35]
						8014, -- [36]
						8014, -- [37]
						8014, -- [38]
						8014, -- [39]
						8014, -- [40]
						6969, -- [41]
					},
					["Health"] = {
						3983, -- [1]
						3886, -- [2]
						3748, -- [3]
						3546, -- [4]
						3516, -- [5]
						3424, -- [6]
						3424, -- [7]
						3316, -- [8]
						3316, -- [9]
						3241, -- [10]
						3204, -- [11]
						2420, -- [12]
						2313, -- [13]
						2109, -- [14]
						2109, -- [15]
						1953, -- [16]
						1755, -- [17]
						1720, -- [18]
						1666, -- [19]
						1629, -- [20]
						3876, -- [21]
						3845, -- [22]
						3845, -- [23]
						3631, -- [24]
						2925, -- [25]
						2877, -- [26]
						2558, -- [27]
						2558, -- [28]
						1378, -- [29]
						1333, -- [30]
						1036, -- [31]
						1006, -- [32]
						959, -- [33]
						906, -- [34]
						281, -- [35]
						281, -- [36]
						237, -- [37]
						237, -- [38]
						237, -- [39]
						129, -- [40]
						0, -- [41]
					},
					["KilledBy"] = "麦积烟雨",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"HEAL", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"MISC", -- [41]
					},
				}, -- [7]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						false, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						false, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						false, -- [42]
						true, -- [43]
						false, -- [44]
						true, -- [45]
						true, -- [46]
						true, -- [47]
						false, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"豹 肉搏 特变电工 Hit -51 (Physical)", -- [1]
						"豹 爪击 特变电工 Hit -34 (Physical)", -- [2]
						"混子战仕-黑龙费尔默 压制 特变电工 Hit -304 (Physical)", -- [3]
						"特变电工 重伤 (伤害/跳) 盗克盗-逐风者 Tick -140 (Physical)", -- [4]
						"特变电工 斩杀 盗克盗-逐风者 Hit -1022 (Physical)", -- [5]
						"麦积烟雨 多重射击 特变电工 Hit -342 (Physical)", -- [6]
						"特变电工 肉搏 混子战仕-黑龙费尔默 Hit -431 (Physical)", -- [7]
						"豹 肉搏 特变电工 Hit -49 (Physical)", -- [8]
						"麦积烟雨 自动射击 特变电工 Hit -215 (Physical)", -- [9]
						"豹 爪击 特变电工 Hit -41 (Physical)", -- [10]
						"混子战仕-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -81 (Physical)", -- [11]
						"豹 肉搏 特变电工 Crit -97 (Physical)", -- [12]
						"豹 爪击 特变电工 Dodge (Physical)", -- [13]
						"豹 肉搏 特变电工 Hit -57 (Physical)", -- [14]
						"特变电工 断筋 黑椒牛柳灬-逐风者 Dodge (Physical)", -- [15]
						"麦积烟雨 自动射击 特变电工 Crit -532 (Physical)", -- [16]
						"豹 爪击 特变电工 Hit -39 (Physical)", -- [17]
						"特变电工 肉搏 黑椒牛柳灬-逐风者 Hit -580 (Physical)", -- [18]
						"豹 肉搏 特变电工 Hit -49 (Physical)", -- [19]
						"混子战仕-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -81 (Physical)", -- [20]
						"麦积烟雨 奥术射击 特变电工 Hit -217 (Arcane)", -- [21]
						"特变电工 旋风斩 大懒猪 Dodge (Physical)", -- [22]
						"特变电工 旋风斩 豹 Hit -378 (Physical)", -- [23]
						"特变电工 旋风斩 黑椒牛柳灬-逐风者 Hit -607 (Physical)", -- [24]
						"特变电工 旋风斩 混子战仕-黑龙费尔默 Crit -927 (Physical)", -- [25]
						"豹 肉搏 特变电工 Hit -55 (Physical)", -- [26]
						"麦积烟雨 自动射击 特变电工 Hit -228 (Physical)", -- [27]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 特变电工 Tick -126 (Nature)", -- [28]
						"豹 爪击 特变电工 Hit -43 (Physical)", -- [29]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Miss (1)", -- [30]
						"特变电工 致死打击 黑椒牛柳灬-逐风者 Dodge (Physical)", -- [31]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Hit -371 (Physical)", -- [32]
						"特变电工 肉搏 黑椒牛柳灬-逐风者 Hit -528 (Physical)", -- [33]
						"豹 肉搏 特变电工 Dodge (1)", -- [34]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Crit -230 (Physical)", -- [35]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -139 (Nature)", -- [36]
						"混子战仕-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -81 (Physical)", -- [37]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Parry (1)", -- [38]
						"大懒猪 肉搏 特变电工 Hit -291 (Physical)", -- [39]
						"大懒猪 断筋 特变电工 Hit -26 (Physical)", -- [40]
						"混子战仕-黑龙费尔默 斩杀 特变电工 Hit -717 (Physical)", -- [41]
						"特变电工 重伤 (伤害/跳) 混子战仕-黑龙费尔默 Tick -140 (Physical)", -- [42]
						"混子战仕-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -35 (Physical)", -- [43]
						"特变电工 压制 黑椒牛柳灬-逐风者 Crit -1153 (Physical)", -- [44]
						"麦积烟雨 自动射击 特变电工 Hit -214 (Physical)", -- [45]
						"豹 肉搏 特变电工 Hit -46 (Physical)", -- [46]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 特变电工 Tick -114 (Nature)", -- [47]
						"特变电工 肉搏 黑椒牛柳灬-逐风者 Hit -592 (Physical)", -- [48]
						"黑椒牛柳灬-逐风者 出血 特变电工 Crit -292 (Physical)", -- [49]
						"特变电工死亡。", -- [50]
					},
					["DeathAt"] = 7409.26,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-10.5, -- [1]
						-10.5, -- [2]
						-10.46700000000055, -- [3]
						-10.15000000000055, -- [4]
						-9.317000000000007, -- [5]
						-9.182999999999993, -- [6]
						-9.13300000000072, -- [7]
						-9.100000000000364, -- [8]
						-8.967000000000553, -- [9]
						-8.88300000000072, -- [10]
						-7.800000000000182, -- [11]
						-7.682999999999993, -- [12]
						-7.267000000000735, -- [13]
						-6.283000000000357, -- [14]
						-5.983000000000175, -- [15]
						-5.682999999999993, -- [16]
						-5.666000000000167, -- [17]
						-5.617000000000189, -- [18]
						-4.88300000000072, -- [19]
						-4.817000000000007, -- [20]
						-4.783000000000357, -- [21]
						-4.467000000000553, -- [22]
						-4.467000000000553, -- [23]
						-4.467000000000553, -- [24]
						-4.467000000000553, -- [25]
						-3.483000000000175, -- [26]
						-3.266000000000531, -- [27]
						-3.25, -- [28]
						-3.216000000000349, -- [29]
						-3.166000000000167, -- [30]
						-2.950000000000728, -- [31]
						-2.150000000000546, -- [32]
						-2.115999999999985, -- [33]
						-2.066000000000713, -- [34]
						-2.016000000000531, -- [35]
						-2, -- [36]
						-1.800000000000182, -- [37]
						-1.749000000000706, -- [38]
						-1.600000000000364, -- [39]
						-1.5, -- [40]
						-1.466000000000349, -- [41]
						-1.446000000000822, -- [42]
						-1.38300000000072, -- [43]
						-1.083000000000538, -- [44]
						-0.7000000000007276, -- [45]
						-0.6500000000005457, -- [46]
						-0.25, -- [47]
						-0.01600000000053115, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						6969, -- [21]
						6969, -- [22]
						6969, -- [23]
						6969, -- [24]
						6969, -- [25]
						6969, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
						6969, -- [30]
						6969, -- [31]
						6969, -- [32]
						6969, -- [33]
						6969, -- [34]
						6969, -- [35]
						6969, -- [36]
						6969, -- [37]
						6969, -- [38]
						6969, -- [39]
						6969, -- [40]
						6969, -- [41]
						6969, -- [42]
						6969, -- [43]
						6969, -- [44]
						6969, -- [45]
						6969, -- [46]
						6969, -- [47]
						6969, -- [48]
						6969, -- [49]
						6969, -- [50]
					},
					["Health"] = {
						5106, -- [1]
						5106, -- [2]
						5021, -- [3]
						4717, -- [4]
						4717, -- [5]
						4717, -- [6]
						4375, -- [7]
						4375, -- [8]
						4326, -- [9]
						4111, -- [10]
						4070, -- [11]
						3989, -- [12]
						3892, -- [13]
						3892, -- [14]
						3835, -- [15]
						3835, -- [16]
						3303, -- [17]
						3264, -- [18]
						3264, -- [19]
						3215, -- [20]
						3134, -- [21]
						2917, -- [22]
						2917, -- [23]
						2917, -- [24]
						2917, -- [25]
						2917, -- [26]
						2862, -- [27]
						2634, -- [28]
						2508, -- [29]
						2465, -- [30]
						2465, -- [31]
						2465, -- [32]
						2094, -- [33]
						2094, -- [34]
						2094, -- [35]
						2094, -- [36]
						1725, -- [37]
						1644, -- [38]
						1644, -- [39]
						1353, -- [40]
						1327, -- [41]
						610, -- [42]
						610, -- [43]
						575, -- [44]
						575, -- [45]
						361, -- [46]
						315, -- [47]
						201, -- [48]
						201, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "黑椒牛柳灬-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [8]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						false, -- [35]
						true, -- [36]
						false, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
					},
					["Messages"] = {
						"特变电工 重伤 (伤害/跳) 大懒猪 Tick -110 (Physical)", -- [1]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Hit -221 (Physical)", -- [2]
						"混子战仕-黑龙费尔默 断筋 特变电工 Hit -25 (Physical)", -- [3]
						"特变电工 肉搏 大懒猪 Crit -843 (Physical)", -- [4]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -118 (Physical)", -- [5]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -150 (Nature)", -- [6]
						"黑椒牛柳灬-逐风者 出血 特变电工 Hit -118 (Physical)", -- [7]
						"混子战仕-黑龙费尔默 断筋 特变电工 Miss (Physical)", -- [8]
						"特变电工 致死打击 大懒猪 Hit -538 (Physical)", -- [9]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -35 (Physical)", -- [10]
						"黑椒牛柳灬-逐风者 出血 特变电工 Crit -281 (Physical)", -- [11]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Hit -295 (Physical)", -- [12]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -45 (Fire)", -- [13]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Miss (1)", -- [14]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Miss (1)", -- [15]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Miss (1)", -- [16]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -117 (Physical)", -- [17]
						"特变电工 肉搏 混子战仕-黑龙费尔默 Dodge (1)", -- [18]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -40 (Physical)", -- [19]
						"黑椒牛柳灬-逐风者 出血 特变电工 Crit -250 (Physical)", -- [20]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -45 (Fire)", -- [21]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -133 (Nature)", -- [22]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Miss (1)", -- [23]
						"特变电工 旋风斩 混子战仕-黑龙费尔默 Parry (Physical)", -- [24]
						"特变电工 旋风斩 黑椒牛柳灬-逐风者 Miss (Physical)", -- [25]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -118 (Physical)", -- [26]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -44 (Fire)", -- [27]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -160 (Nature)", -- [28]
						"黑椒牛柳灬-逐风者 割裂 特变电工 Dodge (Physical)", -- [29]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -274 (Physical)", -- [30]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Crit -72 (Physical)", -- [31]
						"麦积烟雨 多重射击 特变电工 Hit -353 (Physical)", -- [32]
						"麦积烟雨 自动射击 特变电工 Hit -210 (Physical)", -- [33]
						"麦积烟雨 奥术射击 特变电工 Crit -518 (Arcane)", -- [34]
						"特变电工 肉搏 黑椒牛柳灬-逐风者 Miss (1)", -- [35]
						"哎哟喂-火妖鲁西弗隆 多重射击 特变电工 Hit -388 (Physical)", -- [36]
						"特变电工 致死打击 黑椒牛柳灬-逐风者 Hit -722 (Physical)", -- [37]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Dodge (1)", -- [38]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -120 (Physical)", -- [39]
						"麦积烟雨 自动射击 特变电工 Crit -486 (Physical)", -- [40]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Hit -282 (Physical)", -- [41]
						"特变电工死亡。", -- [42]
					},
					["DeathAt"] = 7347.272,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageTimes"] = {
						-14.73899999999958, -- [1]
						-14.67299999999977, -- [2]
						-14.23899999999958, -- [3]
						-13.28899999999976, -- [4]
						-12.73899999999958, -- [5]
						-12.73899999999958, -- [6]
						-12.73899999999958, -- [7]
						-12.73899999999958, -- [8]
						-12.1889999999994, -- [9]
						-12.05599999999959, -- [10]
						-11.73899999999958, -- [11]
						-10.87199999999939, -- [12]
						-10.73899999999958, -- [13]
						-10.63900000000012, -- [14]
						-10.13900000000012, -- [15]
						-7.072000000000116, -- [16]
						-5.889000000000124, -- [17]
						-5.755000000000109, -- [18]
						-5.688999999999396, -- [19]
						-5.221999999999753, -- [20]
						-5.221999999999753, -- [21]
						-5.221999999999753, -- [22]
						-4.28899999999976, -- [23]
						-4.255000000000109, -- [24]
						-4.255000000000109, -- [25]
						-3.471999999999753, -- [26]
						-3.471999999999753, -- [27]
						-3.471999999999753, -- [28]
						-3.438999999999396, -- [29]
						-3.271999999999935, -- [30]
						-2.889000000000124, -- [31]
						-2.838999999999942, -- [32]
						-2.537999999999556, -- [33]
						-2.072000000000116, -- [34]
						-1.755000000000109, -- [35]
						-0.8049999999993815, -- [36]
						-0.8049999999993815, -- [37]
						-0.4879999999993743, -- [38]
						-0.3719999999993888, -- [39]
						-0.2719999999999345, -- [40]
						-0.02199999999993452, -- [41]
						0, -- [42]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						6969, -- [21]
						6969, -- [22]
						6969, -- [23]
						6969, -- [24]
						6969, -- [25]
						6969, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
						6969, -- [30]
						6969, -- [31]
						6969, -- [32]
						6969, -- [33]
						6969, -- [34]
						6969, -- [35]
						6969, -- [36]
						6969, -- [37]
						6969, -- [38]
						6969, -- [39]
						6969, -- [40]
						6969, -- [41]
						6969, -- [42]
					},
					["Health"] = {
						4894, -- [1]
						4894, -- [2]
						4673, -- [3]
						4648, -- [4]
						4648, -- [5]
						4648, -- [6]
						4648, -- [7]
						4648, -- [8]
						4262, -- [9]
						4262, -- [10]
						4227, -- [11]
						3946, -- [12]
						3651, -- [13]
						3606, -- [14]
						3606, -- [15]
						3606, -- [16]
						3606, -- [17]
						3489, -- [18]
						3489, -- [19]
						3449, -- [20]
						3449, -- [21]
						3449, -- [22]
						3021, -- [23]
						3021, -- [24]
						3021, -- [25]
						3021, -- [26]
						3021, -- [27]
						3021, -- [28]
						3021, -- [29]
						2699, -- [30]
						2425, -- [31]
						2353, -- [32]
						2000, -- [33]
						1790, -- [34]
						1272, -- [35]
						1272, -- [36]
						1272, -- [37]
						884, -- [38]
						884, -- [39]
						764, -- [40]
						278, -- [41]
						0, -- [42]
					},
					["KilledBy"] = "哎哟喂-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"MISC", -- [42]
					},
				}, -- [9]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						false, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						true, -- [47]
						false, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"特变电工 重伤 (伤害/跳) 一曲悠扬 Tick -104 (Physical)", -- [1]
						"特变电工 拦截昏迷 一曲悠扬 Hit -51 (Physical)", -- [2]
						"麦积烟雨 多重射击 特变电工 Crit -805 (Physical)", -- [3]
						"哎哟喂-火妖鲁西弗隆 多重射击 特变电工 Hit -430 (Physical)", -- [4]
						"一曲悠扬 冰冻 特变电工 Immune (Frost)", -- [5]
						"特变电工 致死打击 一曲悠扬 Hit -742 (Physical)", -- [6]
						"特变电工 肉搏 一曲悠扬 Hit -631 (Physical)", -- [7]
						"一曲悠扬 冰冻 特变电工 Immune (Frost)", -- [8]
						"麦积烟雨 自动射击 特变电工 Crit -490 (Physical)", -- [9]
						"麦积烟雨 奥术射击 特变电工 Hit -218 (Arcane)", -- [10]
						"黑椒牛柳灬-逐风者 偷袭 特变电工 Immune (Physical)", -- [11]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -109 (Physical)", -- [12]
						"一曲悠扬 冰冻 特变电工 Immune (Frost)", -- [13]
						"特变电工 旋风斩 一曲悠扬 Hit -670 (Physical)", -- [14]
						"特变电工 旋风斩 黑椒牛柳灬-逐风者 Crit -1428 (Physical)", -- [15]
						"要水吗兄弟-逐风者 寒冰箭 特变电工 Hit -901 (Frost)", -- [16]
						"黑椒牛柳灬-逐风者 幽影突袭 特变电工 Resist (Nature)", -- [17]
						"黑椒牛柳灬-逐风者 出血 特变电工 Hit -118 (Physical)", -- [18]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -45 (Fire)", -- [19]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -158 (Nature)", -- [20]
						"特变电工 重伤 (伤害/跳) 一曲悠扬 Tick -105 (Physical)", -- [21]
						"黑椒牛柳灬-逐风者 出血 特变电工 Hit -133 (Physical)", -- [22]
						"黑椒牛柳灬-逐风者 灼热武器 特变电工 Hit -44 (Fire)", -- [23]
						"特变电工 断筋 黑椒牛柳灬-逐风者 Hit -45 (Physical)", -- [24]
						"特变电工 英勇打击 黑椒牛柳灬-逐风者 Hit -731 (Physical)", -- [25]
						"豹 肉搏 特变电工 Dodge (1)", -- [26]
						"豹 爪击 特变电工 Hit -46 (Physical)", -- [27]
						"特变电工 重伤 (伤害/跳) 黑椒牛柳灬-逐风者 Tick -150 (Physical)", -- [28]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Parry (1)", -- [29]
						"混子战仕-黑龙费尔默 断筋 特变电工 Crit -65 (Physical)", -- [30]
						"豹 肉搏 特变电工 Hit -45 (Physical)", -- [31]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Crit -632 (Physical)", -- [32]
						"黑椒牛柳灬-逐风者 出血 特变电工 Hit -98 (Physical)", -- [33]
						"特变电工 肉搏 混子战仕-黑龙费尔默 Crit -989 (Physical)", -- [34]
						"豹 爪击 特变电工 Hit -33 (Physical)", -- [35]
						"黑椒牛柳灬-逐风者 致残毒药 特变电工 Immune (Nature)", -- [36]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Crit -65 (Physical)", -- [37]
						"豹 肉搏 特变电工 Hit -44 (Physical)", -- [38]
						"黑椒牛柳灬-逐风者 肉搏 特变电工 Crit -212 (Physical)", -- [39]
						"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -116 (Nature)", -- [40]
						"哎哟喂-火妖鲁西弗隆 自动射击 特变电工 Crit -576 (Physical)", -- [41]
						"特变电工 重伤 (伤害/跳) 黑椒牛柳灬-逐风者 Tick -150 (Physical)", -- [42]
						"豹 爪击 特变电工 Miss (Physical)", -- [43]
						"混子战仕-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -119 (Physical)", -- [44]
						"龙九爷-黑龙费尔默 奥术射击 特变电工 Hit -141 (Arcane)", -- [45]
						"龙九爷-黑龙费尔默 冰霜箭 特变电工 Hit -41 (Frost)", -- [46]
						"龙九爷-黑龙费尔默 自动射击 特变电工 Hit -95 (Physical)", -- [47]
						"特变电工 重伤 (伤害/跳) 混子战仕-黑龙费尔默 Tick -139 (Physical)", -- [48]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [49]
						"特变电工死亡。", -- [50]
					},
					["DeathAt"] = 7264.266000000001,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-10.40399999999954, -- [1]
						-10.26999999999953, -- [2]
						-10.22000000000026, -- [3]
						-9.670000000000073, -- [4]
						-9.60400000000027, -- [5]
						-9.60400000000027, -- [6]
						-9.436999999999898, -- [7]
						-9.436999999999898, -- [8]
						-9.086999999999534, -- [9]
						-9.086999999999534, -- [10]
						-9.068999999999505, -- [11]
						-8.386999999999716, -- [12]
						-8.10400000000027, -- [13]
						-8.10400000000027, -- [14]
						-8.10400000000027, -- [15]
						-8.002999999999702, -- [16]
						-7.936999999999898, -- [17]
						-7.936999999999898, -- [18]
						-7.936999999999898, -- [19]
						-7.936999999999898, -- [20]
						-7.403999999999542, -- [21]
						-6.920000000000073, -- [22]
						-6.920000000000073, -- [23]
						-6.069999999999709, -- [24]
						-5.920000000000073, -- [25]
						-5.420000000000073, -- [26]
						-5.103000000000066, -- [27]
						-5.069999999999709, -- [28]
						-4.198999999999614, -- [29]
						-4.198999999999614, -- [30]
						-4.002999999999702, -- [31]
						-3.95299999999952, -- [32]
						-3.787000000000262, -- [33]
						-3.48700000000008, -- [34]
						-3.48700000000008, -- [35]
						-2.802999999999884, -- [36]
						-2.802999999999884, -- [37]
						-2.603000000000066, -- [38]
						-2.569999999999709, -- [39]
						-2.569999999999709, -- [40]
						-2.48700000000008, -- [41]
						-2.069999999999709, -- [42]
						-1.869999999999891, -- [43]
						-0.9359999999996944, -- [44]
						-0.9030000000002474, -- [45]
						-0.9030000000002474, -- [46]
						-0.6359999999995125, -- [47]
						-0.4700000000002547, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						6969, -- [1]
						6969, -- [2]
						6969, -- [3]
						6969, -- [4]
						6969, -- [5]
						6969, -- [6]
						6969, -- [7]
						6969, -- [8]
						6969, -- [9]
						6969, -- [10]
						6969, -- [11]
						6969, -- [12]
						6969, -- [13]
						6969, -- [14]
						6969, -- [15]
						6969, -- [16]
						6969, -- [17]
						6969, -- [18]
						6969, -- [19]
						6969, -- [20]
						6969, -- [21]
						6969, -- [22]
						6969, -- [23]
						6969, -- [24]
						6969, -- [25]
						6969, -- [26]
						6969, -- [27]
						6969, -- [28]
						6969, -- [29]
						6969, -- [30]
						6969, -- [31]
						6969, -- [32]
						6969, -- [33]
						6969, -- [34]
						6969, -- [35]
						6969, -- [36]
						6969, -- [37]
						6969, -- [38]
						6969, -- [39]
						6969, -- [40]
						6969, -- [41]
						6969, -- [42]
						6969, -- [43]
						6969, -- [44]
						6969, -- [45]
						6969, -- [46]
						6969, -- [47]
						6969, -- [48]
						6969, -- [49]
						6969, -- [50]
					},
					["Health"] = {
						5799, -- [1]
						5799, -- [2]
						5799, -- [3]
						4994, -- [4]
						4564, -- [5]
						4564, -- [6]
						4564, -- [7]
						4564, -- [8]
						4564, -- [9]
						4564, -- [10]
						3856, -- [11]
						3856, -- [12]
						3747, -- [13]
						3747, -- [14]
						3747, -- [15]
						3747, -- [16]
						2846, -- [17]
						2846, -- [18]
						2846, -- [19]
						2846, -- [20]
						2525, -- [21]
						2525, -- [22]
						2525, -- [23]
						2348, -- [24]
						2348, -- [25]
						2348, -- [26]
						2348, -- [27]
						2302, -- [28]
						2302, -- [29]
						2302, -- [30]
						2237, -- [31]
						2192, -- [32]
						1560, -- [33]
						1462, -- [34]
						1462, -- [35]
						1429, -- [36]
						1429, -- [37]
						1364, -- [38]
						1320, -- [39]
						1320, -- [40]
						992, -- [41]
						416, -- [42]
						416, -- [43]
						416, -- [44]
						297, -- [45]
						297, -- [46]
						115, -- [47]
						20, -- [48]
						20, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "哎哟喂-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [10]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						false, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						false, -- [36]
						false, -- [37]
						true, -- [38]
						false, -- [39]
						false, -- [40]
						true, -- [41]
						true, -- [42]
					},
					["Messages"] = {
						"豹 肉搏 特变电工 Hit -45 (Physical)", -- [1]
						"特变电工 治疗药水 特变电工 Hit +1093", -- [2]
						"豹 爪击 特变电工 Hit -28 (Physical)", -- [3]
						"豹 肉搏 特变电工 Hit -40 (Physical)", -- [4]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -104 (Nature)", -- [5]
						"豹 爪击 特变电工 Hit -38 (Physical)", -- [6]
						"哎哟喂 肉搏 特变电工 Hit -49 (Physical)", -- [7]
						"豹 肉搏 特变电工 Hit -47 (Physical)", -- [8]
						"哎哟喂 爪击 特变电工 Hit -46 (Physical)", -- [9]
						"特变电工 旋风斩 麦积烟雨 Hit -520 (Physical)", -- [10]
						"特变电工 旋风斩 哎哟喂 Hit -451 (Physical)", -- [11]
						"特变电工 旋风斩 豹 Hit -516 (Physical)", -- [12]
						"豹 爪击 特变电工 Hit -39 (Physical)", -- [13]
						"哎哟喂 肉搏 特变电工 Hit -61 (Physical)", -- [14]
						"豹 肉搏 特变电工 Crit -100 (Physical)", -- [15]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [16]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 特变电工 Tick -126 (Nature)", -- [17]
						"哎哟喂 爪击 特变电工 Parry (Physical)", -- [18]
						"豹 肉搏 特变电工 Hit -57 (Physical)", -- [19]
						"特变电工 肉搏 麦积烟雨 Hit -621 (Physical)", -- [20]
						"哎哟喂 肉搏 特变电工 Hit -49 (Physical)", -- [21]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Hit -279 (Physical)", -- [22]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 特变电工 Tick -125 (Nature)", -- [23]
						"哎哟喂 肉搏 特变电工 Hit -45 (Physical)", -- [24]
						"混子战仕-黑龙费尔默 断筋 特变电工 Hit -26 (Physical)", -- [25]
						"哎哟喂 肉搏 特变电工 Hit -46 (Physical)", -- [26]
						"混子战仕-黑龙费尔默 斩杀 特变电工 Hit -361 (Physical)", -- [27]
						"哎哟喂 爪击 特变电工 Hit -37 (Physical)", -- [28]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 特变电工 Tick -103 (Nature)", -- [29]
						"哎哟喂 肉搏 特变电工 Dodge (1)", -- [30]
						"特变电工 缴械 混子战仕-黑龙费尔默 Dodge (Physical)", -- [31]
						"特变电工 肉搏 混子战仕-黑龙费尔默 Crit -938 (Physical)", -- [32]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Hit -265 (Physical)", -- [33]
						"混子战仕-黑龙费尔默 斩杀 特变电工 Hit -385 (Physical)", -- [34]
						"哎哟喂 肉搏 特变电工 Hit -37 (Physical)", -- [35]
						"特变电工 旋风斩 混子战仕-黑龙费尔默 Miss (Physical)", -- [36]
						"特变电工 旋风斩 哎哟喂 Dodge (Physical)", -- [37]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 特变电工 Tick -126 (Nature)", -- [38]
						"特变电工 重伤 (伤害/跳) 混子战仕-黑龙费尔默 Tick -132 (Physical)", -- [39]
						"特变电工 肉搏 混子战仕-黑龙费尔默 Crit -963 (Physical)", -- [40]
						"混子战仕-黑龙费尔默 肉搏 特变电工 Hit -319 (Physical)", -- [41]
						"特变电工死亡。", -- [42]
					},
					["DeathAt"] = 7083.271,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageTimes"] = {
						-14.91799999999967, -- [1]
						-14.91799999999967, -- [2]
						-14.60099999999966, -- [3]
						-13.51800000000003, -- [4]
						-13.39399999999932, -- [5]
						-12.98399999999947, -- [6]
						-12.21799999999985, -- [7]
						-12.10099999999966, -- [8]
						-11.7510000000002, -- [9]
						-11.48399999999947, -- [10]
						-11.48399999999947, -- [11]
						-11.48399999999947, -- [12]
						-11.35099999999966, -- [13]
						-10.70100000000002, -- [14]
						-10.70100000000002, -- [15]
						-10.38400000000002, -- [16]
						-10.33399999999983, -- [17]
						-10.13400000000002, -- [18]
						-9.28399999999965, -- [19]
						-9.166999999999462, -- [20]
						-8.684000000000196, -- [21]
						-7.617000000000189, -- [22]
						-7.317000000000007, -- [23]
						-7.166999999999462, -- [24]
						-6.983999999999469, -- [25]
						-5.684000000000197, -- [26]
						-5.483999999999469, -- [27]
						-4.449999999999818, -- [28]
						-4.333999999999833, -- [29]
						-4.184000000000197, -- [30]
						-3.833999999999833, -- [31]
						-3.833999999999833, -- [32]
						-3.833999999999833, -- [33]
						-3.733999999999469, -- [34]
						-2.684000000000197, -- [35]
						-1.466999999999644, -- [36]
						-1.466999999999644, -- [37]
						-1.333999999999833, -- [38]
						-0.8170000000000073, -- [39]
						-0.3329999999996289, -- [40]
						-0.03299999999944703, -- [41]
						0, -- [42]
					},
					["HealthMax"] = {
						8014, -- [1]
						8014, -- [2]
						8014, -- [3]
						8014, -- [4]
						8014, -- [5]
						8014, -- [6]
						8014, -- [7]
						8014, -- [8]
						8014, -- [9]
						8014, -- [10]
						8014, -- [11]
						8014, -- [12]
						8014, -- [13]
						8014, -- [14]
						8014, -- [15]
						8014, -- [16]
						8014, -- [17]
						8014, -- [18]
						8014, -- [19]
						8014, -- [20]
						8014, -- [21]
						8014, -- [22]
						8014, -- [23]
						8014, -- [24]
						8014, -- [25]
						8014, -- [26]
						8014, -- [27]
						8014, -- [28]
						8014, -- [29]
						8014, -- [30]
						8014, -- [31]
						8014, -- [32]
						8014, -- [33]
						8014, -- [34]
						8014, -- [35]
						8014, -- [36]
						8014, -- [37]
						8014, -- [38]
						8014, -- [39]
						8014, -- [40]
						8014, -- [41]
						6969, -- [42]
					},
					["Health"] = {
						1733, -- [1]
						1733, -- [2]
						2781, -- [3]
						2753, -- [4]
						2713, -- [5]
						2609, -- [6]
						2571, -- [7]
						2522, -- [8]
						2475, -- [9]
						2429, -- [10]
						2429, -- [11]
						2429, -- [12]
						2429, -- [13]
						2390, -- [14]
						2390, -- [15]
						2229, -- [16]
						2102, -- [17]
						1976, -- [18]
						1976, -- [19]
						1919, -- [20]
						1919, -- [21]
						1870, -- [22]
						1591, -- [23]
						1466, -- [24]
						1421, -- [25]
						1395, -- [26]
						1349, -- [27]
						988, -- [28]
						951, -- [29]
						848, -- [30]
						848, -- [31]
						848, -- [32]
						848, -- [33]
						583, -- [34]
						198, -- [35]
						161, -- [36]
						161, -- [37]
						161, -- [38]
						35, -- [39]
						35, -- [40]
						35, -- [41]
						0, -- [42]
					},
					["KilledBy"] = "混子战仕-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"HEAL", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"MISC", -- [42]
					},
				}, -- [11]
			},
			["type"] = "Self",
			["TimeLast"] = {
				["TimeHeal"] = 8164.261,
				["Dispelled"] = 7669.261,
				["HOT_Time"] = 7725.265,
				["DeathCount"] = 8234.266,
				["OVERALL"] = 8270.269,
				["DamageTaken"] = 8270.269,
				["HealingTaken"] = 8164.261,
				["Healing"] = 8164.261,
				["RageGain"] = 8227.266,
				["GTFOEvents"] = 8189.263,
				["TimeDamage"] = 8231.266,
				["ActiveTime"] = 8231.266,
				["GTFOEventDamage"] = 8189.263,
				["DOT_Time"] = 8022.268,
				["Damage"] = 8231.266,
			},
			["LastHealTime"] = 8165.128000000001,
			["LastDamageTaken"] = 592,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				6969, -- [1]
				6969, -- [2]
				6969, -- [3]
				6969, -- [4]
				6969, -- [5]
				6969, -- [6]
				6969, -- [7]
				6969, -- [8]
				6969, -- [9]
				6969, -- [10]
				6969, -- [11]
				6969, -- [12]
				6969, -- [13]
				6969, -- [14]
				6969, -- [15]
				6969, -- [16]
				6969, -- [17]
				6969, -- [18]
				6969, -- [19]
				6969, -- [20]
				6969, -- [21]
				6969, -- [22]
				6969, -- [23]
				6969, -- [24]
				6969, -- [25]
				6969, -- [26]
				6969, -- [27]
				6969, -- [28]
				6969, -- [29]
				6969, -- [30]
				6969, -- [31]
				6969, -- [32]
				6969, -- [33]
				6969, -- [34]
				6969, -- [35]
				8014, -- [36]
				8014, -- [37]
				8014, -- [38]
				8014, -- [39]
				8014, -- [40]
				8014, -- [41]
				8014, -- [42]
				8014, -- [43]
				8014, -- [44]
				8014, -- [45]
				8014, -- [46]
				6969, -- [47]
				6969, -- [48]
				6969, -- [49]
				6969, -- [50]
			},
			["NextEventNum"] = 36,
			["LastDamageTime"] = 8231.983,
			["LastEvents"] = {
				"特变电工 肉搏 麦积烟雨 Dodge (1)", -- [1]
				"哎哟喂 肉搏 特变电工 Hit -57 (Physical)", -- [2]
				"豹 肉搏 特变电工 Hit -52 (Physical)", -- [3]
				"豹 爪击 特变电工 Dodge (Physical)", -- [4]
				"哎哟喂 爪击 特变电工 Parry (Physical)", -- [5]
				"特变电工 压制 麦积烟雨 Crit -1165 (Physical)", -- [6]
				"哎哟喂 肉搏 特变电工 Hit -52 (Physical)", -- [7]
				"豹 肉搏 特变电工 Hit -49 (Physical)", -- [8]
				"特变电工 英勇打击 麦积烟雨 Dodge (Physical)", -- [9]
				"干锅肥肠 多重射击 特变电工 Hit -331 (Physical)", -- [10]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -116 (Nature)", -- [11]
				"干锅肥肠 自动射击 特变电工 Hit -165 (Physical)", -- [12]
				"要水吗兄弟-逐风者 暴风雪 (伤害/跳) 特变电工 Tick -170 (Frost)", -- [13]
				"哎哟喂 肉搏 特变电工 Miss (1)", -- [14]
				"哎哟喂 肉搏 特变电工 Hit -43 (Physical)", -- [15]
				"我想问题不大-黑龙费尔默 闪电箭 特变电工 Hit -972 (Nature)", -- [16]
				"特变电工死亡。", -- [17]
				"Environment Falling 特变电工 Hit -646 (Physical)", -- [18]
				"特变电工 断筋 从天而降的妖-逐风者 Hit -29 (Physical)", -- [19]
				"从天而降的妖-逐风者 荆棘术 特变电工 Hit -18 (Nature)", -- [20]
				"特变电工 肉搏 从天而降的妖-逐风者 Dodge (1)", -- [21]
				"特变电工 铁皮手雷 从天而降的妖-逐风者 Immune (Fire)", -- [22]
				"特变电工 肉搏 哎哟喂-火妖鲁西弗隆 Hit -375 (Physical)", -- [23]
				"我想问题不大-黑龙费尔默 冰霜震击 特变电工 Hit -1096 (Frost)", -- [24]
				"黑椒牛柳灬-逐风者 肉搏 特变电工 Crit -291 (Physical)", -- [25]
				"黑椒牛柳灬-逐风者 出血 特变电工 Crit -365 (Physical)", -- [26]
				"黑椒牛柳灬-逐风者 速效毒药 VI 特变电工 Hit -173 (Nature)", -- [27]
				"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -52 (Physical)", -- [28]
				"特变电工 致死打击 黑椒牛柳灬-逐风者 Crit -1682 (Physical)", -- [29]
				"黑椒牛柳灬-逐风者 肉搏 特变电工 Hit -142 (Physical)", -- [30]
				"我想问题不大-黑龙费尔默 闪电箭 特变电工 Hit -1669 (Nature)", -- [31]
				"我想问题不大-黑龙费尔默 闪电链 特变电工 Hit -1815 (Nature)", -- [32]
				"我想问题不大-黑龙费尔默 地震术 特变电工 Crit -2722 (Nature)", -- [33]
				"特变电工死亡。", -- [34]
				"Environment Falling 特变电工 Hit -592 (Physical)", -- [35]
				"盗克盗-逐风者 剑刃乱舞 特变电工 Hit -149 (Physical)", -- [36]
				"盗克盗-逐风者 剑刃乱舞 特变电工 Hit -475 (Physical)", -- [37]
				"哎哟喂 爪击 特变电工 Hit -39 (Physical)", -- [38]
				"豹 爪击 特变电工 Hit -34 (Physical)", -- [39]
				"哎哟喂 肉搏 特变电工 Hit -52 (Physical)", -- [40]
				"盗克盗-逐风者 剑刃乱舞 特变电工 Hit -346 (Physical)", -- [41]
				"豹 肉搏 特变电工 Hit -56 (Physical)", -- [42]
				"特变电工 斩杀 盗克盗-逐风者 Hit -899 (Physical)", -- [43]
				"哎哟喂 爪击 特变电工 Hit -44 (Physical)", -- [44]
				"哎哟喂 肉搏 特变电工 Dodge (1)", -- [45]
				"豹 肉搏 特变电工 Hit -50 (Physical)", -- [46]
				"哎哟喂 爪击 特变电工 Hit -36 (Physical)", -- [47]
				"哎哟喂 肉搏 特变电工 Hit -53 (Physical)", -- [48]
				"豹 肉搏 特变电工 Miss (1)", -- [49]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -127 (Nature)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				8187.03, -- [1]
				8187.53, -- [2]
				8187.663000000001, -- [3]
				8187.713, -- [4]
				8188.113, -- [5]
				8188.146, -- [6]
				8189.03, -- [7]
				8189.063, -- [8]
				8189.13, -- [9]
				8189.147, -- [10]
				8189.28, -- [11]
				8189.313, -- [12]
				8189.896, -- [13]
				8190.53, -- [14]
				8192.046, -- [15]
				8192.08, -- [16]
				8192.096, -- [17]
				8199.814, -- [18]
				8207.047, -- [19]
				8207.047, -- [20]
				8208.498, -- [21]
				8211.648000000001, -- [22]
				8228.599, -- [23]
				8228.766, -- [24]
				8230.066, -- [25]
				8230.066, -- [26]
				8230.066, -- [27]
				8231.783, -- [28]
				8231.983, -- [29]
				8232.666000000001, -- [30]
				8233.549, -- [31]
				8234.483, -- [32]
				8234.766, -- [33]
				8234.816, -- [34]
				8270.786, -- [35]
				8182.196, -- [36]
				8182.296, -- [37]
				8182.429, -- [38]
				8182.829, -- [39]
				8183.012, -- [40]
				8183.296, -- [41]
				8183.429, -- [42]
				8183.529, -- [43]
				8184.046, -- [44]
				8184.513, -- [45]
				8184.846000000001, -- [46]
				8185.663000000001, -- [47]
				8186.013, -- [48]
				8186.246, -- [49]
				8186.279, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 8935,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 957,
						["Frost"] = 1096,
						["Melee"] = 485,
						["Nature"] = 6397,
					},
					["DOT_Time"] = 0,
					["Damage"] = 2086,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 375,
						["Physical"] = 1711,
					},
					["PartialAbsorb"] = {
						["闪电箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 375,
								},
							},
							["amount"] = 375,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1682,
								},
							},
							["amount"] = 1682,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 29,
								},
							},
							["amount"] = 29,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 592,
								},
							},
							["amount"] = 592,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["闪电箭"] = {
									["count"] = 1669,
								},
								["闪电链"] = {
									["count"] = 1815,
								},
								["地震术"] = {
									["count"] = 2722,
								},
								["冰霜震击"] = {
									["count"] = 1096,
								},
							},
							["amount"] = 7302,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 173,
								},
								["出血"] = {
									["count"] = 365,
								},
								["肉搏"] = {
									["count"] = 485,
								},
							},
							["amount"] = 1023,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["闪电箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.45,
								},
							},
							["amount"] = 4.45,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.45,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1682,
									["min"] = 1682,
									["count"] = 1,
									["amount"] = 1682,
								},
							},
							["count"] = 1,
							["amount"] = 1682,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
							},
							["count"] = 1,
							["amount"] = 29,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 375,
									["min"] = 375,
									["count"] = 1,
									["amount"] = 375,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 375,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 30,
					["TimeDamage"] = 7.45,
					["TimeDamaging"] = {
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.45,
								},
							},
							["amount"] = 4.45,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["一曲悠扬"] = {
									["count"] = 21,
								},
								["盗克盗-逐风者"] = {
									["count"] = 6,
								},
								["黑椒牛柳灬-逐风者"] = {
									["count"] = 6,
								},
								["干锅肥肠"] = {
									["count"] = 21,
								},
								["我想问题不大-黑龙费尔默"] = {
									["count"] = 18,
								},
								["卡拉"] = {
									["count"] = 12,
								},
								["大懒猪"] = {
									["count"] = 21,
								},
								["混子战仕-黑龙费尔默"] = {
									["count"] = 15,
								},
								["哎哟喂"] = {
									["count"] = 21,
								},
								["要水吗兄弟-逐风者"] = {
									["count"] = 24,
								},
							},
							["amount"] = 165,
						},
					},
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 4.5,
								},
								["急救"] = {
									["count"] = 6.5,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 12.5,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.72,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.72,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 1.6,
								},
								["斩杀"] = {
									["count"] = 2.31,
								},
								["肉搏"] = {
									["count"] = 4.38,
								},
							},
							["amount"] = 18.23,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 2.63,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 3.98,
								},
								["肉搏"] = {
									["count"] = 6.1,
								},
							},
							["amount"] = 15.71,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.52,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6.229999999999999,
								},
								["拦截昏迷"] = {
									["count"] = 0.83,
								},
								["断筋"] = {
									["count"] = 1.6,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.37,
								},
							},
							["amount"] = 14.05,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3.66,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.82,
								},
								["旋风斩"] = {
									["count"] = 3,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.98,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.45,
								},
							},
							["amount"] = 4.45,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.8700000000000001,
								},
								["旋风斩"] = {
									["count"] = 0.87,
								},
								["拦截昏迷"] = {
									["count"] = 2.75,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.95,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 8.77,
								},
								["铁皮手雷"] = {
									["count"] = 3.7,
								},
								["肉搏"] = {
									["count"] = 22.22,
								},
							},
							["amount"] = 49.63,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1.12,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.95,
								},
								["英勇打击"] = {
									["count"] = 0.98,
								},
								["肉搏"] = {
									["count"] = 3.25,
								},
							},
							["amount"] = 7.800000000000001,
						},
						["猫头鹰"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.52,
								},
								["肉搏"] = {
									["count"] = 0.7,
								},
								["旋风斩"] = {
									["count"] = 0.88,
								},
							},
							["amount"] = 4.100000000000001,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 4.77,
								},
								["压制"] = {
									["count"] = 0.36,
								},
								["英勇打击"] = {
									["count"] = 0.15,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.27,
								},
								["断筋"] = {
									["count"] = 4.33,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 10.95,
								},
							},
							["amount"] = 24.93,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.3,
								},
								["旋风斩"] = {
									["count"] = 0.02,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.819999999999999,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.67,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.45,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["刺耳怒吼"] = {
									["count"] = 1.25,
								},
								["旋风斩"] = {
									["count"] = 1.33,
								},
								["拦截昏迷"] = {
									["count"] = 3.43,
								},
								["断筋"] = {
									["count"] = 1.81,
								},
								["斩杀"] = {
									["count"] = 3.77,
								},
								["肉搏"] = {
									["count"] = 12.44,
								},
							},
							["amount"] = 39.14999999999999,
						},
						["卡拉"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.83,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["大懒猪"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.1,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.92,
								},
								["旋风斩"] = {
									["count"] = 2.65,
								},
								["断筋"] = {
									["count"] = 4.33,
								},
								["斩杀"] = {
									["count"] = 0.57,
								},
								["肉搏"] = {
									["count"] = 14.04,
								},
							},
							["amount"] = 35.61,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.9,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.569999999999999,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.15,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.47,
								},
								["缴械"] = {
									["count"] = 1.13,
								},
								["肉搏"] = {
									["count"] = 4.98,
								},
							},
							["amount"] = 24.7,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.12,
								},
							},
							["amount"] = 1.12,
						},
						["哎哟喂"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.92,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.45,
								},
								["肉搏"] = {
									["count"] = 2.3,
								},
							},
							["amount"] = 17.67,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 3606,
								},
								["急救"] = {
									["count"] = 1500,
								},
								["治疗药水"] = {
									["count"] = 1093,
								},
							},
							["amount"] = 6199,
						},
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 1397,
						["Melee"] = 8237,
						["Fire"] = 337,
					},
					["DeathCount"] = 11,
					["GTFOEvents"] = 15,
					["ElementTaken"] = {
						["Physical"] = 40666,
						["Melee"] = 14112,
						["Arcane"] = 5282,
						["Fire"] = 3478,
						["Frost"] = 21290,
						["Nature"] = 19277,
					},
					["DOT_Time"] = 165,
					["Damage"] = 88957,
					["TimeHeal"] = 12.5,
					["ElementDone"] = {
						["Physical"] = 47265,
						["Melee"] = 41205,
						["Fire"] = 487,
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 9,
								},
								["Miss"] = {
									["count"] = 9,
								},
								["Parry"] = {
									["count"] = 6,
								},
								["Resist"] = {
									["count"] = 8,
								},
								["Immune"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 52,
								},
								["Hit"] = {
									["count"] = 66,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 21,
								},
								["Dodge"] = {
									["count"] = 10,
								},
							},
							["amount"] = 187,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 18,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 38,
								},
								["Miss"] = {
									["count"] = 8,
								},
								["Dodge"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 18,
								},
								["Parry"] = {
									["count"] = 4,
								},
							},
							["amount"] = 97,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["WhoDamaged"] = {
						["盗克盗-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 1040,
								},
								["剑刃乱舞"] = {
									["count"] = 1472,
								},
								["凿击"] = {
									["count"] = 98,
								},
								["肉搏"] = {
									["count"] = 1686,
								},
							},
							["amount"] = 4296,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1617,
								},
								["奥术射击"] = {
									["count"] = 432,
								},
								["驱散射击"] = {
									["count"] = 138,
								},
								["自动射击"] = {
									["count"] = 4004,
								},
								["多重射击"] = {
									["count"] = 4240,
								},
								["瞄准射击"] = {
									["count"] = 2042,
								},
							},
							["amount"] = 12473,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 76,
								},
							},
							["amount"] = 76,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 304,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 443,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 35,
								},
								["断筋"] = {
									["count"] = 141,
								},
								["斩杀"] = {
									["count"] = 1463,
								},
								["肉搏"] = {
									["count"] = 2957,
								},
							},
							["amount"] = 5343,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["哎哟喂"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 445,
								},
								["肉搏"] = {
									["count"] = 1181,
								},
							},
							["amount"] = 1626,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 846,
								},
								["奥术射击"] = {
									["count"] = 2322,
								},
								["自动射击"] = {
									["count"] = 4883,
								},
								["驱散射击"] = {
									["count"] = 97,
								},
								["多重射击"] = {
									["count"] = 4587,
								},
							},
							["amount"] = 12735,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1004,
								},
							},
							["amount"] = 1004,
						},
						["猫头鹰"] = {
							["Details"] = {
								["尖啸"] = {
									["count"] = 182,
								},
								["爪击"] = {
									["count"] = 153,
								},
								["肉搏"] = {
									["count"] = 685,
								},
							},
							["amount"] = 1020,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 1056,
								},
								["灼热武器"] = {
									["count"] = 485,
								},
								["速效毒药 VI"] = {
									["count"] = 1568,
								},
								["出血"] = {
									["count"] = 2255,
								},
								["肉搏"] = {
									["count"] = 2884,
								},
							},
							["amount"] = 8248,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 571,
								},
								["奥术射击"] = {
									["count"] = 686,
								},
								["自动射击"] = {
									["count"] = 1018,
								},
								["多重射击"] = {
									["count"] = 502,
								},
								["冰霜箭"] = {
									["count"] = 41,
								},
							},
							["amount"] = 2818,
						},
						["卡拉"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 101,
								},
								["肉搏"] = {
									["count"] = 439,
								},
							},
							["amount"] = 540,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 331,
								},
								["自动射击"] = {
									["count"] = 165,
								},
								["驱散射击"] = {
									["count"] = 212,
								},
								["肉搏"] = {
									["count"] = 184,
								},
							},
							["amount"] = 892,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 865,
								},
								["冰霜新星"] = {
									["count"] = 392,
								},
								["魔爆术"] = {
									["count"] = 1172,
								},
								["寒冰箭"] = {
									["count"] = 1613,
								},
								["冰锥术"] = {
									["count"] = 1180,
								},
							},
							["amount"] = 5222,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 7656,
								},
							},
							["amount"] = 7656,
						},
						["大懒猪"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 308,
								},
								["断筋"] = {
									["count"] = 169,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 420,
								},
								["肉搏"] = {
									["count"] = 2000,
								},
							},
							["amount"] = 2897,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 385,
								},
								["冰霜新星"] = {
									["count"] = 502,
								},
								["魔爆术"] = {
									["count"] = 670,
								},
								["寒冰箭"] = {
									["count"] = 5741,
								},
								["火焰冲击"] = {
									["count"] = 706,
								},
								["冰锥术"] = {
									["count"] = 4802,
								},
							},
							["amount"] = 12806,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 706,
								},
								["肉搏"] = {
									["count"] = 1505,
								},
							},
							["amount"] = 2211,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["闪电链"] = {
									["count"] = 4244,
								},
								["火舌攻击"] = {
									["count"] = 877,
								},
								["地震术"] = {
									["count"] = 4450,
								},
								["冰霜震击"] = {
									["count"] = 5769,
								},
								["闪电箭"] = {
									["count"] = 3588,
								},
								["闪电之盾"] = {
									["count"] = 2375,
								},
								["铁皮手雷"] = {
									["count"] = 330,
								},
								["肉搏"] = {
									["count"] = 591,
								},
							},
							["amount"] = 22224,
						},
					},
					["ElementDoneBlock"] = {
						["Physical"] = 5,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 4.5,
								},
								["急救"] = {
									["count"] = 6.5,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 12.5,
						},
					},
					["Dispelled"] = 1,
					["PartialResist"] = {
						["割裂"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["偷袭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["火舌攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 21,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 40,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 40,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 25,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["闪电箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 46,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 46,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 25,
						},
						["幽影突袭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 165,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 165,
						},
					},
					["PartialAbsorb"] = {
						["割裂"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["偷袭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["火舌攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 40,
									["amount"] = 0,
								},
							},
							["count"] = 40,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["闪电箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 46,
									["amount"] = 0,
								},
							},
							["count"] = 46,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["幽影突袭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 165,
									["amount"] = 0,
								},
							},
							["count"] = 165,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 295.9500000000001,
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
					},
					["WhoDispelled"] = {
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["自由行动 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["HOT_Time"] = 18,
					["Heals"] = {
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1202,
									["min"] = 1202,
									["count"] = 3,
									["amount"] = 3606,
								},
							},
							["count"] = 3,
							["amount"] = 3606,
						},
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 6,
									["amount"] = 1500,
								},
							},
							["count"] = 6,
							["amount"] = 1500,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1093,
									["min"] = 1093,
									["count"] = 1,
									["amount"] = 1093,
								},
							},
							["count"] = 1,
							["amount"] = 1093,
						},
					},
					["HealingTaken"] = 6199,
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 3606,
								},
								["急救"] = {
									["count"] = 1500,
								},
								["治疗药水"] = {
									["count"] = 1093,
								},
							},
							["amount"] = 6199,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 136,
								},
								["Tick"] = {
									["count"] = 18,
								},
								["Miss"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 21,
								},
								["Parry"] = {
									["count"] = 5,
								},
							},
							["amount"] = 198,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 115,
								},
								["Miss"] = {
									["count"] = 20,
								},
								["Dodge"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Parry"] = {
									["count"] = 4,
								},
							},
							["amount"] = 165,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 18,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 22,
								},
							},
							["amount"] = 25,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 11,
								},
								["Immune"] = {
									["count"] = 25,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 24,
								},
							},
							["amount"] = 66,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 25,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 25,
								},
							},
							["amount"] = 54,
						},
					},
					["Healing"] = 6199,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["火焰新星"] = {
									["max"] = 545,
									["min"] = 459,
									["count"] = 2,
									["amount"] = 1004,
								},
								["+暴风雪"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
								["暴风雪"] = {
									["max"] = 180,
									["min"] = 147,
									["count"] = 6,
									["amount"] = 1035,
								},
							},
							["count"] = 15,
							["amount"] = 2039,
						},
					},
					["DamageTaken"] = 104105,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1945,
									["min"] = 849,
									["count"] = 5,
									["amount"] = 7455,
								},
								["Hit"] = {
									["max"] = 825,
									["min"] = 363,
									["count"] = 10,
									["amount"] = 5948,
								},
							},
							["count"] = 19,
							["amount"] = 13403,
						},
						["英勇打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 731,
									["min"] = 731,
									["count"] = 1,
									["amount"] = 731,
								},
							},
							["count"] = 2,
							["amount"] = 731,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 101,
									["min"] = 100,
									["count"] = 3,
									["amount"] = 301,
								},
								["Tick"] = {
									["max"] = 172,
									["min"] = 36,
									["count"] = 52,
									["amount"] = 6119,
								},
							},
							["count"] = 55,
							["amount"] = 6420,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 11,
									["min"] = 11,
									["count"] = 1,
									["amount"] = 11,
								},
							},
							["count"] = 1,
							["amount"] = 11,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1165,
									["min"] = 652,
									["count"] = 3,
									["amount"] = 2970,
								},
								["Hit"] = {
									["max"] = 227,
									["min"] = 227,
									["count"] = 1,
									["amount"] = 227,
								},
							},
							["count"] = 4,
							["amount"] = 3197,
						},
						["缴械"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 180,
									["min"] = 157,
									["count"] = 2,
									["amount"] = 337,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 150,
									["min"] = 150,
									["count"] = 1,
									["amount"] = 150,
								},
							},
							["count"] = 4,
							["amount"] = 487,
						},
						["刺耳怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 670,
									["min"] = 282,
									["count"] = 19,
									["amount"] = 8663,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1428,
									["min"] = 927,
									["count"] = 4,
									["amount"] = 4556,
								},
								["Hit (被格挡)"] = {
									["max"] = 516,
									["min"] = 516,
									["count"] = 1,
									["amount"] = 516,
								},
							},
							["count"] = 35,
							["amount"] = 13735,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 51,
									["min"] = 51,
									["count"] = 1,
									["amount"] = 51,
								},
								["Immune"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 53,
									["min"] = 35,
									["count"] = 6,
									["amount"] = 288,
								},
							},
							["count"] = 11,
							["amount"] = 339,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 48,
									["min"] = 38,
									["count"] = 5,
									["amount"] = 203,
								},
								["Hit"] = {
									["max"] = 46,
									["min"] = 23,
									["count"] = 19,
									["amount"] = 668,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 88,
									["min"] = 50,
									["count"] = 8,
									["amount"] = 596,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 38,
							["amount"] = 1467,
						},
						["斩杀"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1416,
									["min"] = 1416,
									["count"] = 1,
									["amount"] = 1416,
								},
								["Hit"] = {
									["max"] = 1023,
									["min"] = 619,
									["count"] = 8,
									["amount"] = 6546,
								},
							},
							["count"] = 10,
							["amount"] = 7962,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 859,
									["min"] = 53,
									["count"] = 18,
									["amount"] = 9079,
								},
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 631,
									["min"] = 280,
									["count"] = 38,
									["amount"] = 16789,
								},
								["Miss"] = {
									["count"] = 8,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 8,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1200,
									["min"] = 126,
									["count"] = 18,
									["amount"] = 15337,
								},
								["Parry"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 97,
							["amount"] = 41205,
						},
					},
					["RageGain"] = 585,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 195,
								},
								["冲锋"] = {
									["count"] = 390,
								},
							},
							["amount"] = 585,
						},
					},
					["TimeDamage"] = 283.4499999999999,
					["TimeDamaging"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.67,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.45,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["刺耳怒吼"] = {
									["count"] = 1.25,
								},
								["旋风斩"] = {
									["count"] = 1.33,
								},
								["拦截昏迷"] = {
									["count"] = 3.43,
								},
								["断筋"] = {
									["count"] = 1.81,
								},
								["斩杀"] = {
									["count"] = 3.77,
								},
								["肉搏"] = {
									["count"] = 12.44,
								},
							},
							["amount"] = 39.14999999999999,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 4.77,
								},
								["压制"] = {
									["count"] = 0.36,
								},
								["英勇打击"] = {
									["count"] = 0.15,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.27,
								},
								["断筋"] = {
									["count"] = 4.33,
								},
								["斩杀"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 10.95,
								},
							},
							["amount"] = 24.93,
						},
						["大懒猪"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.1,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.92,
								},
								["旋风斩"] = {
									["count"] = 2.65,
								},
								["断筋"] = {
									["count"] = 4.33,
								},
								["斩杀"] = {
									["count"] = 0.57,
								},
								["肉搏"] = {
									["count"] = 14.04,
								},
							},
							["amount"] = 35.61,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.72,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.72,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 1.6,
								},
								["斩杀"] = {
									["count"] = 2.31,
								},
								["肉搏"] = {
									["count"] = 4.38,
								},
							},
							["amount"] = 18.23,
						},
						["卡拉"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.83,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 2.63,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 3.98,
								},
								["肉搏"] = {
									["count"] = 6.1,
								},
							},
							["amount"] = 15.71,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.3,
								},
								["旋风斩"] = {
									["count"] = 0.02,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.819999999999999,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.52,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6.229999999999999,
								},
								["拦截昏迷"] = {
									["count"] = 0.83,
								},
								["断筋"] = {
									["count"] = 1.6,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.37,
								},
							},
							["amount"] = 14.05,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.9,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.569999999999999,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.15,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.47,
								},
								["缴械"] = {
									["count"] = 1.13,
								},
								["肉搏"] = {
									["count"] = 4.98,
								},
							},
							["amount"] = 24.7,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3.66,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.82,
								},
								["旋风斩"] = {
									["count"] = 3,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.98,
						},
						["猫头鹰"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 2.52,
								},
								["肉搏"] = {
									["count"] = 0.7,
								},
								["旋风斩"] = {
									["count"] = 0.88,
								},
							},
							["amount"] = 4.100000000000001,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.45,
								},
							},
							["amount"] = 4.45,
						},
						["哎哟喂"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.92,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.45,
								},
								["肉搏"] = {
									["count"] = 2.3,
								},
							},
							["amount"] = 17.67,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1.12,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.95,
								},
								["英勇打击"] = {
									["count"] = 0.98,
								},
								["肉搏"] = {
									["count"] = 3.25,
								},
							},
							["amount"] = 7.800000000000001,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.12,
								},
							},
							["amount"] = 1.12,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.8700000000000001,
								},
								["旋风斩"] = {
									["count"] = 0.87,
								},
								["拦截昏迷"] = {
									["count"] = 2.75,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.95,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 8.77,
								},
								["铁皮手雷"] = {
									["count"] = 3.7,
								},
								["肉搏"] = {
									["count"] = 22.22,
								},
							},
							["amount"] = 49.63,
						},
					},
					["GTFOEventDamage"] = 2039,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 195,
								},
							},
							["amount"] = 195,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 390,
								},
							},
							["amount"] = 390,
						},
					},
					["DamagedWho"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3246,
								},
								["旋风斩"] = {
									["count"] = 1524,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 662,
								},
								["拦截昏迷"] = {
									["count"] = 153,
								},
								["断筋"] = {
									["count"] = 203,
								},
								["斩杀"] = {
									["count"] = 2821,
								},
								["肉搏"] = {
									["count"] = 7154,
								},
							},
							["amount"] = 15763,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1055,
								},
								["旋风斩"] = {
									["count"] = 1660,
								},
								["压制"] = {
									["count"] = 227,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 705,
								},
								["斩杀"] = {
									["count"] = 878,
								},
								["断筋"] = {
									["count"] = 415,
								},
								["铁皮手雷"] = {
									["count"] = 487,
								},
								["肉搏"] = {
									["count"] = 8543,
								},
							},
							["amount"] = 13970,
						},
						["卡拉"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 557,
								},
								["肉搏"] = {
									["count"] = 828,
								},
							},
							["amount"] = 1385,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2247,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 230,
								},
								["旋风斩"] = {
									["count"] = 510,
								},
								["断筋"] = {
									["count"] = 150,
								},
								["斩杀"] = {
									["count"] = 1921,
								},
								["肉搏"] = {
									["count"] = 3705,
								},
							},
							["amount"] = 8763,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1450,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 775,
								},
								["旋风斩"] = {
									["count"] = 356,
								},
								["断筋"] = {
									["count"] = 107,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 1992,
								},
							},
							["amount"] = 4733,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 94,
								},
								["拦截昏迷"] = {
									["count"] = 98,
								},
								["肉搏"] = {
									["count"] = 2407,
								},
							},
							["amount"] = 2599,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 464,
								},
								["斩杀"] = {
									["count"] = 1023,
								},
								["肉搏"] = {
									["count"] = 461,
								},
							},
							["amount"] = 1948,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1212,
								},
								["压制"] = {
									["count"] = 652,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 614,
								},
								["拳击"] = {
									["count"] = 11,
								},
								["断筋"] = {
									["count"] = 96,
								},
								["旋风斩"] = {
									["count"] = 621,
								},
								["肉搏"] = {
									["count"] = 2664,
								},
							},
							["amount"] = 5870,
						},
						["猫头鹰"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 28,
								},
								["肉搏"] = {
									["count"] = 494,
								},
								["旋风斩"] = {
									["count"] = 376,
								},
							},
							["amount"] = 898,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 927,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 737,
								},
								["肉搏"] = {
									["count"] = 3321,
								},
							},
							["amount"] = 4985,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3229,
								},
								["压制"] = {
									["count"] = 1153,
								},
								["英勇打击"] = {
									["count"] = 731,
								},
								["旋风斩"] = {
									["count"] = 3209,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 300,
								},
								["断筋"] = {
									["count"] = 80,
								},
								["斩杀"] = {
									["count"] = 700,
								},
								["肉搏"] = {
									["count"] = 3442,
								},
							},
							["amount"] = 12844,
						},
						["从天而降的妖-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 29,
								},
							},
							["amount"] = 29,
						},
						["大懒猪"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 538,
								},
								["旋风斩"] = {
									["count"] = 442,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 979,
								},
								["断筋"] = {
									["count"] = 226,
								},
								["斩杀"] = {
									["count"] = 619,
								},
								["肉搏"] = {
									["count"] = 4856,
								},
							},
							["amount"] = 7660,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 621,
								},
								["断筋"] = {
									["count"] = 39,
								},
								["压制"] = {
									["count"] = 1165,
								},
								["旋风斩"] = {
									["count"] = 520,
								},
							},
							["amount"] = 2345,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1318,
								},
							},
							["amount"] = 1318,
						},
						["哎哟喂"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 426,
								},
								["旋风斩"] = {
									["count"] = 1808,
								},
								["拦截昏迷"] = {
									["count"] = 35,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 861,
								},
								["肉搏"] = {
									["count"] = 717,
								},
							},
							["amount"] = 3847,
						},
					},
				},
			},
			["UnitLockout"] = 6811.269,
			["LastActive"] = 8270.269,
		},
		["平头哥丿-黑龙费尔默"] = {
			["GUID"] = "Player-5450-0333B220",
			["LastEventHealth"] = {
				5336, -- [1]
				5336, -- [2]
				5429, -- [3]
				4277, -- [4]
				3873, -- [5]
				3873, -- [6]
				3761, -- [7]
				3641, -- [8]
				3641, -- [9]
				3641, -- [10]
				3641, -- [11]
				3641, -- [12]
				3526, -- [13]
				3526, -- [14]
				3407, -- [15]
				5429, -- [16]
				5429, -- [17]
				5429, -- [18]
				5346, -- [19]
				5346, -- [20]
				5346, -- [21]
				4805, -- [22]
				4805, -- [23]
				4805, -- [24]
				4447, -- [25]
				4447, -- [26]
				4447, -- [27]
				4020, -- [28]
				4020, -- [29]
				5429, -- [30]
				5429, -- [31]
				5429, -- [32]
				5429, -- [33]
				1222, -- [34]
				1222, -- [35]
				1222, -- [36]
				2256, -- [37]
				2215, -- [38]
				2095, -- [39]
				2024, -- [40]
				1878, -- [41]
				1878, -- [42]
				1878, -- [43]
				1680, -- [44]
				1446, -- [45]
				1446, -- [46]
				1303, -- [47]
				1303, -- [48]
				1303, -- [49]
				0, -- [50]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"MISC", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["HealingTaken"] = {
					1342, -- [1]
				},
				["ActiveTime"] = {
					63.4, -- [1]
				},
				["TimeDamage"] = {
					61.9, -- [1]
				},
				["Healing"] = {
					1342, -- [1]
				},
				["DamageTaken"] = {
					8709, -- [1]
				},
				["Damage"] = {
					34948, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = "平头哥丿-黑龙费尔默",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
					},
					["Messages"] = {
						"平头哥丿-黑龙费尔默 自动射击 哎哟喂-火妖鲁西弗隆 Hit -367 (Physical)", -- [1]
						"平头哥丿-黑龙费尔默 治疗药水 平头哥丿-黑龙费尔默 Hit +1342", -- [2]
						"哎哟喂-火妖鲁西弗隆 自动射击 平头哥丿-黑龙费尔默 Hit -308 (Physical)", -- [3]
						"黑椒牛柳灬-逐风者 灼热武器 平头哥丿-黑龙费尔默 Hit -41 (Fire)", -- [4]
						"黑椒牛柳灬-逐风者 肉搏 平头哥丿-黑龙费尔默 Hit -120 (Physical)", -- [5]
						"黑椒牛柳灬-逐风者 肉搏 平头哥丿-黑龙费尔默 Crit -71 (Physical)", -- [6]
						"黑椒牛柳灬-逐风者 出血 平头哥丿-黑龙费尔默 Hit -146 (Physical)", -- [7]
						"平头哥丿-黑龙费尔默 猛禽一击 黑椒牛柳灬-逐风者 Hit -485 (Physical)", -- [8]
						"平头哥丿-黑龙费尔默 驱散射击 黑椒牛柳灬-逐风者 Hit -214 (Physical)", -- [9]
						"麦积烟雨 奥术射击 平头哥丿-黑龙费尔默 Hit -198 (Arcane)", -- [10]
						"麦积烟雨 自动射击 平头哥丿-黑龙费尔默 Hit -234 (Physical)", -- [11]
						"豹 肉搏 平头哥丿-黑龙费尔默 Hit -61 (Physical)", -- [12]
						"豹 爪击 平头哥丿-黑龙费尔默 Crit -82 (Physical)", -- [13]
						"平头哥丿-黑龙费尔默 摔绊 黑椒牛柳灬-逐风者 Hit -39 (Physical)", -- [14]
						"黑椒牛柳灬-逐风者 刺骨 平头哥丿-黑龙费尔默 Crit -1258 (Physical)", -- [15]
						"黑椒牛柳灬-逐风者 速效毒药 VI 平头哥丿-黑龙费尔默 Hit -124 (Nature)", -- [16]
						"平头哥丿-黑龙费尔默死亡。", -- [17]
					},
					["DeathAt"] = 8161.261,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
					},
					["MessageTimes"] = {
						-11.08399999999983, -- [1]
						-10.98400000000038, -- [2]
						-10.88400000000002, -- [3]
						-4.75, -- [4]
						-4.699999999999818, -- [5]
						-3.984000000000378, -- [6]
						-3.75, -- [7]
						-2.884000000000015, -- [8]
						-2.884000000000015, -- [9]
						-2.417000000000371, -- [10]
						-1.766999999999825, -- [11]
						-0.6500000000005457, -- [12]
						-0.6500000000005457, -- [13]
						-0.1170000000001892, -- [14]
						-0.01699999999982538, -- [15]
						-0.01699999999982538, -- [16]
						0, -- [17]
					},
					["HealthMax"] = {
						5429, -- [1]
						5429, -- [2]
						5429, -- [3]
						5429, -- [4]
						5429, -- [5]
						5429, -- [6]
						5429, -- [7]
						5429, -- [8]
						5429, -- [9]
						5429, -- [10]
						5429, -- [11]
						5429, -- [12]
						5429, -- [13]
						5429, -- [14]
						5429, -- [15]
						5429, -- [16]
						5429, -- [17]
					},
					["Health"] = {
						1222, -- [1]
						1222, -- [2]
						1222, -- [3]
						2256, -- [4]
						2215, -- [5]
						2095, -- [6]
						2024, -- [7]
						1878, -- [8]
						1878, -- [9]
						1878, -- [10]
						1680, -- [11]
						1446, -- [12]
						1446, -- [13]
						1303, -- [14]
						1303, -- [15]
						1303, -- [16]
						0, -- [17]
					},
					["KilledBy"] = "黑椒牛柳灬-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"HEAL", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"MISC", -- [17]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 15,
			["LastHealTime"] = 8149.027,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 881,
			["LastEventHealthMax"] = {
				5429, -- [1]
				5429, -- [2]
				5429, -- [3]
				5429, -- [4]
				5429, -- [5]
				5429, -- [6]
				5429, -- [7]
				5429, -- [8]
				5429, -- [9]
				5429, -- [10]
				5429, -- [11]
				5429, -- [12]
				5429, -- [13]
				5429, -- [14]
				5429, -- [15]
				5429, -- [16]
				5429, -- [17]
				5429, -- [18]
				5429, -- [19]
				5429, -- [20]
				5429, -- [21]
				5429, -- [22]
				5429, -- [23]
				5429, -- [24]
				5429, -- [25]
				5429, -- [26]
				5429, -- [27]
				5429, -- [28]
				5429, -- [29]
				5429, -- [30]
				5429, -- [31]
				5429, -- [32]
				5429, -- [33]
				5429, -- [34]
				5429, -- [35]
				5429, -- [36]
				5429, -- [37]
				5429, -- [38]
				5429, -- [39]
				5429, -- [40]
				5429, -- [41]
				5429, -- [42]
				5429, -- [43]
				5429, -- [44]
				5429, -- [45]
				5429, -- [46]
				5429, -- [47]
				5429, -- [48]
				5429, -- [49]
				5429, -- [50]
			},
			["TimeLast"] = {
				["TimeHeal"] = 8148.26,
				["OVERALL"] = 8264.258,
				["DamageTaken"] = 8264.258,
				["HealingTaken"] = 8148.26,
				["ActiveTime"] = 8233.266,
				["DeathCount"] = 8159.261,
				["TimeDamage"] = 8233.266,
				["Healing"] = 8148.26,
				["Damage"] = 8233.266,
			},
			["Owner"] = false,
			["Pet"] = {
				"棉花糖 <平头哥丿-黑龙费尔默>", -- [1]
			},
			["NextEventNum"] = 4,
			["LastDamageTime"] = 8233.549,
			["LastEvents"] = {
				"平头哥丿-黑龙费尔默 驱散射击 黑椒牛柳灬-逐风者 Hit -227 (Physical)", -- [1]
				"我想问题不大-黑龙费尔默 闪电链 平头哥丿-黑龙费尔默 Crit -1881 (Nature)", -- [2]
				"Environment Falling 平头哥丿-黑龙费尔默 Hit -881 (Physical)", -- [3]
				"龙九爷-黑龙费尔默 自动射击 平头哥丿-黑龙费尔默 Hit -123 (Physical)", -- [4]
				"平头哥丿-黑龙费尔默 自动射击 龙九爷-黑龙费尔默 Hit -424 (Physical)", -- [5]
				"龙九爷-黑龙费尔默 自动射击 平头哥丿-黑龙费尔默 Hit -112 (Physical)", -- [6]
				"龙九爷-黑龙费尔默 自动射击 平头哥丿-黑龙费尔默 Hit -120 (Physical)", -- [7]
				"平头哥丿-黑龙费尔默 铁皮手雷 龙九爷-黑龙费尔默 Hit -207 (Fire)", -- [8]
				"平头哥丿-黑龙费尔默 自动射击 龙九爷-黑龙费尔默 Hit -462 (Physical)", -- [9]
				"平头哥丿-黑龙费尔默 多重射击 龙九爷-黑龙费尔默 Hit -572 (Physical)", -- [10]
				"平头哥丿-黑龙费尔默 自动射击 龙九爷-黑龙费尔默 Crit -1022 (Physical)", -- [11]
				"龙九爷-黑龙费尔默 自动射击 平头哥丿-黑龙费尔默 Hit -115 (Physical)", -- [12]
				"平头哥丿-黑龙费尔默 自动射击 龙九爷-黑龙费尔默 Hit -442 (Physical)", -- [13]
				"龙九爷-黑龙费尔默 自动射击 平头哥丿-黑龙费尔默 Hit -119 (Physical)", -- [14]
				"龙九爷-黑龙费尔默 自动射击 平头哥丿-黑龙费尔默 Hit -107 (Physical)", -- [15]
				"平头哥丿-黑龙费尔默 自动射击 一曲悠扬 Hit -529 (Physical)", -- [16]
				"平头哥丿-黑龙费尔默 奥术射击 一曲悠扬 Crit -471 (Arcane)", -- [17]
				"盗克盗-逐风者 肉搏 平头哥丿-黑龙费尔默 Hit -83 (Physical)", -- [18]
				"盗克盗-逐风者 邪恶攻击 平头哥丿-黑龙费尔默 Hit -203 (Physical)", -- [19]
				"平头哥丿-黑龙费尔默 猛禽一击 盗克盗-逐风者 Crit -960 (Physical)", -- [20]
				"盗克盗-逐风者 肉搏 平头哥丿-黑龙费尔默 Crit -338 (Physical)", -- [21]
				"盗克盗-逐风者 肉搏 平头哥丿-黑龙费尔默 Dodge (1)", -- [22]
				"平头哥丿-黑龙费尔默 摔绊 盗克盗-逐风者 Hit -38 (Physical)", -- [23]
				"盗克盗-逐风者 肉搏 平头哥丿-黑龙费尔默 Crit -358 (Physical)", -- [24]
				"盗克盗-逐风者 肉搏 平头哥丿-黑龙费尔默 Dodge (1)", -- [25]
				"平头哥丿-黑龙费尔默 摔绊 盗克盗-逐风者 Hit -38 (Physical)", -- [26]
				"盗克盗-逐风者 邪恶攻击 平头哥丿-黑龙费尔默 Crit -427 (Physical)", -- [27]
				"平头哥丿-黑龙费尔默 肉搏 盗克盗-逐风者 Parry (1)", -- [28]
				"盗克盗-逐风者 肉搏 平头哥丿-黑龙费尔默 Hit -143 (Physical)", -- [29]
				"平头哥丿-黑龙费尔默 多重射击 龙九爷-黑龙费尔默 Hit -561 (Physical)", -- [30]
				"平头哥丿-黑龙费尔默 多重射击 豹 Hit -484 (Physical)", -- [31]
				"平头哥丿-黑龙费尔默 多重射击 麦积烟雨 Hit -509 (Physical)", -- [32]
				"平头哥丿-黑龙费尔默 自动射击 龙九爷-黑龙费尔默 Crit -1000 (Physical)", -- [33]
				"平头哥丿-黑龙费尔默 自动射击 哎哟喂-火妖鲁西弗隆 Hit -367 (Physical)", -- [34]
				"平头哥丿-黑龙费尔默 治疗药水 平头哥丿-黑龙费尔默 Hit +1342", -- [35]
				"哎哟喂-火妖鲁西弗隆 自动射击 平头哥丿-黑龙费尔默 Hit -308 (Physical)", -- [36]
				"黑椒牛柳灬-逐风者 灼热武器 平头哥丿-黑龙费尔默 Hit -41 (Fire)", -- [37]
				"黑椒牛柳灬-逐风者 肉搏 平头哥丿-黑龙费尔默 Hit -120 (Physical)", -- [38]
				"黑椒牛柳灬-逐风者 肉搏 平头哥丿-黑龙费尔默 Crit -71 (Physical)", -- [39]
				"黑椒牛柳灬-逐风者 出血 平头哥丿-黑龙费尔默 Hit -146 (Physical)", -- [40]
				"平头哥丿-黑龙费尔默 猛禽一击 黑椒牛柳灬-逐风者 Hit -485 (Physical)", -- [41]
				"平头哥丿-黑龙费尔默 驱散射击 黑椒牛柳灬-逐风者 Hit -214 (Physical)", -- [42]
				"麦积烟雨 奥术射击 平头哥丿-黑龙费尔默 Hit -198 (Arcane)", -- [43]
				"麦积烟雨 自动射击 平头哥丿-黑龙费尔默 Hit -234 (Physical)", -- [44]
				"豹 肉搏 平头哥丿-黑龙费尔默 Hit -61 (Physical)", -- [45]
				"豹 爪击 平头哥丿-黑龙费尔默 Crit -82 (Physical)", -- [46]
				"平头哥丿-黑龙费尔默 摔绊 黑椒牛柳灬-逐风者 Hit -39 (Physical)", -- [47]
				"黑椒牛柳灬-逐风者 刺骨 平头哥丿-黑龙费尔默 Crit -1258 (Physical)", -- [48]
				"黑椒牛柳灬-逐风者 速效毒药 VI 平头哥丿-黑龙费尔默 Hit -124 (Nature)", -- [49]
				"平头哥丿-黑龙费尔默死亡。", -- [50]
			},
			["Name"] = "平头哥丿-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				8233.549, -- [1]
				8234.483, -- [2]
				8265.225, -- [3]
				7737.682, -- [4]
				7738.432, -- [5]
				7739.082, -- [6]
				7740.482, -- [7]
				7743.066, -- [8]
				7745.599, -- [9]
				7746.499, -- [10]
				7748.433, -- [11]
				7750.35, -- [12]
				7751.400000000001, -- [13]
				7751.766000000001, -- [14]
				7753.167, -- [15]
				7807.42, -- [16]
				7808.054, -- [17]
				7818.788000000001, -- [18]
				7818.821, -- [19]
				7818.921, -- [20]
				7818.954, -- [21]
				7820.488, -- [22]
				7820.754, -- [23]
				7821.438, -- [24]
				7822.071, -- [25]
				7822.271, -- [26]
				7822.504, -- [27]
				7822.621, -- [28]
				7823.054, -- [29]
				8124.192, -- [30]
				8124.225, -- [31]
				8124.525000000001, -- [32]
				8124.525000000001, -- [33]
				8148.927000000001, -- [34]
				8149.027, -- [35]
				8149.127, -- [36]
				8155.261, -- [37]
				8155.311000000001, -- [38]
				8156.027, -- [39]
				8156.261, -- [40]
				8157.127, -- [41]
				8157.127, -- [42]
				8157.594, -- [43]
				8158.244000000001, -- [44]
				8159.361, -- [45]
				8159.361, -- [46]
				8159.894, -- [47]
				8159.994000000001, -- [48]
				8159.994000000001, -- [49]
				8160.011, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2762,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 881,
						["Nature"] = 1881,
					},
					["DOT_Time"] = 0,
					["Damage"] = 227,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 227,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 227,
								},
							},
							["amount"] = 227,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 881,
								},
							},
							["amount"] = 881,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["闪电链"] = {
									["count"] = 1881,
								},
							},
							["amount"] = 1881,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 227,
									["min"] = 227,
									["count"] = 1,
									["amount"] = 227,
								},
							},
							["count"] = 1,
							["amount"] = 227,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["平头哥丿-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["TimeSpent"] = {
						["猫头鹰"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 0.13,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.35,
								},
								["摔绊"] = {
									["count"] = 3,
								},
								["猛禽一击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.85,
						},
						["平头哥丿-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 6.88,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.879999999999999,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 6,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 2.4,
								},
							},
							["amount"] = 9.9,
						},
						["部落军旗"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.45,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 2.32,
								},
							},
							["amount"] = 7.270000000000001,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["猛禽一击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 7.5,
								},
								["多重射击"] = {
									["count"] = 2.01,
								},
								["奥术射击"] = {
									["count"] = 0.63,
								},
							},
							["amount"] = 10.14,
						},
						["哎哟喂"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.8,
								},
							},
							["amount"] = 5.03,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 0.03,
						},
						["大懒猪"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.17,
								},
								["自动射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.17,
						},
					},
					["DamageTaken"] = 8709,
					["ElementDoneAbsorb"] = {
						["Physical"] = 2342,
					},
					["PartialResist"] = {
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 63.4,
					["ElementTaken"] = {
						["Physical"] = 4826,
						["Melee"] = 1639,
						["Arcane"] = 198,
						["Fire"] = 41,
						["Nature"] = 2005,
					},
					["Damage"] = 34948,
					["TimeHeal"] = 1.5,
					["WhoDamaged"] = {
						["猫头鹰"] = {
							["Details"] = {
								["尖啸"] = {
									["count"] = 101,
								},
								["爪击"] = {
									["count"] = 209,
								},
								["肉搏"] = {
									["count"] = 465,
								},
							},
							["amount"] = 775,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 630,
								},
								["肉搏"] = {
									["count"] = 922,
								},
							},
							["amount"] = 1552,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 124,
								},
								["灼热武器"] = {
									["count"] = 41,
								},
								["刺骨"] = {
									["count"] = 1258,
								},
								["出血"] = {
									["count"] = 146,
								},
								["肉搏"] = {
									["count"] = 191,
								},
							},
							["amount"] = 1760,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 281,
								},
								["自动射击"] = {
									["count"] = 696,
								},
							},
							["amount"] = 977,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["闪电链"] = {
									["count"] = 1881,
								},
							},
							["amount"] = 1881,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 881,
								},
							},
							["amount"] = 881,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 234,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 432,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 82,
								},
								["肉搏"] = {
									["count"] = 61,
								},
							},
							["amount"] = 143,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 308,
								},
							},
							["amount"] = 308,
						},
					},
					["WhoHealed"] = {
						["平头哥丿-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1342,
								},
							},
							["amount"] = 1342,
						},
					},
					["Healing"] = 1342,
					["HealedWho"] = {
						["平头哥丿-黑龙费尔默"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1342,
								},
							},
							["amount"] = 1342,
						},
					},
					["Heals"] = {
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1342,
									["min"] = 1342,
									["count"] = 1,
									["amount"] = 1342,
								},
							},
							["count"] = 1,
							["amount"] = 1342,
						},
					},
					["Attacks"] = {
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 39,
									["min"] = 38,
									["count"] = 3,
									["amount"] = 115,
								},
							},
							["count"] = 3,
							["amount"] = 115,
						},
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 1235,
									["min"] = 477,
									["count"] = 2,
									["amount"] = 1712,
								},
								["Crit"] = {
									["max"] = 1314,
									["min"] = 826,
									["count"] = 10,
									["amount"] = 10054,
								},
								["Hit"] = {
									["max"] = 529,
									["min"] = 356,
									["count"] = 13,
									["amount"] = 5511,
								},
							},
							["count"] = 25,
							["amount"] = 17277,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 770,
									["min"] = 748,
									["count"] = 2,
									["amount"] = 1518,
								},
							},
							["count"] = 2,
							["amount"] = 1518,
						},
						["奥术射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 471,
									["min"] = 471,
									["count"] = 1,
									["amount"] = 471,
								},
								["Hit"] = {
									["max"] = 198,
									["min"] = 198,
									["count"] = 1,
									["amount"] = 198,
								},
							},
							["count"] = 2,
							["amount"] = 669,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 960,
									["min"] = 960,
									["count"] = 1,
									["amount"] = 960,
								},
								["Hit"] = {
									["max"] = 485,
									["min"] = 485,
									["count"] = 1,
									["amount"] = 485,
								},
							},
							["count"] = 2,
							["amount"] = 1445,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 227,
									["min"] = 214,
									["count"] = 2,
									["amount"] = 441,
								},
							},
							["count"] = 2,
							["amount"] = 441,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 207,
									["min"] = 207,
									["count"] = 1,
									["amount"] = 207,
								},
							},
							["count"] = 1,
							["amount"] = 207,
						},
						["多重射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 630,
									["min"] = 630,
									["count"] = 1,
									["amount"] = 630,
								},
								["Crit"] = {
									["max"] = 1537,
									["min"] = 1054,
									["count"] = 5,
									["amount"] = 6250,
								},
								["Hit"] = {
									["max"] = 659,
									["min"] = 452,
									["count"] = 12,
									["amount"] = 6396,
								},
							},
							["count"] = 18,
							["amount"] = 13276,
						},
						["肉搏"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 1342,
					["DamagedWho"] = {
						["猫头鹰"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1658,
								},
							},
							["amount"] = 1658,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 76,
								},
								["猛禽一击"] = {
									["count"] = 960,
								},
							},
							["amount"] = 1036,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3317,
								},
								["多重射击"] = {
									["count"] = 470,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 3985,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3350,
								},
								["铁皮手雷"] = {
									["count"] = 207,
								},
								["多重射击"] = {
									["count"] = 1133,
								},
							},
							["amount"] = 4690,
						},
						["部落军旗"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1314,
								},
							},
							["amount"] = 1314,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1235,
								},
							},
							["amount"] = 1235,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2223,
								},
								["瞄准射击"] = {
									["count"] = 748,
								},
								["多重射击"] = {
									["count"] = 1805,
								},
							},
							["amount"] = 4776,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 39,
								},
								["自动射击"] = {
									["count"] = 439,
								},
								["驱散射击"] = {
									["count"] = 441,
								},
								["猛禽一击"] = {
									["count"] = 485,
								},
							},
							["amount"] = 1404,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3083,
								},
								["多重射击"] = {
									["count"] = 3464,
								},
								["奥术射击"] = {
									["count"] = 471,
								},
							},
							["amount"] = 7018,
						},
						["哎哟喂"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 452,
								},
							},
							["amount"] = 452,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1571,
								},
								["瞄准射击"] = {
									["count"] = 770,
								},
								["多重射击"] = {
									["count"] = 1098,
								},
							},
							["amount"] = 3439,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 484,
								},
							},
							["amount"] = 484,
						},
						["大懒猪"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 2712,
								},
								["自动射击"] = {
									["count"] = 745,
								},
							},
							["amount"] = 3457,
						},
					},
					["TimeDamage"] = 61.9,
					["TimeDamaging"] = {
						["猫头鹰"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 0.13,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.35,
								},
								["摔绊"] = {
									["count"] = 3,
								},
								["猛禽一击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.85,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 6.88,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.879999999999999,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 6,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 2.4,
								},
							},
							["amount"] = 9.9,
						},
						["部落军旗"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.45,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 2.32,
								},
							},
							["amount"] = 7.270000000000001,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["猛禽一击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 7.5,
								},
								["多重射击"] = {
									["count"] = 2.01,
								},
								["奥术射击"] = {
									["count"] = 0.63,
								},
							},
							["amount"] = 10.14,
						},
						["哎哟喂"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.73,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.8,
								},
							},
							["amount"] = 5.03,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 0.03,
						},
						["大懒猪"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.17,
								},
								["自动射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.17,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 24,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 3,
								},
							},
							["amount"] = 17,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDone"] = {
						["Physical"] = 34072,
						["Fire"] = 207,
						["Arcane"] = 669,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 33,
								},
							},
							["amount"] = 52,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 6848.271,
			["LastActive"] = 8264.258,
		},
		["丶帝殒"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
					},
					["Messages"] = {
						"哎哟喂-火妖鲁西弗隆 多重射击 丶帝殒 Hit -579 (Physical)", -- [1]
						"麦积烟雨 自动射击 丶帝殒 Hit -315 (Physical)", -- [2]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 丶帝殒 Tick -114 (Nature)", -- [3]
						"要水吗兄弟-逐风者 寒冰箭 丶帝殒 Hit -820 (Frost)", -- [4]
						"干锅肥肠 猛禽一击 丶帝殒 Hit -326 (Physical)", -- [5]
						"干锅肥肠 摔绊 丶帝殒 Hit -19 (Physical)", -- [6]
						"卡拉 肉搏 丶帝殒 Hit -98 (Physical)", -- [7]
						"卡拉 爪击 丶帝殒 Hit -47 (Physical)", -- [8]
						"麦积烟雨 毒蛇钉刺 (伤害/跳) 丶帝殒 Tick -115 (Nature)", -- [9]
						"要水吗兄弟-逐风者 寒冰箭 丶帝殒 Hit -804 (Frost)", -- [10]
						"丶帝殒死亡。", -- [11]
					},
					["DeathAt"] = 8236.266,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
					},
					["MessageTimes"] = {
						-7.933999999999287, -- [1]
						-5.083999999998923, -- [2]
						-3.149999999999636, -- [3]
						-2.683999999999287, -- [4]
						-1.583999999998923, -- [5]
						-1.583999999998923, -- [6]
						-0.8169999999990978, -- [7]
						-0.1499999999996362, -- [8]
						-0.1499999999996362, -- [9]
						0, -- [10]
						0, -- [11]
					},
					["HealthMax"] = {
						3503, -- [1]
						3503, -- [2]
						3503, -- [3]
						3503, -- [4]
						3503, -- [5]
						3503, -- [6]
						3503, -- [7]
						3503, -- [8]
						3503, -- [9]
						3503, -- [10]
						3383, -- [11]
					},
					["Health"] = {
						3503, -- [1]
						2436, -- [2]
						2121, -- [3]
						2007, -- [4]
						1187, -- [5]
						1187, -- [6]
						842, -- [7]
						744, -- [8]
						744, -- [9]
						744, -- [10]
						0, -- [11]
					},
					["KilledBy"] = "要水吗兄弟-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"MISC", -- [11]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
					},
					["Messages"] = {
						"哎哟喂 肉搏 丶帝殒 Hit -60 (Physical)", -- [1]
						"哎哟喂 爪击 丶帝殒 Dodge (Physical)", -- [2]
						"丶帝殒 肉搏 哎哟喂 Crit -246 (Physical)", -- [3]
						"哎哟喂 肉搏 丶帝殒 Dodge (1)", -- [4]
						"丶帝殒 邪恶攻击 哎哟喂 Hit -140 (Physical)", -- [5]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 丶帝殒 Tick -115 (Nature)", -- [6]
						"丶帝殒 肉搏 哎哟喂 Hit -67 (Physical)", -- [7]
						"哎哟喂 爪击 丶帝殒 Hit -51 (Physical)", -- [8]
						"哎哟喂 肉搏 丶帝殒 Hit -73 (Physical)", -- [9]
						"丶帝殒 凿击 哎哟喂 Crit -93 (Physical)", -- [10]
						"丶帝殒死亡。", -- [11]
					},
					["DeathAt"] = 7609.273,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
					},
					["MessageTimes"] = {
						-3.050000000000182, -- [1]
						-2.016000000000531, -- [2]
						-1.63300000000072, -- [3]
						-1.533000000000357, -- [4]
						-1.400000000000546, -- [5]
						-0.9170000000003711, -- [6]
						-0.717000000000553, -- [7]
						-0.3500000000003638, -- [8]
						-0.0500000000001819, -- [9]
						0, -- [10]
						0, -- [11]
					},
					["HealthMax"] = {
						3383, -- [1]
						3383, -- [2]
						3383, -- [3]
						3383, -- [4]
						3383, -- [5]
						3383, -- [6]
						3383, -- [7]
						3383, -- [8]
						3383, -- [9]
						3383, -- [10]
						3383, -- [11]
					},
					["Health"] = {
						278, -- [1]
						218, -- [2]
						218, -- [3]
						218, -- [4]
						218, -- [5]
						218, -- [6]
						103, -- [7]
						103, -- [8]
						52, -- [9]
						52, -- [10]
						0, -- [11]
					},
					["KilledBy"] = "哎哟喂",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"MISC", -- [11]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
					},
					["Messages"] = {
						"丶帝殒 肉搏 盗克盗-逐风者 Hit -153 (Physical)", -- [1]
						"丶帝殒 肉搏 盗克盗-逐风者 Miss (1)", -- [2]
						"丶帝殒 背刺 盗克盗-逐风者 Hit -405 (Physical)", -- [3]
						"丶帝殒 肉搏 盗克盗-逐风者 Crit -287 (Physical)", -- [4]
						"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Dodge (1)", -- [5]
						"大懒猪 断筋 丶帝殒 Hit -36 (Physical)", -- [6]
						"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Hit -49 (Physical)", -- [7]
						"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -173 (Physical)", -- [8]
						"麦积烟雨 多重射击 丶帝殒 Hit -489 (Physical)", -- [9]
						"大懒猪 肉搏 丶帝殒 Miss (1)", -- [10]
						"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -176 (Physical)", -- [11]
						"黑椒牛柳灬-逐风者 灼热武器 丶帝殒 Hit -40 (Fire)", -- [12]
						"黑椒牛柳灬-逐风者 致残毒药 丶帝殒 Resist (Nature)", -- [13]
						"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Crit -103 (Physical)", -- [14]
						"黑椒牛柳灬-逐风者 出血 丶帝殒 Dodge (Physical)", -- [15]
						"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Crit -312 (Physical)", -- [16]
						"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Miss (1)", -- [17]
						"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -168 (Physical)", -- [18]
						"混子战仕-黑龙费尔默 肉搏 丶帝殒 Hit -388 (Physical)", -- [19]
						"大懒猪 肉搏 丶帝殒 Hit -397 (Physical)", -- [20]
						"大懒猪 断筋 丶帝殒 Hit -41 (Physical)", -- [21]
						"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Hit -59 (Physical)", -- [22]
						"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Hit -189 (Physical)", -- [23]
						"黑椒牛柳灬-逐风者 灼热武器 丶帝殒 Hit -40 (Fire)", -- [24]
						"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -184 (Physical)", -- [25]
						"黑椒牛柳灬-逐风者 灼热武器 丶帝殒 Hit -41 (Fire)", -- [26]
						"黑椒牛柳灬-逐风者 速效毒药 VI 丶帝殒 Hit -134 (Nature)", -- [27]
						"大懒猪 斩杀 丶帝殒 Hit -678 (Physical)", -- [28]
						"丶帝殒死亡。", -- [29]
					},
					["DeathAt"] = 7405.259,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
					},
					["MessageTimes"] = {
						-8.234000000000378, -- [1]
						-7.333999999999833, -- [2]
						-7.251000000000204, -- [3]
						-6.317000000000007, -- [4]
						-6.283999999999651, -- [5]
						-6.100999999999658, -- [6]
						-6.083999999999833, -- [7]
						-5.716999999999644, -- [8]
						-5.699999999999818, -- [9]
						-5.684000000000197, -- [10]
						-4.699999999999818, -- [11]
						-4.699999999999818, -- [12]
						-4.684000000000197, -- [13]
						-4.684000000000197, -- [14]
						-3.699999999999818, -- [15]
						-3.667000000000371, -- [16]
						-3.283999999999651, -- [17]
						-2.699999999999818, -- [18]
						-2.417000000000371, -- [19]
						-1.882999999999811, -- [20]
						-1.684000000000197, -- [21]
						-1.384000000000015, -- [22]
						-1.082999999999629, -- [23]
						-1.082999999999629, -- [24]
						-0.6829999999999927, -- [25]
						-0.6829999999999927, -- [26]
						-0.6829999999999927, -- [27]
						-0.03300000000035652, -- [28]
						0, -- [29]
					},
					["HealthMax"] = {
						3383, -- [1]
						3383, -- [2]
						3383, -- [3]
						3383, -- [4]
						3383, -- [5]
						3383, -- [6]
						3383, -- [7]
						3383, -- [8]
						3383, -- [9]
						3383, -- [10]
						3383, -- [11]
						3383, -- [12]
						3383, -- [13]
						3383, -- [14]
						3383, -- [15]
						3383, -- [16]
						3383, -- [17]
						3383, -- [18]
						3383, -- [19]
						3383, -- [20]
						3383, -- [21]
						3383, -- [22]
						3383, -- [23]
						3383, -- [24]
						3383, -- [25]
						3383, -- [26]
						3383, -- [27]
						3383, -- [28]
						3383, -- [29]
					},
					["Health"] = {
						3383, -- [1]
						3383, -- [2]
						3383, -- [3]
						3383, -- [4]
						3383, -- [5]
						3383, -- [6]
						3383, -- [7]
						3298, -- [8]
						3298, -- [9]
						3298, -- [10]
						2636, -- [11]
						2636, -- [12]
						2420, -- [13]
						2420, -- [14]
						2317, -- [15]
						2317, -- [16]
						2005, -- [17]
						2005, -- [18]
						1837, -- [19]
						1449, -- [20]
						1052, -- [21]
						1011, -- [22]
						952, -- [23]
						952, -- [24]
						723, -- [25]
						723, -- [26]
						723, -- [27]
						364, -- [28]
						0, -- [29]
					},
					["KilledBy"] = "大懒猪",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"MISC", -- [29]
					},
				}, -- [3]
			},
			["TimeLast"] = {
				["TimeHeal"] = 6974.263,
				["OVERALL"] = 8234.266,
				["DamageTaken"] = 8234.266,
				["DeathCount"] = 8234.266,
				["HealingTaken"] = 6974.263,
				["HOT_Time"] = 6974.263,
				["TimeDamage"] = 7607.259,
				["Healing"] = 6974.263,
				["ActiveTime"] = 7607.259,
				["DOT_Time"] = 7290.268,
				["Damage"] = 7607.259,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"MISC", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"MISC", -- [24]
				"HEAL", -- [25]
				"HEAL", -- [26]
				"HEAL", -- [27]
				"HEAL", -- [28]
				"HEAL", -- [29]
				"HEAL", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"MISC", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					7.5, -- [1]
				},
				["Healing"] = {
					1750, -- [1]
				},
				["DamageTaken"] = {
					14356, -- [1]
				},
				["HealingTaken"] = {
					1750, -- [1]
				},
				["HOT_Time"] = {
					21, -- [1]
				},
				["ActiveTime"] = {
					48.77999999999999, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["TimeDamage"] = {
					41.27999999999999, -- [1]
				},
				["DOT_Time"] = {
					33, -- [1]
				},
				["Damage"] = {
					7323, -- [1]
				},
			},
			["LastHealTime"] = 6974.363,
			["LastDamageTaken"] = 804,
			["level"] = 60,
			["LastDamageAbility"] = "寒冰箭",
			["LastFightIn"] = 15,
			["GUID"] = "Player-5458-03A9748E",
			["type"] = "Ungrouped",
			["LastEventHealth"] = {
				2005, -- [1]
				2005, -- [2]
				1837, -- [3]
				1449, -- [4]
				1052, -- [5]
				1011, -- [6]
				952, -- [7]
				952, -- [8]
				723, -- [9]
				723, -- [10]
				723, -- [11]
				364, -- [12]
				0, -- [13]
				278, -- [14]
				218, -- [15]
				218, -- [16]
				218, -- [17]
				218, -- [18]
				218, -- [19]
				103, -- [20]
				103, -- [21]
				52, -- [22]
				52, -- [23]
				0, -- [24]
				1309, -- [25]
				1592, -- [26]
				1842, -- [27]
				2125, -- [28]
				2375, -- [29]
				2658, -- [30]
				3503, -- [31]
				2436, -- [32]
				2121, -- [33]
				2007, -- [34]
				1187, -- [35]
				1187, -- [36]
				842, -- [37]
				744, -- [38]
				744, -- [39]
				744, -- [40]
				0, -- [41]
				3298, -- [42]
				3298, -- [43]
				3298, -- [44]
				2636, -- [45]
				2636, -- [46]
				2420, -- [47]
				2420, -- [48]
				2317, -- [49]
				2317, -- [50]
			},
			["enClass"] = "ROGUE",
			["unit"] = "丶帝殒",
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3383, -- [1]
				3383, -- [2]
				3383, -- [3]
				3383, -- [4]
				3383, -- [5]
				3383, -- [6]
				3383, -- [7]
				3383, -- [8]
				3383, -- [9]
				3383, -- [10]
				3383, -- [11]
				3383, -- [12]
				3383, -- [13]
				3383, -- [14]
				3383, -- [15]
				3383, -- [16]
				3383, -- [17]
				3383, -- [18]
				3383, -- [19]
				3383, -- [20]
				3383, -- [21]
				3383, -- [22]
				3383, -- [23]
				3383, -- [24]
				3503, -- [25]
				3503, -- [26]
				3503, -- [27]
				3503, -- [28]
				3503, -- [29]
				3503, -- [30]
				3503, -- [31]
				3503, -- [32]
				3503, -- [33]
				3503, -- [34]
				3503, -- [35]
				3503, -- [36]
				3503, -- [37]
				3503, -- [38]
				3503, -- [39]
				3503, -- [40]
				3383, -- [41]
				3383, -- [42]
				3383, -- [43]
				3383, -- [44]
				3383, -- [45]
				3383, -- [46]
				3383, -- [47]
				3383, -- [48]
				3383, -- [49]
				3383, -- [50]
			},
			["NextEventNum"] = 42,
			["LastDamageTime"] = 7607.373000000001,
			["LastEvents"] = {
				"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Miss (1)", -- [1]
				"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -168 (Physical)", -- [2]
				"混子战仕-黑龙费尔默 肉搏 丶帝殒 Hit -388 (Physical)", -- [3]
				"大懒猪 肉搏 丶帝殒 Hit -397 (Physical)", -- [4]
				"大懒猪 断筋 丶帝殒 Hit -41 (Physical)", -- [5]
				"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Hit -59 (Physical)", -- [6]
				"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Hit -189 (Physical)", -- [7]
				"黑椒牛柳灬-逐风者 灼热武器 丶帝殒 Hit -40 (Fire)", -- [8]
				"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -184 (Physical)", -- [9]
				"黑椒牛柳灬-逐风者 灼热武器 丶帝殒 Hit -41 (Fire)", -- [10]
				"黑椒牛柳灬-逐风者 速效毒药 VI 丶帝殒 Hit -134 (Nature)", -- [11]
				"大懒猪 斩杀 丶帝殒 Hit -678 (Physical)", -- [12]
				"丶帝殒死亡。", -- [13]
				"哎哟喂 肉搏 丶帝殒 Hit -60 (Physical)", -- [14]
				"哎哟喂 爪击 丶帝殒 Dodge (Physical)", -- [15]
				"丶帝殒 肉搏 哎哟喂 Crit -246 (Physical)", -- [16]
				"哎哟喂 肉搏 丶帝殒 Dodge (1)", -- [17]
				"丶帝殒 邪恶攻击 哎哟喂 Hit -140 (Physical)", -- [18]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 丶帝殒 Tick -115 (Nature)", -- [19]
				"丶帝殒 肉搏 哎哟喂 Hit -67 (Physical)", -- [20]
				"哎哟喂 爪击 丶帝殒 Hit -51 (Physical)", -- [21]
				"哎哟喂 肉搏 丶帝殒 Hit -73 (Physical)", -- [22]
				"丶帝殒 凿击 哎哟喂 Crit -93 (Physical)", -- [23]
				"丶帝殒死亡。", -- [24]
				"丶帝殒 急救 丶帝殒 Tick +250", -- [25]
				"丶帝殒 急救 丶帝殒 Tick +250", -- [26]
				"丶帝殒 急救 丶帝殒 Tick +250", -- [27]
				"丶帝殒 急救 丶帝殒 Tick +250", -- [28]
				"丶帝殒 急救 丶帝殒 Tick +250", -- [29]
				"丶帝殒 急救 丶帝殒 Tick +250", -- [30]
				"哎哟喂-火妖鲁西弗隆 多重射击 丶帝殒 Hit -579 (Physical)", -- [31]
				"麦积烟雨 自动射击 丶帝殒 Hit -315 (Physical)", -- [32]
				"麦积烟雨 毒蛇钉刺 (伤害/跳) 丶帝殒 Tick -114 (Nature)", -- [33]
				"要水吗兄弟-逐风者 寒冰箭 丶帝殒 Hit -820 (Frost)", -- [34]
				"干锅肥肠 猛禽一击 丶帝殒 Hit -326 (Physical)", -- [35]
				"干锅肥肠 摔绊 丶帝殒 Hit -19 (Physical)", -- [36]
				"卡拉 肉搏 丶帝殒 Hit -98 (Physical)", -- [37]
				"卡拉 爪击 丶帝殒 Hit -47 (Physical)", -- [38]
				"麦积烟雨 毒蛇钉刺 (伤害/跳) 丶帝殒 Tick -115 (Nature)", -- [39]
				"要水吗兄弟-逐风者 寒冰箭 丶帝殒 Hit -804 (Frost)", -- [40]
				"丶帝殒死亡。", -- [41]
				"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -173 (Physical)", -- [42]
				"麦积烟雨 多重射击 丶帝殒 Hit -489 (Physical)", -- [43]
				"大懒猪 肉搏 丶帝殒 Miss (1)", -- [44]
				"黑椒牛柳灬-逐风者 出血 丶帝殒 Hit -176 (Physical)", -- [45]
				"黑椒牛柳灬-逐风者 灼热武器 丶帝殒 Hit -40 (Fire)", -- [46]
				"黑椒牛柳灬-逐风者 致残毒药 丶帝殒 Resist (Nature)", -- [47]
				"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Crit -103 (Physical)", -- [48]
				"黑椒牛柳灬-逐风者 出血 丶帝殒 Dodge (Physical)", -- [49]
				"黑椒牛柳灬-逐风者 肉搏 丶帝殒 Crit -312 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["Name"] = "丶帝殒",
			["LastEventTimes"] = {
				7400.592000000001, -- [1]
				7401.176, -- [2]
				7401.459, -- [3]
				7401.993, -- [4]
				7402.192, -- [5]
				7402.492, -- [6]
				7402.793000000001, -- [7]
				7402.793000000001, -- [8]
				7403.193, -- [9]
				7403.193, -- [10]
				7403.193, -- [11]
				7403.843, -- [12]
				7403.876, -- [13]
				7604.323, -- [14]
				7605.357, -- [15]
				7605.74, -- [16]
				7605.84, -- [17]
				7605.973, -- [18]
				7606.456, -- [19]
				7606.656, -- [20]
				7607.023, -- [21]
				7607.323, -- [22]
				7607.373000000001, -- [23]
				7607.373000000001, -- [24]
				8083.472, -- [25]
				8084.489000000001, -- [26]
				8085.489000000001, -- [27]
				8086.489000000001, -- [28]
				8087.489000000001, -- [29]
				8088.473, -- [30]
				8226.449, -- [31]
				8229.299, -- [32]
				8231.233, -- [33]
				8231.699, -- [34]
				8232.799, -- [35]
				8232.799, -- [36]
				8233.566, -- [37]
				8234.233, -- [38]
				8234.233, -- [39]
				8234.383, -- [40]
				8234.383, -- [41]
				7398.159000000001, -- [42]
				7398.176, -- [43]
				7398.192, -- [44]
				7399.176, -- [45]
				7399.176, -- [46]
				7399.192, -- [47]
				7399.192, -- [48]
				7400.176, -- [49]
				7400.209, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3237,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 1624,
						["Physical"] = 1286,
						["Melee"] = 98,
						["Nature"] = 229,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["卡拉"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 47,
								},
								["肉搏"] = {
									["count"] = 98,
								},
							},
							["amount"] = 145,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1624,
								},
							},
							["amount"] = 1624,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 229,
								},
								["自动射击"] = {
									["count"] = 315,
								},
							},
							["amount"] = 544,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 19,
								},
								["猛禽一击"] = {
									["count"] = 326,
								},
							},
							["amount"] = 345,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 579,
								},
							},
							["amount"] = 579,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["丶帝殒"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["DOTs"] = {
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["要水吗兄弟-逐风者"] = {
									["count"] = 6,
								},
								["哎哟喂-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
								["大懒猪"] = {
									["count"] = 6,
								},
								["盗克盗-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 33,
						},
					},
					["TimeSpent"] = {
						["丶帝殒"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["哎哟喂"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 0.23,
								},
								["凿击"] = {
									["count"] = 0.72,
								},
								["肉搏"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 3.13,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.08,
								},
								["邪恶攻击"] = {
									["count"] = 0.07,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 3.55,
								},
								["肉搏"] = {
									["count"] = 5.47,
								},
							},
							["amount"] = 9.17,
						},
						["大懒猪"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 0.23,
								},
								["肾击"] = {
									["count"] = 1.17,
								},
								["刺骨"] = {
									["count"] = 0.33,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 2.98,
								},
								["肉搏"] = {
									["count"] = 12.55,
								},
							},
							["amount"] = 17.26,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.07,
								},
								["肉搏"] = {
									["count"] = 4.15,
								},
							},
							["amount"] = 4.22,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["DamageTaken"] = 14356,
					["ElementDoneAbsorb"] = {
						["Melee"] = 165,
						["Physical"] = 271,
					},
					["PartialResist"] = {
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 24,
						},
					},
					["DeathCount"] = 3,
					["PartialAbsorb"] = {
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 24,
									["amount"] = 0,
								},
							},
							["count"] = 24,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 48.77999999999999,
					["ElementTaken"] = {
						["Physical"] = 6874,
						["Melee"] = 3665,
						["Arcane"] = 614,
						["Fire"] = 121,
						["Frost"] = 2373,
						["Nature"] = 709,
					},
					["DOT_Time"] = 33,
					["Damage"] = 7323,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 25,
								},
							},
							["amount"] = 29,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 24,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
					},
					["TimeHeal"] = 7.5,
					["WhoHealed"] = {
						["丶帝殒"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1750,
								},
							},
							["amount"] = 1750,
						},
					},
					["HealedWho"] = {
						["丶帝殒"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1750,
								},
							},
							["amount"] = 1750,
						},
					},
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 7,
									["amount"] = 1750,
								},
							},
							["count"] = 7,
							["amount"] = 1750,
						},
					},
					["Healing"] = 1750,
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["丶帝殒"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["HOT_Time"] = 21,
					["ElementDone"] = {
						["Physical"] = 3867,
						["Melee"] = 2839,
						["Nature"] = 617,
					},
					["HealingTaken"] = 1750,
					["DamagedWho"] = {
						["哎哟喂"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 140,
								},
								["凿击"] = {
									["count"] = 93,
								},
								["肉搏"] = {
									["count"] = 313,
								},
							},
							["amount"] = 546,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 405,
								},
								["邪恶攻击"] = {
									["count"] = 403,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 83,
								},
								["肉搏"] = {
									["count"] = 530,
								},
							},
							["amount"] = 1421,
						},
						["大懒猪"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 231,
								},
							},
							["amount"] = 231,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 965,
								},
								["肉搏"] = {
									["count"] = 566,
								},
							},
							["amount"] = 1531,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 271,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 110,
								},
								["肉搏"] = {
									["count"] = 165,
								},
							},
							["amount"] = 546,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 868,
								},
								["邪恶攻击"] = {
									["count"] = 722,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 193,
								},
								["肉搏"] = {
									["count"] = 1265,
								},
							},
							["amount"] = 3048,
						},
					},
					["TimeDamage"] = 41.27999999999999,
					["TimeDamaging"] = {
						["哎哟喂"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 0.23,
								},
								["凿击"] = {
									["count"] = 0.72,
								},
								["肉搏"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 3.13,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.08,
								},
								["邪恶攻击"] = {
									["count"] = 0.07,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 3.55,
								},
								["肉搏"] = {
									["count"] = 5.47,
								},
							},
							["amount"] = 9.17,
						},
						["大懒猪"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.07,
								},
								["肉搏"] = {
									["count"] = 4.15,
								},
							},
							["amount"] = 4.22,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 0.23,
								},
								["肾击"] = {
									["count"] = 1.17,
								},
								["刺骨"] = {
									["count"] = 0.33,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 2.98,
								},
								["肉搏"] = {
									["count"] = 12.55,
								},
							},
							["amount"] = 17.26,
						},
					},
					["Attacks"] = {
						["凿击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 93,
									["min"] = 93,
									["count"] = 1,
									["amount"] = 93,
								},
							},
							["count"] = 1,
							["amount"] = 93,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 965,
									["min"] = 868,
									["count"] = 2,
									["amount"] = 1833,
								},
								["Hit"] = {
									["max"] = 405,
									["min"] = 405,
									["count"] = 1,
									["amount"] = 405,
								},
							},
							["count"] = 3,
							["amount"] = 2238,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 271,
									["min"] = 271,
									["count"] = 1,
									["amount"] = 271,
								},
								["Crit"] = {
									["max"] = 377,
									["min"] = 377,
									["count"] = 1,
									["amount"] = 377,
								},
								["Hit"] = {
									["max"] = 210,
									["min"] = 140,
									["count"] = 5,
									["amount"] = 888,
								},
							},
							["count"] = 7,
							["amount"] = 1536,
						},
						["肾击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 121,
									["min"] = 27,
									["count"] = 11,
									["amount"] = 617,
								},
							},
							["count"] = 11,
							["amount"] = 617,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 165,
									["min"] = 165,
									["count"] = 1,
									["amount"] = 165,
								},
								["Hit"] = {
									["max"] = 153,
									["min"] = 67,
									["count"] = 11,
									["amount"] = 1205,
								},
								["Miss"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 327,
									["min"] = 166,
									["count"] = 6,
									["amount"] = 1469,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 2839,
						},
					},
					["WhoDamaged"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 614,
								},
								["冰霜新星"] = {
									["count"] = 85,
								},
								["冰锥术"] = {
									["count"] = 539,
								},
							},
							["amount"] = 1238,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 471,
								},
								["邪恶攻击"] = {
									["count"] = 540,
								},
							},
							["amount"] = 1011,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 346,
								},
								["瞄准射击"] = {
									["count"] = 848,
								},
								["摔绊"] = {
									["count"] = 78,
								},
								["多重射击"] = {
									["count"] = 1119,
								},
								["自动射击"] = {
									["count"] = 1202,
								},
								["驱散射击"] = {
									["count"] = 205,
								},
								["肉搏"] = {
									["count"] = 1263,
								},
							},
							["amount"] = 5061,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 19,
								},
								["猛禽一击"] = {
									["count"] = 326,
								},
							},
							["amount"] = 345,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 388,
								},
							},
							["amount"] = 388,
						},
						["卡拉"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 47,
								},
								["肉搏"] = {
									["count"] = 98,
								},
							},
							["amount"] = 145,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["灼热武器"] = {
									["count"] = 121,
								},
								["速效毒药 VI"] = {
									["count"] = 134,
								},
								["出血"] = {
									["count"] = 701,
								},
								["肉搏"] = {
									["count"] = 712,
								},
							},
							["amount"] = 1668,
						},
						["哎哟喂"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 230,
								},
								["肉搏"] = {
									["count"] = 336,
								},
							},
							["amount"] = 566,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 229,
								},
								["自动射击"] = {
									["count"] = 315,
								},
								["多重射击"] = {
									["count"] = 489,
								},
							},
							["amount"] = 1033,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 39,
								},
								["寒冰箭"] = {
									["count"] = 1624,
								},
								["冰霜新星"] = {
									["count"] = 86,
								},
							},
							["amount"] = 1749,
						},
						["大懒猪"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 77,
								},
								["斩杀"] = {
									["count"] = 678,
								},
								["肉搏"] = {
									["count"] = 397,
								},
							},
							["amount"] = 1152,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 11,
								},
								["Miss"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 28,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 12,
						},
					},
				},
			},
			["UnitLockout"] = 6939.261,
			["LastActive"] = 8234.266,
		},
		["不带头大哥"] = {
			["GUID"] = "Player-5458-0393A991",
			["LastEventHealth"] = {
				126, -- [1]
				4699, -- [2]
				4699, -- [3]
				4610, -- [4]
				4610, -- [5]
				4610, -- [6]
				4699, -- [7]
				4290, -- [8]
				4290, -- [9]
				4301, -- [10]
				4272, -- [11]
				4272, -- [12]
				4272, -- [13]
				4272, -- [14]
				4199, -- [15]
				3138, -- [16]
				3915, -- [17]
				3874, -- [18]
				3790, -- [19]
				3790, -- [20]
				3790, -- [21]
				3790, -- [22]
				3888, -- [23]
				3888, -- [24]
				3888, -- [25]
				3888, -- [26]
				3833, -- [27]
				4046, -- [28]
				4046, -- [29]
				4345, -- [30]
				4345, -- [31]
				4345, -- [32]
				4042, -- [33]
				4042, -- [34]
				4004, -- [35]
				4004, -- [36]
				4004, -- [37]
				4004, -- [38]
				4004, -- [39]
				4004, -- [40]
				4004, -- [41]
				4004, -- [42]
				3667, -- [43]
				3667, -- [44]
				3667, -- [45]
				3667, -- [46]
				3710, -- [47]
				4699, -- [48]
				4819, -- [49]
				959, -- [50]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"MISC", -- [35]
				"MISC", -- [36]
				"MISC", -- [37]
				"MISC", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["Dispels"] = {
					2, -- [1]
				},
				["Healing"] = {
					47, -- [1]
				},
				["DamageTaken"] = {
					3588, -- [1]
				},
				["RageGain"] = {
					129, -- [1]
				},
				["HOT_Time"] = {
					3, -- [1]
				},
				["TimeDamage"] = {
					32.16, -- [1]
				},
				["HealingTaken"] = {
					47, -- [1]
				},
				["ActiveTime"] = {
					33.66, -- [1]
				},
				["DOT_Time"] = {
					15, -- [1]
				},
				["Damage"] = {
					7851, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "不带头大哥",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 15,
			["type"] = "Ungrouped",
			["LastHealTime"] = 7311.22,
			["LastDamageTaken"] = 225,
			["TimeLast"] = {
				["TimeHeal"] = 7310.269,
				["Dispelled"] = 7669.261,
				["Dispels"] = 7669.261,
				["OVERALL"] = 8263.258,
				["DamageTaken"] = 8263.258,
				["HealingTaken"] = 7310.269,
				["RageGain"] = 7686.262,
				["HOT_Time"] = 7310.269,
				["TimeDamage"] = 7686.262,
				["Healing"] = 7310.269,
				["ActiveTime"] = 7686.262,
				["DOT_Time"] = 7675.261,
				["Damage"] = 7677.261,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4699, -- [1]
				4699, -- [2]
				4699, -- [3]
				4699, -- [4]
				4699, -- [5]
				4699, -- [6]
				4699, -- [7]
				4699, -- [8]
				4699, -- [9]
				4699, -- [10]
				4699, -- [11]
				4699, -- [12]
				4699, -- [13]
				4699, -- [14]
				4699, -- [15]
				4699, -- [16]
				4699, -- [17]
				4699, -- [18]
				4699, -- [19]
				4699, -- [20]
				4699, -- [21]
				4699, -- [22]
				4699, -- [23]
				4699, -- [24]
				4699, -- [25]
				4699, -- [26]
				4699, -- [27]
				4699, -- [28]
				4699, -- [29]
				4699, -- [30]
				4699, -- [31]
				4699, -- [32]
				4699, -- [33]
				4699, -- [34]
				4699, -- [35]
				4699, -- [36]
				4699, -- [37]
				4699, -- [38]
				4699, -- [39]
				4699, -- [40]
				4699, -- [41]
				4699, -- [42]
				4699, -- [43]
				4699, -- [44]
				4699, -- [45]
				4699, -- [46]
				4699, -- [47]
				4699, -- [48]
				4819, -- [49]
				4699, -- [50]
			},
			["NextEventNum"] = 3,
			["LastDamageTime"] = 7686.912,
			["LastEvents"] = {
				"麦积烟雨 自动射击 不带头大哥 Hit -278 (Physical)", -- [1]
				"Environment Falling 不带头大哥 Hit -225 (Physical)", -- [2]
				"不带头大哥 重伤 (伤害/跳) 混子战仕-黑龙费尔默 Tick -83 (Physical)", -- [3]
				"不带头大哥 冲锋击昏 大懒猪 Resist (Physical)", -- [4]
				"不带头大哥 肉搏 大懒猪 Hit -340 (Physical)", -- [5]
				"不带头大哥 斩杀 大懒猪 Hit -531 (Physical)", -- [6]
				"Environment Falling 不带头大哥 Hit -532 (Physical)", -- [7]
				"不带头大哥 血之狂热 不带头大哥 Tick +47", -- [8]
				"大懒猪 重伤 (伤害/跳) 不带头大哥 Tick -79 (Physical)", -- [9]
				"大懒猪 重伤 (伤害/跳) 不带头大哥 Tick -72 (Physical)", -- [10]
				"不带头大哥 肉搏 一曲悠扬 Absorb -859 (1)", -- [11]
				"不带头大哥 肉搏 一曲悠扬 Crit -209 (859 被吸收) (Physical)", -- [12]
				"不带头大哥 断筋 一曲悠扬 Hit -59 (Physical)", -- [13]
				"大懒猪 重伤 (伤害/跳) 不带头大哥 Tick -73 (Physical)", -- [14]
				"不带头大哥 拦截昏迷 一曲悠扬 Hit -67 (Physical)", -- [15]
				"不带头大哥 撕裂 黑椒牛柳灬-逐风者 Dodge (Physical)", -- [16]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 不带头大哥 Tick -127 (Nature)", -- [17]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 不带头大哥 Tick -127 (Nature)", -- [18]
				"不带头大哥 冲锋击昏 哎哟喂-火妖鲁西弗隆 Resist (Physical)", -- [19]
				"不带头大哥 断筋 哎哟喂-火妖鲁西弗隆 Hit -28 (Physical)", -- [20]
				"不带头大哥 肉搏 哎哟喂-火妖鲁西弗隆 Hit -320 (Physical)", -- [21]
				"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 不带头大哥 Tick -115 (Nature)", -- [22]
				"不带头大哥 肉搏 龙九爷-黑龙费尔默 Hit -378 (Physical)", -- [23]
				"不带头大哥 断筋 龙九爷-黑龙费尔默 Crit -74 (Physical)", -- [24]
				"不带头大哥 致死打击 龙九爷-黑龙费尔默 Hit -476 (Physical)", -- [25]
				"龙九爷-黑龙费尔默 驱散射击 不带头大哥 Hit -55 (Physical)", -- [26]
				"不带头大哥 重伤 (伤害/跳) 龙九爷-黑龙费尔默 Tick -78 (Physical)", -- [27]
				"不带头大哥 断筋 盗克盗-逐风者 Hit -35 (Physical)", -- [28]
				"不带头大哥 肉搏 盗克盗-逐风者 Hit -353 (Physical)", -- [29]
				"不带头大哥 断筋 哎哟喂-火妖鲁西弗隆 Hit -31 (Physical)", -- [30]
				"不带头大哥 肉搏 哎哟喂-火妖鲁西弗隆 Dodge (1)", -- [31]
				"哎哟喂-火妖鲁西弗隆 肉搏 不带头大哥 Hit -303 (Physical)", -- [32]
				"不带头大哥 压制 哎哟喂-火妖鲁西弗隆 Crit -679 (Physical)", -- [33]
				"哎哟喂-火妖鲁西弗隆 摔绊 不带头大哥 Hit -38 (Physical)", -- [34]
				"不带头大哥 dispels 不带头大哥 强化摔绊 (逃命专家)", -- [35]
				"不带头大哥 dispels 不带头大哥 强化摔绊 (逃命专家)", -- [36]
				"不带头大哥 dispels 不带头大哥 摔绊 (逃命专家)", -- [37]
				"不带头大哥 dispels 不带头大哥 摔绊 (逃命专家)", -- [38]
				"不带头大哥 重伤 (伤害/跳) 哎哟喂-火妖鲁西弗隆 Tick -85 (Physical)", -- [39]
				"不带头大哥 重伤 (伤害/跳) 哎哟喂-火妖鲁西弗隆 Tick -85 (Physical)", -- [40]
				"不带头大哥 肉搏 哎哟喂-火妖鲁西弗隆 Crit -690 (Physical)", -- [41]
				"不带头大哥 斩杀 哎哟喂-火妖鲁西弗隆 Miss (Physical)", -- [42]
				"不带头大哥 斩杀 哎哟喂-火妖鲁西弗隆 Hit -453 (Physical)", -- [43]
				"不带头大哥 重伤 (伤害/跳) 哎哟喂-火妖鲁西弗隆 Tick -85 (Physical)", -- [44]
				"不带头大哥 肉搏 哎哟喂-火妖鲁西弗隆 Hit -358 (Physical)", -- [45]
				"不带头大哥 斩杀 哎哟喂-火妖鲁西弗隆 Crit -914 (Physical)", -- [46]
				"不带头大哥 冲锋击昏 我想问题不大-黑龙费尔默 Resist (Physical)", -- [47]
				"Environment Falling 不带头大哥 Hit -350 (Physical)", -- [48]
				"Environment Falling 不带头大哥 Hit -381 (Physical)", -- [49]
				"哎哟喂-火妖鲁西弗隆 自动射击 不带头大哥 Crit -833 (Physical)", -- [50]
			},
			["Name"] = "不带头大哥",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				8226.716, -- [1]
				8263.392, -- [2]
				7037.968, -- [3]
				7167.81, -- [4]
				7168.31, -- [5]
				7168.576, -- [6]
				7283.918000000001, -- [7]
				7311.22, -- [8]
				7311.236, -- [9]
				7314.236, -- [10]
				7315.27, -- [11]
				7315.27, -- [12]
				7315.453, -- [13]
				7317.237, -- [14]
				7317.753, -- [15]
				7466.197, -- [16]
				7603.723, -- [17]
				7606.723, -- [18]
				7608.056000000001, -- [19]
				7608.74, -- [20]
				7609.04, -- [21]
				7609.723, -- [22]
				7625.924, -- [23]
				7626.041, -- [24]
				7627.541, -- [25]
				7628.06, -- [26]
				7629.075, -- [27]
				7645.193, -- [28]
				7646.026, -- [29]
				7665.644, -- [30]
				7665.91, -- [31]
				7666.294, -- [32]
				7667.161, -- [33]
				7667.277, -- [34]
				7669.394, -- [35]
				7669.394, -- [36]
				7669.394, -- [37]
				7669.394, -- [38]
				7670.177000000001, -- [39]
				7673.178, -- [40]
				7673.211, -- [41]
				7673.894, -- [42]
				7675.561000000001, -- [43]
				7676.245, -- [44]
				7677.011, -- [45]
				7677.595, -- [46]
				7686.912, -- [47]
				7763.384, -- [48]
				7852.857, -- [49]
				8226.499, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1336,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 1336,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 833,
								},
							},
							["amount"] = 833,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 278,
								},
							},
							["amount"] = 278,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 225,
								},
							},
							["amount"] = 225,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["混子战仕-黑龙费尔默"] = {
									["count"] = 3,
								},
								["龙九爷-黑龙费尔默"] = {
									["count"] = 3,
								},
								["哎哟喂-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
							},
							["amount"] = 15,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["HealedWho"] = {
						["不带头大哥"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 47,
								},
							},
							["amount"] = 47,
						},
					},
					["RageGainedFrom"] = {
						["不带头大哥"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["怒不可遏"] = {
									["count"] = 4,
								},
								["冲锋"] = {
									["count"] = 105,
								},
							},
							["amount"] = 129,
						},
					},
					["HOT_Time"] = 3,
					["ElementTaken"] = {
						["Physical"] = 2916,
						["Melee"] = 303,
						["Nature"] = 369,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["不带头大哥"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["怒不可遏"] = {
							["Details"] = {
								["不带头大哥"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["冲锋"] = {
							["Details"] = {
								["不带头大哥"] = {
									["count"] = 105,
								},
							},
							["amount"] = 105,
						},
					},
					["Damage"] = 7851,
					["TimeHeal"] = 1.5,
					["Dispels"] = 2,
					["ElementDone"] = {
						["Melee"] = 4088,
						["Physical"] = 3763,
					},
					["DamagedWho"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 59,
								},
								["拦截昏迷"] = {
									["count"] = 67,
								},
								["肉搏"] = {
									["count"] = 1068,
								},
							},
							["amount"] = 1194,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 83,
								},
								["肉搏"] = {
									["count"] = 581,
								},
							},
							["amount"] = 664,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 353,
								},
								["断筋"] = {
									["count"] = 35,
								},
							},
							["amount"] = 388,
						},
						["大懒猪"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 531,
								},
								["肉搏"] = {
									["count"] = 340,
								},
							},
							["amount"] = 871,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 679,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 255,
								},
								["断筋"] = {
									["count"] = 59,
								},
								["斩杀"] = {
									["count"] = 1367,
								},
								["肉搏"] = {
									["count"] = 1368,
								},
							},
							["amount"] = 3728,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 476,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 78,
								},
								["肉搏"] = {
									["count"] = 378,
								},
							},
							["amount"] = 1006,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1488,
								},
							},
							["amount"] = 1488,
						},
						["大懒猪"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 224,
								},
							},
							["amount"] = 224,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 369,
								},
								["自动射击"] = {
									["count"] = 833,
								},
								["摔绊"] = {
									["count"] = 38,
								},
								["肉搏"] = {
									["count"] = 303,
								},
							},
							["amount"] = 1543,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 55,
								},
							},
							["amount"] = 55,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 278,
								},
							},
							["amount"] = 278,
						},
					},
					["TimeHealing"] = {
						["不带头大哥"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Dispelled"] = 2,
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 33.66,
					["WhoDispelled"] = {
						["不带头大哥"] = {
							["Details"] = {
								["摔绊 (逃命专家)"] = {
									["count"] = 1,
								},
								["强化摔绊 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 47,
									["min"] = 47,
									["count"] = 1,
									["amount"] = 47,
								},
							},
							["count"] = 1,
							["amount"] = 47,
						},
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 859,
					},
					["TimeSpent"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.18,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.18,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.83,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.33,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1.25,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.68,
								},
								["断筋"] = {
									["count"] = 2.18,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2.76,
								},
								["肉搏"] = {
									["count"] = 1.37,
								},
							},
							["amount"] = 12.74,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.12,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.62,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.02,
								},
							},
							["amount"] = 4.02,
						},
						["大懒猪"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2.27,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["不带头大哥"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["撕裂"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 3588,
					["Healing"] = 47,
					["HealingTaken"] = 47,
					["WhoHealed"] = {
						["不带头大哥"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 47,
								},
							},
							["amount"] = 47,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 476,
									["min"] = 476,
									["count"] = 1,
									["amount"] = 476,
								},
							},
							["count"] = 1,
							["amount"] = 476,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 679,
									["min"] = 679,
									["count"] = 1,
									["amount"] = 679,
								},
							},
							["count"] = 1,
							["amount"] = 679,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 85,
									["min"] = 78,
									["count"] = 5,
									["amount"] = 416,
								},
							},
							["count"] = 5,
							["amount"] = 416,
						},
						["撕裂"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 67,
									["min"] = 67,
									["count"] = 1,
									["amount"] = 67,
								},
							},
							["count"] = 1,
							["amount"] = 67,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 74,
									["min"] = 74,
									["count"] = 1,
									["amount"] = 74,
								},
								["Hit"] = {
									["max"] = 59,
									["min"] = 28,
									["count"] = 4,
									["amount"] = 153,
								},
							},
							["count"] = 5,
							["amount"] = 227,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 914,
									["min"] = 914,
									["count"] = 1,
									["amount"] = 914,
								},
								["Hit"] = {
									["max"] = 531,
									["min"] = 453,
									["count"] = 2,
									["amount"] = 984,
								},
							},
							["count"] = 4,
							["amount"] = 1898,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 859,
									["min"] = 859,
									["count"] = 1,
									["amount"] = 859,
								},
								["Crit"] = {
									["max"] = 690,
									["min"] = 209,
									["count"] = 3,
									["amount"] = 1480,
								},
								["Hit"] = {
									["max"] = 378,
									["min"] = 320,
									["count"] = 5,
									["amount"] = 1749,
								},
							},
							["count"] = 10,
							["amount"] = 4088,
						},
					},
					["RageGain"] = 129,
					["DOT_Time"] = 15,
					["TimeDamage"] = 32.16,
					["TimeDamaging"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.18,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.18,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.02,
								},
							},
							["amount"] = 4.02,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.83,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.33,
						},
						["大懒猪"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.27,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2.27,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["撕裂"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.12,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.62,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1.25,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.68,
								},
								["断筋"] = {
									["count"] = 2.18,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2.76,
								},
								["肉搏"] = {
									["count"] = 1.37,
								},
							},
							["amount"] = 12.74,
						},
					},
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["不带头大哥"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 22,
						},
					},
					["DispelledWho"] = {
						["不带头大哥"] = {
							["Details"] = {
								["摔绊 (逃命专家)"] = {
									["count"] = 1,
								},
								["强化摔绊 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 7033.267,
			["LastActive"] = 8263.258,
		},
		["刀刀丨烈火"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
					},
					["Messages"] = {
						"混子战仕-黑龙费尔默 拦截昏迷 刀刀丨烈火 Hit -31 (Physical)", -- [1]
						"混子战仕-黑龙费尔默 撕裂 (伤害/跳) 刀刀丨烈火 Tick -26 (Physical)", -- [2]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Hit -93 (Physical)", -- [3]
						"龙九爷-黑龙费尔默 奥术射击 刀刀丨烈火 Hit -141 (Arcane)", -- [4]
						"猫头鹰 肉搏 刀刀丨烈火 Hit -54 (Physical)", -- [5]
						"猫头鹰 尖啸 刀刀丨烈火 Hit -21 (Physical)", -- [6]
						"混子战仕-黑龙费尔默 肉搏 刀刀丨烈火 Parry (1)", -- [7]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Hit -89 (Physical)", -- [8]
						"猫头鹰 尖啸 刀刀丨烈火 Hit -34 (Physical)", -- [9]
						"猫头鹰 肉搏 刀刀丨烈火 Hit -74 (Physical)", -- [10]
						"龙九爷-黑龙费尔默 多重射击 刀刀丨烈火 Hit -277 (Physical)", -- [11]
						"混子战仕-黑龙费尔默 撕裂 (伤害/跳) 刀刀丨烈火 Tick -31 (Physical)", -- [12]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Hit -106 (Physical)", -- [13]
						"龙九爷-黑龙费尔默 冰霜箭 刀刀丨烈火 Hit -37 (Frost)", -- [14]
						"麦积烟雨 多重射击 刀刀丨烈火 Hit -362 (Physical)", -- [15]
						"刀刀丨烈火 旋风斩 混子战仕-黑龙费尔默 Dodge (Physical)", -- [16]
						"刀刀丨烈火 旋风斩 猫头鹰 Hit -325 (Physical)", -- [17]
						"猫头鹰 尖啸 刀刀丨烈火 Hit -33 (Physical)", -- [18]
						"哎哟喂-火妖鲁西弗隆 多重射击 刀刀丨烈火 Hit -469 (Physical)", -- [19]
						"哎哟喂-火妖鲁西弗隆 自动射击 刀刀丨烈火 Hit -325 (Physical)", -- [20]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Hit -110 (Physical)", -- [21]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Hit -111 (Physical)", -- [22]
						"混子战仕-黑龙费尔默 撕裂 (伤害/跳) 刀刀丨烈火 Tick -31 (Physical)", -- [23]
						"刀刀丨烈火 拦截昏迷 一曲悠扬 Hit -51 (Physical)", -- [24]
						"刀刀丨烈火 斩杀 一曲悠扬 Hit -511 (Physical)", -- [25]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Crit -278 (Physical)", -- [26]
						"刀刀丨烈火 肉搏 黑椒牛柳灬-逐风者 Hit -531 (Physical)", -- [27]
						"龙九爷-黑龙费尔默 奥术射击 刀刀丨烈火 Hit -173 (Arcane)", -- [28]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Hit -105 (Physical)", -- [29]
						"哎哟喂-火妖鲁西弗隆 瞄准射击 刀刀丨烈火 Hit -639 (Physical)", -- [30]
						"黑椒牛柳灬-逐风者 出血 刀刀丨烈火 Hit -126 (Physical)", -- [31]
						"黑椒牛柳灬-逐风者 灼热武器 刀刀丨烈火 Hit -45 (Fire)", -- [32]
						"哎哟喂-火妖鲁西弗隆 自动射击 刀刀丨烈火 Hit -312 (Physical)", -- [33]
						"龙九爷-黑龙费尔默 毒蛇钉刺 (伤害/跳) 刀刀丨烈火 Tick -128 (Nature)", -- [34]
						"黑椒牛柳灬-逐风者 肉搏 刀刀丨烈火 Hit -142 (Physical)", -- [35]
						"刀刀丨烈火死亡。", -- [36]
					},
					["DeathAt"] = 7259.266000000001,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
					},
					["MessageTimes"] = {
						-9, -- [1]
						-8.516999999999825, -- [2]
						-8.271999999999935, -- [3]
						-8.271999999999935, -- [4]
						-8.050000000000182, -- [5]
						-8.050000000000182, -- [6]
						-7.434000000000197, -- [7]
						-6.817000000000007, -- [8]
						-6.432999999999993, -- [9]
						-6.050000000000182, -- [10]
						-5.567000000000007, -- [11]
						-5.516999999999825, -- [12]
						-5.417000000000371, -- [13]
						-5.417000000000371, -- [14]
						-5.033000000000357, -- [15]
						-4.882999999999811, -- [16]
						-4.882999999999811, -- [17]
						-4.833000000000538, -- [18]
						-4.550000000000182, -- [19]
						-4.382999999999811, -- [20]
						-4.100000000000364, -- [21]
						-2.682999999999993, -- [22]
						-2.5, -- [23]
						-2.367000000000189, -- [24]
						-1.760000000000218, -- [25]
						-1.649000000000342, -- [26]
						-1.550000000000182, -- [27]
						-1.416000000000167, -- [28]
						-1.016999999999825, -- [29]
						-0.6660000000001673, -- [30]
						-0.3659999999999855, -- [31]
						-0.3659999999999855, -- [32]
						-0.25, -- [33]
						-0.1329999999998108, -- [34]
						-0.03300000000035652, -- [35]
						0, -- [36]
					},
					["HealthMax"] = {
						4409, -- [1]
						4409, -- [2]
						4409, -- [3]
						4409, -- [4]
						4409, -- [5]
						4409, -- [6]
						4409, -- [7]
						4409, -- [8]
						4409, -- [9]
						4409, -- [10]
						5070, -- [11]
						5070, -- [12]
						5070, -- [13]
						5070, -- [14]
						5070, -- [15]
						5070, -- [16]
						5070, -- [17]
						5070, -- [18]
						5070, -- [19]
						5070, -- [20]
						5070, -- [21]
						5070, -- [22]
						5070, -- [23]
						5070, -- [24]
						5070, -- [25]
						5070, -- [26]
						5070, -- [27]
						5070, -- [28]
						5070, -- [29]
						5070, -- [30]
						5070, -- [31]
						5070, -- [32]
						5070, -- [33]
						5070, -- [34]
						5070, -- [35]
						4409, -- [36]
					},
					["Health"] = {
						4149, -- [1]
						4118, -- [2]
						4092, -- [3]
						4092, -- [4]
						3858, -- [5]
						3858, -- [6]
						3783, -- [7]
						3446, -- [8]
						3357, -- [9]
						3323, -- [10]
						3747, -- [11]
						3470, -- [12]
						3439, -- [13]
						3333, -- [14]
						3296, -- [15]
						2934, -- [16]
						2934, -- [17]
						2934, -- [18]
						2901, -- [19]
						2432, -- [20]
						2107, -- [21]
						1997, -- [22]
						1886, -- [23]
						1855, -- [24]
						1855, -- [25]
						1855, -- [26]
						1577, -- [27]
						1577, -- [28]
						1404, -- [29]
						1299, -- [30]
						660, -- [31]
						660, -- [32]
						489, -- [33]
						177, -- [34]
						49, -- [35]
						0, -- [36]
					},
					["KilledBy"] = "黑椒牛柳灬-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"MISC", -- [36]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
					},
					["Messages"] = {
						"刀刀丨烈火 拦截昏迷 一曲悠扬 Absorb -51 (51 被吸收) (Physical)", -- [1]
						"一曲悠扬 魔爆术 刀刀丨烈火 Hit -346 (Arcane)", -- [2]
						"哎哟喂-火妖鲁西弗隆 多重射击 刀刀丨烈火 Hit -466 (Physical)", -- [3]
						"刀刀丨烈火 旋风斩 哎哟喂 Hit -286 (Physical)", -- [4]
						"刀刀丨烈火 旋风斩 豹 Hit -306 (Physical)", -- [5]
						"刀刀丨烈火 肉搏 一曲悠扬 Absorb -147 (1)", -- [6]
						"刀刀丨烈火 旋风斩 一曲悠扬 Hit -310 (147 被吸收) (Physical)", -- [7]
						"刀刀丨烈火 肉搏 一曲悠扬 Crit -831 (Physical)", -- [8]
						"麦积烟雨 多重射击 刀刀丨烈火 Hit -391 (Physical)", -- [9]
						"哎哟喂 肉搏 刀刀丨烈火 Hit -59 (Physical)", -- [10]
						"哎哟喂 爪击 刀刀丨烈火 Hit -41 (Physical)", -- [11]
						"哎哟喂 肉搏 刀刀丨烈火 Hit -56 (Physical)", -- [12]
						"哎哟喂 爪击 刀刀丨烈火 Hit -47 (Physical)", -- [13]
						"哎哟喂-火妖鲁西弗隆 自动射击 刀刀丨烈火 Hit -315 (Physical)", -- [14]
						"哎哟喂-火妖鲁西弗隆 奥术射击 刀刀丨烈火 Hit -216 (Arcane)", -- [15]
						"哎哟喂-火妖鲁西弗隆 自动射击 刀刀丨烈火 Hit -326 (Physical)", -- [16]
						"黑椒牛柳灬-逐风者 肉搏 刀刀丨烈火 Hit -127 (Physical)", -- [17]
						"黑椒牛柳灬-逐风者 肉搏 刀刀丨烈火 Miss (1)", -- [18]
						"哎哟喂-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 刀刀丨烈火 Tick -127 (Nature)", -- [19]
						"黑椒牛柳灬-逐风者 出血 刀刀丨烈火 Hit -133 (Physical)", -- [20]
						"黑椒牛柳灬-逐风者 灼热武器 刀刀丨烈火 Hit -44 (Fire)", -- [21]
						"黑椒牛柳灬-逐风者 刺骨 刀刀丨烈火 Crit -1182 (Physical)", -- [22]
						"龙九爷-黑龙费尔默 自动射击 刀刀丨烈火 Hit -118 (Physical)", -- [23]
						"刀刀丨烈火死亡。", -- [24]
					},
					["DeathAt"] = 7074.27,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-13.65099999999984, -- [1]
						-10.28399999999965, -- [2]
						-9.833999999999833, -- [3]
						-9.36700000000019, -- [4]
						-9.36700000000019, -- [5]
						-9.36700000000019, -- [6]
						-9.36700000000019, -- [7]
						-9.067000000000007, -- [8]
						-9.001000000000204, -- [9]
						-8.86700000000019, -- [10]
						-7.783999999999651, -- [11]
						-7.40099999999984, -- [12]
						-6.15099999999984, -- [13]
						-5.384000000000015, -- [14]
						-2.216999999999644, -- [15]
						-2.216999999999644, -- [16]
						-1.516999999999825, -- [17]
						-1.300000000000182, -- [18]
						-1.184000000000197, -- [19]
						-1.067000000000007, -- [20]
						-1.067000000000007, -- [21]
						-0.0500000000001819, -- [22]
						-0.01699999999982538, -- [23]
						0, -- [24]
					},
					["HealthMax"] = {
						4409, -- [1]
						4409, -- [2]
						4409, -- [3]
						4409, -- [4]
						4409, -- [5]
						4409, -- [6]
						4409, -- [7]
						4409, -- [8]
						4409, -- [9]
						4409, -- [10]
						4409, -- [11]
						4409, -- [12]
						4409, -- [13]
						4409, -- [14]
						4409, -- [15]
						4409, -- [16]
						4409, -- [17]
						4409, -- [18]
						4409, -- [19]
						4409, -- [20]
						4409, -- [21]
						4409, -- [22]
						4409, -- [23]
						4409, -- [24]
					},
					["Health"] = {
						3909, -- [1]
						3909, -- [2]
						3563, -- [3]
						3097, -- [4]
						3097, -- [5]
						3097, -- [6]
						3097, -- [7]
						3097, -- [8]
						3097, -- [9]
						2706, -- [10]
						2647, -- [11]
						2606, -- [12]
						2550, -- [13]
						2503, -- [14]
						2188, -- [15]
						2188, -- [16]
						1646, -- [17]
						1519, -- [18]
						1519, -- [19]
						1392, -- [20]
						1392, -- [21]
						1215, -- [22]
						33, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "龙九爷-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
					},
					["Messages"] = {
						"哎哟喂 肉搏 刀刀丨烈火 Hit -67 (Physical)", -- [1]
						"大懒猪 肉搏 刀刀丨烈火 Hit -80 (Physical)", -- [2]
						"哎哟喂 爪击 刀刀丨烈火 Hit -39 (Physical)", -- [3]
						"刀刀丨烈火 肉搏 大懒猪 Hit -458 (Physical)", -- [4]
						"刀刀丨烈火 旋风斩 哎哟喂 Hit -346 (Physical)", -- [5]
						"刀刀丨烈火 旋风斩 大懒猪 Crit -942 (Physical)", -- [6]
						"哎哟喂-火妖鲁西弗隆 自动射击 刀刀丨烈火 Hit -319 (Physical)", -- [7]
						"哎哟喂 肉搏 刀刀丨烈火 Hit -76 (Physical)", -- [8]
						"哎哟喂 爪击 刀刀丨烈火 Hit -49 (Physical)", -- [9]
						"大懒猪 重伤 (伤害/跳) 刀刀丨烈火 Tick -82 (Physical)", -- [10]
						"哎哟喂 肉搏 刀刀丨烈火 Hit -38 (Physical)", -- [11]
						"哎哟喂 爪击 刀刀丨烈火 Miss (Physical)", -- [12]
						"刀刀丨烈火 肉搏 哎哟喂 Crit -851 (Physical)", -- [13]
						"刀刀丨烈火 断筋 哎哟喂 Hit -32 (Physical)", -- [14]
						"哎哟喂 肉搏 刀刀丨烈火 Hit -39 (Physical)", -- [15]
						"哎哟喂-火妖鲁西弗隆 奥术射击 刀刀丨烈火 Hit -217 (Arcane)", -- [16]
						"大懒猪 重伤 (伤害/跳) 刀刀丨烈火 Tick -82 (Physical)", -- [17]
						"哎哟喂 肉搏 刀刀丨烈火 Hit -39 (Physical)", -- [18]
						"刀刀丨烈火 斩杀 哎哟喂 Hit -630 (Physical)", -- [19]
						"哎哟喂-火妖鲁西弗隆 自动射击 刀刀丨烈火 Hit -316 (Physical)", -- [20]
						"哎哟喂-火妖鲁西弗隆 多重射击 刀刀丨烈火 Hit -441 (Physical)", -- [21]
						"刀刀丨烈火死亡。", -- [22]
					},
					["DeathAt"] = 7002.265,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
					},
					["MessageTimes"] = {
						-8.384000000000015, -- [1]
						-8.333999999999833, -- [2]
						-8.25, -- [3]
						-8.03399999999965, -- [4]
						-7.716999999999644, -- [5]
						-7.716999999999644, -- [6]
						-7.516999999999825, -- [7]
						-6.882999999999811, -- [8]
						-5.799999999999272, -- [9]
						-5.61699999999928, -- [10]
						-5.382999999999811, -- [11]
						-4.182999999999993, -- [12]
						-3.882999999999811, -- [13]
						-3.882999999999811, -- [14]
						-3.882999999999811, -- [15]
						-3.016999999999825, -- [16]
						-2.615999999999985, -- [17]
						-2.382999999999811, -- [18]
						-2.199999999999818, -- [19]
						-2.182999999999993, -- [20]
						-0.01599999999962165, -- [21]
						0, -- [22]
					},
					["HealthMax"] = {
						4409, -- [1]
						4409, -- [2]
						4409, -- [3]
						4409, -- [4]
						4409, -- [5]
						4409, -- [6]
						4409, -- [7]
						4409, -- [8]
						4409, -- [9]
						4409, -- [10]
						4409, -- [11]
						4409, -- [12]
						4409, -- [13]
						4409, -- [14]
						4409, -- [15]
						4409, -- [16]
						4409, -- [17]
						4409, -- [18]
						4409, -- [19]
						4409, -- [20]
						4409, -- [21]
						4409, -- [22]
					},
					["Health"] = {
						1525, -- [1]
						1458, -- [2]
						1378, -- [3]
						1339, -- [4]
						1339, -- [5]
						1339, -- [6]
						1339, -- [7]
						1020, -- [8]
						944, -- [9]
						895, -- [10]
						813, -- [11]
						775, -- [12]
						775, -- [13]
						775, -- [14]
						775, -- [15]
						736, -- [16]
						519, -- [17]
						437, -- [18]
						398, -- [19]
						398, -- [20]
						82, -- [21]
						0, -- [22]
					},
					["KilledBy"] = "哎哟喂-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"MISC", -- [22]
					},
				}, -- [3]
			},
			["TimeLast"] = {
				["TimeHeal"] = 7628.258,
				["OVERALL"] = 8263.258,
				["DamageTaken"] = 8235.266,
				["HealingTaken"] = 7628.258,
				["DeathCount"] = 7257.266000000001,
				["Healing"] = 7628.258,
				["TimeDamage"] = 8263.258,
				["ActiveTime"] = 8263.258,
				["RageGain"] = 8191.263,
				["DOT_Time"] = 8263.258,
				["Damage"] = 8263.258,
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"HEAL", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					7.5, -- [1]
				},
				["Healing"] = {
					120, -- [1]
				},
				["DamageTaken"] = {
					19133, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["HealingTaken"] = {
					120, -- [1]
				},
				["TimeDamage"] = {
					75.21000000000002, -- [1]
				},
				["RageGain"] = {
					179, -- [1]
				},
				["ActiveTime"] = {
					82.71000000000002, -- [1]
				},
				["DOT_Time"] = {
					36, -- [1]
				},
				["Damage"] = {
					21224, -- [1]
				},
			},
			["LastHealTime"] = 7628.775000000001,
			["LastDamageTaken"] = 433,
			["GUID"] = "Player-5458-0361EB6B",
			["LastEventHealth"] = {
				3705, -- [1]
				3839, -- [2]
				3839, -- [3]
				3839, -- [4]
				3628, -- [5]
				3628, -- [6]
				3628, -- [7]
				3628, -- [8]
				3628, -- [9]
				3628, -- [10]
				3895, -- [11]
				3895, -- [12]
				3895, -- [13]
				3895, -- [14]
				3558, -- [15]
				3516, -- [16]
				3516, -- [17]
				3739, -- [18]
				3739, -- [19]
				3739, -- [20]
				4188, -- [21]
				4188, -- [22]
				4409, -- [23]
				4409, -- [24]
				3577, -- [25]
				3577, -- [26]
				3577, -- [27]
				3390, -- [28]
				4409, -- [29]
				1, -- [30]
				4409, -- [31]
				4409, -- [32]
				4182, -- [33]
				4182, -- [34]
				4182, -- [35]
				4202, -- [36]
				4015, -- [37]
				4059, -- [38]
				4315, -- [39]
				4315, -- [40]
				3878, -- [41]
				3878, -- [42]
				3779, -- [43]
				3779, -- [44]
				3779, -- [45]
				3799, -- [46]
				3685, -- [47]
				3685, -- [48]
				3685, -- [49]
				3685, -- [50]
			},
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 15,
			["enClass"] = "WARRIOR",
			["type"] = "Ungrouped",
			["unit"] = "刀刀丨烈火",
			["GuardianReverseGUIDs"] = {
				["联盟军旗"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "Creature-0-5429-489-27643-14465-000049459C",
					},
				},
			},
			["LastEventHealthMax"] = {
				4409, -- [1]
				4409, -- [2]
				4409, -- [3]
				4409, -- [4]
				4409, -- [5]
				4409, -- [6]
				4409, -- [7]
				4409, -- [8]
				4409, -- [9]
				4409, -- [10]
				4409, -- [11]
				4409, -- [12]
				4409, -- [13]
				4409, -- [14]
				4409, -- [15]
				4409, -- [16]
				4409, -- [17]
				4409, -- [18]
				4409, -- [19]
				4409, -- [20]
				4409, -- [21]
				4409, -- [22]
				4409, -- [23]
				4409, -- [24]
				4409, -- [25]
				4409, -- [26]
				4409, -- [27]
				4409, -- [28]
				4409, -- [29]
				4409, -- [30]
				4409, -- [31]
				4409, -- [32]
				4409, -- [33]
				4409, -- [34]
				4409, -- [35]
				4409, -- [36]
				4409, -- [37]
				4409, -- [38]
				4409, -- [39]
				4409, -- [40]
				4409, -- [41]
				4409, -- [42]
				4409, -- [43]
				4409, -- [44]
				4409, -- [45]
				4409, -- [46]
				4409, -- [47]
				4409, -- [48]
				4409, -- [49]
				4409, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"联盟军旗 <刀刀丨烈火>", -- [1]
			},
			["NextEventNum"] = 31,
			["LastDamageTime"] = 8263.892,
			["LastEvents"] = {
				"猫头鹰 尖啸 刀刀丨烈火 Miss (Physical)", -- [1]
				"刀刀丨烈火 肉搏 盗克盗-逐风者 Hit -447 (Physical)", -- [2]
				"盗克盗-逐风者 肉搏 刀刀丨烈火 Dodge (1)", -- [3]
				"盗克盗-逐风者 邪恶攻击 刀刀丨烈火 Hit -211 (Physical)", -- [4]
				"盗克盗-逐风者 肉搏 刀刀丨烈火 Miss (1)", -- [5]
				"刀刀丨烈火 旋风斩 盗克盗-逐风者 Crit -1076 (Physical)", -- [6]
				"刀刀丨烈火 拦截昏迷 盗克盗-逐风者 Hit -49 (Physical)", -- [7]
				"刀刀丨烈火 肉搏 盗克盗-逐风者 Hit -497 (Physical)", -- [8]
				"刀刀丨烈火 重伤 (伤害/跳) 盗克盗-逐风者 Tick -92 (Physical)", -- [9]
				"刀刀丨烈火 斩杀 盗克盗-逐风者 Crit -1217 (Physical)", -- [10]
				"刀刀丨烈火 冲锋击昏 哎哟喂-火妖鲁西弗隆 Resist (Physical)", -- [11]
				"刀刀丨烈火 断筋 哎哟喂-火妖鲁西弗隆 Hit -31 (Physical)", -- [12]
				"刀刀丨烈火 肉搏 哎哟喂-火妖鲁西弗隆 Dodge (1)", -- [13]
				"哎哟喂-火妖鲁西弗隆 肉搏 刀刀丨烈火 Hit -337 (Physical)", -- [14]
				"哎哟喂-火妖鲁西弗隆 摔绊 刀刀丨烈火 Hit -42 (Physical)", -- [15]
				"刀刀丨烈火 肉搏 哎哟喂-火妖鲁西弗隆 Dodge (1)", -- [16]
				"刀刀丨烈火 旋风斩 哎哟喂-火妖鲁西弗隆 Hit -493 (Physical)", -- [17]
				"刀刀丨烈火 冲锋击昏 我想问题不大-黑龙费尔默 Resist (Physical)", -- [18]
				"刀刀丨烈火 肉搏 我想问题不大-黑龙费尔默 Hit -316 (Physical)", -- [19]
				"刀刀丨烈火 斩杀 我想问题不大-黑龙费尔默 Hit -526 (Physical)", -- [20]
				"刀刀丨烈火 肉搏 麦积烟雨 Hit -384 (Physical)", -- [21]
				"刀刀丨烈火 旋风斩 麦积烟雨 Crit -697 (Physical)", -- [22]
				"刀刀丨烈火 重伤 (伤害/跳) 麦积烟雨 Tick -82 (Physical)", -- [23]
				"干锅肥肠 多重射击 刀刀丨烈火 Crit -832 (Physical)", -- [24]
				"刀刀丨烈火 斩杀 麦积烟雨 Dodge (Physical)", -- [25]
				"刀刀丨烈火 肉搏 麦积烟雨 Crit -809 (Physical)", -- [26]
				"要水吗兄弟-逐风者 暴风雪 (伤害/跳) 刀刀丨烈火 Tick -187 (Frost)", -- [27]
				"刀刀丨烈火 拦截昏迷 要水吗兄弟-逐风者 Absorb -66 (66 被吸收) (Physical)", -- [28]
				"Environment Falling 刀刀丨烈火 Hit -433 (Physical)", -- [29]
				"刀刀丨烈火 重伤 (伤害/跳) 麦积烟雨 Tick -82 (Physical)", -- [30]
				"Environment Falling 刀刀丨烈火 Hit -397 (Physical)", -- [31]
				"Environment Falling 刀刀丨烈火 Hit -413 (Physical)", -- [32]
				"刀刀丨烈火 肉搏 黑椒牛柳灬-逐风者 Dodge (1)", -- [33]
				"刀刀丨烈火 断筋 黑椒牛柳灬-逐风者 Hit -35 (Physical)", -- [34]
				"刀刀丨烈火 嗜血 刀刀丨烈火 Hit +20", -- [35]
				"要水吗兄弟-逐风者 暴风雪 (伤害/跳) 刀刀丨烈火 Tick -187 (Frost)", -- [36]
				"刀刀丨烈火 铁皮手雷 要水吗兄弟-逐风者 Absorb -162 (162 被吸收) (Fire)", -- [37]
				"要水吗兄弟-逐风者 冰霜新星 刀刀丨烈火 Hit -101 (Frost)", -- [38]
				"刀刀丨烈火 肉搏 哎哟喂-火妖鲁西弗隆 Hit -367 (Physical)", -- [39]
				"刀刀丨烈火 断筋 哎哟喂-火妖鲁西弗隆 Crit -62 (Physical)", -- [40]
				"刀刀丨烈火 拦截昏迷 哎哟喂-火妖鲁西弗隆 Hit -40 (Physical)", -- [41]
				"一曲悠扬 冰霜新星 刀刀丨烈火 Hit -99 (Frost)", -- [42]
				"刀刀丨烈火 肉搏 哎哟喂-火妖鲁西弗隆 Crit -801 (Physical)", -- [43]
				"刀刀丨烈火 嗜血 哎哟喂-火妖鲁西弗隆 Hit -405 (Physical)", -- [44]
				"刀刀丨烈火 嗜血 刀刀丨烈火 Hit +20", -- [45]
				"刀刀丨烈火 重伤 (伤害/跳) 哎哟喂-火妖鲁西弗隆 Tick -100 (Physical)", -- [46]
				"刀刀丨烈火 断筋 龙九爷-黑龙费尔默 Hit -34 (Physical)", -- [47]
				"刀刀丨烈火 肉搏 龙九爷-黑龙费尔默 Hit -457 (Physical)", -- [48]
				"刀刀丨烈火 嗜血 龙九爷-黑龙费尔默 Hit -416 (Physical)", -- [49]
				"刀刀丨烈火 嗜血 刀刀丨烈火 Hit +20", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["Name"] = "刀刀丨烈火",
			["LastEventTimes"] = {
				7630.325, -- [1]
				7642.492, -- [2]
				7642.742, -- [3]
				7643.609, -- [4]
				7644.109, -- [5]
				7644.642, -- [6]
				7646.609, -- [7]
				7647.176, -- [8]
				7647.676, -- [9]
				7648.109, -- [10]
				7665.494000000001, -- [11]
				7666.51, -- [12]
				7666.527, -- [13]
				7669.761, -- [14]
				7669.811000000001, -- [15]
				7670.011, -- [16]
				7671.161, -- [17]
				7684.812, -- [18]
				7686.312, -- [19]
				7687.379, -- [20]
				8184.879, -- [21]
				8185.313, -- [22]
				8188.33, -- [23]
				8189.13, -- [24]
				8189.230000000001, -- [25]
				8189.230000000001, -- [26]
				8189.896, -- [27]
				8190.646, -- [28]
				8235.9, -- [29]
				8263.892, -- [30]
				7283.134, -- [31]
				7346.372, -- [32]
				7464.547000000001, -- [33]
				7464.813, -- [34]
				7464.813, -- [35]
				7465.247, -- [36]
				7465.597, -- [37]
				7473.497, -- [38]
				7496.449000000001, -- [39]
				7496.732, -- [40]
				7605.74, -- [41]
				7606.14, -- [42]
				7607.123000000001, -- [43]
				7609.123000000001, -- [44]
				7609.14, -- [45]
				7610.14, -- [46]
				7626.441, -- [47]
				7628.458000000001, -- [48]
				7628.758, -- [49]
				7628.775000000001, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["麦积烟雨"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 433,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 433,
					},
					["DOT_Time"] = 3,
					["Damage"] = 82,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 82,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["麦积烟雨"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 82,
								},
							},
							["amount"] = 82,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 433,
								},
							},
							["amount"] = 433,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["麦积烟雨"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 82,
									["min"] = 82,
									["count"] = 1,
									["amount"] = 82,
								},
							},
							["count"] = 1,
							["amount"] = 82,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["麦积烟雨"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneBlock"] = {
						["Physical"] = 5,
					},
					["TimeHealing"] = {
						["刀刀丨烈火"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["盗克盗-逐风者"] = {
									["count"] = 3,
								},
								["哎哟喂"] = {
									["count"] = 12,
								},
								["哎哟喂-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
								["麦积烟雨"] = {
									["count"] = 6,
								},
								["黑椒牛柳灬-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 36,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 18,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 20,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 39,
								},
							},
							["amount"] = 50,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 19133,
					["RageGainedFrom"] = {
						["刀刀丨烈火"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 80,
								},
								["怒不可遏"] = {
									["count"] = 9,
								},
								["冲锋"] = {
									["count"] = 90,
								},
							},
							["amount"] = 179,
						},
					},
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 20,
						},
					},
					["DeathCount"] = 3,
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰霜箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 82.71000000000002,
					["HealingTaken"] = 120,
					["ElementTaken"] = {
						["Frost"] = 3010,
						["Melee"] = 1629,
						["Arcane"] = 2163,
						["Fire"] = 89,
						["Physical"] = 11987,
						["Nature"] = 255,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["刀刀丨烈火"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
						["怒不可遏"] = {
							["Details"] = {
								["刀刀丨烈火"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["冲锋"] = {
							["Details"] = {
								["刀刀丨烈火"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
					},
					["Damage"] = 21224,
					["WhoHealed"] = {
						["刀刀丨烈火"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["TimeHeal"] = 7.5,
					["HealedWho"] = {
						["刀刀丨烈火"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 6,
									["amount"] = 120,
								},
							},
							["count"] = 6,
							["amount"] = 120,
						},
					},
					["DOT_Time"] = 36,
					["Healing"] = 120,
					["ElementDoneAbsorb"] = {
						["Fire"] = 162,
						["Physical"] = 337,
					},
					["DamagedWho"] = {
						["猫头鹰"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 325,
								},
							},
							["amount"] = 325,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1076,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 92,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["斩杀"] = {
									["count"] = 1217,
								},
								["肉搏"] = {
									["count"] = 944,
								},
							},
							["amount"] = 3378,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 35,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 332,
								},
								["肉搏"] = {
									["count"] = 1448,
								},
							},
							["amount"] = 1815,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 34,
								},
								["嗜血"] = {
									["count"] = 416,
								},
								["肉搏"] = {
									["count"] = 457,
								},
							},
							["amount"] = 907,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 162,
								},
								["拦截昏迷"] = {
									["count"] = 139,
								},
							},
							["amount"] = 301,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 526,
								},
								["肉搏"] = {
									["count"] = 316,
								},
							},
							["amount"] = 842,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 477,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
							},
							["amount"] = 519,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 405,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 100,
								},
								["旋风斩"] = {
									["count"] = 493,
								},
								["断筋"] = {
									["count"] = 93,
								},
								["拦截昏迷"] = {
									["count"] = 40,
								},
								["肉搏"] = {
									["count"] = 1168,
								},
							},
							["amount"] = 2299,
						},
						["一曲悠扬"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 511,
								},
								["旋风斩"] = {
									["count"] = 310,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 102,
								},
								["铁皮手雷"] = {
									["count"] = 176,
								},
								["肉搏"] = {
									["count"] = 1489,
								},
							},
							["amount"] = 2625,
						},
						["哎哟喂"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 391,
								},
								["旋风斩"] = {
									["count"] = 632,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 576,
								},
								["断筋"] = {
									["count"] = 101,
								},
								["斩杀"] = {
									["count"] = 630,
								},
								["肉搏"] = {
									["count"] = 1279,
								},
							},
							["amount"] = 3609,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 164,
								},
								["旋风斩"] = {
									["count"] = 697,
								},
								["肉搏"] = {
									["count"] = 1193,
								},
							},
							["amount"] = 2054,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 306,
								},
							},
							["amount"] = 306,
						},
						["大懒猪"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 933,
								},
								["旋风斩"] = {
									["count"] = 1311,
								},
							},
							["amount"] = 2244,
						},
					},
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 416,
									["min"] = 391,
									["count"] = 3,
									["amount"] = 1212,
								},
							},
							["count"] = 3,
							["amount"] = 1212,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 144,
									["min"] = 82,
									["count"] = 12,
									["amount"] = 1264,
								},
							},
							["count"] = 12,
							["amount"] = 1264,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 162,
									["min"] = 162,
									["count"] = 1,
									["amount"] = 162,
								},
								["Hit"] = {
									["max"] = 176,
									["min"] = 176,
									["count"] = 1,
									["amount"] = 176,
								},
							},
							["count"] = 2,
							["amount"] = 338,
						},
						["旋风斩"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit (被格挡)"] = {
									["max"] = 306,
									["min"] = 306,
									["count"] = 1,
									["amount"] = 306,
								},
								["Crit"] = {
									["max"] = 1076,
									["min"] = 697,
									["count"] = 3,
									["amount"] = 2715,
								},
								["Hit"] = {
									["max"] = 493,
									["min"] = 286,
									["count"] = 6,
									["amount"] = 2129,
								},
							},
							["count"] = 11,
							["amount"] = 5150,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 69,
									["min"] = 62,
									["count"] = 2,
									["amount"] = 131,
								},
								["Hit"] = {
									["max"] = 37,
									["min"] = 31,
									["count"] = 5,
									["amount"] = 169,
								},
							},
							["count"] = 7,
							["amount"] = 300,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 51,
									["min"] = 40,
									["count"] = 4,
									["amount"] = 182,
								},
								["Absorb"] = {
									["max"] = 73,
									["min"] = 51,
									["count"] = 3,
									["amount"] = 190,
								},
							},
							["count"] = 7,
							["amount"] = 372,
						},
						["斩杀"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1217,
									["min"] = 1217,
									["count"] = 1,
									["amount"] = 1217,
								},
								["Hit"] = {
									["max"] = 630,
									["min"] = 511,
									["count"] = 3,
									["amount"] = 1667,
								},
							},
							["count"] = 5,
							["amount"] = 2884,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 147,
									["min"] = 147,
									["count"] = 1,
									["amount"] = 147,
								},
								["Crit"] = {
									["max"] = 917,
									["min"] = 801,
									["count"] = 5,
									["amount"] = 4209,
								},
								["Hit"] = {
									["max"] = 531,
									["min"] = 316,
									["count"] = 12,
									["amount"] = 5348,
								},
							},
							["count"] = 21,
							["amount"] = 9704,
						},
					},
					["RageGain"] = 179,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 22,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 12,
								},
							},
							["amount"] = 49,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 21,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["TimeDamage"] = 75.21000000000002,
					["WhoDamaged"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 880,
								},
								["冰锥术"] = {
									["count"] = 1154,
								},
								["魔爆术"] = {
									["count"] = 1200,
								},
								["冰霜新星"] = {
									["count"] = 292,
								},
							},
							["amount"] = 3526,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 211,
								},
							},
							["amount"] = 211,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 127,
								},
								["奥术射击"] = {
									["count"] = 649,
								},
								["摔绊"] = {
									["count"] = 42,
								},
								["瞄准射击"] = {
									["count"] = 639,
								},
								["自动射击"] = {
									["count"] = 2659,
								},
								["多重射击"] = {
									["count"] = 1841,
								},
								["肉搏"] = {
									["count"] = 337,
								},
							},
							["amount"] = 6294,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 128,
								},
								["奥术射击"] = {
									["count"] = 314,
								},
								["自动射击"] = {
									["count"] = 1010,
								},
								["多重射击"] = {
									["count"] = 277,
								},
								["冰霜箭"] = {
									["count"] = 37,
								},
							},
							["amount"] = 1766,
						},
						["干锅肥肠"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 832,
								},
							},
							["amount"] = 832,
						},
						["猫头鹰"] = {
							["Details"] = {
								["尖啸"] = {
									["count"] = 88,
								},
								["肉搏"] = {
									["count"] = 128,
								},
							},
							["amount"] = 216,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 31,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 88,
								},
								["肉搏"] = {
									["count"] = 314,
								},
							},
							["amount"] = 433,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 546,
								},
								["冰霜新星"] = {
									["count"] = 101,
								},
							},
							["amount"] = 647,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1646,
								},
							},
							["amount"] = 1646,
						},
						["大懒猪"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 164,
								},
								["肉搏"] = {
									["count"] = 80,
								},
							},
							["amount"] = 244,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 753,
								},
							},
							["amount"] = 753,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["灼热武器"] = {
									["count"] = 89,
								},
								["刺骨"] = {
									["count"] = 1182,
								},
								["出血"] = {
									["count"] = 259,
								},
								["肉搏"] = {
									["count"] = 269,
								},
							},
							["amount"] = 1799,
						},
						["哎哟喂"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 265,
								},
								["肉搏"] = {
									["count"] = 501,
								},
							},
							["amount"] = 766,
						},
					},
					["ElementDone"] = {
						["Physical"] = 11182,
						["Melee"] = 9704,
						["Fire"] = 338,
					},
					["TimeSpent"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 0.61,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.8,
								},
							},
							["amount"] = 6.91,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.43,
								},
								["肉搏"] = {
									["count"] = 2.07,
								},
							},
							["amount"] = 6,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.27,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.93,
								},
								["肉搏"] = {
									["count"] = 3.21,
								},
							},
							["amount"] = 9.41,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 0.3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.3,
						},
						["哎哟喂"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.82,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 13.82,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 0.9,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 3.8,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.07,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.07,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.15,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.4,
								},
							},
							["amount"] = 12.37,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 0.78,
								},
								["拦截昏迷"] = {
									["count"] = 2.92,
								},
							},
							["amount"] = 3.7,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 0.9,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 5.83,
						},
						["大懒猪"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["刀刀丨烈火"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["TimeDamaging"] = {
						["一曲悠扬"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 0.61,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.8,
								},
							},
							["amount"] = 6.91,
						},
						["盗克盗-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.43,
								},
								["肉搏"] = {
									["count"] = 2.07,
								},
							},
							["amount"] = 6,
						},
						["黑椒牛柳灬-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.27,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.93,
								},
								["肉搏"] = {
									["count"] = 3.21,
								},
							},
							["amount"] = 9.41,
						},
						["龙九爷-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 0.3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.3,
						},
						["混子战仕-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 0.9,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.4,
								},
							},
							["amount"] = 3.8,
						},
						["要水吗兄弟-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 0.78,
								},
								["拦截昏迷"] = {
									["count"] = 2.92,
								},
							},
							["amount"] = 3.7,
						},
						["我想问题不大-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.07,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.07,
						},
						["哎哟喂"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.82,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 13.82,
						},
						["麦积烟雨"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 0.43,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 0.9,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 5.83,
						},
						["哎哟喂-火妖鲁西弗隆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.15,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.4,
								},
							},
							["amount"] = 12.37,
						},
						["大懒猪"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
					},
				},
			},
			["UnitLockout"] = 6906.259,
			["LastActive"] = 8263.258,
		},
	},
	["FightNum"] = 16,
	["CombatTimes"] = {
		{
			6848.271, -- [1]
			6853.272, -- [2]
			"17:02:01", -- [3]
			"17:02:06", -- [4]
			"一曲悠扬", -- [5]
		}, -- [1]
		{
			6855.272, -- [1]
			6868.273, -- [2]
			"17:02:08", -- [3]
			"17:02:21", -- [4]
			"一曲悠扬", -- [5]
		}, -- [2]
		{
			6906.259, -- [1]
			6919.259, -- [2]
			"17:02:59", -- [3]
			"17:03:12", -- [4]
			"一曲悠扬", -- [5]
		}, -- [3]
		{
			6937.261, -- [1]
			7196.262, -- [2]
			"17:03:30", -- [3]
			"17:07:49", -- [4]
			"哎哟喂-火妖鲁西弗隆", -- [5]
		}, -- [4]
		{
			7248.265, -- [1]
			7375.274, -- [2]
			"17:08:41", -- [3]
			"17:10:48", -- [4]
			"混子战仕-黑龙费尔默", -- [5]
		}, -- [5]
		{
			7378.258, -- [1]
			7409.26, -- [2]
			"17:10:51", -- [3]
			"17:11:22", -- [4]
			"Environment", -- [5]
		}, -- [6]
		{
			7457.263, -- [1]
			7620.274, -- [2]
			"17:12:10", -- [3]
			"17:14:53", -- [4]
			"麦积烟雨", -- [5]
		}, -- [7]
		{
			7625.258, -- [1]
			7638.259, -- [2]
			"17:14:59", -- [3]
			"17:15:11", -- [4]
			"龙九爷-黑龙费尔默", -- [5]
		}, -- [8]
		{
			7642.259, -- [1]
			7760.267, -- [2]
			"17:15:15", -- [3]
			"17:17:13", -- [4]
			"盗克盗-逐风者", -- [5]
		}, -- [9]
		{
			7788.269, -- [1]
			7848.273, -- [2]
			"17:17:41", -- [3]
			"17:18:41", -- [4]
			"Environment", -- [5]
		}, -- [10]
		{
			7894.259, -- [1]
			7931.262, -- [2]
			"17:19:27", -- [3]
			"17:20:04", -- [4]
			"干锅肥肠", -- [5]
		}, -- [11]
		{
			8011.267, -- [1]
			8039.269, -- [2]
			"17:21:24", -- [3]
			"17:21:52", -- [4]
			"我想问题不大-黑龙费尔默", -- [5]
		}, -- [12]
		{
			8055.271, -- [1]
			8083.273, -- [2]
			"17:22:09", -- [3]
			"17:22:36", -- [4]
			"要水吗兄弟-逐风者", -- [5]
		}, -- [13]
		{
			8118.258, -- [1]
			8194.263, -- [2]
			"17:23:12", -- [3]
			"17:24:27", -- [4]
			"我想问题不大-黑龙费尔默", -- [5]
		}, -- [14]
		{
			8199.264000000001, -- [1]
			8205.264000000001, -- [2]
			"17:24:32", -- [3]
			"17:24:38", -- [4]
			"Environment", -- [5]
		}, -- [15]
		{
			8206.264000000001, -- [1]
			8273.269, -- [2]
			"17:24:39", -- [3]
			"17:25:46", -- [4]
			"Environment", -- [5]
		}, -- [16]
	},
	["FoughtWho"] = {
	},
}
