
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["LastEventHealth"] = {
				4819, -- [1]
				4819, -- [2]
				4819, -- [3]
				4392, -- [4]
				4392, -- [5]
				4392, -- [6]
				4392, -- [7]
				4359, -- [8]
				4359, -- [9]
				4359, -- [10]
				4359, -- [11]
				4359, -- [12]
				4359, -- [13]
				4359, -- [14]
				3153, -- [15]
				3153, -- [16]
				3153, -- [17]
				3153, -- [18]
				2714, -- [19]
				1629, -- [20]
				1629, -- [21]
				1589, -- [22]
				1589, -- [23]
				1589, -- [24]
				1589, -- [25]
				1089, -- [26]
				1045, -- [27]
				1045, -- [28]
				0, -- [29]
				3200, -- [30]
				2966, -- [31]
				2784, -- [32]
				2784, -- [33]
				2562, -- [34]
				2562, -- [35]
				2438, -- [36]
				2361, -- [37]
				2176, -- [38]
				2055, -- [39]
				1522, -- [40]
				1522, -- [41]
				1522, -- [42]
				1337, -- [43]
				1150, -- [44]
				1150, -- [45]
				1150, -- [46]
				0, -- [47]
				4819, -- [48]
				4819, -- [49]
				4819, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"MISC", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"MISC", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					2, -- [1]
				},
				["RageGain"] = {
					57, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					30.36, -- [1]
				},
				["DOT_Time"] = {
					27, -- [1]
				},
				["TimeDamage"] = {
					30.36, -- [1]
				},
				["DamageTaken"] = {
					11562, -- [1]
				},
				["Damage"] = {
					6861, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						false, -- [21]
						false, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
					},
					["Messages"] = {
						"特变电工 肉搏 Andlen-黑龙费尔默 Crit -753 (Physical)", -- [1]
						"Andlen-黑龙费尔默 肉搏 特变电工 Hit -427 (Physical)", -- [2]
						"特变电工 致死打击 Andlen-黑龙费尔默 Hit -498 (Physical)", -- [3]
						"Andlen-黑龙费尔默 缴械 特变电工 Immune (Physical)", -- [4]
						"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -147 (Physical)", -- [5]
						"Andlen-黑龙费尔默 断筋 特变电工 Hit -33 (Physical)", -- [6]
						"特变电工 肉搏 Andlen-黑龙费尔默 Hit -395 (Physical)", -- [7]
						"Andlen-黑龙费尔默 肉搏 特变电工 Parry (1)", -- [8]
						"特变电工 肉搏 Andlen-黑龙费尔默 Hit -337 (Physical)", -- [9]
						"特变电工 缴械 Andlen-黑龙费尔默 Immune (Physical)", -- [10]
						"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -147 (Physical)", -- [11]
						"Andlen-黑龙费尔默 肉搏 特变电工 Dodge (1)", -- [12]
						"Andlen-黑龙费尔默 致死打击 特变电工 Crit -1206 (Physical)", -- [13]
						"特变电工 致死打击 Andlen-黑龙费尔默 Parry (Physical)", -- [14]
						"特变电工 肉搏 Andlen-黑龙费尔默 Hit -548 (Physical)", -- [15]
						"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -148 (Physical)", -- [16]
						"Andlen-黑龙费尔默 肉搏 特变电工 Hit -439 (Physical)", -- [17]
						"Andlen-黑龙费尔默 压制 特变电工 Crit -1085 (Physical)", -- [18]
						"特变电工 断筋 Andlen-黑龙费尔默 Hit -41 (Physical)", -- [19]
						"Andlen-黑龙费尔默 断筋 特变电工 Hit -40 (Physical)", -- [20]
						"特变电工 旋风斩 Andlen-黑龙费尔默 Hit -426 (Physical)", -- [21]
						"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -134 (Physical)", -- [22]
						"特变电工 肉搏 Andlen-黑龙费尔默 Hit -486 (Physical)", -- [23]
						"Andlen-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -163 (Physical)", -- [24]
						"Andlen-黑龙费尔默 拦截昏迷 特变电工 Hit -44 (Physical)", -- [25]
						"Andlen-黑龙费尔默 肉搏 特变电工 Miss (1)", -- [26]
						"南宫狸猫-火妖鲁西弗隆 多重射击 特变电工 Crit -1063 (Physical)", -- [27]
						"特变电工死亡。", -- [28]
					},
					["DeathAt"] = 4145.641000000001,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
					},
					["MessageTimes"] = {
						-14.36800000000039, -- [1]
						-14.33399999999983, -- [2]
						-14.2510000000002, -- [3]
						-13.26699999999983, -- [4]
						-11.35100000000057, -- [5]
						-11.16800000000058, -- [6]
						-10.96799999999985, -- [7]
						-10.83399999999983, -- [8]
						-8.934000000000196, -- [9]
						-8.851000000000568, -- [10]
						-8.333999999999833, -- [11]
						-7.317000000000007, -- [12]
						-5.884000000000015, -- [13]
						-5.634000000000015, -- [14]
						-5.516999999999825, -- [15]
						-5.351000000000568, -- [16]
						-4.951000000000022, -- [17]
						-4.384000000000015, -- [18]
						-4.134000000000015, -- [19]
						-2.850000000000364, -- [20]
						-2.567000000000007, -- [21]
						-2.350000000000364, -- [22]
						-1.617000000000189, -- [23]
						-1.367000000000189, -- [24]
						-0.9340000000001965, -- [25]
						-0.4340000000001965, -- [26]
						0, -- [27]
						0, -- [28]
					},
					["HealthMax"] = {
						4819, -- [1]
						4819, -- [2]
						4819, -- [3]
						4819, -- [4]
						4819, -- [5]
						4819, -- [6]
						4819, -- [7]
						4819, -- [8]
						4819, -- [9]
						4819, -- [10]
						4819, -- [11]
						4819, -- [12]
						4819, -- [13]
						4819, -- [14]
						4819, -- [15]
						4819, -- [16]
						4819, -- [17]
						4819, -- [18]
						4819, -- [19]
						4819, -- [20]
						4819, -- [21]
						4819, -- [22]
						4819, -- [23]
						4819, -- [24]
						4819, -- [25]
						4819, -- [26]
						4819, -- [27]
						4819, -- [28]
					},
					["Health"] = {
						4819, -- [1]
						4819, -- [2]
						4392, -- [3]
						4392, -- [4]
						4392, -- [5]
						4392, -- [6]
						4359, -- [7]
						4359, -- [8]
						4359, -- [9]
						4359, -- [10]
						4359, -- [11]
						4359, -- [12]
						4359, -- [13]
						3153, -- [14]
						3153, -- [15]
						3153, -- [16]
						3153, -- [17]
						2714, -- [18]
						1629, -- [19]
						1629, -- [20]
						1589, -- [21]
						1589, -- [22]
						1589, -- [23]
						1589, -- [24]
						1089, -- [25]
						1045, -- [26]
						1045, -- [27]
						0, -- [28]
					},
					["KilledBy"] = "南宫狸猫-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"MISC", -- [28]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
					},
					["Messages"] = {
						"小骚蹄-火妖鲁西弗隆 月火术 特变电工 Hit -234 (Arcane)", -- [1]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -182 (Shadow)", -- [2]
						"特变电工 断筋 清风徐自来-火妖鲁西弗隆 Absorb -29 (29 被吸收) (Physical)", -- [3]
						"清风徐自来-火妖鲁西弗隆 虚弱之触 特变电工 Hit -86 (Shadow)", -- [4]
						"特变电工 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -339 (339 被吸收) (1)", -- [5]
						"亿万-火妖鲁西弗隆 dispels 特变电工 强效王者祝福 (净化术)", -- [6]
						"亿万-火妖鲁西弗隆 dispels 特变电工 野性印记 (净化术)", -- [7]
						"清风徐自来-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 特变电工 Tick -123 (Shadow)", -- [8]
						"清风徐自来-火妖鲁西弗隆 心灵震爆 特变电工 Hit -647 (Shadow)", -- [9]
						"特变电工 拳击 清风徐自来-火妖鲁西弗隆 Absorb -20 (20 被吸收) (Physical)", -- [10]
						"小骚蹄-火妖鲁西弗隆 月火术 (伤害/跳) 特变电工 Tick -120 (Arcane)", -- [11]
						"小骚蹄-火妖鲁西弗隆 月火术 特变电工 Hit -263 (Arcane)", -- [12]
						"小骚蹄-火妖鲁西弗隆 虫群 (伤害/跳) 特变电工 Tick -77 (Nature)", -- [13]
						"亿万-火妖鲁西弗隆 肉搏 特变电工 Hit -234 (Physical)", -- [14]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -182 (Shadow)", -- [15]
						"特变电工 断筋 亿万-火妖鲁西弗隆 Hit -18 (Physical)", -- [16]
						"亿万-火妖鲁西弗隆 闪电之盾 特变电工 Hit -222 (Nature)", -- [17]
						"特变电工 肉搏 亿万-火妖鲁西弗隆 Miss (1)", -- [18]
						"清风徐自来-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 特变电工 Tick -124 (Shadow)", -- [19]
						"小骚蹄-火妖鲁西弗隆 虫群 (伤害/跳) 特变电工 Tick -77 (Nature)", -- [20]
						"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -185 (Shadow)", -- [21]
						"小骚蹄-火妖鲁西弗隆 月火术 (伤害/跳) 特变电工 Tick -121 (Arcane)", -- [22]
						"亿万-火妖鲁西弗隆 风暴打击 特变电工 Crit -533 (Physical)", -- [23]
						"特变电工 旋风斩 亿万-火妖鲁西弗隆 Hit -427 (Physical)", -- [24]
						"特变电工 旋风斩 清风徐自来-火妖鲁西弗隆 Absorb -372 (372 被吸收) (Physical)", -- [25]
						"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -185 (Shadow)", -- [26]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -187 (Shadow)", -- [27]
						"亿万-火妖鲁西弗隆 肉搏 特变电工 Crit -609 (Physical)", -- [28]
						"亿万-火妖鲁西弗隆 肉搏 特变电工 Hit -378 (Physical)", -- [29]
						"亿万-火妖鲁西弗隆 肉搏 特变电工 Crit -689 (Physical)", -- [30]
						"特变电工死亡。", -- [31]
					},
					["DeathAt"] = 4072.631,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
					},
					["MessageTimes"] = {
						-7.338000000000193, -- [1]
						-6.371000000000095, -- [2]
						-6.171000000000277, -- [3]
						-6.152000000000044, -- [4]
						-6.104000000000269, -- [5]
						-5.721000000000004, -- [6]
						-5.721000000000004, -- [7]
						-4.888000000000375, -- [8]
						-4.871000000000095, -- [9]
						-4.671000000000277, -- [10]
						-4.338000000000193, -- [11]
						-4.338000000000193, -- [12]
						-3.855000000000018, -- [13]
						-3.50400000000036, -- [14]
						-3.388000000000375, -- [15]
						-3.070000000000164, -- [16]
						-3.055000000000291, -- [17]
						-2.705000000000382, -- [18]
						-1.888000000000375, -- [19]
						-1.854000000000269, -- [20]
						-1.804000000000087, -- [21]
						-1.321000000000367, -- [22]
						-1.104000000000269, -- [23]
						-1.00400000000036, -- [24]
						-1.00400000000036, -- [25]
						-0.8040000000000873, -- [26]
						-0.3710000000000946, -- [27]
						-0.02100000000018554, -- [28]
						-0.02100000000018554, -- [29]
						-0.02100000000018554, -- [30]
						0, -- [31]
					},
					["HealthMax"] = {
						5269, -- [1]
						5269, -- [2]
						5269, -- [3]
						5269, -- [4]
						5269, -- [5]
						5269, -- [6]
						5269, -- [7]
						4819, -- [8]
						4819, -- [9]
						4819, -- [10]
						4819, -- [11]
						4819, -- [12]
						4819, -- [13]
						4819, -- [14]
						4819, -- [15]
						4819, -- [16]
						4819, -- [17]
						4819, -- [18]
						4819, -- [19]
						4819, -- [20]
						4819, -- [21]
						4819, -- [22]
						4819, -- [23]
						4819, -- [24]
						4819, -- [25]
						4819, -- [26]
						4819, -- [27]
						4819, -- [28]
						4819, -- [29]
						4819, -- [30]
						4819, -- [31]
					},
					["Health"] = {
						5269, -- [1]
						4698, -- [2]
						4516, -- [3]
						4516, -- [4]
						4430, -- [5]
						4430, -- [6]
						4430, -- [7]
						4430, -- [8]
						4307, -- [9]
						3660, -- [10]
						3660, -- [11]
						3540, -- [12]
						3277, -- [13]
						3200, -- [14]
						2966, -- [15]
						2784, -- [16]
						2784, -- [17]
						2562, -- [18]
						2562, -- [19]
						2438, -- [20]
						2361, -- [21]
						2176, -- [22]
						2055, -- [23]
						1522, -- [24]
						1522, -- [25]
						1522, -- [26]
						1337, -- [27]
						1150, -- [28]
						1150, -- [29]
						1150, -- [30]
						0, -- [31]
					},
					["KilledBy"] = "亿万-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"MISC", -- [6]
						"MISC", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"MISC", -- [31]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "多重射击",
			["LastFightIn"] = 2,
			["type"] = "Self",
			["LastEventHealthMax"] = {
				4819, -- [1]
				4819, -- [2]
				4819, -- [3]
				4819, -- [4]
				4819, -- [5]
				4819, -- [6]
				4819, -- [7]
				4819, -- [8]
				4819, -- [9]
				4819, -- [10]
				4819, -- [11]
				4819, -- [12]
				4819, -- [13]
				4819, -- [14]
				4819, -- [15]
				4819, -- [16]
				4819, -- [17]
				4819, -- [18]
				4819, -- [19]
				4819, -- [20]
				4819, -- [21]
				4819, -- [22]
				4819, -- [23]
				4819, -- [24]
				4819, -- [25]
				4819, -- [26]
				4819, -- [27]
				4819, -- [28]
				4819, -- [29]
				4819, -- [30]
				4819, -- [31]
				4819, -- [32]
				4819, -- [33]
				4819, -- [34]
				4819, -- [35]
				4819, -- [36]
				4819, -- [37]
				4819, -- [38]
				4819, -- [39]
				4819, -- [40]
				4819, -- [41]
				4819, -- [42]
				4819, -- [43]
				4819, -- [44]
				4819, -- [45]
				4819, -- [46]
				4819, -- [47]
				4819, -- [48]
				4819, -- [49]
				4819, -- [50]
			},
			["LastDamageTaken"] = 1063,
			["Owner"] = false,
			["TimeLast"] = {
				["Dispelled"] = 4064.63,
				["OVERALL"] = 4143.635,
				["DamageTaken"] = 4143.635,
				["RageGain"] = 4142.635,
				["TimeDamage"] = 4142.635,
				["DeathCount"] = 4143.635,
				["ActiveTime"] = 4142.635,
				["DOT_Time"] = 4141.635,
				["Damage"] = 4142.635,
			},
			["NextEventNum"] = 30,
			["LastDamageTime"] = 4142.768,
			["LastEvents"] = {
				"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -70 (Physical)", -- [1]
				"特变电工 肉搏 Andlen-黑龙费尔默 Crit -753 (Physical)", -- [2]
				"Andlen-黑龙费尔默 肉搏 特变电工 Hit -427 (Physical)", -- [3]
				"特变电工 致死打击 Andlen-黑龙费尔默 Hit -498 (Physical)", -- [4]
				"Andlen-黑龙费尔默 缴械 特变电工 Immune (Physical)", -- [5]
				"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -147 (Physical)", -- [6]
				"Andlen-黑龙费尔默 断筋 特变电工 Hit -33 (Physical)", -- [7]
				"特变电工 肉搏 Andlen-黑龙费尔默 Hit -395 (Physical)", -- [8]
				"Andlen-黑龙费尔默 肉搏 特变电工 Parry (1)", -- [9]
				"特变电工 肉搏 Andlen-黑龙费尔默 Hit -337 (Physical)", -- [10]
				"特变电工 缴械 Andlen-黑龙费尔默 Immune (Physical)", -- [11]
				"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -147 (Physical)", -- [12]
				"Andlen-黑龙费尔默 肉搏 特变电工 Dodge (1)", -- [13]
				"Andlen-黑龙费尔默 致死打击 特变电工 Crit -1206 (Physical)", -- [14]
				"特变电工 致死打击 Andlen-黑龙费尔默 Parry (Physical)", -- [15]
				"特变电工 肉搏 Andlen-黑龙费尔默 Hit -548 (Physical)", -- [16]
				"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -148 (Physical)", -- [17]
				"Andlen-黑龙费尔默 肉搏 特变电工 Hit -439 (Physical)", -- [18]
				"Andlen-黑龙费尔默 压制 特变电工 Crit -1085 (Physical)", -- [19]
				"特变电工 断筋 Andlen-黑龙费尔默 Hit -41 (Physical)", -- [20]
				"Andlen-黑龙费尔默 断筋 特变电工 Hit -40 (Physical)", -- [21]
				"特变电工 旋风斩 Andlen-黑龙费尔默 Hit -426 (Physical)", -- [22]
				"特变电工 重伤 (伤害/跳) Andlen-黑龙费尔默 Tick -134 (Physical)", -- [23]
				"特变电工 肉搏 Andlen-黑龙费尔默 Hit -486 (Physical)", -- [24]
				"Andlen-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -163 (Physical)", -- [25]
				"Andlen-黑龙费尔默 拦截昏迷 特变电工 Hit -44 (Physical)", -- [26]
				"Andlen-黑龙费尔默 肉搏 特变电工 Miss (1)", -- [27]
				"南宫狸猫-火妖鲁西弗隆 多重射击 特变电工 Crit -1063 (Physical)", -- [28]
				"特变电工死亡。", -- [29]
				"亿万-火妖鲁西弗隆 肉搏 特变电工 Hit -234 (Physical)", -- [30]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -182 (Shadow)", -- [31]
				"特变电工 断筋 亿万-火妖鲁西弗隆 Hit -18 (Physical)", -- [32]
				"亿万-火妖鲁西弗隆 闪电之盾 特变电工 Hit -222 (Nature)", -- [33]
				"特变电工 肉搏 亿万-火妖鲁西弗隆 Miss (1)", -- [34]
				"清风徐自来-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 特变电工 Tick -124 (Shadow)", -- [35]
				"小骚蹄-火妖鲁西弗隆 虫群 (伤害/跳) 特变电工 Tick -77 (Nature)", -- [36]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -185 (Shadow)", -- [37]
				"小骚蹄-火妖鲁西弗隆 月火术 (伤害/跳) 特变电工 Tick -121 (Arcane)", -- [38]
				"亿万-火妖鲁西弗隆 风暴打击 特变电工 Crit -533 (Physical)", -- [39]
				"特变电工 旋风斩 亿万-火妖鲁西弗隆 Hit -427 (Physical)", -- [40]
				"特变电工 旋风斩 清风徐自来-火妖鲁西弗隆 Absorb -372 (372 被吸收) (Physical)", -- [41]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -185 (Shadow)", -- [42]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -187 (Shadow)", -- [43]
				"亿万-火妖鲁西弗隆 肉搏 特变电工 Crit -609 (Physical)", -- [44]
				"亿万-火妖鲁西弗隆 肉搏 特变电工 Hit -378 (Physical)", -- [45]
				"亿万-火妖鲁西弗隆 肉搏 特变电工 Crit -689 (Physical)", -- [46]
				"特变电工死亡。", -- [47]
				"Environment Falling 特变电工 Hit -370 (Physical)", -- [48]
				"特变电工 断筋 Andlen-黑龙费尔默 Crit -55 (Physical)", -- [49]
				"特变电工 肉搏 Andlen-黑龙费尔默 Hit -247 (Physical)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				4127.934, -- [1]
				4130.017, -- [2]
				4130.051, -- [3]
				4130.134, -- [4]
				4131.118, -- [5]
				4133.034, -- [6]
				4133.217, -- [7]
				4133.417, -- [8]
				4133.551, -- [9]
				4135.451, -- [10]
				4135.534, -- [11]
				4136.051, -- [12]
				4137.068, -- [13]
				4138.501, -- [14]
				4138.751, -- [15]
				4138.868, -- [16]
				4139.034, -- [17]
				4139.434, -- [18]
				4140.001, -- [19]
				4140.251, -- [20]
				4141.535, -- [21]
				4141.818, -- [22]
				4142.035, -- [23]
				4142.768, -- [24]
				4143.018, -- [25]
				4143.451, -- [26]
				4143.951, -- [27]
				4144.385, -- [28]
				4144.385, -- [29]
				4067.531, -- [30]
				4067.647, -- [31]
				4067.965, -- [32]
				4067.98, -- [33]
				4068.33, -- [34]
				4069.147, -- [35]
				4069.181, -- [36]
				4069.231, -- [37]
				4069.714, -- [38]
				4069.931, -- [39]
				4070.031, -- [40]
				4070.031, -- [41]
				4070.231, -- [42]
				4070.664, -- [43]
				4071.014, -- [44]
				4071.014, -- [45]
				4071.014, -- [46]
				4071.035, -- [47]
				4088.932, -- [48]
				4124.9, -- [49]
				4125.1, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Andlen-黑龙费尔默"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4500,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 10,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 25,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 11,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 866,
						["Physical"] = 3634,
					},
					["DOT_Time"] = 15,
					["Damage"] = 4432,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 2766,
						["Physical"] = 1666,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["缴械"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 498,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 646,
								},
								["断筋"] = {
									["count"] = 96,
								},
								["旋风斩"] = {
									["count"] = 426,
								},
								["肉搏"] = {
									["count"] = 2766,
								},
							},
							["amount"] = 4432,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1063,
								},
							},
							["amount"] = 1063,
						},
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1206,
								},
								["压制"] = {
									["count"] = 1085,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 163,
								},
								["断筋"] = {
									["count"] = 73,
								},
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["肉搏"] = {
									["count"] = 866,
								},
							},
							["amount"] = 3437,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["缴械"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.91,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.72,
								},
								["缴械"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 4.43,
								},
							},
							["amount"] = 14.26,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 14.26,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 498,
									["min"] = 498,
									["count"] = 1,
									["amount"] = 498,
								},
							},
							["count"] = 2,
							["amount"] = 498,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 148,
									["min"] = 70,
									["count"] = 5,
									["amount"] = 646,
								},
							},
							["count"] = 5,
							["amount"] = 646,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 426,
									["min"] = 426,
									["count"] = 1,
									["amount"] = 426,
								},
							},
							["count"] = 1,
							["amount"] = 426,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 1,
									["amount"] = 55,
								},
								["Hit"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 1,
									["amount"] = 41,
								},
							},
							["count"] = 2,
							["amount"] = 96,
						},
						["缴械"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 753,
									["min"] = 753,
									["count"] = 1,
									["amount"] = 753,
								},
								["Hit"] = {
									["max"] = 548,
									["min"] = 247,
									["count"] = 5,
									["amount"] = 2013,
								},
							},
							["count"] = 6,
							["amount"] = 2766,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 25,
					["TimeDamage"] = 14.26,
					["TimeDamaging"] = {
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.91,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.72,
								},
								["缴械"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 4.43,
								},
							},
							["amount"] = 14.26,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["亿万-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
								["Andlen-黑龙费尔默"] = {
									["count"] = 15,
								},
							},
							["amount"] = 27,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 9,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
					},
					["DamageTaken"] = 11562,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 27,
								},
								["冲锋"] = {
									["count"] = 30,
								},
							},
							["amount"] = 57,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 1,
									["amount"] = 101,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 101,
							["amount"] = 3,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["缴械"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["缴械"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 30.36,
					["ElementTaken"] = {
						["Frost"] = 590,
						["Melee"] = 2776,
						["Arcane"] = 738,
						["Shadow"] = 1901,
						["Fire"] = 236,
						["Physical"] = 4643,
						["Nature"] = 678,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["Damage"] = 6861,
					["WhoDispelled"] = {
						["亿万-火妖鲁西弗隆"] = {
							["Details"] = {
								["强效王者祝福 (净化术)"] = {
									["count"] = 1,
								},
								["野性印记 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Dispelled"] = 2,
					["ElementDoneAbsorb"] = {
						["Melee"] = 339,
						["Physical"] = 421,
					},
					["ElementTakenResist"] = {
						["Nature"] = 101,
					},
					["DOT_Time"] = 27,
					["DamagedWho"] = {
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 498,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 646,
								},
								["断筋"] = {
									["count"] = 96,
								},
								["旋风斩"] = {
									["count"] = 426,
								},
								["肉搏"] = {
									["count"] = 2766,
								},
							},
							["amount"] = 4432,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 372,
								},
								["断筋"] = {
									["count"] = 29,
								},
								["拳击"] = {
									["count"] = 20,
								},
								["肉搏"] = {
									["count"] = 339,
								},
							},
							["amount"] = 760,
						},
						["亿万-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏 (剑类武器专精)"] = {
									["count"] = 349,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 296,
								},
								["旋风斩"] = {
									["count"] = 427,
								},
								["断筋"] = {
									["count"] = 87,
								},
								["铁皮手雷"] = {
									["count"] = 153,
								},
								["肉搏"] = {
									["count"] = 357,
								},
							},
							["amount"] = 1669,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 498,
									["min"] = 498,
									["count"] = 1,
									["amount"] = 498,
								},
							},
							["count"] = 2,
							["amount"] = 498,
						},
						["肉搏 (剑类武器专精)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 349,
									["min"] = 349,
									["count"] = 1,
									["amount"] = 349,
								},
							},
							["count"] = 1,
							["amount"] = 349,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 148,
									["min"] = 70,
									["count"] = 9,
									["amount"] = 942,
								},
							},
							["count"] = 9,
							["amount"] = 942,
						},
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 1,
									["amount"] = 20,
								},
							},
							["count"] = 1,
							["amount"] = 20,
						},
						["缴械"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 372,
									["min"] = 372,
									["count"] = 1,
									["amount"] = 372,
								},
								["Hit"] = {
									["max"] = 427,
									["min"] = 426,
									["count"] = 2,
									["amount"] = 853,
								},
							},
							["count"] = 3,
							["amount"] = 1225,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
								["Crit"] = {
									["max"] = 69,
									["min"] = 55,
									["count"] = 2,
									["amount"] = 124,
								},
								["Hit"] = {
									["max"] = 41,
									["min"] = 18,
									["count"] = 2,
									["amount"] = 59,
								},
							},
							["count"] = 5,
							["amount"] = 212,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 153,
									["min"] = 153,
									["count"] = 1,
									["amount"] = 153,
								},
							},
							["count"] = 1,
							["amount"] = 153,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 339,
									["min"] = 339,
									["count"] = 1,
									["amount"] = 339,
								},
								["Crit"] = {
									["max"] = 753,
									["min"] = 753,
									["count"] = 1,
									["amount"] = 753,
								},
								["Hit"] = {
									["max"] = 548,
									["min"] = 247,
									["count"] = 6,
									["amount"] = 2370,
								},
							},
							["count"] = 9,
							["amount"] = 3462,
						},
					},
					["RageGain"] = 57,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 9,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 24,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 30.36,
					["WhoDamaged"] = {
						["亿万-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 590,
								},
								["风暴打击"] = {
									["count"] = 533,
								},
								["闪电之盾"] = {
									["count"] = 524,
								},
								["铁皮手雷"] = {
									["count"] = 236,
								},
								["肉搏"] = {
									["count"] = 1910,
								},
							},
							["amount"] = 3793,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 476,
								},
							},
							["amount"] = 476,
						},
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1206,
								},
								["压制"] = {
									["count"] = 1085,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 163,
								},
								["断筋"] = {
									["count"] = 73,
								},
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["肉搏"] = {
									["count"] = 866,
								},
							},
							["amount"] = 3437,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1063,
								},
							},
							["amount"] = 1063,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 247,
								},
								["心灵震爆"] = {
									["count"] = 647,
								},
								["虚弱之触"] = {
									["count"] = 86,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 551,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 370,
								},
							},
							["amount"] = 1901,
						},
						["小骚蹄-火妖鲁西弗隆"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 154,
								},
								["月火术"] = {
									["count"] = 497,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 241,
								},
							},
							["amount"] = 892,
						},
					},
					["ElementDone"] = {
						["Physical"] = 3246,
						["Melee"] = 3462,
						["Fire"] = 153,
					},
					["TimeSpent"] = {
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.91,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.72,
								},
								["缴械"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 4.43,
								},
							},
							["amount"] = 14.26,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 1.43,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 3,
						},
						["亿万-火妖鲁西弗隆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.73,
								},
								["拦截昏迷"] = {
									["count"] = 1.28,
								},
								["断筋"] = {
									["count"] = 2.18,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.41,
								},
							},
							["amount"] = 13.1,
						},
					},
					["TimeDamaging"] = {
						["Andlen-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.91,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.72,
								},
								["缴械"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 4.43,
								},
							},
							["amount"] = 14.26,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 1.43,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 3,
						},
						["亿万-火妖鲁西弗隆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.73,
								},
								["拦截昏迷"] = {
									["count"] = 1.28,
								},
								["断筋"] = {
									["count"] = 2.18,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.41,
								},
							},
							["amount"] = 13.1,
						},
					},
				},
			},
			["UnitLockout"] = 3931.623,
			["LastActive"] = 4143.635,
		},
		["罡风剑气"] = {
			["GUID"] = "Player-5458-030C7ABF",
			["LastEventHealth"] = {
				4391, -- [1]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					4, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 0,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 4,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 3933.623,
				["OVERALL"] = 3933.623,
			},
			["NextEventNum"] = 2,
			["LastEventHealthMax"] = {
				4391, -- [1]
			},
			["LastEvents"] = {
				"Environment Falling 罡风剑气 Hit -4 (Physical)", -- [1]
			},
			["Name"] = "罡风剑气",
			["LastEventIncoming"] = {
				true, -- [1]
			},
			["LastEventTimes"] = {
				3934.156, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 4,
					},
					["DamageTaken"] = 4,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 3933.623,
			["LastActive"] = 3933.623,
		},
		["伊丽丹丿乱疯"] = {
			["GUID"] = "Player-5458-030FD15F",
			["LastEventHealth"] = {
				4699, -- [1]
				4289, -- [2]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					127, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "伊丽丹丿乱疯",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 2,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 92,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 4074.631,
				["OVERALL"] = 4074.631,
			},
			["NextEventNum"] = 3,
			["LastEventHealthMax"] = {
				4699, -- [1]
				4289, -- [2]
			},
			["LastEvents"] = {
				"Environment Falling 伊丽丹丿乱疯 Hit -35 (Physical)", -- [1]
				"Environment Falling 伊丽丹丿乱疯 Hit -92 (Physical)", -- [2]
			},
			["Name"] = "伊丽丹丿乱疯",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
			},
			["LastEventTimes"] = {
				3931.423, -- [1]
				4075.448, -- [2]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 127,
								},
							},
							["amount"] = 127,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 127,
					},
					["DamageTaken"] = 127,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 4074.631,
			["LastActive"] = 4074.631,
		},
		["Allhuakeba"] = {
			["GUID"] = "Player-5458-032B5B51",
			["LastEventHealth"] = {
				4751, -- [1]
				4751, -- [2]
				4751, -- [3]
				4267, -- [4]
				4267, -- [5]
			},
			["LastAttackedBy"] = "南宫狸猫-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"HEAL", -- [2]
				"DAMAGE", -- [3]
				"MISC", -- [4]
				"MISC", -- [5]
			},
			["TimeWindows"] = {
				["Dispelled"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					1.5, -- [1]
				},
				["Dispels"] = {
					1, -- [1]
				},
				["DamageTaken"] = {
					484, -- [1]
				},
				["TimeDamage"] = {
					1.5, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = "Allhuakeba",
			["level"] = 60,
			["LastDamageAbility"] = "自动射击",
			["LastFightIn"] = 1,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 484,
			["TimeLast"] = {
				["Dispelled"] = 4052.63,
				["ActiveTime"] = 3985.628,
				["Dispels"] = 4052.63,
				["OVERALL"] = 4052.63,
				["DamageTaken"] = 4052.63,
				["TimeDamage"] = 3985.628,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4751, -- [1]
				4751, -- [2]
				4751, -- [3]
				4751, -- [4]
				4751, -- [5]
			},
			["NextEventNum"] = 6,
			["LastDamageTime"] = 3985.692,
			["LastEvents"] = {
				"Allhuakeba 制裁之锤 亿万-火妖鲁西弗隆 Resist (Holy)", -- [1]
				"Allhuakeba 圣光闪现 特变电工 Hit +390 (201 过量治疗)", -- [2]
				"南宫狸猫-火妖鲁西弗隆 自动射击 Allhuakeba Crit -484 (Physical)", -- [3]
				"Allhuakeba dispels Allhuakeba 蝰蛇钉刺 (清洁术)", -- [4]
				"Allhuakeba dispels Allhuakeba 蝰蛇钉刺 (清洁术)", -- [5]
			},
			["Name"] = "Allhuakeba",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
			},
			["LastEventTimes"] = {
				3985.692, -- [1]
				4023.078, -- [2]
				4052.73, -- [3]
				4053.53, -- [4]
				4053.53, -- [5]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["WhoDispelled"] = {
						["Allhuakeba"] = {
							["Details"] = {
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ActiveTime"] = 1.5,
					["Dispelled"] = 1,
					["Dispels"] = 1,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeSpent"] = {
						["亿万-火妖鲁西弗隆"] = {
							["Details"] = {
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 484,
					["PartialAbsorb"] = {
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["Attacks"] = {
						["制裁之锤"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["亿万-火妖鲁西弗隆"] = {
							["Details"] = {
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 484,
					},
					["WhoDamaged"] = {
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 484,
								},
							},
							["amount"] = 484,
						},
					},
					["DispelledWho"] = {
						["Allhuakeba"] = {
							["Details"] = {
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 4022.628,
			["LastActive"] = 4052.63,
		},
		["给我滚-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-031B7261",
			["LastEventHealth"] = {
				3781, -- [1]
				3440, -- [2]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					407, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = "给我滚-火妖鲁西弗隆",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 3,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 297,
			["Owner"] = false,
			["TimeLast"] = {
				["DamageTaken"] = 4155.635,
				["OVERALL"] = 4155.635,
			},
			["NextEventNum"] = 3,
			["LastEventHealthMax"] = {
				3781, -- [1]
				3440, -- [2]
			},
			["LastEvents"] = {
				"Environment Falling 给我滚-火妖鲁西弗隆 Hit -110 (Physical)", -- [1]
				"Environment Falling 给我滚-火妖鲁西弗隆 Hit -297 (Physical)", -- [2]
			},
			["Name"] = "给我滚-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
			},
			["LastEventTimes"] = {
				3933.739, -- [1]
				4156.535, -- [2]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 407,
								},
							},
							["amount"] = 407,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 407,
					},
					["DamageTaken"] = 407,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 4155.635,
			["LastActive"] = 4155.635,
		},
	},
	["FightNum"] = 3,
	["CombatTimes"] = {
		{
			3977.625, -- [1]
			3994.626, -- [2]
			"23:57:50", -- [3]
			"23:58:06", -- [4]
			"亿万-火妖鲁西弗隆", -- [5]
		}, -- [1]
		{
			4052.63, -- [1]
			4071.631, -- [2]
			"23:59:04", -- [3]
			"23:59:23", -- [4]
			"南宫狸猫-火妖鲁西弗隆", -- [5]
		}, -- [2]
		{
			4124.634, -- [1]
			4144.635, -- [2]
			"00:00:16", -- [3]
			"00:00:36", -- [4]
			"Andlen-黑龙费尔默", -- [5]
		}, -- [3]
	},
	["FoughtWho"] = {
	},
}
