
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["哔哔妹-老马布兰契"] = {
			["GUID"] = "Player-5447-02F2D270",
			["LastEventHealth"] = {
				4479, -- [1]
				4479, -- [2]
				4303, -- [3]
				4215, -- [4]
				4215, -- [5]
				2028, -- [6]
				1263, -- [7]
				1103, -- [8]
				1042, -- [9]
				1042, -- [10]
				439, -- [11]
				391, -- [12]
				287, -- [13]
				33, -- [14]
				0, -- [15]
				3219, -- [16]
				3135, -- [17]
				3135, -- [18]
				3135, -- [19]
				3135, -- [20]
				3135, -- [21]
				3135, -- [22]
				2789, -- [23]
				2789, -- [24]
				2427, -- [25]
				3429, -- [26]
				3429, -- [27]
				3429, -- [28]
				3429, -- [29]
				3237, -- [30]
				3237, -- [31]
				3237, -- [32]
				3237, -- [33]
				3046, -- [34]
				3046, -- [35]
				2854, -- [36]
				2854, -- [37]
				2662, -- [38]
				2125, -- [39]
				1939, -- [40]
				1754, -- [41]
				1754, -- [42]
				1568, -- [43]
				1568, -- [44]
				1568, -- [45]
				1568, -- [46]
				4479, -- [47]
				4479, -- [48]
				4479, -- [49]
				4479, -- [50]
			},
			["LastAttackedBy"] = "芬达么有糖-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"MISC", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"HEAL", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["HealingTaken"] = {
					1385, -- [1]
				},
				["TimeDamage"] = {
					85.69000000000001, -- [1]
				},
				["ActiveTime"] = {
					85.69000000000001, -- [1]
				},
				["DOT_Time"] = {
					15, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					7098, -- [1]
				},
				["Damage"] = {
					42633, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
					},
					["Messages"] = {
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -160 (Shadow)", -- [1]
						"乌勒哈姆 肉搏 哔哔妹-老马布兰契 Hit -61 (Physical)", -- [2]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -255 (Shadow)", -- [3]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 哔哔妹-老马布兰契 Tick -348 (Shadow)", -- [4]
						"乌勒哈姆 肉搏 哔哔妹-老马布兰契 Hit -48 (Physical)", -- [5]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 哔哔妹-老马布兰契 Tick -104 (Shadow)", -- [6]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -254 (Shadow)", -- [7]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 哔哔妹-老马布兰契 Tick -348 (Shadow)", -- [8]
						"哔哔妹-老马布兰契死亡。", -- [9]
					},
					["DeathAt"] = 23285.335,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["MessageTimes"] = {
						-5.049999999999272, -- [1]
						-4.816999999999098, -- [2]
						-3.049999999999272, -- [3]
						-3.016999999999825, -- [4]
						-2.815999999998894, -- [5]
						-2.549999999999272, -- [6]
						-1.049999999999272, -- [7]
						-0.01699999999982538, -- [8]
						0, -- [9]
					},
					["HealthMax"] = {
						4479, -- [1]
						4479, -- [2]
						4479, -- [3]
						4479, -- [4]
						4479, -- [5]
						4479, -- [6]
						4479, -- [7]
						4479, -- [8]
						4479, -- [9]
					},
					["Health"] = {
						1263, -- [1]
						1103, -- [2]
						1042, -- [3]
						1042, -- [4]
						439, -- [5]
						391, -- [6]
						287, -- [7]
						33, -- [8]
						0, -- [9]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "旋风斩",
			["LastFightIn"] = 12,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				4479, -- [1]
				4479, -- [2]
				4479, -- [3]
				4479, -- [4]
				4479, -- [5]
				4479, -- [6]
				4479, -- [7]
				4479, -- [8]
				4479, -- [9]
				4479, -- [10]
				4479, -- [11]
				4479, -- [12]
				4479, -- [13]
				4479, -- [14]
				4479, -- [15]
				4479, -- [16]
				4479, -- [17]
				4479, -- [18]
				4479, -- [19]
				4479, -- [20]
				4479, -- [21]
				4479, -- [22]
				4479, -- [23]
				4479, -- [24]
				4479, -- [25]
				4479, -- [26]
				4479, -- [27]
				4479, -- [28]
				4479, -- [29]
				4479, -- [30]
				4479, -- [31]
				4479, -- [32]
				4479, -- [33]
				4479, -- [34]
				4479, -- [35]
				4479, -- [36]
				4479, -- [37]
				4479, -- [38]
				4479, -- [39]
				4479, -- [40]
				4479, -- [41]
				4479, -- [42]
				4479, -- [43]
				4479, -- [44]
				4479, -- [45]
				4479, -- [46]
				4479, -- [47]
				4479, -- [48]
				4479, -- [49]
				4479, -- [50]
			},
			["LastDamageTaken"] = 362,
			["TimeLast"] = {
				["OVERALL"] = 23501.33,
				["DamageTaken"] = 23496.33,
				["HealingTaken"] = 23501.33,
				["DeathCount"] = 23283.334,
				["TimeDamage"] = 23496.33,
				["Healing"] = 22645.332,
				["ActiveTime"] = 23496.33,
				["DOT_Time"] = 22954.332,
				["Damage"] = 23496.33,
			},
			["Owner"] = false,
			["Pet"] = {
				"非洲大佬 <哔哔妹-老马布兰契>", -- [1]
			},
			["NextEventNum"] = 26,
			["LastDamageTime"] = 23497.213,
			["LastEvents"] = {
				"哔哔妹-老马布兰契 自动射击 果不其然-逐风者 Hit -459 (Physical)", -- [1]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 哔哔妹-老马布兰契 Tick -176 (59 被抵抗) (Shadow)", -- [2]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -88 (Shadow)", -- [3]
				"哔哔妹-老马布兰契 多重射击 二道沟子靓仔-逐风者 Hit -537 (Physical)", -- [4]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -88 (Shadow)", -- [5]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 哔哔妹-老马布兰契 Tick -72 (Shadow)", -- [6]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -160 (Shadow)", -- [7]
				"乌勒哈姆 肉搏 哔哔妹-老马布兰契 Hit -61 (Physical)", -- [8]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -255 (Shadow)", -- [9]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 哔哔妹-老马布兰契 Tick -348 (Shadow)", -- [10]
				"乌勒哈姆 肉搏 哔哔妹-老马布兰契 Hit -48 (Physical)", -- [11]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 哔哔妹-老马布兰契 Tick -104 (Shadow)", -- [12]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 哔哔妹-老马布兰契 Tick -254 (Shadow)", -- [13]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 哔哔妹-老马布兰契 Tick -348 (Shadow)", -- [14]
				"哔哔妹-老马布兰契死亡。", -- [15]
				"古德斯尼-逐风者 冰霜新星 哔哔妹-老马布兰契 Hit -84 (Frost)", -- [16]
				"哔哔妹-老马布兰契 自动射击 清风徐自来-火妖鲁西弗隆 Absorb -510 (510 被吸收) (Physical)", -- [17]
				"哔哔妹-老马布兰契 自动射击 古德斯尼-逐风者 Hit -454 (Physical)", -- [18]
				"哔哔妹-老马布兰契 多重射击 芬达么有糖-黑龙费尔默 Hit -422 (Physical)", -- [19]
				"哔哔妹-老马布兰契 自动射击 芬达么有糖-黑龙费尔默 Crit -731 (Physical)", -- [20]
				"哔哔妹-老马布兰契 肉搏 芬达么有糖-黑龙费尔默 Hit -114 (Physical)", -- [21]
				"芬达么有糖-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Hit -346 (Physical)", -- [22]
				"哔哔妹-老马布兰契 肉搏 芬达么有糖-黑龙费尔默 Hit -104 (Physical)", -- [23]
				"芬达么有糖-黑龙费尔默 旋风斩 哔哔妹-老马布兰契 Hit -362 (Physical)", -- [24]
				"商山-逐风者 圣光闪现 哔哔妹-老马布兰契 Hit +769", -- [25]
				"哔哔妹-老马布兰契 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -151 (1)", -- [26]
				"哔哔妹-老马布兰契 肉搏 清风徐自来-火妖鲁西弗隆 Crit -96 (151 被吸收) (Physical)", -- [27]
				"哔哔妹-老马布兰契 摔绊 清风徐自来-火妖鲁西弗隆 Absorb -34 (34 被吸收) (Physical)", -- [28]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 哔哔妹-老马布兰契 Tick -192 (Shadow)", -- [29]
				"哔哔妹-老马布兰契 多重射击 清风徐自来-火妖鲁西弗隆 Hit -520 (Physical)", -- [30]
				"哔哔妹-老马布兰契 自动射击 清风徐自来-火妖鲁西弗隆 Hit -382 (Physical)", -- [31]
				"哔哔妹-老马布兰契 驱散射击 清风徐自来-火妖鲁西弗隆 Crit -467 (Physical)", -- [32]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 哔哔妹-老马布兰契 Tick -191 (Shadow)", -- [33]
				"哔哔妹-老马布兰契 自动射击 清风徐自来-火妖鲁西弗隆 Hit -414 (Physical)", -- [34]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 哔哔妹-老马布兰契 Tick -192 (Shadow)", -- [35]
				"哔哔妹-老马布兰契 瞄准射击 清风徐自来-火妖鲁西弗隆 Hit -783 (Physical)", -- [36]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 哔哔妹-老马布兰契 Tick -192 (Shadow)", -- [37]
				"古德斯尼-逐风者 冰锥术 哔哔妹-老马布兰契 Hit -537 (Frost)", -- [38]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 哔哔妹-老马布兰契 Tick -186 (Shadow)", -- [39]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 哔哔妹-老马布兰契 Tick -185 (Shadow)", -- [40]
				"哔哔妹-老马布兰契 多重射击 乌勒哈姆 Hit -521 (Physical)", -- [41]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 哔哔妹-老马布兰契 Tick -186 (Shadow)", -- [42]
				"哔哔妹-老马布兰契 多重射击 取名不能骚气-黑龙费尔默 Hit -705 (Physical)", -- [43]
				"哔哔妹-老马布兰契 自动射击 取名不能骚气-黑龙费尔默 Hit -556 (Physical)", -- [44]
				"哔哔妹-老马布兰契 自动射击 草莓尐布丁-火妖鲁西弗隆 Hit -418 (Physical)", -- [45]
				"哔哔妹-老马布兰契 毒蛇钉刺 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -101 (Nature)", -- [46]
				"哔哔妹-老马布兰契 多重射击 龍雲卿 Hit -500 (Physical)", -- [47]
				"哔哔妹-老马布兰契 自动射击 龍雲卿 Hit -390 (Physical)", -- [48]
				"哔哔妹-老马布兰契 驱散射击 果不其然-逐风者 Crit -552 (Physical)", -- [49]
				"哔哔妹-老马布兰契 瞄准射击 果不其然-逐风者 Hit -880 (Physical)", -- [50]
			},
			["Name"] = "哔哔妹-老马布兰契",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				23006.735, -- [1]
				23007.985, -- [2]
				23008.486, -- [3]
				23009.019, -- [4]
				23010.486, -- [5]
				23044.037, -- [6]
				23279.151, -- [7]
				23279.384, -- [8]
				23281.151, -- [9]
				23281.184, -- [10]
				23281.385, -- [11]
				23281.651, -- [12]
				23283.151, -- [13]
				23284.184, -- [14]
				23284.201, -- [15]
				23487.213, -- [16]
				23489.296, -- [17]
				23492.18, -- [18]
				23492.53, -- [19]
				23494.413, -- [20]
				23495.53, -- [21]
				23496.313, -- [22]
				23497.213, -- [23]
				23497.247, -- [24]
				23501.464, -- [25]
				22929.498, -- [26]
				22929.498, -- [27]
				22929.498, -- [28]
				22931.748, -- [29]
				22932.548, -- [30]
				22932.898, -- [31]
				22933.131, -- [32]
				22934.731, -- [33]
				22936.815, -- [34]
				22937.732, -- [35]
				22940.184, -- [36]
				22940.748, -- [37]
				22943.616, -- [38]
				22943.748, -- [39]
				22946.732, -- [40]
				22949.632, -- [41]
				22949.749, -- [42]
				22949.965, -- [43]
				22950.199, -- [44]
				22953.166, -- [45]
				22955.166, -- [46]
				22997.968, -- [47]
				22998.168, -- [48]
				22999.535, -- [49]
				23006.252, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2370,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 362,
						["Shadow"] = 1469,
						["Melee"] = 455,
						["Frost"] = 84,
					},
					["DOT_Time"] = 0,
					["Damage"] = 2335,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 510,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 218,
						["Physical"] = 2117,
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 454,
								},
							},
							["amount"] = 454,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 510,
								},
							},
							["amount"] = 510,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 731,
								},
								["多重射击"] = {
									["count"] = 422,
								},
								["肉搏"] = {
									["count"] = 218,
								},
							},
							["amount"] = 1371,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 104,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 696,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 669,
								},
							},
							["amount"] = 1469,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 109,
								},
							},
							["amount"] = 109,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 362,
								},
								["肉搏"] = {
									["count"] = 346,
								},
							},
							["amount"] = 708,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.35,
								},
								["肉搏"] = {
									["count"] = 2.62,
								},
							},
							["amount"] = 4.470000000000001,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 769,
								},
							},
							["amount"] = 769,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.47,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 510,
									["min"] = 510,
									["count"] = 1,
									["amount"] = 510,
								},
								["Crit"] = {
									["max"] = 731,
									["min"] = 731,
									["count"] = 1,
									["amount"] = 731,
								},
								["Hit"] = {
									["max"] = 454,
									["min"] = 454,
									["count"] = 1,
									["amount"] = 454,
								},
							},
							["count"] = 3,
							["amount"] = 1695,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 422,
									["min"] = 422,
									["count"] = 1,
									["amount"] = 422,
								},
							},
							["count"] = 1,
							["amount"] = 422,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 114,
									["min"] = 104,
									["count"] = 2,
									["amount"] = 218,
								},
							},
							["count"] = 2,
							["amount"] = 218,
						},
					},
					["HealingTaken"] = 769,
					["RageGain"] = 0,
					["TimeDamage"] = 7.47,
					["TimeDamaging"] = {
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.35,
								},
								["肉搏"] = {
									["count"] = 2.62,
								},
							},
							["amount"] = 4.470000000000001,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["取名不能骚气-黑龙费尔默"] = {
									["count"] = 6,
								},
								["古德斯尼-逐风者"] = {
									["count"] = 6,
								},
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
					},
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.12,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.15,
								},
							},
							["amount"] = 7.270000000000001,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 3.07,
								},
								["肉搏"] = {
									["count"] = 4.12,
								},
							},
							["amount"] = 8.69,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 3,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 0.4,
								},
								["自动射击"] = {
									["count"] = 4.800000000000001,
								},
								["多重射击"] = {
									["count"] = 2.03,
								},
								["驱散射击"] = {
									["count"] = 1.62,
								},
							},
							["amount"] = 13.35,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 3.03,
								},
							},
							["amount"] = 3.03,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.34,
								},
								["自动射击"] = {
									["count"] = 4,
								},
								["多重射击"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 11.34,
						},
						["龍雲卿"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.7,
								},
							},
							["amount"] = 3.2,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.98,
								},
								["驱散射击"] = {
									["count"] = 1.37,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.85,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["火焰灬"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 1.13,
								},
								["猛禽一击"] = {
									["count"] = 1.33,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.18,
								},
								["肉搏"] = {
									["count"] = 4.4,
								},
							},
							["amount"] = 10.04,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.63,
								},
							},
							["amount"] = 1.63,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 3,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["震荡射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 0.23,
								},
								["自动射击"] = {
									["count"] = 7.92,
								},
								["多重射击"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 20.79,
						},
					},
					["DamageTaken"] = 7098,
					["ElementDoneAbsorb"] = {
						["Arcane"] = 198,
						["Physical"] = 2718,
						["Melee"] = 151,
						["Nature"] = 101,
					},
					["PartialResist"] = {
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 59,
									["min"] = 59,
									["count"] = 1,
									["amount"] = 59,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 5,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 85.69000000000001,
					["ElementTaken"] = {
						["Frost"] = 1192,
						["Melee"] = 455,
						["Arcane"] = 452,
						["Physical"] = 832,
						["Shadow"] = 4167,
					},
					["DOT_Time"] = 15,
					["Damage"] = 42633,
					["ElementTakenResist"] = {
						["Shadow"] = 59,
					},
					["Healing"] = 0,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 23,
								},
							},
							["amount"] = 23,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 769,
								},
								["神圣震击"] = {
									["count"] = 616,
								},
							},
							["amount"] = 1385,
						},
					},
					["ElementDone"] = {
						["Arcane"] = 865,
						["Physical"] = 39159,
						["Melee"] = 2105,
						["Nature"] = 504,
					},
					["HealingTaken"] = 1385,
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["自动射击"] = {
									["count"] = 1338,
								},
								["多重射击"] = {
									["count"] = 1018,
								},
								["肉搏"] = {
									["count"] = 156,
								},
							},
							["amount"] = 2613,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 65,
								},
								["自动射击"] = {
									["count"] = 731,
								},
								["多重射击"] = {
									["count"] = 2016,
								},
								["肉搏"] = {
									["count"] = 320,
								},
							},
							["amount"] = 3132,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 202,
								},
								["奥术射击"] = {
									["count"] = 197,
								},
								["瞄准射击"] = {
									["count"] = 2475,
								},
								["自动射击"] = {
									["count"] = 3746,
								},
								["多重射击"] = {
									["count"] = 3649,
								},
								["驱散射击"] = {
									["count"] = 830,
								},
							},
							["amount"] = 11099,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 2915,
								},
							},
							["amount"] = 2915,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 201,
								},
								["瞄准射击"] = {
									["count"] = 413,
								},
								["自动射击"] = {
									["count"] = 3025,
								},
								["多重射击"] = {
									["count"] = 2336,
								},
								["肉搏"] = {
									["count"] = 799,
								},
							},
							["amount"] = 6774,
						},
						["龍雲卿"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 500,
								},
								["自动射击"] = {
									["count"] = 796,
								},
							},
							["amount"] = 1296,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 894,
								},
								["驱散射击"] = {
									["count"] = 552,
								},
								["瞄准射击"] = {
									["count"] = 880,
								},
							},
							["amount"] = 2326,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 537,
								},
							},
							["amount"] = 537,
						},
						["火焰灬"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 252,
								},
								["摔绊"] = {
									["count"] = 125,
								},
								["驱散射击"] = {
									["count"] = 239,
								},
								["自动射击"] = {
									["count"] = 485,
								},
								["多重射击"] = {
									["count"] = 592,
								},
								["肉搏"] = {
									["count"] = 311,
								},
							},
							["amount"] = 2004,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1822,
								},
							},
							["amount"] = 1822,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 668,
								},
								["瞄准射击"] = {
									["count"] = 783,
								},
								["摔绊"] = {
									["count"] = 34,
								},
								["驱散射击"] = {
									["count"] = 467,
								},
								["自动射击"] = {
									["count"] = 2940,
								},
								["多重射击"] = {
									["count"] = 2704,
								},
								["肉搏"] = {
									["count"] = 519,
								},
							},
							["amount"] = 8115,
						},
					},
					["TimeDamage"] = 85.69000000000001,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.12,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.15,
								},
							},
							["amount"] = 7.270000000000001,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 3.07,
								},
								["肉搏"] = {
									["count"] = 4.12,
								},
							},
							["amount"] = 8.69,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 3,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 0.4,
								},
								["自动射击"] = {
									["count"] = 4.800000000000001,
								},
								["多重射击"] = {
									["count"] = 2.03,
								},
								["驱散射击"] = {
									["count"] = 1.62,
								},
							},
							["amount"] = 13.35,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 3.03,
								},
							},
							["amount"] = 3.03,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.34,
								},
								["自动射击"] = {
									["count"] = 4,
								},
								["多重射击"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 11.34,
						},
						["龍雲卿"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.7,
								},
							},
							["amount"] = 3.2,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.98,
								},
								["驱散射击"] = {
									["count"] = 1.37,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.85,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["火焰灬"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 1.13,
								},
								["猛禽一击"] = {
									["count"] = 1.33,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.18,
								},
								["肉搏"] = {
									["count"] = 4.4,
								},
							},
							["amount"] = 10.04,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.63,
								},
							},
							["amount"] = 1.63,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 3,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["震荡射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 0.23,
								},
								["自动射击"] = {
									["count"] = 7.92,
								},
								["多重射击"] = {
									["count"] = 2.14,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 20.79,
						},
					},
					["Attacks"] = {
						["摔绊"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 34,
									["min"] = 34,
									["count"] = 1,
									["amount"] = 34,
								},
								["Crit"] = {
									["max"] = 65,
									["min"] = 65,
									["count"] = 1,
									["amount"] = 65,
								},
								["Hit"] = {
									["max"] = 42,
									["min"] = 41,
									["count"] = 3,
									["amount"] = 125,
								},
							},
							["count"] = 5,
							["amount"] = 224,
						},
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 538,
									["min"] = 409,
									["count"] = 3,
									["amount"] = 1457,
								},
								["Crit"] = {
									["max"] = 1174,
									["min"] = 731,
									["count"] = 3,
									["amount"] = 3057,
								},
								["Hit"] = {
									["max"] = 556,
									["min"] = 382,
									["count"] = 21,
									["amount"] = 9441,
								},
							},
							["count"] = 27,
							["amount"] = 13955,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2475,
									["min"] = 2475,
									["count"] = 1,
									["amount"] = 2475,
								},
								["Hit"] = {
									["max"] = 880,
									["min"] = 413,
									["count"] = 3,
									["amount"] = 2076,
								},
							},
							["count"] = 4,
							["amount"] = 4551,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 1,
									["amount"] = 101,
								},
								["Tick"] = {
									["max"] = 101,
									["min"] = 100,
									["count"] = 4,
									["amount"] = 403,
								},
							},
							["count"] = 5,
							["amount"] = 504,
						},
						["奥术射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 198,
									["min"] = 198,
									["count"] = 1,
									["amount"] = 198,
								},
								["Crit"] = {
									["max"] = 470,
									["min"] = 470,
									["count"] = 1,
									["amount"] = 470,
								},
								["Hit"] = {
									["max"] = 197,
									["min"] = 197,
									["count"] = 1,
									["amount"] = 197,
								},
							},
							["count"] = 3,
							["amount"] = 865,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 252,
									["min"] = 252,
									["count"] = 1,
									["amount"] = 252,
								},
							},
							["count"] = 1,
							["amount"] = 252,
						},
						["震荡射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 574,
									["min"] = 467,
									["count"] = 3,
									["amount"] = 1593,
								},
								["Hit"] = {
									["max"] = 256,
									["min"] = 239,
									["count"] = 2,
									["amount"] = 495,
								},
							},
							["count"] = 5,
							["amount"] = 2088,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1617,
									["min"] = 1124,
									["count"] = 7,
									["amount"] = 9110,
								},
								["Hit"] = {
									["max"] = 705,
									["min"] = 306,
									["count"] = 17,
									["amount"] = 8979,
								},
							},
							["count"] = 24,
							["amount"] = 18089,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 471,
									["min"] = 52,
									["count"] = 6,
									["amount"] = 1378,
								},
								["Crit"] = {
									["max"] = 96,
									["min"] = 96,
									["count"] = 1,
									["amount"] = 96,
								},
								["Hit"] = {
									["max"] = 133,
									["min"] = 82,
									["count"] = 6,
									["amount"] = 631,
								},
							},
							["count"] = 14,
							["amount"] = 2105,
						},
					},
					["WhoDamaged"] = {
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 452,
								},
								["冰锥术"] = {
									["count"] = 537,
								},
								["冰霜新星"] = {
									["count"] = 254,
								},
							},
							["amount"] = 1243,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 362,
								},
								["英勇打击"] = {
									["count"] = 470,
								},
								["肉搏"] = {
									["count"] = 346,
								},
							},
							["amount"] = 1178,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 252,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1388,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1203,
								},
							},
							["amount"] = 2843,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1324,
								},
								["寒冰箭"] = {
									["count"] = 401,
								},
							},
							["amount"] = 1725,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 109,
								},
							},
							["amount"] = 109,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 15,
								},
								["Hit"] = {
									["count"] = 47,
								},
							},
							["amount"] = 66,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 14,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
				},
			},
			["UnitLockout"] = 22027.33,
			["LastActive"] = 23501.33,
		},
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["TimeLast"] = {
				["Interrupts"] = 22689.334,
				["TimeHeal"] = 23497.33,
				["Dispelled"] = 23530.335,
				["Overhealing"] = 23424.326,
				["DeathCount"] = 23363.345,
				["OVERALL"] = 23541.332,
				["DamageTaken"] = 23523.331,
				["Healing"] = 23497.33,
				["ActiveTime"] = 23541.332,
				["RageGain"] = 23538.332,
				["GTFOEvents"] = 23326.337,
				["TimeDamage"] = 23541.332,
				["HealingTaken"] = 23541.332,
				["GTFOEventDamage"] = 23326.337,
				["DOT_Time"] = 23452.327,
				["Damage"] = 23541.332,
			},
			["LastAttackedBy"] = "果不其然-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"HEAL", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"HEAL", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"HEAL", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"HEAL", -- [39]
				"DAMAGE", -- [40]
				"MISC", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					236.62, -- [1]
				},
				["Dispelled"] = {
					15, -- [1]
				},
				["Interrupts"] = {
					2, -- [1]
				},
				["Overhealing"] = {
					300, -- [1]
				},
				["Healing"] = {
					10367, -- [1]
				},
				["DamageTaken"] = {
					117022, -- [1]
				},
				["DeathCount"] = {
					6, -- [1]
				},
				["HealingTaken"] = {
					73447, -- [1]
				},
				["RageGain"] = {
					880, -- [1]
				},
				["GTFOEvents"] = {
					3, -- [1]
				},
				["TimeDamage"] = {
					560.3199999999998, -- [1]
				},
				["ActiveTime"] = {
					796.9399999999991, -- [1]
				},
				["GTFOEventDamage"] = {
					1093, -- [1]
				},
				["DOT_Time"] = {
					294, -- [1]
				},
				["Damage"] = {
					248807, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["level"] = 60,
			["LastDamageAbility"] = "出血",
			["LastFightIn"] = 12,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						false, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
						true, -- [35]
						false, -- [36]
						true, -- [37]
						false, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						false, -- [44]
						true, -- [45]
						true, -- [46]
						false, -- [47]
						true, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"特变电工 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -128 (Physical)", -- [1]
						"取名不能骚气-黑龙费尔默 暗影灼烧 特变电工 Hit -809 (Shadow)", -- [2]
						"特变电工 嗜血 取名不能骚气-黑龙费尔默 Hit -504 (Physical)", -- [3]
						"特变电工 嗜血 特变电工 Hit +20", -- [4]
						"二道沟子靓仔-逐风者 肉搏 特变电工 Hit -246 (Physical)", -- [5]
						"特变电工 治疗药水 特变电工 Hit +1106", -- [6]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -97 (Shadow)", -- [7]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -177 (Fire)", -- [8]
						"特变电工 生命赐福 特变电工 Hit +1073", -- [9]
						"特变电工 断筋 取名不能骚气-黑龙费尔默 Hit -49 (Physical)", -- [10]
						"特变电工 嗜血 特变电工 Hit +20", -- [11]
						"特变电工 重伤 (伤害/跳) 取名不能骚气-黑龙费尔默 Tick -127 (Physical)", -- [12]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -257 (Shadow)", -- [13]
						"特变电工 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -128 (Physical)", -- [14]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -97 (Shadow)", -- [15]
						"特变电工 旋风斩 乌勒哈姆 Dodge (Physical)", -- [16]
						"特变电工 旋风斩 取名不能骚气-黑龙费尔默 Crit -1378 (Physical)", -- [17]
						"特变电工 嗜血 特变电工 Hit +20", -- [18]
						"特变电工 肉搏 取名不能骚气-黑龙费尔默 Hit -539 (Physical)", -- [19]
						"特变电工 嗜血 特变电工 Hit +20", -- [20]
						"灼热图腾 VI 攻击 特变电工 Hit -35 (31 被抵抗) (Fire)", -- [21]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -177 (Fire)", -- [22]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -153 (Shadow)", -- [23]
						"特变电工 斩杀 取名不能骚气-黑龙费尔默 Crit -3025 (Physical)", -- [24]
						"特变电工 嗜血 特变电工 Hit +20", -- [25]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -258 (Shadow)", -- [26]
						"特变电工 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -127 (Physical)", -- [27]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -80 (Shadow)", -- [28]
						"特变电工 肉搏 二道沟子靓仔-逐风者 Hit -406 (Physical)", -- [29]
						"二道沟子靓仔-逐风者 肉搏 特变电工 Hit -257 (Physical)", -- [30]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -153 (Shadow)", -- [31]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -177 (Fire)", -- [32]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -258 (Shadow)", -- [33]
						"特变电工 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -127 (Physical)", -- [34]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -79 (Shadow)", -- [35]
						"特变电工 肉搏 二道沟子靓仔-逐风者 Hit -438 (Physical)", -- [36]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -152 (Shadow)", -- [37]
						"特变电工 嗜血 二道沟子靓仔-逐风者 Hit -389 (Physical)", -- [38]
						"特变电工 嗜血 特变电工 Hit +20", -- [39]
						"二道沟子靓仔-逐风者 肉搏 特变电工 Hit -277 (Physical)", -- [40]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -177 (Fire)", -- [41]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -152 (Shadow)", -- [42]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -258 (Shadow)", -- [43]
						"特变电工 肉搏 二道沟子靓仔-逐风者 Hit -438 (Physical)", -- [44]
						"特变电工 嗜血 特变电工 Hit +20", -- [45]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -79 (Shadow)", -- [46]
						"特变电工 斩杀 二道沟子靓仔-逐风者 Hit -599 (Physical)", -- [47]
						"特变电工 嗜血 特变电工 Hit +20", -- [48]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -208 (Shadow)", -- [49]
						"特变电工死亡。", -- [50]
					},
					["DeathAt"] = 23366.339,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-13.3080000000009, -- [1]
						-13.09100000000035, -- [2]
						-13.00800000000163, -- [3]
						-12.98300000000018, -- [4]
						-12.57400000000052, -- [5]
						-12.29100000000108, -- [6]
						-12.02400000000125, -- [7]
						-11.92399999999907, -- [8]
						-11.75800000000163, -- [9]
						-11.1239999999998, -- [10]
						-11.10800000000018, -- [11]
						-10.6239999999998, -- [12]
						-10.52400000000125, -- [13]
						-10.3080000000009, -- [14]
						-10.02400000000125, -- [15]
						-9.623999999999796, -- [16]
						-9.623999999999796, -- [17]
						-9.604999999999563, -- [18]
						-9.578000000001339, -- [19]
						-9.578000000001339, -- [20]
						-9.458000000002357, -- [21]
						-8.907999999999447, -- [22]
						-8.024000000001251, -- [23]
						-8.024000000001251, -- [24]
						-8.024000000001251, -- [25]
						-7.541000000001077, -- [26]
						-7.307000000000699, -- [27]
						-7.241000000001804, -- [28]
						-6.890999999999622, -- [29]
						-6.757000000001426, -- [30]
						-6.024000000001252, -- [31]
						-5.906999999999243, -- [32]
						-4.541000000001077, -- [33]
						-4.307000000000699, -- [34]
						-4.241000000001804, -- [35]
						-4.207000000002154, -- [36]
						-4.024000000001252, -- [37]
						-3.156999999999243, -- [38]
						-3.135000000002037, -- [39]
						-2.940000000002328, -- [40]
						-2.906999999999243, -- [41]
						-2.024000000001252, -- [42]
						-1.540000000000873, -- [43]
						-1.507000000001426, -- [44]
						-1.490000000001601, -- [45]
						-1.240000000001601, -- [46]
						-1.024000000001252, -- [47]
						-1.001000000000204, -- [48]
						-0.02400000000125147, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						7151, -- [10]
						7151, -- [11]
						7151, -- [12]
						7151, -- [13]
						7151, -- [14]
						7151, -- [15]
						7151, -- [16]
						7151, -- [17]
						7151, -- [18]
						7151, -- [19]
						7151, -- [20]
						7151, -- [21]
						7151, -- [22]
						7151, -- [23]
						7151, -- [24]
						7151, -- [25]
						7151, -- [26]
						7151, -- [27]
						7151, -- [28]
						7151, -- [29]
						7151, -- [30]
						7151, -- [31]
						7151, -- [32]
						7151, -- [33]
						7151, -- [34]
						7151, -- [35]
						7151, -- [36]
						7151, -- [37]
						7151, -- [38]
						7151, -- [39]
						7151, -- [40]
						7151, -- [41]
						7151, -- [42]
						7151, -- [43]
						7151, -- [44]
						7151, -- [45]
						7151, -- [46]
						7151, -- [47]
						7151, -- [48]
						7151, -- [49]
						6219, -- [50]
					},
					["Health"] = {
						1175, -- [1]
						1175, -- [2]
						366, -- [3]
						366, -- [4]
						386, -- [5]
						140, -- [6]
						140, -- [7]
						1149, -- [8]
						972, -- [9]
						2977, -- [10]
						2977, -- [11]
						2997, -- [12]
						2997, -- [13]
						2740, -- [14]
						2740, -- [15]
						2643, -- [16]
						2643, -- [17]
						2643, -- [18]
						2643, -- [19]
						2663, -- [20]
						2683, -- [21]
						2648, -- [22]
						2471, -- [23]
						2471, -- [24]
						2471, -- [25]
						2338, -- [26]
						2080, -- [27]
						2080, -- [28]
						2000, -- [29]
						2000, -- [30]
						1743, -- [31]
						1590, -- [32]
						1413, -- [33]
						1155, -- [34]
						1155, -- [35]
						1076, -- [36]
						1076, -- [37]
						924, -- [38]
						924, -- [39]
						944, -- [40]
						944, -- [41]
						490, -- [42]
						338, -- [43]
						80, -- [44]
						80, -- [45]
						100, -- [46]
						21, -- [47]
						21, -- [48]
						41, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"HEAL", -- [4]
						"DAMAGE", -- [5]
						"HEAL", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"HEAL", -- [9]
						"DAMAGE", -- [10]
						"HEAL", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"HEAL", -- [18]
						"DAMAGE", -- [19]
						"HEAL", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"HEAL", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"HEAL", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"HEAL", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"HEAL", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
					},
					["Messages"] = {
						"熔岩图腾 IV 熔岩图腾 特变电工 Hit -98 (Fire)", -- [1]
						"特变电工 重伤 (伤害/跳) 乌勒哈姆 Tick -118 (Physical)", -- [2]
						"商山-逐风者 圣光闪现 特变电工 Hit +739", -- [3]
						"特变电工 拦截昏迷 龍雲卿 Hit -54 (Physical)", -- [4]
						"特变电工 断筋 龍雲卿 Hit -38 (Physical)", -- [5]
						"特变电工 嗜血 特变电工 Hit +20", -- [6]
						"特变电工 肉搏 龍雲卿 Hit -513 (Physical)", -- [7]
						"特变电工 嗜血 特变电工 Hit +20", -- [8]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -258 (Shadow)", -- [9]
						"二道沟子靓仔-逐风者 冰霜震击 特变电工 Hit -603 (Frost)", -- [10]
						"特变电工 重伤 (伤害/跳) 乌勒哈姆 Tick -118 (Physical)", -- [11]
						"特变电工 旋风斩 龍雲卿 Hit -289 (Physical)", -- [12]
						"特变电工 嗜血 特变电工 Hit +20", -- [13]
						"特变电工 嗜血 龍雲卿 Hit -263 (Physical)", -- [14]
						"特变电工 嗜血 特变电工 Hit +20", -- [15]
						"二道沟子靓仔-逐风者 肉搏 特变电工 Hit -234 (Physical)", -- [16]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -257 (Shadow)", -- [17]
						"特变电工 肉搏 龍雲卿 Hit -282 (Physical)", -- [18]
						"特变电工 嗜血 特变电工 Hit +20", -- [19]
						"灼热图腾 VI 攻击 特变电工 Resist (Fire)", -- [20]
						"二道沟子靓仔-逐风者 冰霜震击 特变电工 Hit -618 (Frost)", -- [21]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -258 (Shadow)", -- [22]
						"特变电工 断筋 果不其然-逐风者 Hit -33 (Physical)", -- [23]
						"特变电工 嗜血 特变电工 Hit +20", -- [24]
						"特变电工 肉搏 果不其然-逐风者 Hit -503 (Physical)", -- [25]
						"特变电工 嗜血 特变电工 Hit +20", -- [26]
						"灼热图腾 VI 攻击 特变电工 Hit -64 (Fire)", -- [27]
						"特变电工 嗜血 果不其然-逐风者 Hit -455 (Physical)", -- [28]
						"特变电工 嗜血 特变电工 Hit +20", -- [29]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -257 (Shadow)", -- [30]
						"二道沟子靓仔-逐风者 冰霜震击 特变电工 Hit -608 (Frost)", -- [31]
						"灼热图腾 VI 攻击 特变电工 Crit -103 (Fire)", -- [32]
						"取名不能骚气-黑龙费尔默 暗影灼烧 特变电工 Hit -683 (Shadow)", -- [33]
						"二道沟子靓仔-逐风者 肉搏 特变电工 Hit -234 (Physical)", -- [34]
						"特变电工死亡。", -- [35]
					},
					["DeathAt"] = 23012.336,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["MessageTimes"] = {
						-14.70100000000093, -- [1]
						-14.48400000000038, -- [2]
						-14.35099999999875, -- [3]
						-13.66699999999764, -- [4]
						-12.88099999999758, -- [5]
						-12.88099999999758, -- [6]
						-12.53399999999965, -- [7]
						-12.51699999999983, -- [8]
						-11.93399999999747, -- [9]
						-11.51699999999983, -- [10]
						-11.48400000000038, -- [11]
						-10.84599999999773, -- [12]
						-10.84599999999773, -- [13]
						-9.217000000000553, -- [14]
						-9.217000000000553, -- [15]
						-9.11699999999837, -- [16]
						-8.933999999997468, -- [17]
						-8.53399999999965, -- [18]
						-8.516999999999825, -- [19]
						-7.032999999999447, -- [20]
						-6.5, -- [21]
						-5.933000000000902, -- [22]
						-5.450000000000728, -- [23]
						-5.450000000000728, -- [24]
						-5.032999999999447, -- [25]
						-5.016999999999825, -- [26]
						-3.816999999999098, -- [27]
						-3.194999999999709, -- [28]
						-3.194999999999709, -- [29]
						-2.933000000000902, -- [30]
						-1.5, -- [31]
						-0.9830000000001746, -- [32]
						-0.7659999999996217, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
						6219, -- [25]
						6219, -- [26]
						6219, -- [27]
						6219, -- [28]
						6219, -- [29]
						6219, -- [30]
						6219, -- [31]
						6219, -- [32]
						6219, -- [33]
						6219, -- [34]
						6219, -- [35]
					},
					["Health"] = {
						3335, -- [1]
						3237, -- [2]
						3237, -- [3]
						3976, -- [4]
						3976, -- [5]
						3976, -- [6]
						3996, -- [7]
						3996, -- [8]
						4016, -- [9]
						3758, -- [10]
						3155, -- [11]
						3155, -- [12]
						3155, -- [13]
						3175, -- [14]
						3175, -- [15]
						3195, -- [16]
						2961, -- [17]
						2704, -- [18]
						2704, -- [19]
						2724, -- [20]
						2724, -- [21]
						2106, -- [22]
						1848, -- [23]
						1848, -- [24]
						1868, -- [25]
						1868, -- [26]
						1888, -- [27]
						1824, -- [28]
						1824, -- [29]
						1844, -- [30]
						1587, -- [31]
						979, -- [32]
						876, -- [33]
						193, -- [34]
						0, -- [35]
					},
					["KilledBy"] = "二道沟子靓仔-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"HEAL", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"HEAL", -- [6]
						"DAMAGE", -- [7]
						"HEAL", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"HEAL", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"HEAL", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"HEAL", -- [24]
						"DAMAGE", -- [25]
						"HEAL", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"HEAL", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"MISC", -- [35]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						false, -- [32]
						true, -- [33]
						true, -- [34]
					},
					["Messages"] = {
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -295 (Shadow)", -- [1]
						"火焰灬 寒冰箭 特变电工 Hit -688 (Frost)", -- [2]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [3]
						"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -220 (Shadow)", -- [4]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -241 (Shadow)", -- [5]
						"草莓尐布丁-火妖鲁西弗隆 心灵震爆 特变电工 Hit -603 (Shadow)", -- [6]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -73 (Shadow)", -- [7]
						"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -220 (Shadow)", -- [8]
						"取名不能骚气-黑龙费尔默 献祭 特变电工 Hit -432 (Fire)", -- [9]
						"草莓尐布丁-火妖鲁西弗隆 惩击 特变电工 Hit -720 (Holy)", -- [10]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -241 (Shadow)", -- [11]
						"取名不能骚气-黑龙费尔默 灼热之痛 特变电工 Hit -405 (Fire)", -- [12]
						"特变电工 生命赐福 特变电工 Hit +1073", -- [13]
						"取名不能骚气-黑龙费尔默 暗影灼烧 特变电工 Hit -696 (Shadow)", -- [14]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [15]
						"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -219 (Shadow)", -- [16]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -193 (Fire)", -- [17]
						"特变电工 嗜血 作战小鸡 Hit -281 (Physical)", -- [18]
						"特变电工 嗜血 特变电工 Hit +20", -- [19]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -73 (Shadow)", -- [20]
						"特变电工 肉搏 作战小鸡 Crit -695 (Physical)", -- [21]
						"特变电工 嗜血 特变电工 Hit +20", -- [22]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -193 (Fire)", -- [23]
						"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -220 (Shadow)", -- [24]
						"火焰灬 寒冰箭 特变电工 Hit -63 (Frost)", -- [25]
						"草莓尐布丁-火妖鲁西弗隆 惩击 特变电工 Hit -591 (Holy)", -- [26]
						"火焰灬 火焰冲击 特变电工 Resist (Fire)", -- [27]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [28]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -194 (Fire)", -- [29]
						"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -220 (Shadow)", -- [30]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -253 (Shadow)", -- [31]
						"特变电工 拦截昏迷 火焰灬 Absorb -53 (53 被吸收) (Physical)", -- [32]
						"草莓尐布丁-火妖鲁西弗隆 惩击 特变电工 Hit -722 (Holy)", -- [33]
						"特变电工死亡。", -- [34]
					},
					["DeathAt"] = 22488.323,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
					},
					["MessageTimes"] = {
						-14.82399999999689, -- [1]
						-13.65699999999924, -- [2]
						-13.32299999999668, -- [3]
						-13.12299999999959, -- [4]
						-11.84000000000015, -- [5]
						-11.34000000000015, -- [6]
						-10.32299999999668, -- [7]
						-10.12299999999959, -- [8]
						-9.972999999998137, -- [9]
						-9.255999999997584, -- [10]
						-8.822999999996682, -- [11]
						-8.455999999998312, -- [12]
						-8.239999999997963, -- [13]
						-7.622999999999593, -- [14]
						-7.322999999996682, -- [15]
						-7.139999999999418, -- [16]
						-6.955999999998312, -- [17]
						-4.672999999998865, -- [18]
						-4.672999999998865, -- [19]
						-4.322999999996682, -- [20]
						-4.27299999999741, -- [21]
						-4.27299999999741, -- [22]
						-3.955999999998312, -- [23]
						-3.722999999998137, -- [24]
						-2.338999999999942, -- [25]
						-2.138999999999214, -- [26]
						-1.77299999999741, -- [27]
						-1.322999999996682, -- [28]
						-0.9729999999981374, -- [29]
						-0.705999999998312, -- [30]
						-0.672999999998865, -- [31]
						-0.5039999999971769, -- [32]
						-0.02299999999740976, -- [33]
						0, -- [34]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						7151, -- [14]
						7151, -- [15]
						7151, -- [16]
						7151, -- [17]
						7151, -- [18]
						7151, -- [19]
						7151, -- [20]
						7151, -- [21]
						7151, -- [22]
						7151, -- [23]
						7151, -- [24]
						7151, -- [25]
						7151, -- [26]
						7151, -- [27]
						7151, -- [28]
						7151, -- [29]
						7151, -- [30]
						7151, -- [31]
						7151, -- [32]
						7151, -- [33]
						6219, -- [34]
					},
					["Health"] = {
						5546, -- [1]
						5251, -- [2]
						4563, -- [3]
						4491, -- [4]
						4271, -- [5]
						4030, -- [6]
						3427, -- [7]
						3354, -- [8]
						3134, -- [9]
						2702, -- [10]
						1982, -- [11]
						1741, -- [12]
						1336, -- [13]
						3341, -- [14]
						2645, -- [15]
						2573, -- [16]
						2354, -- [17]
						2161, -- [18]
						2161, -- [19]
						2181, -- [20]
						2108, -- [21]
						2108, -- [22]
						2128, -- [23]
						1935, -- [24]
						1715, -- [25]
						1652, -- [26]
						1061, -- [27]
						1061, -- [28]
						989, -- [29]
						795, -- [30]
						575, -- [31]
						322, -- [32]
						322, -- [33]
						0, -- [34]
					},
					["KilledBy"] = "草莓尐布丁-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"HEAL", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"HEAL", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"MISC", -- [34]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
						false, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						false, -- [35]
					},
					["Messages"] = {
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -253 (Shadow)", -- [1]
						"特变电工 旋风斩 草莓尐布丁-火妖鲁西弗隆 Hit -456 (Physical)", -- [2]
						"特变电工 嗜血 特变电工 Hit +20", -- [3]
						"草莓尐布丁-火妖鲁西弗隆 神圣新星 特变电工 Hit -263 (Holy)", -- [4]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -78 (Shadow)", -- [5]
						"特变电工 肉搏 草莓尐布丁-火妖鲁西弗隆 Hit -490 (Physical)", -- [6]
						"特变电工 嗜血 特变电工 Hit +20", -- [7]
						"特变电工 重伤 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -117 (Physical)", -- [8]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -253 (Shadow)", -- [9]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -78 (Shadow)", -- [10]
						"特变电工 肉搏 草莓尐布丁-火妖鲁西弗隆 Crit -873 (Physical)", -- [11]
						"特变电工 破胆怒吼 草莓尐布丁-火妖鲁西弗隆 Resist (Physical)", -- [12]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -257 (Shadow)", -- [13]
						"古德斯尼-逐风者 冰霜新星 特变电工 Hit -99 (Frost)", -- [14]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -78 (Shadow)", -- [15]
						"特变电工 嗜血 古德斯尼-逐风者 Dodge (Physical)", -- [16]
						"特变电工 肉搏 古德斯尼-逐风者 Absorb -451 (451 被吸收) (1)", -- [17]
						"特变电工 重伤 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -118 (Physical)", -- [18]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -235 (Shadow)", -- [19]
						"古德斯尼-逐风者 火焰冲击 特变电工 Crit -907 (Fire)", -- [20]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -78 (Shadow)", -- [21]
						"特变电工 重伤 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -118 (Physical)", -- [22]
						"取名不能骚气-黑龙费尔默 献祭 特变电工 Hit -407 (Fire)", -- [23]
						"特变电工 拳击 取名不能骚气-黑龙费尔默 Crit -131 (Physical)", -- [24]
						"古德斯尼-逐风者 冰锥术 特变电工 Hit -561 (Frost)", -- [25]
						"特变电工 肉搏 取名不能骚气-黑龙费尔默 Hit -690 (Physical)", -- [26]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -258 (Shadow)", -- [27]
						"草莓尐布丁-火妖鲁西弗隆 心灵震爆 特变电工 Hit -723 (Shadow)", -- [28]
						"特变电工 旋风斩 取名不能骚气-黑龙费尔默 Hit -664 (Physical)", -- [29]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -79 (Shadow)", -- [30]
						"特变电工 重伤 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -117 (Physical)", -- [31]
						"取名不能骚气-黑龙费尔默 暗影灼烧 特变电工 Hit -817 (Shadow)", -- [32]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 特变电工 Tick -177 (Fire)", -- [33]
						"特变电工死亡。", -- [34]
						"特变电工 重伤 (伤害/跳) 取名不能骚气-黑龙费尔默 Tick -184 (Physical)", -- [35]
					},
					["DeathAt"] = 22380.333,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["MessageTimes"] = {
						-14.645999999997, -- [1]
						-14.04599999999846, -- [2]
						-14.04599999999846, -- [3]
						-13.69599999999991, -- [4]
						-13.12899999999718, -- [5]
						-12.42900000000009, -- [6]
						-12.42900000000009, -- [7]
						-12.09599999999773, -- [8]
						-11.645999999997, -- [9]
						-10.145999999997, -- [10]
						-9.22899999999936, -- [11]
						-8.611999999997352, -- [12]
						-8.412000000000262, -- [13]
						-7.861999999997352, -- [14]
						-7.145000000000437, -- [15]
						-6.72899999999936, -- [16]
						-6.528999999998632, -- [17]
						-6.194999999999709, -- [18]
						-5.412000000000262, -- [19]
						-4.427999999999884, -- [20]
						-4.145000000000437, -- [21]
						-3.211999999999534, -- [22]
						-3.027999999998428, -- [23]
						-2.977999999999156, -- [24]
						-2.912000000000262, -- [25]
						-2.895000000000437, -- [26]
						-2.412000000000262, -- [27]
						-1.677999999999884, -- [28]
						-1.460999999999331, -- [29]
						-1.127999999996973, -- [30]
						-0.194999999999709, -- [31]
						-0.1450000000004366, -- [32]
						-0.02799999999842839, -- [33]
						0, -- [34]
						0.04400000000168802, -- [35]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
						6219, -- [25]
						6219, -- [26]
						6219, -- [27]
						6219, -- [28]
						6219, -- [29]
						6219, -- [30]
						6219, -- [31]
						6219, -- [32]
						6219, -- [33]
						6219, -- [34]
						6219, -- [35]
					},
					["Health"] = {
						4866, -- [1]
						4613, -- [2]
						4613, -- [3]
						4633, -- [4]
						4370, -- [5]
						4292, -- [6]
						4292, -- [7]
						4312, -- [8]
						4312, -- [9]
						4681, -- [10]
						4603, -- [11]
						4603, -- [12]
						4603, -- [13]
						4346, -- [14]
						4247, -- [15]
						4169, -- [16]
						4169, -- [17]
						4169, -- [18]
						4169, -- [19]
						3934, -- [20]
						3027, -- [21]
						2949, -- [22]
						2949, -- [23]
						2542, -- [24]
						2542, -- [25]
						2542, -- [26]
						1981, -- [27]
						1723, -- [28]
						1000, -- [29]
						1000, -- [30]
						921, -- [31]
						921, -- [32]
						104, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"HEAL", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"MISC", -- [34]
						"DAMAGE", -- [35]
					},
				}, -- [4]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
						false, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
					},
					["Messages"] = {
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -162 (Shadow)", -- [1]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -295 (Shadow)", -- [2]
						"特变电工 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -781 (781 被吸收) (1)", -- [3]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [4]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -198 (Shadow)", -- [5]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -294 (Shadow)", -- [6]
						"特变电工 重伤 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Absorb -94 (94 被吸收) (Physical)", -- [7]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [8]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -179 (Shadow)", -- [9]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -267 (Shadow)", -- [10]
						"特变电工 重伤 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -94 (Physical)", -- [11]
						"阿拉希的传说-火妖鲁西弗隆 肉搏 特变电工 Crit -245 (Physical)", -- [12]
						"阿拉希的传说-火妖鲁西弗隆 肉搏 特变电工 Crit -131 (Physical)", -- [13]
						"阿拉希的传说-火妖鲁西弗隆 邪恶攻击 特变电工 Hit -160 (Physical)", -- [14]
						"特变电工 断筋 阿拉希的传说-火妖鲁西弗隆 Hit -41 (Physical)", -- [15]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [16]
						"特变电工 肉搏 阿拉希的传说-火妖鲁西弗隆 Hit -540 (Physical)", -- [17]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -198 (Shadow)", -- [18]
						"阿拉希的传说-火妖鲁西弗隆 邪恶攻击 特变电工 Hit -175 (Physical)", -- [19]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -294 (Shadow)", -- [20]
						"特变电工 重伤 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -94 (Physical)", -- [21]
						"特变电工 旋风斩 阿拉希的传说-火妖鲁西弗隆 Hit -558 (Physical)", -- [22]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [23]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -198 (Shadow)", -- [24]
						"特变电工 肉搏 阿拉希的传说-火妖鲁西弗隆 Crit -1177 (Physical)", -- [25]
						"特变电工 嗜血 阿拉希的传说-火妖鲁西弗隆 Hit -559 (Physical)", -- [26]
						"特变电工 嗜血 特变电工 Hit +20", -- [27]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 特变电工 Tick -295 (Shadow)", -- [28]
						"特变电工 重伤 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -95 (Physical)", -- [29]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -72 (Shadow)", -- [30]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 特变电工 Tick -84 (Shadow)", -- [31]
						"特变电工死亡。", -- [32]
					},
					["DeathAt"] = 22073.332,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
					},
					["MessageTimes"] = {
						-14.80099999999948, -- [1]
						-14.15100000000166, -- [2]
						-14.0010000000002, -- [3]
						-12.21700000000055, -- [4]
						-11.78399999999965, -- [5]
						-11.15000000000146, -- [6]
						-10.96700000000055, -- [7]
						-9.234000000000378, -- [8]
						-8.799999999999272, -- [9]
						-8.150000000001455, -- [10]
						-7.967000000000553, -- [11]
						-7.367000000002008, -- [12]
						-6.967000000000553, -- [13]
						-6.683000000000902, -- [14]
						-6.317000000002736, -- [15]
						-6.217000000000553, -- [16]
						-6.167000000001281, -- [17]
						-5.799999999999272, -- [18]
						-5.667000000001281, -- [19]
						-5.150000000001455, -- [20]
						-4.967000000000553, -- [21]
						-4.817000000002736, -- [22]
						-3.217000000000553, -- [23]
						-2.799999999999272, -- [24]
						-2.700000000000728, -- [25]
						-2.600000000002183, -- [26]
						-2.569999999999709, -- [27]
						-2.167000000001281, -- [28]
						-1.967000000000553, -- [29]
						-0.2160000000003493, -- [30]
						-0.0319999999992433, -- [31]
						0, -- [32]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
						6219, -- [25]
						6219, -- [26]
						6219, -- [27]
						6219, -- [28]
						6219, -- [29]
						6219, -- [30]
						6219, -- [31]
						6219, -- [32]
					},
					["Health"] = {
						3413, -- [1]
						3251, -- [2]
						2956, -- [3]
						2956, -- [4]
						2884, -- [5]
						2686, -- [6]
						2392, -- [7]
						2392, -- [8]
						2320, -- [9]
						2141, -- [10]
						1874, -- [11]
						1922, -- [12]
						1677, -- [13]
						1546, -- [14]
						1386, -- [15]
						1386, -- [16]
						1314, -- [17]
						1314, -- [18]
						1116, -- [19]
						941, -- [20]
						647, -- [21]
						647, -- [22]
						647, -- [23]
						575, -- [24]
						377, -- [25]
						377, -- [26]
						377, -- [27]
						397, -- [28]
						102, -- [29]
						102, -- [30]
						30, -- [31]
						0, -- [32]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"HEAL", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"MISC", -- [32]
					},
				}, -- [5]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						false, -- [19]
						false, -- [20]
						false, -- [21]
						false, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
					},
					["Messages"] = {
						"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -219 (Shadow)", -- [1]
						"特变电工 治疗药水 特变电工 Hit +1425", -- [2]
						"乌勒哈姆 肉搏 特变电工 Hit -40 (Physical)", -- [3]
						"取名不能骚气-黑龙费尔默 灼热之痛 特变电工 Hit -499 (Fire)", -- [4]
						"特变电工 重伤 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -141 (Physical)", -- [5]
						"草莓尐布丁-火妖鲁西弗隆 惩击 特变电工 Hit -724 (Holy)", -- [6]
						"特变电工 旋风斩 乌勒哈姆 Hit -487 (Physical)", -- [7]
						"特变电工 旋风斩 芬达么有糖-黑龙费尔默 Hit -488 (Physical)", -- [8]
						"特变电工 旋风斩 取名不能骚气-黑龙费尔默 Crit -1450 (Physical)", -- [9]
						"特变电工 旋风斩 草莓尐布丁-火妖鲁西弗隆 Crit -1054 (Physical)", -- [10]
						"特变电工 嗜血 特变电工 Hit +20", -- [11]
						"特变电工 嗜血 特变电工 Hit +20", -- [12]
						"特变电工 嗜血 特变电工 Hit +20", -- [13]
						"特变电工 嗜血 特变电工 Hit +20", -- [14]
						"乌勒哈姆 肉搏 特变电工 Hit -44 (Physical)", -- [15]
						"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -219 (Shadow)", -- [16]
						"特变电工 肉搏 芬达么有糖-黑龙费尔默 Hit -528 (Physical)", -- [17]
						"取名不能骚气-黑龙费尔默 灼热之痛 特变电工 Hit -506 (Fire)", -- [18]
						"特变电工 斩杀 取名不能骚气-黑龙费尔默 Hit -1859 (Physical)", -- [19]
						"特变电工 肉搏 芬达么有糖-黑龙费尔默 Crit -771 (Physical)", -- [20]
						"特变电工 斩杀 芬达么有糖-黑龙费尔默 Hit -532 (Physical)", -- [21]
						"特变电工 肉搏 果不其然-逐风者 Hit -418 (Physical)", -- [22]
						"特变电工 断筋 果不其然-逐风者 Hit -32 (Physical)", -- [23]
						"果不其然-逐风者 出血 特变电工 Hit -261 (Physical)", -- [24]
						"特变电工死亡。", -- [25]
					},
					["DeathAt"] = 21928.324,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
					},
					["MessageTimes"] = {
						-14.53399999999965, -- [1]
						-14.21800000000076, -- [2]
						-14.1339999999982, -- [3]
						-13.98400000000038, -- [4]
						-12.70100000000093, -- [5]
						-12.5679999999993, -- [6]
						-12.30099999999948, -- [7]
						-12.30099999999948, -- [8]
						-12.30099999999948, -- [9]
						-12.30099999999948, -- [10]
						-12.27799999999843, -- [11]
						-12.27799999999843, -- [12]
						-12.27799999999843, -- [13]
						-12.27799999999843, -- [14]
						-11.61799999999857, -- [15]
						-11.53399999999965, -- [16]
						-11.51800000000003, -- [17]
						-10.80099999999948, -- [18]
						-10.66799999999785, -- [19]
						-8.817999999999302, -- [20]
						-8.248999999999796, -- [21]
						-6.11699999999837, -- [22]
						-5.883999999998196, -- [23]
						-0.01699999999982538, -- [24]
						0, -- [25]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
						6219, -- [25]
					},
					["Health"] = {
						897, -- [1]
						678, -- [2]
						678, -- [3]
						2063, -- [4]
						1564, -- [5]
						1564, -- [6]
						840, -- [7]
						840, -- [8]
						840, -- [9]
						840, -- [10]
						840, -- [11]
						840, -- [12]
						840, -- [13]
						840, -- [14]
						920, -- [15]
						876, -- [16]
						657, -- [17]
						657, -- [18]
						151, -- [19]
						151, -- [20]
						151, -- [21]
						151, -- [22]
						151, -- [23]
						199, -- [24]
						0, -- [25]
					},
					["KilledBy"] = "果不其然-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"HEAL", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"HEAL", -- [11]
						"HEAL", -- [12]
						"HEAL", -- [13]
						"HEAL", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"MISC", -- [25]
					},
				}, -- [6]
			},
			["type"] = "Self",
			["LastEventHealth"] = {
				5532, -- [1]
				5532, -- [2]
				5532, -- [3]
				5552, -- [4]
				5502, -- [5]
				5502, -- [6]
				6219, -- [7]
				6219, -- [8]
				6219, -- [9]
				6219, -- [10]
				5903, -- [11]
				5903, -- [12]
				5903, -- [13]
				5566, -- [14]
				5566, -- [15]
				5566, -- [16]
				5586, -- [17]
				5586, -- [18]
				5586, -- [19]
				5992, -- [20]
				5992, -- [21]
				5524, -- [22]
				5320, -- [23]
				5320, -- [24]
				5255, -- [25]
				5255, -- [26]
				5014, -- [27]
				4886, -- [28]
				5034, -- [29]
				5034, -- [30]
				5034, -- [31]
				5034, -- [32]
				5034, -- [33]
				5760, -- [34]
				4941, -- [35]
				4443, -- [36]
				4223, -- [37]
				5315, -- [38]
				5200, -- [39]
				5968, -- [40]
				5817, -- [41]
				5817, -- [42]
				5728, -- [43]
				5728, -- [44]
				5728, -- [45]
				5728, -- [46]
				5728, -- [47]
				5728, -- [48]
				5630, -- [49]
				5630, -- [50]
			},
			["LastHealTime"] = 23498.147,
			["LastDamageTaken"] = 176,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				6219, -- [1]
				6219, -- [2]
				6219, -- [3]
				6219, -- [4]
				6219, -- [5]
				6219, -- [6]
				6219, -- [7]
				6219, -- [8]
				6219, -- [9]
				6219, -- [10]
				6219, -- [11]
				6219, -- [12]
				6219, -- [13]
				6219, -- [14]
				6219, -- [15]
				6219, -- [16]
				6219, -- [17]
				6219, -- [18]
				6219, -- [19]
				6219, -- [20]
				6219, -- [21]
				6219, -- [22]
				6219, -- [23]
				6219, -- [24]
				6219, -- [25]
				6219, -- [26]
				6219, -- [27]
				6219, -- [28]
				6569, -- [29]
				6569, -- [30]
				6569, -- [31]
				6569, -- [32]
				6569, -- [33]
				6569, -- [34]
				6219, -- [35]
				6219, -- [36]
				6219, -- [37]
				6219, -- [38]
				6219, -- [39]
				6219, -- [40]
				6219, -- [41]
				6219, -- [42]
				6219, -- [43]
				6219, -- [44]
				6219, -- [45]
				6219, -- [46]
				6219, -- [47]
				6219, -- [48]
				6219, -- [49]
				6219, -- [50]
			},
			["NextEventNum"] = 35,
			["LastDamageTime"] = 23542.332,
			["LastEvents"] = {
				"特变电工 肉搏 二道沟子靓仔-逐风者 Hit -426 (Physical)", -- [1]
				"特变电工 嗜血 二道沟子靓仔-逐风者 Hit -384 (Physical)", -- [2]
				"特变电工 嗜血 特变电工 Hit +20", -- [3]
				"熔岩图腾 IV 熔岩图腾 特变电工 Hit -98 (Fire)", -- [4]
				"特变电工 英勇打击 阿拉希的传说-火妖鲁西弗隆 Hit -523 (Physical)", -- [5]
				"商山-逐风者 圣光闪现 特变电工 Crit +1108 (391 过量治疗)", -- [6]
				"特变电工 冲锋击昏 清风徐自来-火妖鲁西弗隆 Resist (Physical)", -- [7]
				"特变电工 肉搏 取名不能骚气-黑龙费尔默 Hit -446 (Physical)", -- [8]
				"特变电工 断筋 取名不能骚气-黑龙费尔默 Hit -40 (Physical)", -- [9]
				"古德斯尼-逐风者 魔爆术 特变电工 Hit -316 (Arcane)", -- [10]
				"特变电工 断筋 古德斯尼-逐风者 Hit -34 (Physical)", -- [11]
				"特变电工 肉搏 古德斯尼-逐风者 Hit -459 (Physical)", -- [12]
				"特变电工 旋风斩 古德斯尼-逐风者 Crit -986 (Physical)", -- [13]
				"特变电工 肉搏 古德斯尼-逐风者 Crit -858 (Physical)", -- [14]
				"特变电工 嗜血 古德斯尼-逐风者 Hit -381 (Physical)", -- [15]
				"特变电工 嗜血 特变电工 Hit +20", -- [16]
				"特变电工 肉搏 古德斯尼-逐风者 Absorb -852 (1)", -- [17]
				"特变电工 斩杀 古德斯尼-逐风者 Crit -211 (852 被吸收) (Physical)", -- [18]
				"特变电工 嗜血 特变电工 Hit +20", -- [19]
				"果不其然-逐风者 肉搏 特变电工 Crit -420 (Physical)", -- [20]
				"果不其然-逐风者 速效毒药 III 特变电工 Hit -48 (Nature)", -- [21]
				"果不其然-逐风者 出血 特变电工 Hit -204 (Physical)", -- [22]
				"果不其然-逐风者 肉搏 特变电工 Miss (1)", -- [23]
				"果不其然-逐风者 肉搏 特变电工 Hit -65 (Physical)", -- [24]
				"果不其然-逐风者 肉搏 特变电工 Hit -187 (Physical)", -- [25]
				"果不其然-逐风者 速效毒药 III 特变电工 Hit -54 (Nature)", -- [26]
				"果不其然-逐风者 出血 特变电工 Hit -176 (Physical)", -- [27]
				"商山-逐风者 dispels 特变电工 侦测魔法 (清洁术)", -- [28]
				"特变电工 断筋 二道沟子靓仔-逐风者 Parry (Physical)", -- [29]
				"特变电工 肉搏 二道沟子靓仔-逐风者 Hit -407 (Physical)", -- [30]
				"特变电工 拦截昏迷 火焰灬 Hit -52 (Physical)", -- [31]
				"特变电工 断筋 火焰灬 Hit -36 (Physical)", -- [32]
				"商山-逐风者 圣光闪现 特变电工 Hit +726", -- [33]
				"特变电工 肉搏 火焰灬 Hit -413 (Physical)", -- [34]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -115 (Shadow)", -- [35]
				"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -220 (Shadow)", -- [36]
				"商山-逐风者 圣光闪现 特变电工 Crit +1092", -- [37]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 特变电工 Tick -115 (Shadow)", -- [38]
				"商山-逐风者 圣光闪现 特变电工 Hit +768", -- [39]
				"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -200 (Shadow)", -- [40]
				"商山-逐风者 dispels 特变电工 生命虹吸 (清洁术)", -- [41]
				"熔岩图腾 IV 熔岩图腾 特变电工 Hit -89 (Fire)", -- [42]
				"特变电工 断筋 二道沟子靓仔-逐风者 Hit -46 (Physical)", -- [43]
				"特变电工 肉搏 二道沟子靓仔-逐风者 Crit -1147 (Physical)", -- [44]
				"特变电工 旋风斩 二道沟子靓仔-逐风者 Hit -492 (Physical)", -- [45]
				"特变电工 肉搏 二道沟子靓仔-逐风者 Hit -562 (Physical)", -- [46]
				"特变电工 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -183 (Physical)", -- [47]
				"熔岩图腾 IV 熔岩图腾 特变电工 Hit -98 (Fire)", -- [48]
				"特变电工 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -190 (Physical)", -- [49]
				"熔岩图腾 IV 熔岩图腾 特变电工 Hit -98 (Fire)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				23453.094, -- [1]
				23453.194, -- [2]
				23453.22, -- [3]
				23454.73, -- [4]
				23462.528, -- [5]
				23463.378, -- [6]
				23477.395, -- [7]
				23488.713, -- [8]
				23488.713, -- [9]
				23490.813, -- [10]
				23491.179, -- [11]
				23492.567, -- [12]
				23493.746, -- [13]
				23496.48, -- [14]
				23496.65, -- [15]
				23496.65, -- [16]
				23498.147, -- [17]
				23498.147, -- [18]
				23498.147, -- [19]
				23520.365, -- [20]
				23520.365, -- [21]
				23520.981, -- [22]
				23521.731, -- [23]
				23523.431, -- [24]
				23523.481, -- [25]
				23523.481, -- [26]
				23523.865, -- [27]
				23530.882, -- [28]
				23538.766, -- [29]
				23538.816, -- [30]
				23540.666, -- [31]
				23541.599, -- [32]
				23542.066, -- [33]
				23542.332, -- [34]
				23439.927, -- [35]
				23440.41, -- [36]
				23441.877, -- [37]
				23442.91, -- [38]
				23443.377, -- [39]
				23443.41, -- [40]
				23445.327, -- [41]
				23446.01, -- [42]
				23446.41, -- [43]
				23446.644, -- [44]
				23449.161, -- [45]
				23449.611, -- [46]
				23449.682, -- [47]
				23450.727, -- [48]
				23452.677, -- [49]
				23452.727, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["FDamagedWho"] = {
					},
					["GTFOEventDamage"] = 554,
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 3,
								},
								["二道沟子靓仔-逐风者"] = {
									["count"] = 33,
								},
								["取名不能骚气-黑龙费尔默"] = {
									["count"] = 3,
								},
								["龍雲卿"] = {
									["count"] = 6,
								},
								["果不其然-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 51,
						},
					},
					["GTFOEvents"] = 1,
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 28809,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 60,
								},
								["怒不可遏"] = {
									["count"] = 16,
								},
								["冲锋"] = {
									["count"] = 120,
								},
							},
							["amount"] = 196,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 56,
								},
							},
							["amount"] = 57,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 26,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 41,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 13,
								},
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 21,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 14,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 15,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 47,
								},
								["Tick"] = {
									["count"] = 17,
								},
								["Dodge"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 17,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 90,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 22,
								},
								["Hit"] = {
									["count"] = 24,
								},
							},
							["amount"] = 49,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 12133,
						["Melee"] = 7142,
						["Arcane"] = 316,
						["Physical"] = 4856,
						["Fire"] = 2527,
						["Frost"] = 503,
						["Nature"] = 1332,
					},
					["DOT_Time"] = 51,
					["Damage"] = 64337,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 56.03,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 31,
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 1,
						["Physical"] = 1358,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 32167,
						["Melee"] = 31866,
						["Fire"] = 304,
					},
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 41,
									["amount"] = 0,
								},
							},
							["count"] = 41,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 817,
								},
								["旋风斩"] = {
									["count"] = 1109,
								},
								["断筋"] = {
									["count"] = 99,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 82,
								},
								["肉搏"] = {
									["count"] = 4113,
								},
							},
							["amount"] = 6220,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 146,
								},
								["嗜血"] = {
									["count"] = 848,
								},
								["旋风斩"] = {
									["count"] = 438,
								},
								["压制"] = {
									["count"] = 426,
								},
								["断筋"] = {
									["count"] = 76,
								},
								["斩杀"] = {
									["count"] = 1711,
								},
								["肉搏"] = {
									["count"] = 1995,
								},
							},
							["amount"] = 5640,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 57,
								},
								["断筋"] = {
									["count"] = 128,
								},
								["嗜血"] = {
									["count"] = 1399,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 127,
								},
								["旋风斩"] = {
									["count"] = 2342,
								},
								["拳击"] = {
									["count"] = 55,
								},
								["斩杀"] = {
									["count"] = 3025,
								},
								["肉搏"] = {
									["count"] = 3565,
								},
							},
							["amount"] = 10698,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 381,
								},
								["旋风斩"] = {
									["count"] = 986,
								},
								["断筋"] = {
									["count"] = 34,
								},
								["斩杀"] = {
									["count"] = 717,
								},
								["肉搏"] = {
									["count"] = 2596,
								},
							},
							["amount"] = 4714,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1403,
								},
								["嗜血"] = {
									["count"] = 1350,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 127,
								},
								["拦截昏迷"] = {
									["count"] = 60,
								},
								["断筋"] = {
									["count"] = 75,
								},
								["斩杀"] = {
									["count"] = 1067,
								},
								["肉搏"] = {
									["count"] = 4197,
								},
							},
							["amount"] = 8279,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 395,
								},
							},
							["amount"] = 395,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 599,
								},
								["嗜血"] = {
									["count"] = 1575,
								},
								["旋风斩"] = {
									["count"] = 1451,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1352,
								},
								["断筋"] = {
									["count"] = 221,
								},
								["铁皮手雷"] = {
									["count"] = 150,
								},
								["肉搏"] = {
									["count"] = 8508,
								},
							},
							["amount"] = 13856,
						},
						["火焰灬"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 52,
								},
								["断筋"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 413,
								},
							},
							["amount"] = 501,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1631,
								},
								["旋风斩"] = {
									["count"] = 936,
								},
								["英勇打击"] = {
									["count"] = 1975,
								},
								["断筋"] = {
									["count"] = 123,
								},
								["嗜血"] = {
									["count"] = 336,
								},
								["肉搏"] = {
									["count"] = 4221,
								},
							},
							["amount"] = 9222,
						},
						["龍雲卿"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 97,
								},
								["嗜血"] = {
									["count"] = 595,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 241,
								},
								["英勇打击"] = {
									["count"] = 1403,
								},
								["拦截昏迷"] = {
									["count"] = 64,
								},
								["铁皮手雷"] = {
									["count"] = 154,
								},
								["肉搏"] = {
									["count"] = 2258,
								},
							},
							["amount"] = 4812,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2614,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 1185,
								},
							},
							["amount"] = 3799,
						},
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 383,
								},
							},
							["amount"] = 383,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 358,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["嗜血"] = {
									["count"] = 784,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 320,
								},
								["雷霆一击"] = {
									["count"] = 124,
								},
								["震击"] = {
									["count"] = 248,
								},
								["英勇打击"] = {
									["count"] = 962,
								},
								["肉搏"] = {
									["count"] = 2368,
								},
							},
							["amount"] = 5213,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 809,
								},
								["献祭"] = {
									["count"] = 407,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1206,
								},
								["铁皮手雷"] = {
									["count"] = 303,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 930,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5389,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 708,
								},
							},
							["amount"] = 9752,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 172,
								},
							},
							["amount"] = 172,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 316,
								},
							},
							["amount"] = 316,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["速效毒药 III"] = {
									["count"] = 163,
								},
								["出血"] = {
									["count"] = 589,
								},
								["肉搏"] = {
									["count"] = 1220,
								},
							},
							["amount"] = 1972,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 528,
								},
							},
							["amount"] = 528,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 500,
								},
								["肉搏"] = {
									["count"] = 2571,
								},
								["冰霜震击"] = {
									["count"] = 503,
								},
							},
							["amount"] = 3574,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 158,
								},
								["邪恶攻击"] = {
									["count"] = 187,
								},
								["刺骨"] = {
									["count"] = 955,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 263,
								},
								["肉搏"] = {
									["count"] = 771,
								},
							},
							["amount"] = 2334,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 212,
								},
							},
							["amount"] = 212,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 554,
								},
							},
							["amount"] = 554,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["攻击"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 31,
							["amount"] = 3,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 18,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 41,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 41,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.53,
								},
								["嗜血"] = {
									["count"] = 54.81,
								},
								["治疗药水"] = {
									["count"] = 0.69,
								},
							},
							["amount"] = 56.03,
						},
					},
					["OverHeals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 3,
									["amount"] = 60,
								},
							},
							["count"] = 3,
							["amount"] = 60,
						},
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 16,
								},
							},
							["amount"] = 16,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 960,
								},
								["治疗药水"] = {
									["count"] = 1106,
								},
							},
							["amount"] = 3139,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 60,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.71,
								},
								["旋风斩"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 1.72,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.34,
								},
								["肉搏"] = {
									["count"] = 6.42,
								},
							},
							["amount"] = 10.21,
						},
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.53,
								},
								["嗜血"] = {
									["count"] = 54.81,
								},
								["治疗药水"] = {
									["count"] = 0.69,
								},
							},
							["amount"] = 56.03,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.93,
								},
								["缴械"] = {
									["count"] = 0.98,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.46,
								},
								["压制"] = {
									["count"] = 0.21,
								},
								["断筋"] = {
									["count"] = 0.58,
								},
								["斩杀"] = {
									["count"] = 2.3,
								},
								["肉搏"] = {
									["count"] = 6.16,
								},
							},
							["amount"] = 14.12,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.32,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 5,
								},
							},
							["amount"] = 14.32,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.6,
								},
								["旋风斩"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.53,
								},
								["断筋"] = {
									["count"] = 0.23,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.15,
								},
							},
							["amount"] = 10.51,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.61,
								},
							},
							["amount"] = 1.61,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.17,
								},
								["旋风斩"] = {
									["count"] = 1.18,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.43,
								},
							},
							["amount"] = 8.78,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 0.48,
								},
								["嗜血"] = {
									["count"] = 3.59,
								},
								["旋风斩"] = {
									["count"] = 1.64,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.75,
								},
								["断筋"] = {
									["count"] = 7.69,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 10.37,
								},
							},
							["amount"] = 35.02,
						},
						["火焰灬"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.93,
								},
								["肉搏"] = {
									["count"] = 0.73,
								},
							},
							["amount"] = 3.16,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.65,
								},
								["压制"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.25,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.489999999999999,
								},
							},
							["amount"] = 16.39,
						},
						["龍雲卿"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.9700000000000001,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.83,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.24,
								},
							},
							["amount"] = 12.54,
						},
					},
					["WhoDispelled"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["生命虹吸 (清洁术)"] = {
									["count"] = 1,
								},
								["侦测魔法 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["自由祝福 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1073,
									["count"] = 1,
									["amount"] = 1073,
								},
							},
							["count"] = 1,
							["amount"] = 1073,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 48,
									["amount"] = 960,
								},
							},
							["count"] = 48,
							["amount"] = 960,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1106,
									["min"] = 1106,
									["count"] = 1,
									["amount"] = 1106,
								},
							},
							["count"] = 1,
							["amount"] = 1106,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 527,
								},
								["圣光闪现"] = {
									["count"] = 17022,
								},
							},
							["amount"] = 17549,
						},
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 960,
								},
								["治疗药水"] = {
									["count"] = 1106,
								},
							},
							["amount"] = 3139,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 184.1899999999999,
					["Healing"] = 3139,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["火焰新星"] = {
									["max"] = 554,
									["min"] = 554,
									["count"] = 1,
									["amount"] = 554,
								},
							},
							["count"] = 1,
							["amount"] = 554,
						},
					},
					["Dispelled"] = 3,
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 940,
									["min"] = 848,
									["count"] = 3,
									["amount"] = 2683,
								},
								["Hit"] = {
									["max"] = 595,
									["min"] = 315,
									["count"] = 11,
									["amount"] = 4618,
								},
							},
							["count"] = 15,
							["amount"] = 7301,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 190,
									["min"] = 81,
									["count"] = 17,
									["amount"] = 2075,
								},
							},
							["count"] = 17,
							["amount"] = 2075,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 1,
									["amount"] = 55,
								},
							},
							["count"] = 1,
							["amount"] = 55,
						},
						["斩杀"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 506,
									["min"] = 506,
									["count"] = 1,
									["amount"] = 506,
								},
								["Crit"] = {
									["max"] = 3025,
									["min"] = 211,
									["count"] = 3,
									["amount"] = 4416,
								},
								["Hit"] = {
									["max"] = 1067,
									["min"] = 531,
									["count"] = 3,
									["amount"] = 2197,
								},
							},
							["count"] = 7,
							["amount"] = 7119,
						},
						["缴械"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1093,
									["min"] = 1093,
									["count"] = 1,
									["amount"] = 1093,
								},
								["Hit"] = {
									["max"] = 538,
									["min"] = 426,
									["count"] = 2,
									["amount"] = 964,
								},
							},
							["count"] = 3,
							["amount"] = 2057,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 64,
									["min"] = 52,
									["count"] = 4,
									["amount"] = 233,
								},
							},
							["count"] = 4,
							["amount"] = 233,
						},
						["旋风斩"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1403,
									["min"] = 964,
									["count"] = 5,
									["amount"] = 5840,
								},
								["Hit"] = {
									["max"] = 530,
									["min"] = 395,
									["count"] = 7,
									["amount"] = 3220,
								},
							},
							["count"] = 14,
							["amount"] = 9060,
						},
						["英勇打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1452,
									["min"] = 1403,
									["count"] = 2,
									["amount"] = 2855,
								},
								["Hit"] = {
									["max"] = 523,
									["min"] = 523,
									["count"] = 1,
									["amount"] = 523,
								},
							},
							["count"] = 3,
							["amount"] = 3378,
						},
						["断筋"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 90,
									["min"] = 68,
									["count"] = 3,
									["amount"] = 234,
								},
								["Hit"] = {
									["max"] = 49,
									["min"] = 23,
									["count"] = 18,
									["amount"] = 655,
								},
							},
							["count"] = 23,
							["amount"] = 889,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 154,
									["min"] = 150,
									["count"] = 2,
									["amount"] = 304,
								},
							},
							["count"] = 2,
							["amount"] = 304,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 852,
									["min"] = 1,
									["count"] = 2,
									["amount"] = 853,
								},
								["Crit"] = {
									["max"] = 1191,
									["min"] = 641,
									["count"] = 22,
									["amount"] = 20868,
								},
								["Hit"] = {
									["max"] = 562,
									["min"] = 247,
									["count"] = 24,
									["amount"] = 10145,
								},
							},
							["count"] = 49,
							["amount"] = 31866,
						},
					},
					["HealingTaken"] = 20688,
					["RageGain"] = 196,
					["TimeDamage"] = 128.16,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.71,
								},
								["旋风斩"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 1.72,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.34,
								},
								["肉搏"] = {
									["count"] = 6.42,
								},
							},
							["amount"] = 10.21,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.93,
								},
								["缴械"] = {
									["count"] = 0.98,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.46,
								},
								["压制"] = {
									["count"] = 0.21,
								},
								["断筋"] = {
									["count"] = 0.58,
								},
								["斩杀"] = {
									["count"] = 2.3,
								},
								["肉搏"] = {
									["count"] = 6.16,
								},
							},
							["amount"] = 14.12,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.32,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 5,
								},
							},
							["amount"] = 14.32,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.6,
								},
								["旋风斩"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.53,
								},
								["断筋"] = {
									["count"] = 0.23,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.15,
								},
							},
							["amount"] = 10.51,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.61,
								},
							},
							["amount"] = 1.61,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.17,
								},
								["旋风斩"] = {
									["count"] = 1.18,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.43,
								},
							},
							["amount"] = 8.78,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 0.48,
								},
								["嗜血"] = {
									["count"] = 3.59,
								},
								["旋风斩"] = {
									["count"] = 1.64,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.75,
								},
								["断筋"] = {
									["count"] = 7.69,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 10.37,
								},
							},
							["amount"] = 35.02,
						},
						["火焰灬"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.93,
								},
								["肉搏"] = {
									["count"] = 0.73,
								},
							},
							["amount"] = 3.16,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.65,
								},
								["压制"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.25,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.489999999999999,
								},
							},
							["amount"] = 16.39,
						},
						["龍雲卿"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.9700000000000001,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.83,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.24,
								},
							},
							["amount"] = 12.54,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 24,
								},
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 42,
								},
								["取名不能骚气-黑龙费尔默"] = {
									["count"] = 18,
								},
								["古德斯尼-逐风者"] = {
									["count"] = 15,
								},
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 18,
								},
								["乌勒哈姆"] = {
									["count"] = 18,
								},
								["果不其然-逐风者"] = {
									["count"] = 12,
								},
								["龍雲卿"] = {
									["count"] = 24,
								},
								["二道沟子靓仔-逐风者"] = {
									["count"] = 75,
								},
								["火焰灬"] = {
									["count"] = 15,
								},
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 24,
								},
								["霜如雪"] = {
									["count"] = 9,
								},
							},
							["amount"] = 294,
						},
					},
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 29,
								},
							},
							["amount"] = 42,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 57,
								},
								["Dodge"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Parry"] = {
									["count"] = 3,
								},
							},
							["amount"] = 91,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 198,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 214,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 20,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 37,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 12,
								},
								["Hit"] = {
									["count"] = 42,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 3,
								},
							},
							["amount"] = 66,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 10,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 37,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 3332,
								},
								["圣光术"] = {
									["count"] = 7777,
								},
								["圣疗术"] = {
									["count"] = 3911,
								},
								["圣光闪现"] = {
									["count"] = 48060,
								},
							},
							["amount"] = 63080,
						},
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 2146,
								},
								["嗜血"] = {
									["count"] = 4040,
								},
								["治疗药水"] = {
									["count"] = 4181,
								},
							},
							["amount"] = 10367,
						},
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 6121,
						["Melee"] = 6047,
						["Fire"] = 328,
					},
					["DeathCount"] = 6,
					["GTFOEvents"] = 3,
					["ElementTaken"] = {
						["Holy"] = 4855,
						["Shadow"] = 48952,
						["Melee"] = 13126,
						["Arcane"] = 4066,
						["Physical"] = 16083,
						["Fire"] = 8560,
						["Frost"] = 18342,
						["Nature"] = 3038,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 320,
								},
							},
							["amount"] = 320,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 480,
								},
							},
							["amount"] = 480,
						},
					},
					["Damage"] = 248807,
					["TimeHeal"] = 236.62,
					["ElementDone"] = {
						["Physical"] = 125322,
						["Melee"] = 122853,
						["Fire"] = 632,
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 16,
								},
								["Parry"] = {
									["count"] = 3,
								},
								["Resist"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 11,
								},
								["Tick"] = {
									["count"] = 91,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 79,
								},
								["Hit"] = {
									["count"] = 177,
								},
							},
							["amount"] = 386,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 19,
								},
								["Hit"] = {
									["count"] = 115,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 71,
								},
								["Dodge"] = {
									["count"] = 7,
								},
							},
							["amount"] = 214,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 1185,
								},
								["虚弱之触"] = {
									["count"] = 111,
								},
								["神圣新星"] = {
									["count"] = 263,
								},
								["惩击"] = {
									["count"] = 4592,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 6885,
								},
								["心灵震爆"] = {
									["count"] = 2050,
								},
							},
							["amount"] = 15086,
						},
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 579,
								},
							},
							["amount"] = 579,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1279,
								},
								["嗜血"] = {
									["count"] = 1423,
								},
								["旋风斩"] = {
									["count"] = 2068,
								},
								["英勇打击"] = {
									["count"] = 962,
								},
								["震击"] = {
									["count"] = 248,
								},
								["雷霆一击"] = {
									["count"] = 193,
								},
								["肉搏"] = {
									["count"] = 3376,
								},
							},
							["amount"] = 9598,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 691,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2591,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 145,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 410,
								},
							},
							["amount"] = 3837,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 3990,
								},
								["献祭"] = {
									["count"] = 1246,
								},
								["铁皮手雷"] = {
									["count"] = 541,
								},
								["暗影箭"] = {
									["count"] = 4328,
								},
								["灼热之痛"] = {
									["count"] = 1410,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 4246,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3282,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 19038,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1465,
								},
							},
							["amount"] = 39546,
						},
						["作战小鸡"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 339,
								},
							},
							["amount"] = 339,
						},
						["龍雲卿"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 30,
								},
								["肉搏"] = {
									["count"] = 441,
								},
							},
							["amount"] = 471,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3748,
								},
								["火焰冲击"] = {
									["count"] = 907,
								},
								["冰锥术"] = {
									["count"] = 3522,
								},
								["冰霜新星"] = {
									["count"] = 860,
								},
							},
							["amount"] = 9037,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 48,
								},
								["速效毒药 III"] = {
									["count"] = 216,
								},
								["出血"] = {
									["count"] = 1485,
								},
								["肉搏"] = {
									["count"] = 1582,
								},
							},
							["amount"] = 3331,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 4765,
								},
							},
							["amount"] = 4765,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 239,
								},
								["闪电之盾"] = {
									["count"] = 1285,
								},
								["冰霜震击"] = {
									["count"] = 3882,
								},
								["肉搏"] = {
									["count"] = 4182,
								},
							},
							["amount"] = 9588,
						},
						["火焰灬"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 778,
								},
								["冰霜新星"] = {
									["count"] = 270,
								},
								["魔爆术"] = {
									["count"] = 318,
								},
								["寒冰箭"] = {
									["count"] = 6832,
								},
								["铁皮手雷"] = {
									["count"] = 202,
								},
								["冰锥术"] = {
									["count"] = 2976,
								},
							},
							["amount"] = 11376,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["剑刃乱舞"] = {
									["count"] = 702,
								},
								["凿击"] = {
									["count"] = 49,
								},
								["邪恶攻击"] = {
									["count"] = 1631,
								},
								["刺骨"] = {
									["count"] = 1190,
								},
								["速效毒药 VI"] = {
									["count"] = 879,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 380,
								},
								["肉搏"] = {
									["count"] = 3460,
								},
							},
							["amount"] = 8291,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1093,
								},
							},
							["amount"] = 1093,
						},
					},
					["ElementDoneBlock"] = {
						["Physical"] = 5,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 2.03,
								},
								["嗜血"] = {
									["count"] = 231.36,
								},
								["治疗药水"] = {
									["count"] = 3.23,
								},
							},
							["amount"] = 236.62,
						},
					},
					["Dispelled"] = 15,
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地缚术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 70,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["攻击"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 31,
							["amount"] = 6,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 50,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 50,
						},
						["精神控制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["疲劳诅咒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["驱散魔法"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["重击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["惩击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 45,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 45,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 22,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 91,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 91,
						},
					},
					["ElementTakenResist"] = {
						["Fire"] = 31,
					},
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["神圣新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地缚术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 70,
									["amount"] = 0,
								},
							},
							["count"] = 70,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 50,
									["amount"] = 0,
								},
							},
							["count"] = 50,
							["amount"] = 0,
						},
						["精神控制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["疲劳诅咒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["驱散魔法"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["重击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["惩击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 45,
									["amount"] = 0,
								},
							},
							["count"] = 45,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 91,
									["amount"] = 0,
								},
							},
							["count"] = 91,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 796.9399999999991,
					["InterruptData"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["恐惧嚎叫 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["火焰灬"] = {
							["Details"] = {
								["变形术 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 2,
					["OverHeals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 15,
									["amount"] = 300,
								},
							},
							["count"] = 15,
							["amount"] = 300,
						},
					},
					["WhoDispelled"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["王者祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["自由祝福 (吞噬魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["霜如雪"] = {
							["Details"] = {
								["野性印记 (驱散魔法)"] = {
									["count"] = 1,
								},
								["奥术光辉 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["克萨苏恩 <灌篮高手-逐风者>"] = {
							["Details"] = {
								["霜寒刺骨 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["自由行动 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
								["侦测魔法 (清洁术)"] = {
									["count"] = 1,
								},
								["生命虹吸 (清洁术)"] = {
									["count"] = 1,
								},
								["腐蚀术 (清洁术)"] = {
									["count"] = 2,
								},
								["精灵之火 (清洁术)"] = {
									["count"] = 1,
								},
								["噬灵瘟疫 (纯净术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["自由祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Overhealing"] = 300,
					["Heals"] = {
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1073,
									["count"] = 2,
									["amount"] = 2146,
								},
							},
							["count"] = 2,
							["amount"] = 2146,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 202,
									["amount"] = 4040,
								},
							},
							["count"] = 202,
							["amount"] = 4040,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1650,
									["min"] = 1106,
									["count"] = 3,
									["amount"] = 4181,
								},
							},
							["count"] = 3,
							["amount"] = 4181,
						},
					},
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 320,
								},
								["怒不可遏"] = {
									["count"] = 80,
								},
								["冲锋"] = {
									["count"] = 480,
								},
							},
							["amount"] = 880,
						},
					},
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.09,
								},
								["破胆怒吼"] = {
									["count"] = 0.62,
								},
								["拦截昏迷"] = {
									["count"] = 1.48,
								},
								["旋风斩"] = {
									["count"] = 1.1,
								},
								["嗜血"] = {
									["count"] = 2.6,
								},
								["断筋"] = {
									["count"] = 2.81,
								},
								["斩杀"] = {
									["count"] = 2.43,
								},
								["肉搏"] = {
									["count"] = 21.05,
								},
							},
							["amount"] = 40.68000000000001,
						},
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 2.03,
								},
								["嗜血"] = {
									["count"] = 231.36,
								},
								["治疗药水"] = {
									["count"] = 3.23,
								},
							},
							["amount"] = 236.62,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 2.89,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12.05,
								},
								["缴械"] = {
									["count"] = 0.98,
								},
								["英勇打击"] = {
									["count"] = 2.1,
								},
								["拦截昏迷"] = {
									["count"] = 1.45,
								},
								["旋风斩"] = {
									["count"] = 1.46,
								},
								["嗜血"] = {
									["count"] = 7.56,
								},
								["断筋"] = {
									["count"] = 10.96,
								},
								["斩杀"] = {
									["count"] = 6.739999999999999,
								},
								["肉搏"] = {
									["count"] = 35.10999999999999,
								},
							},
							["amount"] = 81.30000000000003,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 7.699999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6.07,
								},
								["拳击"] = {
									["count"] = 2.58,
								},
								["英勇打击"] = {
									["count"] = 2.77,
								},
								["旋风斩"] = {
									["count"] = 1.46,
								},
								["拦截昏迷"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 9.780000000000001,
								},
								["斩杀"] = {
									["count"] = 3.58,
								},
								["肉搏"] = {
									["count"] = 26.91000000000001,
								},
							},
							["amount"] = 66.84999999999998,
						},
						["作战小鸡"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 1.9,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1.07,
								},
								["旋风斩"] = {
									["count"] = 3.8,
								},
								["嗜血"] = {
									["count"] = 5.4,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.45,
								},
								["拦截昏迷"] = {
									["count"] = 3.82,
								},
								["断筋"] = {
									["count"] = 6.159999999999999,
								},
								["斩杀"] = {
									["count"] = 3.31,
								},
								["肉搏"] = {
									["count"] = 14.13,
								},
							},
							["amount"] = 39.14000000000002,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.17,
								},
								["旋风斩"] = {
									["count"] = 4.91,
								},
								["断筋"] = {
									["count"] = 0.08,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.55,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 16.71,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 0.57,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.94,
								},
								["旋风斩"] = {
									["count"] = 3.57,
								},
								["斩杀"] = {
									["count"] = 3.33,
								},
								["断筋"] = {
									["count"] = 9.24,
								},
								["铁皮手雷"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 16.61,
								},
							},
							["amount"] = 48.76,
						},
						["龍雲卿"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 4.05,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.760000000000002,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.8400000000000001,
								},
								["断筋"] = {
									["count"] = 5.810000000000001,
								},
								["拦截昏迷"] = {
									["count"] = 7.03,
								},
								["斩杀"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 14.89,
								},
							},
							["amount"] = 45.53000000000001,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 5.69,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.310000000000001,
								},
								["英勇打击"] = {
									["count"] = 1.65,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.72,
								},
								["旋风斩"] = {
									["count"] = 4.58,
								},
								["压制"] = {
									["count"] = 6.58,
								},
								["断筋"] = {
									["count"] = 13.61,
								},
								["斩杀"] = {
									["count"] = 2.83,
								},
								["肉搏"] = {
									["count"] = 32.67,
								},
							},
							["amount"] = 74.14,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 10.01,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 25.57,
								},
								["旋风斩"] = {
									["count"] = 1.64,
								},
								["断筋"] = {
									["count"] = 12.26,
								},
								["斩杀"] = {
									["count"] = 1.98,
								},
								["肉搏"] = {
									["count"] = 25.54,
								},
							},
							["amount"] = 78.49999999999997,
						},
						["火焰灬"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.83,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.609999999999999,
								},
								["拳击"] = {
									["count"] = 0.15,
								},
								["断筋"] = {
									["count"] = 3.95,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.53,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2.19,
								},
								["肉搏"] = {
									["count"] = 7.41,
								},
							},
							["amount"] = 26.67,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.67,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.18,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.13,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2.08,
								},
								["肉搏"] = {
									["count"] = 7.440000000000001,
								},
							},
							["amount"] = 27,
						},
						["霜如雪"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.82,
								},
								["旋风斩"] = {
									["count"] = 1.18,
								},
								["断筋"] = {
									["count"] = 0.63,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 7.43,
								},
							},
							["amount"] = 13.14,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 2146,
								},
								["嗜血"] = {
									["count"] = 4040,
								},
								["治疗药水"] = {
									["count"] = 4181,
								},
							},
							["amount"] = 10367,
						},
					},
					["Healing"] = 10367,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["火焰新星"] = {
									["max"] = 554,
									["min"] = 539,
									["count"] = 2,
									["amount"] = 1093,
								},
								["+暴风雪"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 1093,
						},
					},
					["DOT_Time"] = 294,
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1181,
									["min"] = 264,
									["count"] = 15,
									["amount"] = 12798,
								},
								["Hit"] = {
									["max"] = 595,
									["min"] = 189,
									["count"] = 50,
									["amount"] = 20378,
								},
							},
							["count"] = 70,
							["amount"] = 33176,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 148,
									["min"] = 67,
									["count"] = 7,
									["amount"] = 691,
								},
								["Tick"] = {
									["max"] = 190,
									["min"] = 65,
									["count"] = 91,
									["amount"] = 9128,
								},
							},
							["count"] = 98,
							["amount"] = 9819,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
								["Crit"] = {
									["max"] = 131,
									["min"] = 131,
									["count"] = 1,
									["amount"] = 131,
								},
								["Hit"] = {
									["max"] = 55,
									["min"] = 38,
									["count"] = 3,
									["amount"] = 135,
								},
							},
							["count"] = 5,
							["amount"] = 306,
						},
						["缴械"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 196,
									["min"] = 132,
									["count"] = 2,
									["amount"] = 328,
								},
								["Hit"] = {
									["max"] = 154,
									["min"] = 150,
									["count"] = 2,
									["amount"] = 304,
								},
							},
							["count"] = 5,
							["amount"] = 632,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 521,
									["min"] = 521,
									["count"] = 1,
									["amount"] = 521,
								},
								["Crit"] = {
									["max"] = 1454,
									["min"] = 348,
									["count"] = 4,
									["amount"] = 4657,
								},
								["Hit"] = {
									["max"] = 603,
									["min"] = 435,
									["count"] = 5,
									["amount"] = 2506,
								},
							},
							["count"] = 10,
							["amount"] = 7684,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1293,
									["min"] = 658,
									["count"] = 8,
									["amount"] = 8146,
								},
								["Hit"] = {
									["max"] = 538,
									["min"] = 418,
									["count"] = 4,
									["amount"] = 1865,
								},
							},
							["count"] = 12,
							["amount"] = 10011,
						},
						["旋风斩"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 664,
									["min"] = 289,
									["count"] = 27,
									["amount"] = 13095,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 1071,
									["min"] = 1071,
									["count"] = 1,
									["amount"] = 1071,
								},
								["Crit"] = {
									["max"] = 1450,
									["min"] = 591,
									["count"] = 15,
									["amount"] = 15827,
								},
								["Hit (被格挡)"] = {
									["max"] = 396,
									["min"] = 396,
									["count"] = 1,
									["amount"] = 396,
								},
							},
							["count"] = 48,
							["amount"] = 30389,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
								["Hit"] = {
									["max"] = 71,
									["min"] = 40,
									["count"] = 17,
									["amount"] = 903,
								},
							},
							["count"] = 20,
							["amount"] = 956,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 86,
									["min"] = 34,
									["count"] = 4,
									["amount"] = 202,
								},
								["Hit"] = {
									["max"] = 49,
									["min"] = 21,
									["count"] = 53,
									["amount"] = 1805,
								},
								["Dodge"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 92,
									["min"] = 35,
									["count"] = 24,
									["amount"] = 1697,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 87,
							["amount"] = 3704,
						},
						["斩杀"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 506,
									["min"] = 506,
									["count"] = 1,
									["amount"] = 506,
								},
								["Crit"] = {
									["max"] = 3025,
									["min"] = 211,
									["count"] = 12,
									["amount"] = 17040,
								},
								["Hit"] = {
									["max"] = 1859,
									["min"] = 325,
									["count"] = 17,
									["amount"] = 11731,
								},
							},
							["count"] = 30,
							["amount"] = 29277,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 1062,
									["min"] = 1,
									["count"] = 19,
									["amount"] = 9084,
								},
								["Hit"] = {
									["max"] = 690,
									["min"] = 59,
									["count"] = 115,
									["amount"] = 50140,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1239,
									["min"] = 276,
									["count"] = 71,
									["amount"] = 63629,
								},
								["Dodge"] = {
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 214,
							["amount"] = 122853,
						},
					},
					["RageGain"] = 880,
					["DamageTaken"] = 117022,
					["TimeDamage"] = 560.3199999999998,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.09,
								},
								["破胆怒吼"] = {
									["count"] = 0.62,
								},
								["拦截昏迷"] = {
									["count"] = 1.48,
								},
								["旋风斩"] = {
									["count"] = 1.1,
								},
								["嗜血"] = {
									["count"] = 2.6,
								},
								["断筋"] = {
									["count"] = 2.81,
								},
								["斩杀"] = {
									["count"] = 2.43,
								},
								["肉搏"] = {
									["count"] = 21.05,
								},
							},
							["amount"] = 40.68000000000001,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 2.89,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12.05,
								},
								["缴械"] = {
									["count"] = 0.98,
								},
								["英勇打击"] = {
									["count"] = 2.1,
								},
								["拦截昏迷"] = {
									["count"] = 1.45,
								},
								["旋风斩"] = {
									["count"] = 1.46,
								},
								["嗜血"] = {
									["count"] = 7.56,
								},
								["断筋"] = {
									["count"] = 10.96,
								},
								["斩杀"] = {
									["count"] = 6.739999999999999,
								},
								["肉搏"] = {
									["count"] = 35.10999999999999,
								},
							},
							["amount"] = 81.30000000000003,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 7.699999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6.07,
								},
								["拳击"] = {
									["count"] = 2.58,
								},
								["英勇打击"] = {
									["count"] = 2.77,
								},
								["旋风斩"] = {
									["count"] = 1.46,
								},
								["拦截昏迷"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 9.780000000000001,
								},
								["斩杀"] = {
									["count"] = 3.58,
								},
								["肉搏"] = {
									["count"] = 26.91000000000001,
								},
							},
							["amount"] = 66.84999999999998,
						},
						["作战小鸡"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 1.9,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1.07,
								},
								["旋风斩"] = {
									["count"] = 3.8,
								},
								["嗜血"] = {
									["count"] = 5.4,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.45,
								},
								["拦截昏迷"] = {
									["count"] = 3.82,
								},
								["断筋"] = {
									["count"] = 6.159999999999999,
								},
								["斩杀"] = {
									["count"] = 3.31,
								},
								["肉搏"] = {
									["count"] = 14.13,
								},
							},
							["amount"] = 39.14000000000002,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.17,
								},
								["旋风斩"] = {
									["count"] = 4.91,
								},
								["断筋"] = {
									["count"] = 0.08,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.55,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 16.71,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 0.57,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.94,
								},
								["旋风斩"] = {
									["count"] = 3.57,
								},
								["斩杀"] = {
									["count"] = 3.33,
								},
								["断筋"] = {
									["count"] = 9.24,
								},
								["铁皮手雷"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 16.61,
								},
							},
							["amount"] = 48.76,
						},
						["龍雲卿"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 4.05,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9.760000000000002,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.8400000000000001,
								},
								["断筋"] = {
									["count"] = 5.810000000000001,
								},
								["拦截昏迷"] = {
									["count"] = 7.03,
								},
								["斩杀"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 14.89,
								},
							},
							["amount"] = 45.53000000000001,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 5.69,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.310000000000001,
								},
								["英勇打击"] = {
									["count"] = 1.65,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 0.72,
								},
								["旋风斩"] = {
									["count"] = 4.58,
								},
								["压制"] = {
									["count"] = 6.58,
								},
								["断筋"] = {
									["count"] = 13.61,
								},
								["斩杀"] = {
									["count"] = 2.83,
								},
								["肉搏"] = {
									["count"] = 32.67,
								},
							},
							["amount"] = 74.14,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 10.01,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 25.57,
								},
								["旋风斩"] = {
									["count"] = 1.64,
								},
								["断筋"] = {
									["count"] = 12.26,
								},
								["斩杀"] = {
									["count"] = 1.98,
								},
								["肉搏"] = {
									["count"] = 25.54,
								},
							},
							["amount"] = 78.49999999999997,
						},
						["火焰灬"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.83,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.609999999999999,
								},
								["拳击"] = {
									["count"] = 0.15,
								},
								["断筋"] = {
									["count"] = 3.95,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.53,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2.19,
								},
								["肉搏"] = {
									["count"] = 7.41,
								},
							},
							["amount"] = 26.67,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.67,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.18,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.13,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2.08,
								},
								["肉搏"] = {
									["count"] = 7.440000000000001,
								},
							},
							["amount"] = 27,
						},
						["霜如雪"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.82,
								},
								["旋风斩"] = {
									["count"] = 1.18,
								},
								["断筋"] = {
									["count"] = 0.63,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 7.43,
								},
							},
							["amount"] = 13.14,
						},
					},
					["GTFOEventDamage"] = 1093,
					["HealingTaken"] = 73447,
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3242,
								},
								["英勇打击"] = {
									["count"] = 603,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 900,
								},
								["旋风斩"] = {
									["count"] = 2619,
								},
								["断筋"] = {
									["count"] = 210,
								},
								["斩杀"] = {
									["count"] = 2114,
								},
								["肉搏"] = {
									["count"] = 11820,
								},
							},
							["amount"] = 21508,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1502,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1225,
								},
								["嗜血"] = {
									["count"] = 4840,
								},
								["旋风斩"] = {
									["count"] = 1978,
								},
								["英勇打击"] = {
									["count"] = 880,
								},
								["断筋"] = {
									["count"] = 340,
								},
								["斩杀"] = {
									["count"] = 5979,
								},
								["肉搏"] = {
									["count"] = 12976,
								},
							},
							["amount"] = 29720,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 6835,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 634,
								},
								["拳击"] = {
									["count"] = 226,
								},
								["英勇打击"] = {
									["count"] = 2323,
								},
								["旋风斩"] = {
									["count"] = 6452,
								},
								["拦截昏迷"] = {
									["count"] = 242,
								},
								["断筋"] = {
									["count"] = 586,
								},
								["斩杀"] = {
									["count"] = 6113,
								},
								["肉搏"] = {
									["count"] = 17030,
								},
							},
							["amount"] = 40441,
						},
						["作战小鸡"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 281,
								},
								["肉搏"] = {
									["count"] = 695,
								},
							},
							["amount"] = 976,
						},
						["霜如雪"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1302,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 246,
								},
								["旋风斩"] = {
									["count"] = 456,
								},
								["断筋"] = {
									["count"] = 82,
								},
								["拳击"] = {
									["count"] = 42,
								},
								["肉搏"] = {
									["count"] = 3553,
								},
							},
							["amount"] = 5681,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 483,
								},
								["旋风斩"] = {
									["count"] = 1901,
								},
								["嗜血"] = {
									["count"] = 3953,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 393,
								},
								["拦截昏迷"] = {
									["count"] = 148,
								},
								["断筋"] = {
									["count"] = 302,
								},
								["斩杀"] = {
									["count"] = 3067,
								},
								["肉搏"] = {
									["count"] = 10505,
								},
							},
							["amount"] = 20752,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 500,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 471,
								},
								["压制"] = {
									["count"] = 1108,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["嗜血"] = {
									["count"] = 1032,
								},
								["旋风斩"] = {
									["count"] = 2354,
								},
								["斩杀"] = {
									["count"] = 1879,
								},
								["断筋"] = {
									["count"] = 343,
								},
								["铁皮手雷"] = {
									["count"] = 196,
								},
								["肉搏"] = {
									["count"] = 10276,
								},
							},
							["amount"] = 18208,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 446,
								},
								["旋风斩"] = {
									["count"] = 2648,
								},
								["断筋"] = {
									["count"] = 32,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 675,
								},
								["肉搏"] = {
									["count"] = 1331,
								},
							},
							["amount"] = 5132,
						},
						["龍雲卿"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1152,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 677,
								},
								["铁皮手雷"] = {
									["count"] = 154,
								},
								["英勇打击"] = {
									["count"] = 1403,
								},
								["旋风斩"] = {
									["count"] = 1424,
								},
								["拦截昏迷"] = {
									["count"] = 321,
								},
								["断筋"] = {
									["count"] = 471,
								},
								["斩杀"] = {
									["count"] = 325,
								},
								["肉搏"] = {
									["count"] = 7791,
								},
							},
							["amount"] = 13718,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 150,
								},
								["嗜血"] = {
									["count"] = 4855,
								},
								["旋风斩"] = {
									["count"] = 3146,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2630,
								},
								["断筋"] = {
									["count"] = 513,
								},
								["斩杀"] = {
									["count"] = 2011,
								},
								["肉搏"] = {
									["count"] = 17693,
								},
							},
							["amount"] = 30998,
						},
						["火焰灬"] = {
							["Details"] = {
								["拳击"] = {
									["count"] = 38,
								},
								["断筋"] = {
									["count"] = 189,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 574,
								},
								["旋风斩"] = {
									["count"] = 1896,
								},
								["铁皮手雷"] = {
									["count"] = 132,
								},
								["拦截昏迷"] = {
									["count"] = 105,
								},
								["斩杀"] = {
									["count"] = 2736,
								},
								["肉搏"] = {
									["count"] = 3001,
								},
							},
							["amount"] = 8671,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 70,
								},
								["嗜血"] = {
									["count"] = 1533,
								},
								["旋风斩"] = {
									["count"] = 1948,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 839,
								},
								["拦截昏迷"] = {
									["count"] = 43,
								},
								["斩杀"] = {
									["count"] = 2558,
								},
								["肉搏"] = {
									["count"] = 5312,
								},
							},
							["amount"] = 12303,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3705,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 555,
								},
								["英勇打击"] = {
									["count"] = 1975,
								},
								["拦截昏迷"] = {
									["count"] = 48,
								},
								["旋风斩"] = {
									["count"] = 3567,
								},
								["压制"] = {
									["count"] = 6918,
								},
								["断筋"] = {
									["count"] = 566,
								},
								["斩杀"] = {
									["count"] = 2495,
								},
								["肉搏"] = {
									["count"] = 20870,
								},
							},
							["amount"] = 40699,
						},
					},
				},
			},
			["UnitLockout"] = 21755.331,
			["LastActive"] = 23541.332,
		},
		["非洲大佬 <哔哔妹-老马布兰契>"] = {
			["GUID"] = "Pet-0-5427-489-17662-5828-03012344EB",
			["LastEventHealth"] = {
				3589, -- [1]
				3589, -- [2]
				3589, -- [3]
				3589, -- [4]
				3589, -- [5]
				3589, -- [6]
				3589, -- [7]
				3589, -- [8]
				3499, -- [9]
			},
			["LastAttackedBy"] = "芬达么有糖-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
			},
			["TimeWindows"] = {
				["Damage"] = {
					216, -- [1]
				},
				["TimeDamage"] = {
					1.62, -- [1]
				},
				["DamageTaken"] = {
					1848, -- [1]
				},
				["ActiveTime"] = {
					1.62, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "非洲大佬",
			["level"] = 1,
			["LastDamageAbility"] = "旋风斩",
			["LastFightIn"] = 12,
			["type"] = "Pet",
			["ownerName"] = "哔哔妹-老马布兰契",
			["LastEventHealthMax"] = {
				3589, -- [1]
				3589, -- [2]
				3589, -- [3]
				3589, -- [4]
				3589, -- [5]
				3589, -- [6]
				3589, -- [7]
				3589, -- [8]
				3589, -- [9]
			},
			["LastDamageTaken"] = 785,
			["TimeLast"] = {
				["ActiveTime"] = 22841.326,
				["TimeDamage"] = 22841.326,
				["OVERALL"] = 23496.33,
				["DamageTaken"] = 23496.33,
				["Damage"] = 22841.326,
			},
			["NextEventNum"] = 10,
			["LastDamageTime"] = 22841.509,
			["LastEvents"] = {
				"芬达么有糖-黑龙费尔默 旋风斩 非洲大佬 <哔哔妹-老马布兰契> Hit -390 (Physical)", -- [1]
				"非洲大佬 <哔哔妹-老马布兰契> 肉搏 火焰灬 Hit -108 (Physical)", -- [2]
				"火焰灬 冰冻 非洲大佬 <哔哔妹-老马布兰契> Resist (Frost)", -- [3]
				"非洲大佬 <哔哔妹-老马布兰契> 撕咬 火焰灬 Hit -108 (Physical)", -- [4]
				"古德斯尼-逐风者 魔爆术 非洲大佬 <哔哔妹-老马布兰契> Crit -334 (74 被抵抗) (Arcane)", -- [5]
				"古德斯尼-逐风者 冰霜新星 非洲大佬 <哔哔妹-老马布兰契> Crit -163 (Frost)", -- [6]
				"古德斯尼-逐风者 冰霜新星 非洲大佬 <哔哔妹-老马布兰契> Hit -86 (Frost)", -- [7]
				"古德斯尼-逐风者 冰霜新星 非洲大佬 <哔哔妹-老马布兰契> Hit -90 (Frost)", -- [8]
				"芬达么有糖-黑龙费尔默 旋风斩 非洲大佬 <哔哔妹-老马布兰契> Crit -785 (Physical)", -- [9]
			},
			["Name"] = "非洲大佬",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
			},
			["LastEventTimes"] = {
				22645.682, -- [1]
				22841.393, -- [2]
				22841.393, -- [3]
				22841.509, -- [4]
				22854.06, -- [5]
				22892.412, -- [6]
				22933.681, -- [7]
				23487.213, -- [8]
				23497.247, -- [9]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 875,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 785,
						["Frost"] = 90,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 785,
								},
							},
							["amount"] = 785,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["火焰灬"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.62,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["火焰灬"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 108,
								},
								["肉搏"] = {
									["count"] = 108,
								},
							},
							["amount"] = 216,
						},
					},
					["ElementDone"] = {
						["Melee"] = 108,
						["Physical"] = 108,
					},
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 108,
									["min"] = 108,
									["count"] = 1,
									["amount"] = 108,
								},
							},
							["count"] = 1,
							["amount"] = 108,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 108,
									["min"] = 108,
									["count"] = 1,
									["amount"] = 108,
								},
							},
							["count"] = 1,
							["amount"] = 108,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 1848,
					["ElementTakenResist"] = {
						["Arcane"] = 148,
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 148,
									["min"] = 148,
									["count"] = 1,
									["amount"] = 148,
								},
							},
							["count"] = 148,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["TimeDamaging"] = {
						["火焰灬"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.62,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 1.62,
					["WhoDamaged"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1175,
								},
							},
							["amount"] = 1175,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 334,
								},
								["冰霜新星"] = {
									["count"] = 339,
								},
							},
							["amount"] = 673,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 1175,
						["Frost"] = 339,
						["Arcane"] = 334,
					},
					["TimeDamage"] = 1.62,
					["Damage"] = 216,
				},
			},
			["UnitLockout"] = 22645.332,
			["LastActive"] = 23496.33,
		},
		["熊一-老马布兰契"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
					},
					["Messages"] = {
						"芬达么有糖-黑龙费尔默 肉搏 熊一-老马布兰契 Hit -329 (Physical)", -- [1]
						"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -18 (Nature)", -- [2]
						"古德斯尼-逐风者 魔爆术 熊一-老马布兰契 Hit -299 (Arcane)", -- [3]
						"古德斯尼-逐风者 冰霜新星 熊一-老马布兰契 Resist (Frost)", -- [4]
						"古德斯尼-逐风者 火焰冲击 熊一-老马布兰契 Hit -621 (Fire)", -- [5]
						"古德斯尼-逐风者 冰锥术 熊一-老马布兰契 Crit -1044 (Frost)", -- [6]
						"古德斯尼-逐风者 魔爆术 熊一-老马布兰契 Crit -433 (Arcane)", -- [7]
						"熊一-老马布兰契死亡。", -- [8]
						"熊一-老马布兰契 月火术 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Absorb -72 (72 被吸收) (Arcane)", -- [9]
					},
					["DeathAt"] = 22918.33,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["MessageTimes"] = {
						-13.78399999999965, -- [1]
						-13.76699999999983, -- [2]
						-13.41100000000006, -- [3]
						-11.90000000000146, -- [4]
						-3.015999999999622, -- [5]
						-1.515999999999622, -- [6]
						-0.01599999999962165, -- [7]
						0, -- [8]
						0.8169999999990978, -- [9]
					},
					["HealthMax"] = {
						3563, -- [1]
						3563, -- [2]
						3563, -- [3]
						3563, -- [4]
						3563, -- [5]
						3563, -- [6]
						3563, -- [7]
						3443, -- [8]
						3443, -- [9]
					},
					["Health"] = {
						3563, -- [1]
						3563, -- [2]
						3234, -- [3]
						2935, -- [4]
						2935, -- [5]
						2314, -- [6]
						379, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["KilledBy"] = "古德斯尼-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"MISC", -- [8]
						"DAMAGE", -- [9]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
					},
					["Messages"] = {
						"熊一-老马布兰契 槌击 芬达么有糖-黑龙费尔默 Hit -317 (Physical)", -- [1]
						"芬达么有糖-黑龙费尔默 英勇打击 熊一-老马布兰契 Hit -305 (Physical)", -- [2]
						"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [3]
						"火焰灬 寒冰箭 熊一-老马布兰契 Hit -643 (Frost)", -- [4]
						"芬达么有糖-黑龙费尔默 拦截昏迷 熊一-老马布兰契 Hit -54 (Physical)", -- [5]
						"芬达么有糖-黑龙费尔默 肉搏 熊一-老马布兰契 Hit -297 (Physical)", -- [6]
						"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [7]
						"火焰灬 寒冰箭 熊一-老马布兰契 Hit -625 (Frost)", -- [8]
						"芬达么有糖-黑龙费尔默 旋风斩 熊一-老马布兰契 Hit -296 (Physical)", -- [9]
						"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -19 (Nature)", -- [10]
						"熊一-老马布兰契 肉搏 芬达么有糖-黑龙费尔默 Hit -103 (Physical)", -- [11]
						"芬达么有糖-黑龙费尔默 肉搏 熊一-老马布兰契 Hit -180 (Physical)", -- [12]
						"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [13]
						"火焰灬 寒冰箭 熊一-老马布兰契 Hit -637 (Frost)", -- [14]
						"火焰灬 火焰冲击 熊一-老马布兰契 Crit -874 (Fire)", -- [15]
						"熊一-老马布兰契 肉搏 芬达么有糖-黑龙费尔默 Hit -151 (Physical)", -- [16]
						"火焰灬 冰霜新星 熊一-老马布兰契 Crit -164 (Frost)", -- [17]
						"芬达么有糖-黑龙费尔默 斩杀 熊一-老马布兰契 Hit -322 (Physical)", -- [18]
						"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [19]
						"熊一-老马布兰契死亡。", -- [20]
					},
					["DeathAt"] = 22830.325,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
					},
					["MessageTimes"] = {
						-11.8169999999991, -- [1]
						-11.76699999999983, -- [2]
						-11.76699999999983, -- [3]
						-7.734000000000378, -- [4]
						-6.617000000002008, -- [5]
						-5.566999999999098, -- [6]
						-5.549999999999272, -- [7]
						-4.350000000002183, -- [8]
						-3.667000000001281, -- [9]
						-3.667000000001281, -- [10]
						-3.25, -- [11]
						-2.367000000002008, -- [12]
						-2.350000000002183, -- [13]
						-1.850000000002183, -- [14]
						-1.717000000000553, -- [15]
						-0.8500000000021828, -- [16]
						-0.03299999999944703, -- [17]
						-0.03299999999944703, -- [18]
						-0.01699999999982538, -- [19]
						0, -- [20]
					},
					["HealthMax"] = {
						5253, -- [1]
						5253, -- [2]
						5253, -- [3]
						3563, -- [4]
						3563, -- [5]
						3563, -- [6]
						3563, -- [7]
						3563, -- [8]
						3563, -- [9]
						3563, -- [10]
						3563, -- [11]
						5253, -- [12]
						5253, -- [13]
						5253, -- [14]
						5253, -- [15]
						5253, -- [16]
						5253, -- [17]
						5253, -- [18]
						5253, -- [19]
						3443, -- [20]
					},
					["Health"] = {
						4904, -- [1]
						4904, -- [2]
						4904, -- [3]
						3210, -- [4]
						2567, -- [5]
						2513, -- [6]
						2216, -- [7]
						2216, -- [8]
						1591, -- [9]
						1591, -- [10]
						1295, -- [11]
						1909, -- [12]
						1729, -- [13]
						1729, -- [14]
						1092, -- [15]
						218, -- [16]
						218, -- [17]
						218, -- [18]
						218, -- [19]
						0, -- [20]
					},
					["KilledBy"] = "芬达么有糖-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"MISC", -- [20]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
					},
					["Messages"] = {
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 熊一-老马布兰契 Tick -185 (Shadow)", -- [1]
						"清风徐自来-火妖鲁西弗隆 心灵震爆 熊一-老马布兰契 Hit -628 (Shadow)", -- [2]
						"阿拉希的传说-火妖鲁西弗隆 邪恶攻击 熊一-老马布兰契 Hit -131 (Physical)", -- [3]
						"阿拉希的传说-火妖鲁西弗隆 速效毒药 VI 熊一-老马布兰契 Hit -116 (Nature)", -- [4]
						"阿拉希的传说-火妖鲁西弗隆 肉搏 熊一-老马布兰契 Crit -225 (Physical)", -- [5]
						"熊一-老马布兰契死亡。", -- [6]
					},
					["DeathAt"] = 22068.332,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
					},
					["MessageTimes"] = {
						-2.717000000000553, -- [1]
						-2.283999999999651, -- [2]
						-0.1670000000012806, -- [3]
						-0.1670000000012806, -- [4]
						-0.03399999999965075, -- [5]
						0, -- [6]
					},
					["HealthMax"] = {
						3443, -- [1]
						5103, -- [2]
						5103, -- [3]
						5103, -- [4]
						5103, -- [5]
						3443, -- [6]
					},
					["Health"] = {
						792, -- [1]
						899, -- [2]
						271, -- [3]
						271, -- [4]
						24, -- [5]
						0, -- [6]
					},
					["KilledBy"] = "阿拉希的传说-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"MISC", -- [6]
					},
				}, -- [3]
			},
			["LastEventHealth"] = {
				3563, -- [1]
				3234, -- [2]
				2935, -- [3]
				2935, -- [4]
				2314, -- [5]
				379, -- [6]
				0, -- [7]
				0, -- [8]
				1, -- [9]
				3563, -- [10]
				3035, -- [11]
				2819, -- [12]
				2604, -- [13]
				2406, -- [14]
				2191, -- [15]
				594, -- [16]
				3792, -- [17]
				3358, -- [18]
				3358, -- [19]
				3358, -- [20]
				3358, -- [21]
				3332, -- [22]
				4122, -- [23]
				4908, -- [24]
				4908, -- [25]
				3307, -- [26]
				4904, -- [27]
				4904, -- [28]
				4904, -- [29]
				3210, -- [30]
				2567, -- [31]
				2513, -- [32]
				2216, -- [33]
				2216, -- [34]
				1591, -- [35]
				1591, -- [36]
				1295, -- [37]
				1909, -- [38]
				1729, -- [39]
				1729, -- [40]
				1092, -- [41]
				218, -- [42]
				218, -- [43]
				218, -- [44]
				218, -- [45]
				0, -- [46]
				5173, -- [47]
				5173, -- [48]
				3563, -- [49]
				3563, -- [50]
			},
			["LastAttackedBy"] = "取名不能骚气-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"MISC", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"HEAL", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"MISC", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					9, -- [1]
				},
				["Dispelled"] = {
					3, -- [1]
				},
				["Dispels"] = {
					1, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["Healing"] = {
					1067, -- [1]
				},
				["DamageTaken"] = {
					28125, -- [1]
				},
				["ActiveTime"] = {
					130.4, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["HealingTaken"] = {
					9808, -- [1]
				},
				["Overhealing"] = {
					1044, -- [1]
				},
				["TimeDamage"] = {
					121.4, -- [1]
				},
				["HOT_Time"] = {
					21, -- [1]
				},
				["RageGain"] = {
					175, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["Damage"] = {
					16672, -- [1]
				},
			},
			["LastHealTime"] = 21850.086,
			["LastDamageTaken"] = 234,
			["level"] = 60,
			["LastDamageAbility"] = "腐蚀术 (伤害/跳)",
			["LastFightIn"] = 12,
			["GUID"] = "Player-5447-03696FEA",
			["type"] = "Grouped",
			["TimeLast"] = {
				["Interrupts"] = 22310.329,
				["TimeHeal"] = 21849.336,
				["Dispelled"] = 22008.329,
				["Dispels"] = 21830.335,
				["ActiveTime"] = 22920.331,
				["OVERALL"] = 23504.33,
				["DamageTaken"] = 23504.33,
				["DeathCount"] = 22916.33,
				["HOT_Time"] = 21855.337,
				["HealingTaken"] = 22712.335,
				["Overhealing"] = 21855.337,
				["TimeDamage"] = 22920.331,
				["Healing"] = 21849.336,
				["RageGain"] = 22882.328,
				["DOT_Time"] = 22920.331,
				["Damage"] = 22920.331,
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3563, -- [1]
				3563, -- [2]
				3563, -- [3]
				3563, -- [4]
				3563, -- [5]
				3563, -- [6]
				3443, -- [7]
				3443, -- [8]
				3443, -- [9]
				3563, -- [10]
				3563, -- [11]
				3563, -- [12]
				3563, -- [13]
				3563, -- [14]
				3563, -- [15]
				3563, -- [16]
				5253, -- [17]
				5253, -- [18]
				5253, -- [19]
				5253, -- [20]
				5253, -- [21]
				5253, -- [22]
				5253, -- [23]
				5253, -- [24]
				5253, -- [25]
				3563, -- [26]
				5253, -- [27]
				5253, -- [28]
				5253, -- [29]
				3563, -- [30]
				3563, -- [31]
				3563, -- [32]
				3563, -- [33]
				3563, -- [34]
				3563, -- [35]
				3563, -- [36]
				3563, -- [37]
				5253, -- [38]
				5253, -- [39]
				5253, -- [40]
				5253, -- [41]
				5253, -- [42]
				5253, -- [43]
				5253, -- [44]
				5253, -- [45]
				3443, -- [46]
				5253, -- [47]
				5253, -- [48]
				3563, -- [49]
				3563, -- [50]
			},
			["NextEventNum"] = 17,
			["LastDamageTime"] = 22920.497,
			["LastEvents"] = {
				"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -18 (Nature)", -- [1]
				"古德斯尼-逐风者 魔爆术 熊一-老马布兰契 Hit -299 (Arcane)", -- [2]
				"古德斯尼-逐风者 冰霜新星 熊一-老马布兰契 Resist (Frost)", -- [3]
				"古德斯尼-逐风者 火焰冲击 熊一-老马布兰契 Hit -621 (Fire)", -- [4]
				"古德斯尼-逐风者 冰锥术 熊一-老马布兰契 Crit -1044 (Frost)", -- [5]
				"古德斯尼-逐风者 魔爆术 熊一-老马布兰契 Crit -433 (Arcane)", -- [6]
				"熊一-老马布兰契死亡。", -- [7]
				"熊一-老马布兰契 月火术 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Absorb -72 (72 被吸收) (Arcane)", -- [8]
				"熊一-老马布兰契 月火术 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Absorb -96 (96 被吸收) (Arcane)", -- [9]
				"火焰灬 冰锥术 熊一-老马布兰契 Hit -528 (Frost)", -- [10]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 熊一-老马布兰契 Tick -234 (Shadow)", -- [11]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 熊一-老马布兰契 Tick -234 (Shadow)", -- [12]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 熊一-老马布兰契 Tick -234 (Shadow)", -- [13]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 熊一-老马布兰契 Tick -234 (Shadow)", -- [14]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 熊一-老马布兰契 Tick -234 (Shadow)", -- [15]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 熊一-老马布兰契 Tick -234 (Shadow)", -- [16]
				"古德斯尼-逐风者 魔爆术 熊一-老马布兰契 Crit -434 (Arcane)", -- [17]
				"熊一-老马布兰契 槌击 火焰灬 Immune (Physical)", -- [18]
				"火焰灬 肉搏 熊一-老马布兰契 Hit -26 (Physical)", -- [19]
				"熊一-老马布兰契 肉搏 火焰灬 Absorb -18 (1)", -- [20]
				"熊一-老马布兰契 荆棘术 火焰灬 Hit -0 (18 被吸收) (Nature)", -- [21]
				"商山-逐风者 圣光闪现 熊一-老马布兰契 Hit +772", -- [22]
				"商山-逐风者 圣光闪现 熊一-老马布兰契 Hit +768", -- [23]
				"芬达么有糖-黑龙费尔默 肉搏 熊一-老马布兰契 Hit -170 (Physical)", -- [24]
				"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -18 (Nature)", -- [25]
				"商山-逐风者 圣光闪现 熊一-老马布兰契 Hit +747 (491 过量治疗)", -- [26]
				"熊一-老马布兰契 槌击 芬达么有糖-黑龙费尔默 Hit -317 (Physical)", -- [27]
				"芬达么有糖-黑龙费尔默 英勇打击 熊一-老马布兰契 Hit -305 (Physical)", -- [28]
				"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [29]
				"火焰灬 寒冰箭 熊一-老马布兰契 Hit -643 (Frost)", -- [30]
				"芬达么有糖-黑龙费尔默 拦截昏迷 熊一-老马布兰契 Hit -54 (Physical)", -- [31]
				"芬达么有糖-黑龙费尔默 肉搏 熊一-老马布兰契 Hit -297 (Physical)", -- [32]
				"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [33]
				"火焰灬 寒冰箭 熊一-老马布兰契 Hit -625 (Frost)", -- [34]
				"芬达么有糖-黑龙费尔默 旋风斩 熊一-老马布兰契 Hit -296 (Physical)", -- [35]
				"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -19 (Nature)", -- [36]
				"熊一-老马布兰契 肉搏 芬达么有糖-黑龙费尔默 Hit -103 (Physical)", -- [37]
				"芬达么有糖-黑龙费尔默 肉搏 熊一-老马布兰契 Hit -180 (Physical)", -- [38]
				"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [39]
				"火焰灬 寒冰箭 熊一-老马布兰契 Hit -637 (Frost)", -- [40]
				"火焰灬 火焰冲击 熊一-老马布兰契 Crit -874 (Fire)", -- [41]
				"熊一-老马布兰契 肉搏 芬达么有糖-黑龙费尔默 Hit -151 (Physical)", -- [42]
				"火焰灬 冰霜新星 熊一-老马布兰契 Crit -164 (Frost)", -- [43]
				"芬达么有糖-黑龙费尔默 斩杀 熊一-老马布兰契 Hit -322 (Physical)", -- [44]
				"熊一-老马布兰契 荆棘术 芬达么有糖-黑龙费尔默 Hit -20 (Nature)", -- [45]
				"熊一-老马布兰契死亡。", -- [46]
				"熊一-老马布兰契 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -144 (144 被吸收) (1)", -- [47]
				"熊一-老马布兰契 精灵之火（野性） 清风徐自来-火妖鲁西弗隆 Resist (Nature)", -- [48]
				"熊一-老马布兰契 纠缠根须 清风徐自来-火妖鲁西弗隆 Immune (Nature)", -- [49]
				"芬达么有糖-黑龙费尔默 肉搏 熊一-老马布兰契 Hit -329 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["Name"] = "熊一-老马布兰契",
			["LastEventTimes"] = {
				22902.913, -- [1]
				22903.269, -- [2]
				22904.78, -- [3]
				22913.664, -- [4]
				22915.164, -- [5]
				22916.664, -- [6]
				22916.68, -- [7]
				22917.497, -- [8]
				22920.497, -- [9]
				23484.929, -- [10]
				23490.196, -- [11]
				23493.196, -- [12]
				23496.213, -- [13]
				23499.197, -- [14]
				23502.214, -- [15]
				23505.197, -- [16]
				22696.051, -- [17]
				22696.418, -- [18]
				22698.335, -- [19]
				22698.352, -- [20]
				22698.352, -- [21]
				22704.318, -- [22]
				22705.835, -- [23]
				22708.452, -- [24]
				22708.468, -- [25]
				22712.902, -- [26]
				22817.225, -- [27]
				22817.275, -- [28]
				22817.275, -- [29]
				22821.308, -- [30]
				22822.425, -- [31]
				22823.475, -- [32]
				22823.492, -- [33]
				22824.692, -- [34]
				22825.375, -- [35]
				22825.375, -- [36]
				22825.792, -- [37]
				22826.675, -- [38]
				22826.692, -- [39]
				22827.192, -- [40]
				22827.325, -- [41]
				22828.192, -- [42]
				22829.009, -- [43]
				22829.009, -- [44]
				22829.025, -- [45]
				22829.042, -- [46]
				22884.295, -- [47]
				22888.929, -- [48]
				22892.746, -- [49]
				22902.896, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1932,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 1404,
						["Frost"] = 528,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1404,
								},
							},
							["amount"] = 1404,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 528,
								},
							},
							["amount"] = 528,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 3.47,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 2.63,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.1,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 9.680000000000001,
								},
								["槌击"] = {
									["count"] = 5.98,
								},
								["肉搏"] = {
									["count"] = 9.959999999999999,
								},
								["荆棘术"] = {
									["count"] = 15.55,
								},
							},
							["amount"] = 41.17,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["纠缠根须"] = {
									["count"] = 1.5,
								},
								["精灵之火（野性）"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
								["挥击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.04,
								},
							},
							["amount"] = 1.04,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 4.060000000000001,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 6.83,
						},
						["龍雲卿"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 4.5,
								},
								["精灵之火（野性）"] = {
									["count"] = 1.5,
								},
								["荆棘术"] = {
									["count"] = 2.78,
								},
								["挥击"] = {
									["count"] = 3.71,
								},
								["肉搏"] = {
									["count"] = 9.53,
								},
							},
							["amount"] = 22.02,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 2.75,
								},
								["槌击"] = {
									["count"] = 8.1,
								},
								["肉搏"] = {
									["count"] = 4.23,
								},
							},
							["amount"] = 15.08,
						},
						["火焰灬"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.64,
								},
								["槌击"] = {
									["count"] = 0.52,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5.16,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.5,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
						["熊一-老马布兰契"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8741,
								},
							},
							["amount"] = 8741,
						},
						["熊一-老马布兰契"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 1067,
								},
							},
							["amount"] = 1067,
						},
					},
					["ElementDoneAbsorb"] = {
						["Arcane"] = 168,
						["Physical"] = 560,
						["Melee"] = 535,
						["Nature"] = 18,
					},
					["DeathCount"] = 3,
					["Overhealing"] = 1044,
					["ElementTaken"] = {
						["Physical"] = 3986,
						["Melee"] = 3140,
						["Arcane"] = 2205,
						["Shadow"] = 7752,
						["Fire"] = 2178,
						["Frost"] = 7583,
						["Nature"] = 1281,
					},
					["RageGained"] = {
						["原始狂怒"] = {
							["Details"] = {
								["熊一-老马布兰契"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
						["激怒"] = {
							["Details"] = {
								["熊一-老马布兰契"] = {
									["count"] = 100,
								},
							},
							["amount"] = 100,
						},
					},
					["Damage"] = 16672,
					["TimeHeal"] = 9,
					["Dispels"] = 1,
					["ElementDone"] = {
						["Arcane"] = 168,
						["Physical"] = 9028,
						["Melee"] = 7070,
						["Nature"] = 406,
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 609,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 60,
								},
								["槌击"] = {
									["count"] = 293,
								},
								["肉搏"] = {
									["count"] = 182,
								},
							},
							["amount"] = 1144,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 886,
								},
								["槌击"] = {
									["count"] = 1287,
								},
								["肉搏"] = {
									["count"] = 2256,
								},
								["荆棘术"] = {
									["count"] = 310,
								},
							},
							["amount"] = 4739,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 96,
								},
								["槌击"] = {
									["count"] = 893,
								},
								["肉搏"] = {
									["count"] = 1254,
								},
							},
							["amount"] = 2243,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 82,
								},
							},
							["amount"] = 82,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 539,
								},
							},
							["amount"] = 539,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 74,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 168,
								},
								["肉搏"] = {
									["count"] = 144,
								},
							},
							["amount"] = 386,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 234,
								},
								["肉搏"] = {
									["count"] = 198,
								},
							},
							["amount"] = 432,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 478,
								},
								["槌击"] = {
									["count"] = 1852,
								},
								["肉搏"] = {
									["count"] = 844,
								},
							},
							["amount"] = 3174,
						},
						["火焰灬"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 176,
								},
								["荆棘术"] = {
									["count"] = 0,
								},
								["肉搏"] = {
									["count"] = 208,
								},
							},
							["amount"] = 384,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 85,
								},
								["槌击"] = {
									["count"] = 407,
								},
								["肉搏"] = {
									["count"] = 186,
								},
							},
							["amount"] = 678,
						},
						["龍雲卿"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 244,
								},
								["槌击"] = {
									["count"] = 793,
								},
								["荆棘术"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 1798,
								},
							},
							["amount"] = 2871,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 101,
								},
							},
							["amount"] = 101,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1061,
								},
								["雷霆一击"] = {
									["count"] = 53,
								},
								["嗜血"] = {
									["count"] = 458,
								},
								["旋风斩"] = {
									["count"] = 1481,
								},
								["英勇打击"] = {
									["count"] = 305,
								},
								["拦截昏迷"] = {
									["count"] = 54,
								},
								["斩杀"] = {
									["count"] = 322,
								},
								["肉搏"] = {
									["count"] = 2740,
								},
							},
							["amount"] = 6474,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 188,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5361,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1477,
								},
							},
							["amount"] = 7026,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1760,
								},
								["火焰冲击"] = {
									["count"] = 621,
								},
								["冰锥术"] = {
									["count"] = 1575,
								},
								["冰霜新星"] = {
									["count"] = 441,
								},
							},
							["amount"] = 4397,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 185,
								},
								["心灵震爆"] = {
									["count"] = 628,
								},
							},
							["amount"] = 813,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 225,
								},
								["剑刃乱舞"] = {
									["count"] = 53,
								},
								["速效毒药 VI"] = {
									["count"] = 116,
								},
								["邪恶攻击"] = {
									["count"] = 131,
								},
							},
							["amount"] = 525,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 571,
								},
								["闪电之盾"] = {
									["count"] = 1131,
								},
							},
							["amount"] = 1702,
						},
						["火焰灬"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 874,
								},
								["冰霜新星"] = {
									["count"] = 244,
								},
								["魔爆术"] = {
									["count"] = 445,
								},
								["寒冰箭"] = {
									["count"] = 3187,
								},
								["肉搏"] = {
									["count"] = 26,
								},
								["冰锥术"] = {
									["count"] = 1565,
								},
							},
							["amount"] = 6341,
						},
						["龍雲卿"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 34,
								},
								["爪击"] = {
									["count"] = 68,
								},
								["肉搏"] = {
									["count"] = 149,
								},
							},
							["amount"] = 251,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 495,
								},
							},
							["amount"] = 495,
						},
					},
					["TimeHealing"] = {
						["熊一-老马布兰契"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["Dispelled"] = 3,
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电之盾"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 59,
									["min"] = 59,
									["count"] = 1,
									["amount"] = 59,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 59,
							["amount"] = 5,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 23,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
					},
					["InterruptData"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["快速治疗 (野性冲锋效果)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 130.4,
					["Interrupts"] = 1,
					["DOT_Time"] = 12,
					["ElementTakenResist"] = {
						["Nature"] = 59,
					},
					["WhoDispelled"] = {
						["熊一-老马布兰契"] = {
							["Details"] = {
								["痛苦诅咒 (解除诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["荆棘术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["野性印记 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["HOTs"] = {
						["愈合"] = {
							["Details"] = {
								["熊一-老马布兰契"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["Heals"] = {
						["愈合"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 154,
									["min"] = 147,
									["count"] = 5,
									["amount"] = 763,
								},
								["Hit"] = {
									["max"] = 304,
									["min"] = 304,
									["count"] = 1,
									["amount"] = 304,
								},
							},
							["count"] = 6,
							["amount"] = 1067,
						},
					},
					["HOT_Time"] = 21,
					["OverHeals"] = {
						["愈合"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 154,
									["min"] = 7,
									["count"] = 3,
									["amount"] = 314,
								},
								["Hit"] = {
									["max"] = 730,
									["min"] = 730,
									["count"] = 1,
									["amount"] = 730,
								},
							},
							["count"] = 4,
							["amount"] = 1044,
						},
					},
					["HealedWho"] = {
						["熊一-老马布兰契"] = {
							["Details"] = {
								["愈合"] = {
									["count"] = 1067,
								},
							},
							["amount"] = 1067,
						},
					},
					["Healing"] = 1067,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 22,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 19,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 35,
								},
							},
							["amount"] = 37,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 17,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
					},
					["DamageTaken"] = 28125,
					["Attacks"] = {
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 96,
									["min"] = 72,
									["count"] = 2,
									["amount"] = 168,
								},
							},
							["count"] = 2,
							["amount"] = 168,
						},
						["槌击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 258,
									["min"] = 258,
									["count"] = 1,
									["amount"] = 258,
								},
								["Hit"] = {
									["max"] = 407,
									["min"] = 261,
									["count"] = 13,
									["amount"] = 4374,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 893,
									["min"] = 893,
									["count"] = 1,
									["amount"] = 893,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 5525,
						},
						["精灵之火（野性）"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["纠缠根须"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["挥击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 153,
									["min"] = 93,
									["count"] = 2,
									["amount"] = 246,
								},
								["Hit"] = {
									["max"] = 96,
									["min"] = 57,
									["count"] = 33,
									["amount"] = 2463,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 154,
									["min"] = 98,
									["count"] = 6,
									["amount"] = 794,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 44,
							["amount"] = 3503,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 30,
									["min"] = 30,
									["count"] = 2,
									["amount"] = 60,
								},
							},
							["count"] = 2,
							["amount"] = 60,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 391,
									["min"] = 18,
									["count"] = 4,
									["amount"] = 609,
								},
								["Hit"] = {
									["max"] = 277,
									["min"] = 103,
									["count"] = 22,
									["amount"] = 3899,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 566,
									["min"] = 316,
									["count"] = 6,
									["amount"] = 2562,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 37,
							["amount"] = 7070,
						},
						["荆棘术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 346,
								},
							},
							["count"] = 19,
							["amount"] = 346,
						},
					},
					["RageGain"] = 175,
					["RageGainedFrom"] = {
						["熊一-老马布兰契"] = {
							["Details"] = {
								["原始狂怒"] = {
									["count"] = 75,
								},
								["激怒"] = {
									["count"] = 100,
								},
							},
							["amount"] = 175,
						},
					},
					["TimeDamage"] = 121.4,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 3.47,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 2.63,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.1,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 9.680000000000001,
								},
								["槌击"] = {
									["count"] = 5.98,
								},
								["肉搏"] = {
									["count"] = 9.959999999999999,
								},
								["荆棘术"] = {
									["count"] = 15.55,
								},
							},
							["amount"] = 41.17,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.04,
								},
							},
							["amount"] = 1.04,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["纠缠根须"] = {
									["count"] = 1.5,
								},
								["精灵之火（野性）"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3,
								},
								["挥击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 4.060000000000001,
								},
								["肉搏"] = {
									["count"] = 2.77,
								},
							},
							["amount"] = 6.83,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 2.75,
								},
								["槌击"] = {
									["count"] = 8.1,
								},
								["肉搏"] = {
									["count"] = 4.23,
								},
							},
							["amount"] = 15.08,
						},
						["火焰灬"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.64,
								},
								["槌击"] = {
									["count"] = 0.52,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5.16,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["挥击"] = {
									["count"] = 1.5,
								},
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
						["龍雲卿"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 4.5,
								},
								["精灵之火（野性）"] = {
									["count"] = 1.5,
								},
								["荆棘术"] = {
									["count"] = 2.78,
								},
								["挥击"] = {
									["count"] = 3.71,
								},
								["肉搏"] = {
									["count"] = 9.53,
								},
							},
							["amount"] = 22.02,
						},
					},
					["HealingTaken"] = 9808,
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 46,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Dodge"] = {
									["count"] = 3,
								},
							},
							["amount"] = 61,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 22,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 37,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 24,
						},
					},
					["DispelledWho"] = {
						["熊一-老马布兰契"] = {
							["Details"] = {
								["痛苦诅咒 (解除诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 21759.331,
			["LastActive"] = 23504.33,
		},
		["莫妍-逐风者"] = {
			["GUID"] = "Player-5451-02EF2B6A",
			["TimeLast"] = {
				["TimeHeal"] = 23418.325,
				["Dispelled"] = 23417.325,
				["Dispels"] = 23417.325,
				["Interrupts"] = 23526.331,
				["OVERALL"] = 23542.332,
				["DamageTaken"] = 23538.332,
				["FDamage"] = 22707.335,
				["Absorbs"] = 23418.325,
				["HealingTaken"] = 23418.325,
				["HOT_Time"] = 22533.325,
				["TimeDamage"] = 23542.332,
				["Healing"] = 22533.325,
				["ManaGain"] = 23539.332,
				["ActiveTime"] = 23542.332,
				["Damage"] = 23542.332,
			},
			["LastAttackedBy"] = "二道沟子靓仔-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"MISC", -- [19]
				"MISC", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"MISC", -- [23]
				"MISC", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"MISC", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					55.26999999999999, -- [1]
				},
				["Dispelled"] = {
					9, -- [1]
				},
				["Dispels"] = {
					5, -- [1]
				},
				["Healing"] = {
					500, -- [1]
				},
				["DamageTaken"] = {
					16450, -- [1]
				},
				["Interrupts"] = {
					2, -- [1]
				},
				["Absorbs"] = {
					6772, -- [1]
				},
				["HealingTaken"] = {
					9606, -- [1]
				},
				["HOT_Time"] = {
					6, -- [1]
				},
				["TimeDamage"] = {
					164.2, -- [1]
				},
				["FDamage"] = {
					420, -- [1]
				},
				["ManaGain"] = {
					4784, -- [1]
				},
				["ActiveTime"] = {
					219.47, -- [1]
				},
				["Damage"] = {
					146509, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 12,
			["type"] = "Grouped",
			["LastDamageTaken"] = 305,
			["LastHealTime"] = 23419.026,
			["LastEventHealth"] = {
				5130, -- [1]
				5130, -- [2]
				4564, -- [3]
				4564, -- [4]
				4564, -- [5]
				4237, -- [6]
				2969, -- [7]
				2715, -- [8]
				3406, -- [9]
				3422, -- [10]
				3430, -- [11]
				3447, -- [12]
				4149, -- [13]
				4173, -- [14]
				4173, -- [15]
				5130, -- [16]
				5130, -- [17]
				5130, -- [18]
				5130, -- [19]
				5130, -- [20]
				5130, -- [21]
				5130, -- [22]
				5130, -- [23]
				5130, -- [24]
				5130, -- [25]
				5130, -- [26]
				5130, -- [27]
				5130, -- [28]
				5130, -- [29]
				5130, -- [30]
				5130, -- [31]
				5130, -- [32]
				4833, -- [33]
				4833, -- [34]
				4841, -- [35]
				5130, -- [36]
				5130, -- [37]
				5130, -- [38]
				5130, -- [39]
				5130, -- [40]
				5130, -- [41]
				5130, -- [42]
				5130, -- [43]
				5130, -- [44]
				5130, -- [45]
				5130, -- [46]
				5130, -- [47]
				5130, -- [48]
				5130, -- [49]
				5130, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				5130, -- [1]
				5130, -- [2]
				5130, -- [3]
				5130, -- [4]
				5130, -- [5]
				5130, -- [6]
				5130, -- [7]
				5130, -- [8]
				5130, -- [9]
				5130, -- [10]
				5130, -- [11]
				5130, -- [12]
				5130, -- [13]
				5130, -- [14]
				5130, -- [15]
				5130, -- [16]
				5130, -- [17]
				5130, -- [18]
				5130, -- [19]
				5130, -- [20]
				5130, -- [21]
				5130, -- [22]
				5130, -- [23]
				5130, -- [24]
				5130, -- [25]
				5130, -- [26]
				5130, -- [27]
				5130, -- [28]
				5130, -- [29]
				5130, -- [30]
				5130, -- [31]
				5130, -- [32]
				5130, -- [33]
				5130, -- [34]
				5130, -- [35]
				5130, -- [36]
				5130, -- [37]
				5130, -- [38]
				5130, -- [39]
				5130, -- [40]
				5130, -- [41]
				5130, -- [42]
				5130, -- [43]
				5130, -- [44]
				5130, -- [45]
				5130, -- [46]
				5130, -- [47]
				5130, -- [48]
				5130, -- [49]
				5130, -- [50]
			},
			["NextEventNum"] = 36,
			["LastDamageTime"] = 23542.566,
			["LastEvents"] = {
				"莫妍-逐风者 寒冰箭 阿拉希的传说-火妖鲁西弗隆 Crit -2206 (Frost)", -- [1]
				"二道沟子靓仔-逐风者 地震术 莫妍-逐风者 Hit -566 (Nature)", -- [2]
				"莫妍-逐风者 冰锥术 二道沟子靓仔-逐风者 Hit -486 (Frost)", -- [3]
				"二道沟子靓仔-逐风者 肉搏 莫妍-逐风者 Hit -327 (Physical)", -- [4]
				"二道沟子靓仔-逐风者 肉搏 莫妍-逐风者 Hit -404 (Physical)", -- [5]
				"二道沟子靓仔-逐风者 肉搏 莫妍-逐风者 Crit -864 (Physical)", -- [6]
				"二道沟子靓仔-逐风者 风暴打击 莫妍-逐风者 Hit -278 (Physical)", -- [7]
				"商山-逐风者 圣光闪现 莫妍-逐风者 Hit +691", -- [8]
				"莫妍-逐风者 寒冰箭 二道沟子靓仔-逐风者 Crit -1966 (Frost)", -- [9]
				"莫妍-逐风者 寒冰箭 芬达么有糖-黑龙费尔默 Hit -1267 (Frost)", -- [10]
				"莫妍-逐风者 火焰冲击 根基图腾 Hit -843 (Fire)", -- [11]
				"商山-逐风者 圣光闪现 莫妍-逐风者 Hit +694", -- [12]
				"莫妍-逐风者 铁皮手雷 龍雲卿 Hit -192 (Fire)", -- [13]
				"莫妍-逐风者 寒冰箭 二道沟子靓仔-逐风者 Hit -1123 (Frost)", -- [14]
				"取名不能骚气-黑龙费尔默 铁皮手雷 莫妍-逐风者 Absorb -152 (152 被吸收) (Fire)", -- [15]
				"莫妍-逐风者 火焰冲击 芬达么有糖-黑龙费尔默 Hit -1080 (Fire)", -- [16]
				"莫妍-逐风者 火焰冲击 古德斯尼-逐风者 Hit -1139 (Fire)", -- [17]
				"古德斯尼-逐风者 冰霜新星 莫妍-逐风者 Absorb -92 (92 被吸收) (Frost)", -- [18]
				"莫妍-逐风者 dispels 莫妍-逐风者 冰霜新星 (逃命专家)", -- [19]
				"莫妍-逐风者 dispels 莫妍-逐风者 冰霜新星 (逃命专家)", -- [20]
				"取名不能骚气-黑龙费尔默 肉搏 莫妍-逐风者 Absorb -163 (1)", -- [21]
				"取名不能骚气-黑龙费尔默 铁皮手雷 莫妍-逐风者 Hit -107 (163 被吸收) (Fire)", -- [22]
				"乌勒哈姆 interrupts 莫妍-逐风者 寒冰箭 (法术封锁)", -- [23]
				"莫妍-逐风者 interrupts 火焰灬 变形术 (法术反制)", -- [24]
				"莫妍-逐风者 肉搏 火焰灬 Absorb -105 (1)", -- [25]
				"莫妍-逐风者 火焰冲击 火焰灬 Hit -705 (105 被吸收) (Fire)", -- [26]
				"莫妍-逐风者 冰锥术 火焰灬 Hit -569 (Frost)", -- [27]
				"莫妍-逐风者 寒冰箭 古德斯尼-逐风者 Crit -2233 (Frost)", -- [28]
				"莫妍-逐风者 火焰冲击 取名不能骚气-黑龙费尔默 Hit -794 (Fire)", -- [29]
				"莫妍-逐风者 寒冰箭 取名不能骚气-黑龙费尔默 Crit -2184 (Frost)", -- [30]
				"莫妍-逐风者 interrupts 火焰灬 寒冰箭 (法术反制)", -- [31]
				"二道沟子靓仔-逐风者 肉搏 莫妍-逐风者 Hit -305 (Physical)", -- [32]
				"莫妍-逐风者 冰霜新星 二道沟子靓仔-逐风者 Hit -33 (Frost)", -- [33]
				"莫妍-逐风者 冰锥术 二道沟子靓仔-逐风者 Hit -478 (Frost)", -- [34]
				"莫妍-逐风者 火焰冲击 二道沟子靓仔-逐风者 Hit -795 (Fire)", -- [35]
				"莫妍-逐风者 寒冰箭 取名不能骚气-黑龙费尔默 Crit -2922 (Frost)", -- [36]
				"莫妍-逐风者 寒冰箭 取名不能骚气-黑龙费尔默 Hit -1420 (Frost)", -- [37]
				"莫妍-逐风者 火焰冲击 龍雲卿 Hit -1024 (Fire)", -- [38]
				"龍雲卿 肉搏 莫妍-逐风者 Absorb -116 (116 被吸收) (1)", -- [39]
				"莫妍-逐风者 冰锥术 龍雲卿 Crit -1400 (Frost)", -- [40]
				"阿拉希的传说-火妖鲁西弗隆 肉搏 莫妍-逐风者 Absorb -407 (407 被吸收) (1)", -- [41]
				"莫妍-逐风者 火焰冲击 芬达么有糖-黑龙费尔默 Hit -1176 (Fire)", -- [42]
				"莫妍-逐风者 冰霜新星 芬达么有糖-黑龙费尔默 Hit -53 (Frost)", -- [43]
				"莫妍-逐风者 冰霜新星 阿拉希的传说-火妖鲁西弗隆 Hit -48 (Frost)", -- [44]
				"莫妍-逐风者 冰锥术 芬达么有糖-黑龙费尔默 Crit -1561 (Frost)", -- [45]
				"莫妍-逐风者 寒冰箭 阿拉希的传说-火妖鲁西弗隆 Crit -2191 (Frost)", -- [46]
				"莫妍-逐风者 火焰冲击 芬达么有糖-黑龙费尔默 Crit -1724 (Fire)", -- [47]
				"莫妍-逐风者 寒冰箭 芬达么有糖-黑龙费尔默 Crit -3321 (Frost)", -- [48]
				"莫妍-逐风者 寒冰箭 阿拉希的传说-火妖鲁西弗隆 Crit -294 (Frost)", -- [49]
				"莫妍-逐风者 火焰冲击 阿拉希的传说-火妖鲁西弗隆 Crit -1158 (Fire)", -- [50]
			},
			["Name"] = "莫妍-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				23299.295, -- [1]
				23301.019, -- [2]
				23302.202, -- [3]
				23302.258, -- [4]
				23302.258, -- [5]
				23302.282, -- [6]
				23302.536, -- [7]
				23307.68, -- [8]
				23308.553, -- [9]
				23312.636, -- [10]
				23314.47, -- [11]
				23316.953, -- [12]
				23320.153, -- [13]
				23325.053, -- [14]
				23325.487, -- [15]
				23396.641, -- [16]
				23414.342, -- [17]
				23415.109, -- [18]
				23417.959, -- [19]
				23417.959, -- [20]
				23419.026, -- [21]
				23419.026, -- [22]
				23475.795, -- [23]
				23489.279, -- [24]
				23489.696, -- [25]
				23489.696, -- [26]
				23491.2, -- [27]
				23499.447, -- [28]
				23505.08, -- [29]
				23505.33, -- [30]
				23526.932, -- [31]
				23538.799, -- [32]
				23539.532, -- [33]
				23541.049, -- [34]
				23542.566, -- [35]
				23133.993, -- [36]
				23136.609, -- [37]
				23136.809, -- [38]
				23137.31, -- [39]
				23138.326, -- [40]
				23141.726, -- [41]
				23144.81, -- [42]
				23146.31, -- [43]
				23146.31, -- [44]
				23148.46, -- [45]
				23152.844, -- [46]
				23269.967, -- [47]
				23270.4, -- [48]
				23296.352, -- [49]
				23298.952, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["莫妍-逐风者"] = {
									["max"] = 163,
									["min"] = 92,
									["count"] = 3,
									["amount"] = 407,
								},
							},
							["count"] = 3,
							["amount"] = 407,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3258,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 407,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementTakenAbsorb"] = {
						["Frost"] = 92,
						["Fire"] = 315,
					},
					["ElementTaken"] = {
						["Physical"] = 278,
						["Melee"] = 2063,
						["Fire"] = 259,
						["Frost"] = 92,
						["Nature"] = 566,
					},
					["DOT_Time"] = 0,
					["Damage"] = 24695,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 4.5,
					["RessedWho"] = {
					},
					["Dispels"] = 1,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Fire"] = 105,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 8430,
						["Melee"] = 105,
						["Frost"] = 16160,
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
							},
							["count"] = 1,
							["amount"] = 92,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 163,
									["min"] = 152,
									["count"] = 2,
									["amount"] = 315,
								},
							},
							["count"] = 2,
							["amount"] = 315,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2184,
								},
								["火焰冲击"] = {
									["count"] = 794,
								},
							},
							["amount"] = 2978,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2233,
								},
								["火焰冲击"] = {
									["count"] = 1139,
								},
							},
							["amount"] = 3372,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 4588,
								},
								["火焰冲击"] = {
									["count"] = 2804,
								},
							},
							["amount"] = 7392,
						},
						["根基图腾"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 843,
								},
							},
							["amount"] = 843,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 795,
								},
								["寒冰箭"] = {
									["count"] = 3089,
								},
								["冰霜新星"] = {
									["count"] = 33,
								},
								["冰锥术"] = {
									["count"] = 964,
								},
							},
							["amount"] = 4881,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 569,
								},
								["火焰冲击"] = {
									["count"] = 705,
								},
								["肉搏"] = {
									["count"] = 105,
								},
							},
							["amount"] = 1379,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1158,
								},
								["寒冰箭"] = {
									["count"] = 2500,
								},
							},
							["amount"] = 3658,
						},
						["龍雲卿"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 192,
								},
							},
							["amount"] = 192,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 259,
								},
								["肉搏"] = {
									["count"] = 163,
								},
							},
							["amount"] = 422,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 92,
								},
							},
							["amount"] = 92,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 566,
								},
								["风暴打击"] = {
									["count"] = 278,
								},
								["肉搏"] = {
									["count"] = 1900,
								},
							},
							["amount"] = 2744,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["法力回复"] = {
									["count"] = 192,
								},
							},
							["amount"] = 192,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 407,
								},
							},
							["amount"] = 407,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["法力回复"] = {
							["Details"] = {
								["莫妍-逐风者"] = {
									["count"] = 192,
								},
							},
							["amount"] = 192,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 2,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.93,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.93,
						},
						["根基图腾"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 0.25,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.75,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.84,
								},
							},
							["amount"] = 3.34,
						},
						["龍雲卿"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
						["火焰灬"] = {
							["Details"] = {
								["寒冰箭 (法术反制)"] = {
									["count"] = 1,
								},
								["变形术 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 163,
									["min"] = 92,
									["count"] = 3,
									["amount"] = 407,
								},
							},
							["count"] = 3,
							["amount"] = 407,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1385,
								},
							},
							["amount"] = 1385,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 407,
								},
							},
							["amount"] = 407,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 32.52,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 105,
									["min"] = 105,
									["count"] = 1,
									["amount"] = 105,
								},
							},
							["count"] = 1,
							["amount"] = 105,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 33,
									["min"] = 33,
									["count"] = 1,
									["amount"] = 33,
								},
							},
							["count"] = 1,
							["amount"] = 33,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 569,
									["min"] = 478,
									["count"] = 3,
									["amount"] = 1533,
								},
							},
							["count"] = 3,
							["amount"] = 1533,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 3321,
									["min"] = 294,
									["count"] = 6,
									["amount"] = 12204,
								},
								["Hit"] = {
									["max"] = 1267,
									["min"] = 1123,
									["count"] = 2,
									["amount"] = 2390,
								},
							},
							["count"] = 8,
							["amount"] = 14594,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 192,
									["min"] = 192,
									["count"] = 1,
									["amount"] = 192,
								},
							},
							["count"] = 1,
							["amount"] = 192,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1724,
									["min"] = 1158,
									["count"] = 2,
									["amount"] = 2882,
								},
								["Hit"] = {
									["max"] = 1139,
									["min"] = 705,
									["count"] = 6,
									["amount"] = 5356,
								},
							},
							["count"] = 8,
							["amount"] = 8238,
						},
					},
					["HealingTaken"] = 1792,
					["RageGain"] = 0,
					["TimeDamage"] = 28.02,
					["TimeDamaging"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 0.25,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.75,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.93,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.93,
						},
						["根基图腾"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.84,
								},
							},
							["amount"] = 3.34,
						},
						["龍雲卿"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 192,
					["HOTs"] = {
					},
					["DispelledWho"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneResist"] = {
						["Arcane"] = 180,
						["Fire"] = 384,
					},
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
								["法术反制 - 沉默"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 5.63,
								},
								["冰锥术"] = {
									["count"] = 4.48,
								},
								["寒冰箭"] = {
									["count"] = 13.93,
								},
								["铁皮手雷"] = {
									["count"] = 0.23,
								},
								["火焰冲击"] = {
									["count"] = 9.69,
								},
							},
							["amount"] = 33.95999999999999,
						},
						["根基图腾"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 4.75,
								},
								["冰锥术"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 6,
								},
							},
							["amount"] = 15.25,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 52.76999999999999,
								},
								["急救"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 55.26999999999999,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 4.5,
								},
								["地精工兵炸药"] = {
									["count"] = 1.15,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 10.15,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["霜寒刺骨"] = {
									["count"] = 1.22,
								},
								["寒冰箭"] = {
									["count"] = 7.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 17.72,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 4.7,
								},
								["寒冰箭"] = {
									["count"] = 2.26,
								},
								["铁皮手雷"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15.96,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3.19,
								},
								["火焰冲击"] = {
									["count"] = 1.66,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.850000000000001,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.6,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 12.1,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 0.3,
								},
								["冰锥术"] = {
									["count"] = 2.72,
								},
								["寒冰箭"] = {
									["count"] = 11.29,
								},
								["铁皮手雷"] = {
									["count"] = 0.02,
								},
								["火焰冲击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 18.83,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["法术反制 - 沉默"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.65,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 3.2,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3.53,
								},
							},
							["amount"] = 15.88,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2334,
								},
							},
							["amount"] = 2334,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6772,
								},
								["急救"] = {
									["count"] = 500,
								},
							},
							["amount"] = 7272,
						},
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 2176,
						["Fire"] = 2546,
					},
					["Absorbs"] = 6772,
					["HOT_Time"] = 6,
					["ElementTaken"] = {
						["Physical"] = 950,
						["Melee"] = 3220,
						["Arcane"] = 979,
						["Frost"] = 260,
						["Fire"] = 392,
						["Shadow"] = 9870,
						["Nature"] = 779,
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["莫妍-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["Damage"] = 146509,
					["TimeHeal"] = 55.26999999999999,
					["Dispels"] = 5,
					["FAttacks"] = {
						["地精工兵炸药"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 420,
									["min"] = 420,
									["count"] = 1,
									["amount"] = 420,
								},
							},
							["count"] = 1,
							["amount"] = 420,
						},
					},
					["ElementDone"] = {
						["Fire"] = 33790,
						["Frost"] = 105051,
						["Melee"] = 2874,
						["Arcane"] = 4794,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 11,
								},
								["Hit"] = {
									["count"] = 27,
								},
							},
							["amount"] = 41,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 34,
								},
								["Hit"] = {
									["count"] = 55,
								},
							},
							["amount"] = 94,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 14,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1897,
								},
								["肉搏"] = {
									["count"] = 97,
								},
							},
							["amount"] = 1994,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 52,
								},
								["英勇打击"] = {
									["count"] = 529,
								},
								["雷霆一击"] = {
									["count"] = 91,
								},
							},
							["amount"] = 672,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 2393,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 333,
								},
								["铁皮手雷"] = {
									["count"] = 259,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5247,
								},
								["肉搏"] = {
									["count"] = 616,
								},
							},
							["amount"] = 8848,
						},
						["作战小鸡"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 705,
								},
								["冰霜新星"] = {
									["count"] = 260,
								},
							},
							["amount"] = 965,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 407,
								},
							},
							["amount"] = 407,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 278,
								},
								["闪电之盾"] = {
									["count"] = 213,
								},
								["地震术"] = {
									["count"] = 566,
								},
								["肉搏"] = {
									["count"] = 1900,
								},
							},
							["amount"] = 2957,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 274,
								},
							},
							["amount"] = 274,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 133,
								},
							},
							["amount"] = 133,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["莫妍-逐风者"] = {
									["max"] = 529,
									["min"] = 1,
									["count"] = 42,
									["amount"] = 6772,
								},
							},
							["count"] = 42,
							["amount"] = 6772,
						},
					},
					["TimeHealing"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 52.76999999999999,
								},
								["急救"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 55.26999999999999,
						},
					},
					["Dispelled"] = 9,
					["PartialResist"] = {
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 33,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 33,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 23,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["ManaGained"] = {
						["法力回复"] = {
							["Details"] = {
								["莫妍-逐风者"] = {
									["count"] = 1160,
								},
							},
							["amount"] = 1160,
						},
						["恢复法力"] = {
							["Details"] = {
								["莫妍-逐风者"] = {
									["count"] = 1357,
								},
							},
							["amount"] = 1357,
						},
						["补充法力"] = {
							["Details"] = {
								["莫妍-逐风者"] = {
									["count"] = 2267,
								},
							},
							["amount"] = 2267,
						},
					},
					["PartialAbsorb"] = {
						["英勇打击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 529,
									["min"] = 529,
									["count"] = 1,
									["amount"] = 529,
								},
							},
							["count"] = 1,
							["amount"] = 529,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 82,
									["min"] = 47,
									["count"] = 11,
									["amount"] = 798,
								},
							},
							["count"] = 33,
							["amount"] = 798,
						},
						["冰霜新星"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 92,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 213,
									["min"] = 213,
									["count"] = 1,
									["amount"] = 213,
								},
							},
							["count"] = 1,
							["amount"] = 213,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 407,
									["min"] = 1,
									["count"] = 5,
									["amount"] = 607,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 607,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 52,
									["min"] = 52,
									["count"] = 1,
									["amount"] = 52,
								},
							},
							["count"] = 1,
							["amount"] = 52,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 271,
									["min"] = 40,
									["count"] = 12,
									["amount"] = 2650,
								},
							},
							["count"] = 23,
							["amount"] = 2650,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 163,
									["min"] = 152,
									["count"] = 2,
									["amount"] = 315,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 315,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 81,
									["min"] = 80,
									["count"] = 2,
									["amount"] = 161,
								},
							},
							["count"] = 4,
							["amount"] = 161,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 274,
									["min"] = 274,
									["count"] = 2,
									["amount"] = 548,
								},
							},
							["count"] = 3,
							["amount"] = 548,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 199,
									["min"] = 97,
									["count"] = 2,
									["amount"] = 296,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 296,
						},
						["雷霆一击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 91,
									["min"] = 91,
									["count"] = 1,
									["amount"] = 91,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 91,
						},
					},
					["ActiveTime"] = 219.47,
					["InterruptData"] = {
						["火焰灬"] = {
							["Details"] = {
								["寒冰箭 (法术反制)"] = {
									["count"] = 1,
								},
								["变形术 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Interrupts"] = 2,
					["WhoDispelled"] = {
						["乌勒哈姆"] = {
							["Details"] = {
								["寒冰护体 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
								["奥术光辉 (驱散魔法)"] = {
									["count"] = 1,
								},
								["诺格弗格药剂 (驱散魔法)"] = {
									["count"] = 1,
								},
								["强效王者祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["语言诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 2,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["FDamagedWho"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["地精工兵炸药"] = {
									["count"] = 420,
								},
							},
							["amount"] = 420,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 529,
									["min"] = 1,
									["count"] = 42,
									["amount"] = 6772,
								},
							},
							["count"] = 42,
							["amount"] = 6772,
						},
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 2,
									["amount"] = 500,
								},
							},
							["count"] = 2,
							["amount"] = 500,
						},
					},
					["FDamage"] = 420,
					["ManaGainedFrom"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["法力回复"] = {
									["count"] = 1160,
								},
								["恢复法力"] = {
									["count"] = 1357,
								},
								["补充法力"] = {
									["count"] = 2267,
								},
							},
							["amount"] = 4784,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 17,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 22,
								},
								["Tick"] = {
									["count"] = 48,
								},
							},
							["amount"] = 70,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Healing"] = 500,
					["HealedWho"] = {
						["莫妍-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6772,
								},
								["急救"] = {
									["count"] = 500,
								},
							},
							["amount"] = 7272,
						},
					},
					["ElementTakenAbsorb"] = {
						["Physical"] = 672,
						["Melee"] = 607,
						["Arcane"] = 548,
						["Frost"] = 92,
						["Fire"] = 315,
						["Shadow"] = 3905,
						["Nature"] = 213,
					},
					["Attacks"] = {
						["地精工兵炸药"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 583,
									["min"] = 16,
									["count"] = 3,
									["amount"] = 1131,
								},
							},
							["count"] = 3,
							["amount"] = 1131,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 39,
									["min"] = 35,
									["count"] = 3,
									["amount"] = 109,
								},
								["Crit"] = {
									["max"] = 77,
									["min"] = 74,
									["count"] = 2,
									["amount"] = 151,
								},
								["Hit"] = {
									["max"] = 60,
									["min"] = 33,
									["count"] = 13,
									["amount"] = 536,
								},
							},
							["count"] = 18,
							["amount"] = 796,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1561,
									["min"] = 578,
									["count"] = 10,
									["amount"] = 11159,
								},
								["Hit"] = {
									["max"] = 818,
									["min"] = 478,
									["count"] = 16,
									["amount"] = 8805,
								},
							},
							["count"] = 26,
							["amount"] = 19964,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 702,
									["min"] = 105,
									["count"] = 7,
									["amount"] = 2874,
								},
							},
							["count"] = 7,
							["amount"] = 2874,
						},
						["法术反制 - 沉默"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 546,
									["min"] = 398,
									["count"] = 4,
									["amount"] = 2018,
								},
								["Hit"] = {
									["max"] = 363,
									["min"] = 277,
									["count"] = 8,
									["amount"] = 2776,
								},
							},
							["count"] = 12,
							["amount"] = 4794,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 3321,
									["min"] = 294,
									["count"] = 22,
									["amount"] = 53161,
								},
								["Hit"] = {
									["max"] = 1790,
									["min"] = 179,
									["count"] = 26,
									["amount"] = 31130,
								},
							},
							["count"] = 49,
							["amount"] = 84291,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 175,
									["min"] = 175,
									["count"] = 1,
									["amount"] = 175,
								},
								["Crit"] = {
									["max"] = 206,
									["min"] = 200,
									["count"] = 3,
									["amount"] = 610,
								},
								["Hit"] = {
									["max"] = 192,
									["min"] = 139,
									["count"] = 3,
									["amount"] = 500,
								},
							},
							["count"] = 7,
							["amount"] = 1285,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 792,
									["min"] = 772,
									["count"] = 2,
									["amount"] = 1564,
								},
								["Crit"] = {
									["max"] = 1912,
									["min"] = 1068,
									["count"] = 8,
									["amount"] = 11564,
								},
								["Hit"] = {
									["max"] = 1176,
									["min"] = 621,
									["count"] = 21,
									["amount"] = 18246,
								},
							},
							["count"] = 31,
							["amount"] = 31374,
						},
					},
					["HealingTaken"] = 9606,
					["DamageTaken"] = 16450,
					["TimeDamage"] = 164.2,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
								["法术反制 - 沉默"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 5.63,
								},
								["冰锥术"] = {
									["count"] = 4.48,
								},
								["寒冰箭"] = {
									["count"] = 13.93,
								},
								["铁皮手雷"] = {
									["count"] = 0.23,
								},
								["火焰冲击"] = {
									["count"] = 9.69,
								},
							},
							["amount"] = 33.95999999999999,
						},
						["根基图腾"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 4.75,
								},
								["冰锥术"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 6,
								},
							},
							["amount"] = 15.25,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 4.5,
								},
								["地精工兵炸药"] = {
									["count"] = 1.15,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 10.15,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["霜寒刺骨"] = {
									["count"] = 1.22,
								},
								["寒冰箭"] = {
									["count"] = 7.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 17.72,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 4.7,
								},
								["寒冰箭"] = {
									["count"] = 2.26,
								},
								["铁皮手雷"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15.96,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3.19,
								},
								["火焰冲击"] = {
									["count"] = 1.66,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.850000000000001,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["火焰冲击"] = {
									["count"] = 1.6,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 12.1,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["法术反制 - 沉默"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.65,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 3.2,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3.53,
								},
							},
							["amount"] = 15.88,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 0.3,
								},
								["冰锥术"] = {
									["count"] = 2.72,
								},
								["寒冰箭"] = {
									["count"] = 11.29,
								},
								["铁皮手雷"] = {
									["count"] = 0.02,
								},
								["火焰冲击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 18.83,
						},
					},
					["ManaGain"] = 4784,
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 5517,
								},
							},
							["amount"] = 5517,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 3483,
								},
								["冰霜新星"] = {
									["count"] = 266,
								},
								["魔爆术"] = {
									["count"] = 902,
								},
								["寒冰箭"] = {
									["count"] = 19806,
								},
								["铁皮手雷"] = {
									["count"] = 169,
								},
								["火焰冲击"] = {
									["count"] = 10234,
								},
							},
							["amount"] = 34860,
						},
						["根基图腾"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 843,
								},
								["寒冰箭"] = {
									["count"] = 1654,
								},
							},
							["amount"] = 2497,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["地精工兵炸药"] = {
									["count"] = 583,
								},
								["冰霜新星"] = {
									["count"] = 113,
								},
								["魔爆术"] = {
									["count"] = 1610,
								},
								["寒冰箭"] = {
									["count"] = 7642,
								},
								["冰锥术"] = {
									["count"] = 3299,
								},
								["火焰冲击"] = {
									["count"] = 3165,
								},
							},
							["amount"] = 16412,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1037,
								},
								["地精工兵炸药"] = {
									["count"] = 532,
								},
								["冰霜新星"] = {
									["count"] = 39,
								},
								["冰锥术"] = {
									["count"] = 1116,
								},
							},
							["amount"] = 2724,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 2139,
								},
								["冰霜新星"] = {
									["count"] = 42,
								},
								["火焰冲击"] = {
									["count"] = 2273,
								},
								["寒冰箭"] = {
									["count"] = 10223,
								},
								["铁皮手雷"] = {
									["count"] = 175,
								},
								["肉搏"] = {
									["count"] = 477,
								},
							},
							["amount"] = 15329,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 255,
								},
								["冰霜新星"] = {
									["count"] = 36,
								},
								["火焰冲击"] = {
									["count"] = 3356,
								},
								["寒冰箭"] = {
									["count"] = 7170,
								},
								["铁皮手雷"] = {
									["count"] = 331,
								},
								["冰锥术"] = {
									["count"] = 1939,
								},
							},
							["amount"] = 13087,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 355,
								},
								["寒冰箭"] = {
									["count"] = 5317,
								},
								["火焰冲击"] = {
									["count"] = 1732,
								},
								["冰锥术"] = {
									["count"] = 525,
								},
							},
							["amount"] = 7929,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 33,
								},
								["火焰冲击"] = {
									["count"] = 2279,
								},
								["寒冰箭"] = {
									["count"] = 5065,
								},
								["肉搏"] = {
									["count"] = 596,
								},
								["冰锥术"] = {
									["count"] = 1464,
								},
							},
							["amount"] = 9437,
						},
						["火焰灬"] = {
							["Details"] = {
								["地精工兵炸药"] = {
									["count"] = 16,
								},
								["肉搏"] = {
									["count"] = 807,
								},
								["冰霜新星"] = {
									["count"] = 70,
								},
								["魔爆术"] = {
									["count"] = 354,
								},
								["冰锥术"] = {
									["count"] = 2661,
								},
								["铁皮手雷"] = {
									["count"] = 200,
								},
								["火焰冲击"] = {
									["count"] = 1773,
								},
							},
							["amount"] = 5881,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1625,
								},
								["冰霜新星"] = {
									["count"] = 75,
								},
								["肉搏"] = {
									["count"] = 739,
								},
								["寒冰箭"] = {
									["count"] = 4940,
								},
								["铁皮手雷"] = {
									["count"] = 204,
								},
								["火焰冲击"] = {
									["count"] = 2439,
								},
							},
							["amount"] = 10022,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1713,
								},
								["冰霜新星"] = {
									["count"] = 122,
								},
								["魔爆术"] = {
									["count"] = 536,
								},
								["寒冰箭"] = {
									["count"] = 16957,
								},
								["铁皮手雷"] = {
									["count"] = 206,
								},
								["火焰冲击"] = {
									["count"] = 3280,
								},
							},
							["amount"] = 22814,
						},
					},
					["DispelledWho"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["语言诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["语言诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 2,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
				},
			},
			["UnitLockout"] = 21763.331,
			["LastActive"] = 23542.332,
		},
		["已鱼"] = {
			["GUID"] = "Player-5458-03423CEA",
			["LastEventHealth"] = {
				3331, -- [1]
				3319, -- [2]
				3278, -- [3]
				3278, -- [4]
				3278, -- [5]
				3208, -- [6]
				3208, -- [7]
				3208, -- [8]
				3208, -- [9]
				3210, -- [10]
				3210, -- [11]
				3138, -- [12]
				3204, -- [13]
				3204, -- [14]
				3206, -- [15]
				3206, -- [16]
				3553, -- [17]
				3553, -- [18]
				3553, -- [19]
				3553, -- [20]
				3553, -- [21]
				3553, -- [22]
				3553, -- [23]
				3216, -- [24]
				2660, -- [25]
				2660, -- [26]
				2660, -- [27]
				2662, -- [28]
				2664, -- [29]
				2098, -- [30]
				2098, -- [31]
				2100, -- [32]
				2011, -- [33]
				2747, -- [34]
				3516, -- [35]
				3516, -- [36]
				3516, -- [37]
				3516, -- [38]
				3516, -- [39]
				3429, -- [40]
				3429, -- [41]
				3429, -- [42]
				3342, -- [43]
				3553, -- [44]
				3553, -- [45]
				3482, -- [46]
				3470, -- [47]
				3429, -- [48]
				3416, -- [49]
				3373, -- [50]
			},
			["LastAttackedBy"] = "取名不能骚气-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"HEAL", -- [33]
				"HEAL", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["HealingTaken"] = {
					8920, -- [1]
				},
				["ActiveTime"] = {
					78.16000000000001, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["TimeDamage"] = {
					78.16000000000001, -- [1]
				},
				["DamageTaken"] = {
					20825, -- [1]
				},
				["Damage"] = {
					12346, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "已鱼",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
					},
					["Messages"] = {
						"已鱼 肉搏 芬达么有糖-黑龙费尔默 Dodge (1)", -- [1]
						"已鱼 肉搏 芬达么有糖-黑龙费尔默 Hit -47 (Physical)", -- [2]
						"火焰灬 寒冰箭 已鱼 Crit -1261 (Frost)", -- [3]
						"芬达么有糖-黑龙费尔默 撕裂 (伤害/跳) 已鱼 Tick -29 (Physical)", -- [4]
						"火焰灬 奥术飞弹 已鱼 Crit -357 (Arcane)", -- [5]
						"已鱼死亡。", -- [6]
					},
					["DeathAt"] = 22818.325,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
					},
					["MessageTimes"] = {
						-2.350000000002183, -- [1]
						-2.233000000000175, -- [2]
						-1.5, -- [3]
						-1.450000000000728, -- [4]
						-0.03299999999944703, -- [5]
						0, -- [6]
					},
					["HealthMax"] = {
						3553, -- [1]
						3553, -- [2]
						3553, -- [3]
						3553, -- [4]
						3553, -- [5]
						3553, -- [6]
					},
					["Health"] = {
						1559, -- [1]
						1559, -- [2]
						1559, -- [3]
						1559, -- [4]
						271, -- [5]
						0, -- [6]
					},
					["KilledBy"] = "火焰灬",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"MISC", -- [6]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
					},
					["Messages"] = {
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 已鱼 Tick -180 (Shadow)", -- [1]
						"火焰灬 寒冰箭 已鱼 Hit -59 (Frost)", -- [2]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 已鱼 Tick -230 (Shadow)", -- [3]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -71 (Shadow)", -- [4]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 已鱼 Tick -180 (Shadow)", -- [5]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 已鱼 Tick -230 (Shadow)", -- [6]
						"芬达么有糖-黑龙费尔默 肉搏 已鱼 Hit -326 (Physical)", -- [7]
						"清风徐自来-火妖鲁西弗隆 心灵震爆 已鱼 Hit -630 (Shadow)", -- [8]
						"芬达么有糖-黑龙费尔默 雷霆一击 已鱼 Hit -76 (Physical)", -- [9]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -71 (Shadow)", -- [10]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 已鱼 Tick -179 (Shadow)", -- [11]
						"清风徐自来-火妖鲁西弗隆 铁皮手雷 已鱼 Hit -187 (Fire)", -- [12]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 已鱼 Tick -231 (Shadow)", -- [13]
						"火焰灬 火焰冲击 已鱼 Hit -584 (Fire)", -- [14]
						"芬达么有糖-黑龙费尔默 肉搏 已鱼 Hit -381 (Physical)", -- [15]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -71 (Shadow)", -- [16]
						"已鱼死亡。", -- [17]
					},
					["DeathAt"] = 22036.33,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
					},
					["MessageTimes"] = {
						-8.867999999998574, -- [1]
						-8.034999999999854, -- [2]
						-7.501000000000204, -- [3]
						-6.001000000000204, -- [4]
						-5.867999999998574, -- [5]
						-4.501000000000204, -- [6]
						-4.400999999998021, -- [7]
						-4.083999999998923, -- [8]
						-3.451000000000931, -- [9]
						-3.001000000000204, -- [10]
						-2.867999999998574, -- [11]
						-2.033999999999651, -- [12]
						-1.501000000000204, -- [13]
						-1.417999999997846, -- [14]
						-1.184000000001106, -- [15]
						0, -- [16]
						0, -- [17]
					},
					["HealthMax"] = {
						3673, -- [1]
						3673, -- [2]
						3673, -- [3]
						3673, -- [4]
						3673, -- [5]
						3673, -- [6]
						3673, -- [7]
						3673, -- [8]
						3673, -- [9]
						3673, -- [10]
						3673, -- [11]
						3673, -- [12]
						3673, -- [13]
						3673, -- [14]
						3673, -- [15]
						3673, -- [16]
						3553, -- [17]
					},
					["Health"] = {
						3673, -- [1]
						3495, -- [2]
						3436, -- [3]
						3208, -- [4]
						3208, -- [5]
						2957, -- [6]
						2729, -- [7]
						2403, -- [8]
						1773, -- [9]
						1697, -- [10]
						1697, -- [11]
						1449, -- [12]
						1262, -- [13]
						1031, -- [14]
						447, -- [15]
						68, -- [16]
						0, -- [17]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"MISC", -- [17]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "生命虹吸 (伤害/跳)",
			["LastFightIn"] = 12,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 72,
			["TimeLast"] = {
				["HealingTaken"] = 23449.327,
				["DeathCount"] = 22816.325,
				["ActiveTime"] = 23539.332,
				["TimeDamage"] = 23539.332,
				["OVERALL"] = 23539.332,
				["DamageTaken"] = 23528.332,
				["Damage"] = 23539.332,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3553, -- [1]
				3553, -- [2]
				3553, -- [3]
				3553, -- [4]
				3553, -- [5]
				3553, -- [6]
				3553, -- [7]
				3553, -- [8]
				3553, -- [9]
				3553, -- [10]
				3553, -- [11]
				3553, -- [12]
				3553, -- [13]
				3553, -- [14]
				3553, -- [15]
				3553, -- [16]
				3553, -- [17]
				3553, -- [18]
				3553, -- [19]
				3553, -- [20]
				3553, -- [21]
				3553, -- [22]
				3553, -- [23]
				3553, -- [24]
				3553, -- [25]
				3553, -- [26]
				3553, -- [27]
				3553, -- [28]
				3553, -- [29]
				3553, -- [30]
				3553, -- [31]
				3553, -- [32]
				3553, -- [33]
				3553, -- [34]
				3553, -- [35]
				3553, -- [36]
				3553, -- [37]
				3553, -- [38]
				3553, -- [39]
				3553, -- [40]
				3553, -- [41]
				3553, -- [42]
				3553, -- [43]
				3553, -- [44]
				3553, -- [45]
				3553, -- [46]
				3553, -- [47]
				3553, -- [48]
				3553, -- [49]
				3553, -- [50]
			},
			["NextEventNum"] = 17,
			["LastDamageTime"] = 23540.082,
			["LastEvents"] = {
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -72 (Shadow)", -- [1]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -72 (Shadow)", -- [2]
				"已鱼 肉搏 果不其然-逐风者 Hit -158 (Physical)", -- [3]
				"已鱼 肉搏 果不其然-逐风者 Hit -53 (Physical)", -- [4]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -72 (Shadow)", -- [5]
				"已鱼 肉搏 果不其然-逐风者 Hit -171 (Physical)", -- [6]
				"已鱼 背刺 果不其然-逐风者 Hit -392 (Physical)", -- [7]
				"已鱼 肉搏 果不其然-逐风者 Hit -53 (Physical)", -- [8]
				"已鱼 肉搏 果不其然-逐风者 Crit -108 (Physical)", -- [9]
				"已鱼 肉搏 果不其然-逐风者 Hit -164 (Physical)", -- [10]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -72 (Shadow)", -- [11]
				"已鱼 肉搏 果不其然-逐风者 Hit -64 (Physical)", -- [12]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Miss (1)", -- [13]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Hit -57 (Physical)", -- [14]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Crit -103 (Physical)", -- [15]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Miss (1)", -- [16]
				"已鱼 肉搏 芬达么有糖-黑龙费尔默 Hit -109 (Physical)", -- [17]
				"已鱼 肉搏 芬达么有糖-黑龙费尔默 Hit -35 (Physical)", -- [18]
				"已鱼 肉搏 芬达么有糖-黑龙费尔默 Miss (1)", -- [19]
				"已鱼 肉搏 芬达么有糖-黑龙费尔默 Hit -44 (Physical)", -- [20]
				"芬达么有糖-黑龙费尔默 肉搏 已鱼 Dodge (1)", -- [21]
				"二道沟子靓仔-逐风者 肉搏 已鱼 Dodge (1)", -- [22]
				"二道沟子靓仔-逐风者 风暴打击 已鱼 Hit -337 (Physical)", -- [23]
				"二道沟子靓仔-逐风者 冰霜震击 已鱼 Hit -558 (Frost)", -- [24]
				"已鱼 出血 芬达么有糖-黑龙费尔默 Crit -216 (Physical)", -- [25]
				"已鱼 肉搏 芬达么有糖-黑龙费尔默 Hit -87 (Physical)", -- [26]
				"已鱼 肉搏 芬达么有糖-黑龙费尔默 Hit -42 (Physical)", -- [27]
				"二道沟子靓仔-逐风者 肉搏 已鱼 Miss (1)", -- [28]
				"二道沟子靓仔-逐风者 冰霜震击 已鱼 Hit -566 (Frost)", -- [29]
				"已鱼 出血 芬达么有糖-黑龙费尔默 Hit -111 (Physical)", -- [30]
				"已鱼 闪电箭 芬达么有糖-黑龙费尔默 Hit -46 (Nature)", -- [31]
				"熔岩图腾 IV 熔岩图腾 已鱼 Hit -89 (Fire)", -- [32]
				"商山-逐风者 圣光闪现 已鱼 Hit +734", -- [33]
				"商山-逐风者 圣光闪现 已鱼 Hit +767", -- [34]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Hit -143 (Physical)", -- [35]
				"已鱼 出血 二道沟子靓仔-逐风者 Hit -118 (Physical)", -- [36]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Hit -58 (Physical)", -- [37]
				"已鱼 炽热火焰 二道沟子靓仔-逐风者 Hit -10 (Fire)", -- [38]
				"熔岩图腾 IV 熔岩图腾 已鱼 Hit -89 (Fire)", -- [39]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Hit -144 (Physical)", -- [40]
				"已鱼 肉搏 二道沟子靓仔-逐风者 Hit -55 (Physical)", -- [41]
				"熔岩图腾 IV 熔岩图腾 已鱼 Hit -89 (Fire)", -- [42]
				"已鱼 背刺 二道沟子靓仔-逐风者 Hit -343 (Physical)", -- [43]
				"已鱼 伏击 火焰灬 Crit -1265 (Physical)", -- [44]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -73 (Shadow)", -- [45]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -72 (Shadow)", -- [46]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -72 (Shadow)", -- [47]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -73 (Shadow)", -- [48]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -73 (Shadow)", -- [49]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 已鱼 Tick -72 (Shadow)", -- [50]
			},
			["Name"] = "已鱼",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				23519.598, -- [1]
				23522.598, -- [2]
				23524.148, -- [3]
				23524.865, -- [4]
				23525.598, -- [5]
				23525.981, -- [6]
				23526.098, -- [7]
				23526.265, -- [8]
				23527.665, -- [9]
				23527.765, -- [10]
				23528.598, -- [11]
				23529.082, -- [12]
				23538.282, -- [13]
				23538.466, -- [14]
				23539.866, -- [15]
				23540.082, -- [16]
				23435.843, -- [17]
				23436.626, -- [18]
				23437.643, -- [19]
				23438.043, -- [20]
				23438.16, -- [21]
				23438.96, -- [22]
				23438.96, -- [23]
				23440.46, -- [24]
				23440.877, -- [25]
				23440.96, -- [26]
				23440.96, -- [27]
				23443.277, -- [28]
				23445.477, -- [29]
				23446.477, -- [30]
				23446.477, -- [31]
				23448.01, -- [32]
				23448.627, -- [33]
				23450.127, -- [34]
				23451.811, -- [35]
				23451.811, -- [36]
				23452.527, -- [37]
				23452.527, -- [38]
				23452.727, -- [39]
				23453.627, -- [40]
				23453.927, -- [41]
				23454.73, -- [42]
				23455.011, -- [43]
				23492.413, -- [44]
				23501.597, -- [45]
				23504.58, -- [46]
				23507.597, -- [47]
				23510.597, -- [48]
				23513.581, -- [49]
				23516.581, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
						["Nature"] = 11,
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3116,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 13,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 20,
								},
							},
							["amount"] = 27,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 337,
						["Frost"] = 1124,
						["Fire"] = 267,
						["Shadow"] = 1321,
						["Nature"] = 67,
					},
					["DOT_Time"] = 0,
					["Damage"] = 6000,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 10,
						["Physical"] = 3820,
						["Melee"] = 2044,
						["Nature"] = 126,
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["闪电箭"] = {
									["count"] = 46,
								},
								["出血"] = {
									["count"] = 327,
								},
								["背刺"] = {
									["count"] = 290,
								},
								["肉搏"] = {
									["count"] = 457,
								},
							},
							["amount"] = 1120,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 392,
								},
								["肉搏"] = {
									["count"] = 771,
								},
							},
							["amount"] = 1163,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 343,
								},
								["炽热火焰"] = {
									["count"] = 10,
								},
								["出血"] = {
									["count"] = 118,
								},
								["肉搏"] = {
									["count"] = 560,
								},
							},
							["amount"] = 1031,
						},
						["火焰灬"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1265,
								},
							},
							["amount"] = 1265,
						},
						["龍雲卿"] = {
							["Details"] = {
								["闪电箭"] = {
									["count"] = 80,
								},
								["背刺"] = {
									["count"] = 337,
								},
								["肉搏"] = {
									["count"] = 256,
								},
							},
							["amount"] = 673,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 748,
								},
							},
							["amount"] = 748,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 598,
								},
							},
							["amount"] = 598,
						},
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 267,
								},
							},
							["amount"] = 267,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 1124,
								},
								["风暴打击"] = {
									["count"] = 337,
								},
							},
							["amount"] = 1461,
						},
						["龍雲卿"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 67,
								},
							},
							["amount"] = 67,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 723,
								},
							},
							["amount"] = 723,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 3,
								},
								["背刺"] = {
									["count"] = 0.05,
								},
								["肉搏"] = {
									["count"] = 5.550000000000001,
								},
							},
							["amount"] = 8.6,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 6.449999999999999,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1.08,
								},
								["肉搏"] = {
									["count"] = 6.919999999999999,
								},
							},
							["amount"] = 7.999999999999999,
						},
						["火焰灬"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龍雲卿"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 3.1,
								},
							},
							["amount"] = 3.32,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1501,
								},
							},
							["amount"] = 1501,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 29.37,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["背刺"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 392,
									["min"] = 290,
									["count"] = 4,
									["amount"] = 1362,
								},
							},
							["count"] = 4,
							["amount"] = 1362,
						},
						["炽热火焰"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 10,
									["min"] = 10,
									["count"] = 1,
									["amount"] = 10,
								},
							},
							["count"] = 1,
							["amount"] = 10,
						},
						["闪电箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 46,
									["min"] = 35,
									["count"] = 3,
									["amount"] = 126,
								},
							},
							["count"] = 3,
							["amount"] = 126,
						},
						["出血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 216,
									["min"] = 216,
									["count"] = 1,
									["amount"] = 216,
								},
								["Hit"] = {
									["max"] = 118,
									["min"] = 111,
									["count"] = 2,
									["amount"] = 229,
								},
							},
							["count"] = 3,
							["amount"] = 445,
						},
						["伏击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1265,
									["min"] = 1265,
									["count"] = 1,
									["amount"] = 1265,
								},
								["Hit"] = {
									["max"] = 748,
									["min"] = 748,
									["count"] = 1,
									["amount"] = 748,
								},
							},
							["count"] = 2,
							["amount"] = 2013,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 108,
									["min"] = 103,
									["count"] = 2,
									["amount"] = 211,
								},
								["Hit"] = {
									["max"] = 171,
									["min"] = 35,
									["count"] = 20,
									["amount"] = 1833,
								},
							},
							["count"] = 27,
							["amount"] = 2044,
						},
					},
					["HealingTaken"] = 1501,
					["RageGain"] = 0,
					["TimeDamage"] = 29.37,
					["TimeDamaging"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 3,
								},
								["背刺"] = {
									["count"] = 0.05,
								},
								["肉搏"] = {
									["count"] = 5.550000000000001,
								},
							},
							["amount"] = 8.6,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 6.33,
								},
							},
							["amount"] = 6.449999999999999,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1.08,
								},
								["肉搏"] = {
									["count"] = 6.919999999999999,
								},
							},
							["amount"] = 7.999999999999999,
						},
						["火焰灬"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龍雲卿"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 3.1,
								},
							},
							["amount"] = 3.32,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneResist"] = {
						["Nature"] = 11,
						["Fire"] = 6,
					},
					["TimeSpent"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.05,
								},
								["邪恶攻击"] = {
									["count"] = 0.52,
								},
								["凿击"] = {
									["count"] = 1.5,
								},
								["出血"] = {
									["count"] = 7.54,
								},
								["肉搏"] = {
									["count"] = 16.35,
								},
							},
							["amount"] = 25.96,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 1.5,
								},
								["出血"] = {
									["count"] = 6.350000000000001,
								},
								["肉搏"] = {
									["count"] = 5.11,
								},
							},
							["amount"] = 12.96,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.77,
								},
								["肉搏"] = {
									["count"] = 8.03,
								},
							},
							["amount"] = 8.8,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.2,
								},
							},
							["amount"] = 2.2,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1.08,
								},
								["肉搏"] = {
									["count"] = 6.919999999999999,
								},
							},
							["amount"] = 7.999999999999999,
						},
						["火焰灬"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龍雲卿"] = {
							["Details"] = {
								["脚踢"] = {
									["count"] = 0.55,
								},
								["暗影箭"] = {
									["count"] = 0.07,
								},
								["背刺"] = {
									["count"] = 0.22,
								},
								["邪恶攻击"] = {
									["count"] = 0.21,
								},
								["肉搏"] = {
									["count"] = 12.86,
								},
							},
							["amount"] = 13.91,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 1.5,
								},
								["背刺"] = {
									["count"] = 0.92,
								},
								["肉搏"] = {
									["count"] = 0.9099999999999999,
								},
							},
							["amount"] = 3.33,
						},
					},
					["DamageTaken"] = 20825,
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 23,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 16,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 78.16000000000001,
					["ElementTaken"] = {
						["Frost"] = 5848,
						["Melee"] = 1084,
						["Arcane"] = 1820,
						["Shadow"] = 8176,
						["Fire"] = 2538,
						["Physical"] = 1258,
						["Nature"] = 101,
					},
					["Damage"] = 12346,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 45,
								},
							},
							["amount"] = 47,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8920,
								},
							},
							["amount"] = 8920,
						},
					},
					["ElementDone"] = {
						["Physical"] = 5872,
						["Melee"] = 5927,
						["Fire"] = 29,
						["Shadow"] = 129,
						["Nature"] = 389,
					},
					["HealingTaken"] = 8920,
					["DamagedWho"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["炽热火焰"] = {
									["count"] = 13,
								},
								["邪恶攻击"] = {
									["count"] = 171,
								},
								["背刺"] = {
									["count"] = 290,
								},
								["出血"] = {
									["count"] = 895,
								},
								["闪电箭"] = {
									["count"] = 46,
								},
								["速效毒药 VI"] = {
									["count"] = 133,
								},
								["凿击"] = {
									["count"] = 44,
								},
								["肉搏"] = {
									["count"] = 1328,
								},
							},
							["amount"] = 2920,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 748,
								},
							},
							["amount"] = 748,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 121,
								},
								["肉搏"] = {
									["count"] = 751,
								},
							},
							["amount"] = 872,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 760,
								},
								["肉搏"] = {
									["count"] = 1121,
								},
							},
							["amount"] = 1881,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 166,
								},
								["肉搏"] = {
									["count"] = 340,
								},
							},
							["amount"] = 506,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 343,
								},
								["炽热火焰"] = {
									["count"] = 10,
								},
								["出血"] = {
									["count"] = 118,
								},
								["肉搏"] = {
									["count"] = 560,
								},
							},
							["amount"] = 1031,
						},
						["火焰灬"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1265,
								},
							},
							["amount"] = 1265,
						},
						["龍雲卿"] = {
							["Details"] = {
								["脚踢"] = {
									["count"] = 54,
								},
								["暗影箭"] = {
									["count"] = 129,
								},
								["背刺"] = {
									["count"] = 337,
								},
								["闪电箭"] = {
									["count"] = 80,
								},
								["邪恶攻击"] = {
									["count"] = 231,
								},
								["炽热火焰"] = {
									["count"] = 6,
								},
								["肉搏"] = {
									["count"] = 1431,
								},
							},
							["amount"] = 2268,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 130,
								},
								["背刺"] = {
									["count"] = 329,
								},
								["肉搏"] = {
									["count"] = 396,
								},
							},
							["amount"] = 855,
						},
					},
					["TimeDamage"] = 78.16000000000001,
					["TimeDamaging"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.05,
								},
								["邪恶攻击"] = {
									["count"] = 0.52,
								},
								["凿击"] = {
									["count"] = 1.5,
								},
								["出血"] = {
									["count"] = 7.54,
								},
								["肉搏"] = {
									["count"] = 16.35,
								},
							},
							["amount"] = 25.96,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 1.5,
								},
								["出血"] = {
									["count"] = 6.350000000000001,
								},
								["肉搏"] = {
									["count"] = 5.11,
								},
							},
							["amount"] = 12.96,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.77,
								},
								["肉搏"] = {
									["count"] = 8.03,
								},
							},
							["amount"] = 8.8,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 2.2,
								},
							},
							["amount"] = 2.2,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1.08,
								},
								["肉搏"] = {
									["count"] = 6.919999999999999,
								},
							},
							["amount"] = 7.999999999999999,
						},
						["火焰灬"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["龍雲卿"] = {
							["Details"] = {
								["脚踢"] = {
									["count"] = 0.55,
								},
								["暗影箭"] = {
									["count"] = 0.07,
								},
								["背刺"] = {
									["count"] = 0.22,
								},
								["邪恶攻击"] = {
									["count"] = 0.21,
								},
								["肉搏"] = {
									["count"] = 12.86,
								},
							},
							["amount"] = 13.91,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 1.5,
								},
								["背刺"] = {
									["count"] = 0.92,
								},
								["肉搏"] = {
									["count"] = 0.9099999999999999,
								},
							},
							["amount"] = 3.33,
						},
					},
					["Attacks"] = {
						["脚踢"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 54,
									["min"] = 54,
									["count"] = 1,
									["amount"] = 54,
								},
							},
							["count"] = 1,
							["amount"] = 54,
						},
						["背刺"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 392,
									["min"] = 290,
									["count"] = 6,
									["amount"] = 2059,
								},
							},
							["count"] = 6,
							["amount"] = 2059,
						},
						["闪电箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 46,
									["min"] = 35,
									["count"] = 3,
									["amount"] = 126,
								},
							},
							["count"] = 3,
							["amount"] = 126,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 133,
									["min"] = 130,
									["count"] = 2,
									["amount"] = 263,
								},
							},
							["count"] = 2,
							["amount"] = 263,
						},
						["凿击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 121,
									["min"] = 121,
									["count"] = 1,
									["amount"] = 121,
								},
								["Hit"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 2,
							["amount"] = 165,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 231,
									["min"] = 171,
									["count"] = 2,
									["amount"] = 402,
								},
							},
							["count"] = 2,
							["amount"] = 402,
						},
						["暗影箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 129,
									["min"] = 129,
									["count"] = 1,
									["amount"] = 129,
								},
							},
							["count"] = 1,
							["amount"] = 129,
						},
						["伏击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1265,
									["min"] = 1265,
									["count"] = 1,
									["amount"] = 1265,
								},
								["Hit"] = {
									["max"] = 748,
									["min"] = 748,
									["count"] = 1,
									["amount"] = 748,
								},
							},
							["count"] = 2,
							["amount"] = 2013,
						},
						["炽热火焰"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 13,
									["min"] = 6,
									["count"] = 3,
									["amount"] = 29,
								},
							},
							["count"] = 3,
							["amount"] = 29,
						},
						["出血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 166,
									["min"] = 83,
									["count"] = 6,
									["amount"] = 721,
								},
								["Immune"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 242,
									["min"] = 216,
									["count"] = 2,
									["amount"] = 458,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 1179,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 187,
									["min"] = 34,
									["count"] = 47,
									["amount"] = 4174,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 364,
									["min"] = 83,
									["count"] = 9,
									["amount"] = 1753,
								},
								["Miss"] = {
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 74,
							["amount"] = 5927,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 598,
								},
							},
							["amount"] = 598,
						},
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 267,
								},
							},
							["amount"] = 267,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 29,
								},
								["旋风斩"] = {
									["count"] = 816,
								},
								["雷霆一击"] = {
									["count"] = 76,
								},
								["肉搏"] = {
									["count"] = 1084,
								},
							},
							["amount"] = 2005,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 987,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1659,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3763,
								},
							},
							["amount"] = 6409,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1463,
								},
								["冰锥术"] = {
									["count"] = 3151,
								},
								["冰霜新星"] = {
									["count"] = 253,
								},
								["火焰冲击"] = {
									["count"] = 1500,
								},
							},
							["amount"] = 6367,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 1124,
								},
								["风暴打击"] = {
									["count"] = 337,
								},
							},
							["amount"] = 1461,
						},
						["火焰灬"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1320,
								},
								["奥术飞弹"] = {
									["count"] = 357,
								},
								["火焰冲击"] = {
									["count"] = 584,
								},
							},
							["amount"] = 2261,
						},
						["龍雲卿"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 101,
								},
							},
							["amount"] = 101,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 630,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 539,
								},
								["铁皮手雷"] = {
									["count"] = 187,
								},
							},
							["amount"] = 1356,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 3,
								},
								["Immune"] = {
									["count"] = 7,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 31,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 47,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Miss"] = {
									["count"] = 11,
								},
							},
							["amount"] = 74,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
				},
			},
			["UnitLockout"] = 21794.338,
			["LastActive"] = 23539.332,
		},
		["灌篮高手-逐风者"] = {
			["GUID"] = "Player-5451-02F6D5E6",
			["LastEventHealth"] = {
				2785, -- [1]
				3552, -- [2]
				4184, -- [3]
				4184, -- [4]
				4184, -- [5]
				4184, -- [6]
				4184, -- [7]
				4184, -- [8]
				4184, -- [9]
				4184, -- [10]
				4184, -- [11]
				3409, -- [12]
				3409, -- [13]
				2642, -- [14]
				2710, -- [15]
				2725, -- [16]
				2520, -- [17]
				2285, -- [18]
				2308, -- [19]
				2100, -- [20]
				3318, -- [21]
				4184, -- [22]
				3897, -- [23]
				3897, -- [24]
				2994, -- [25]
				3001, -- [26]
				1988, -- [27]
				1988, -- [28]
				1938, -- [29]
				1938, -- [30]
				2012, -- [31]
				2035, -- [32]
				2035, -- [33]
				2805, -- [34]
				2733, -- [35]
				3485, -- [36]
				3485, -- [37]
				3485, -- [38]
				2595, -- [39]
				2595, -- [40]
				2595, -- [41]
				2633, -- [42]
				1830, -- [43]
				1838, -- [44]
				1845, -- [45]
				1853, -- [46]
				1, -- [47]
				1, -- [48]
				4424, -- [49]
				3343, -- [50]
			},
			["LastAttackedBy"] = "古德斯尼-逐风者",
			["LastEventType"] = {
				"HEAL", -- [1]
				"HEAL", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"MISC", -- [18]
				"DAMAGE", -- [19]
				"HEAL", -- [20]
				"HEAL", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"HEAL", -- [30]
				"DAMAGE", -- [31]
				"HEAL", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"MISC", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					24.48, -- [1]
				},
				["Dispelled"] = {
					15, -- [1]
				},
				["Dispels"] = {
					3, -- [1]
				},
				["Healing"] = {
					1013, -- [1]
				},
				["DamageTaken"] = {
					5370, -- [1]
				},
				["Absorbs"] = {
					335, -- [1]
				},
				["HealingTaken"] = {
					9365, -- [1]
				},
				["Overhealing"] = {
					2027, -- [1]
				},
				["ActiveTime"] = {
					227.1600000000001, -- [1]
				},
				["TimeDamage"] = {
					202.68, -- [1]
				},
				["ManaGain"] = {
					10595, -- [1]
				},
				["DOT_Time"] = {
					504, -- [1]
				},
				["Damage"] = {
					44786, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 12,
			["LastHealTime"] = 22984.434,
			["type"] = "Grouped",
			["TimeLast"] = {
				["TimeHeal"] = 22984.334,
				["Dispelled"] = 23475.329,
				["Dispels"] = 22920.331,
				["OVERALL"] = 23495.33,
				["DamageTaken"] = 23490.33,
				["ActiveTime"] = 23495.33,
				["Absorbs"] = 22589.328,
				["HealingTaken"] = 23486.329,
				["Overhealing"] = 23457.328,
				["TimeDamage"] = 23495.33,
				["Healing"] = 22984.334,
				["ManaGain"] = 23493.33,
				["DOT_Time"] = 23493.33,
				["Damage"] = 23495.33,
			},
			["LastDamageTaken"] = 295,
			["LastEventHealthMax"] = {
				4184, -- [1]
				4184, -- [2]
				4184, -- [3]
				4184, -- [4]
				4184, -- [5]
				4184, -- [6]
				4184, -- [7]
				4184, -- [8]
				4184, -- [9]
				4184, -- [10]
				4184, -- [11]
				4184, -- [12]
				4184, -- [13]
				4184, -- [14]
				4184, -- [15]
				4184, -- [16]
				4184, -- [17]
				4184, -- [18]
				4184, -- [19]
				4184, -- [20]
				4184, -- [21]
				4184, -- [22]
				4184, -- [23]
				4184, -- [24]
				4184, -- [25]
				4184, -- [26]
				4424, -- [27]
				4424, -- [28]
				4424, -- [29]
				4424, -- [30]
				4424, -- [31]
				4424, -- [32]
				4424, -- [33]
				4424, -- [34]
				4424, -- [35]
				4424, -- [36]
				4424, -- [37]
				4424, -- [38]
				4424, -- [39]
				4424, -- [40]
				4424, -- [41]
				4424, -- [42]
				4424, -- [43]
				4424, -- [44]
				4424, -- [45]
				4424, -- [46]
				4424, -- [47]
				4424, -- [48]
				4424, -- [49]
				4184, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"克萨苏恩 <灌篮高手-逐风者>", -- [1]
			},
			["NextEventNum"] = 27,
			["LastDamageTime"] = 23496.23,
			["LastEvents"] = {
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Hit +767", -- [1]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Crit +1108 (476 过量治疗)", -- [2]
				"灌篮高手-逐风者 灼热之痛 取名不能骚气-黑龙费尔默 Hit -436 (Fire)", -- [3]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -203 (Shadow)", -- [4]
				"灌篮高手-逐风者 暗影箭 芬达么有糖-黑龙费尔默 Hit -927 (Shadow)", -- [5]
				"灌篮高手-逐风者 暗影箭 果不其然-逐风者 Hit -937 (Shadow)", -- [6]
				"灌篮高手-逐风者 暗影箭 根基图腾 Hit -968 (Shadow)", -- [7]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 阿拉希的传说-火妖鲁西弗隆 Tick -202 (Shadow)", -- [8]
				"灌篮高手-逐风者 死亡缠绕 阿拉希的传说-火妖鲁西弗隆 Hit -618 (Shadow)", -- [9]
				"灌篮高手-逐风者 死亡缠绕 灌篮高手-逐风者 Hit +618 (618 过量治疗)", -- [10]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 阿拉希的传说-火妖鲁西弗隆 Tick -87 (Shadow)", -- [11]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 阿拉希的传说-火妖鲁西弗隆 Tick -86 (Shadow)", -- [12]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 阿拉希的传说-火妖鲁西弗隆 Tick -203 (Shadow)", -- [13]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 阿拉希的传说-火妖鲁西弗隆 Tick -87 (Shadow)", -- [14]
				"灌篮高手-逐风者 暗影箭 取名不能骚气-黑龙费尔默 Absorb -727 (727 被吸收) (Shadow)", -- [15]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 灌篮高手-逐风者 Tick -235 (Shadow)", -- [16]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 灌篮高手-逐风者 Tick -235 (Shadow)", -- [17]
				"商山-逐风者 dispels 灌篮高手-逐风者 腐蚀术 (清洁术)", -- [18]
				"清风徐自来-火妖鲁西弗隆 铁皮手雷 灌篮高手-逐风者 Hit -208 (Fire)", -- [19]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Crit +1135", -- [20]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Crit +1092 (226 过量治疗)", -- [21]
				"古德斯尼-逐风者 魔爆术 灌篮高手-逐风者 Hit -295 (Arcane)", -- [22]
				"灌篮高手-逐风者 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -1 (1)", -- [23]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -77 (26 被抵抗) (1 被吸收) (Shadow)", -- [24]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -103 (Shadow)", -- [25]
				"灌篮高手-逐风者 铁皮手雷 二道沟子靓仔-逐风者 Crit -293 (Fire)", -- [26]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -214 (Shadow)", -- [27]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 灌篮高手-逐风者 Tick -72 (Shadow)", -- [28]
				"灌篮高手-逐风者 生命虹吸 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -74 (Shadow)", -- [29]
				"灌篮高手-逐风者 生命虹吸 灌篮高手-逐风者 Hit +74", -- [30]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 古德斯尼-逐风者 Tick -143 (Shadow)", -- [31]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Hit +770", -- [32]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -214 (Shadow)", -- [33]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 灌篮高手-逐风者 Tick -72 (Shadow)", -- [34]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 古德斯尼-逐风者 Tick -193 (Shadow)", -- [35]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 古德斯尼-逐风者 Tick -193 (Shadow)", -- [36]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Absorb -214 (214 被吸收) (Shadow)", -- [37]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 灌篮高手-逐风者 Tick -72 (Shadow)", -- [38]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 生命虹吸 (吞噬魔法)", -- [39]
				"灌篮高手-逐风者 暗影箭 芬达么有糖-黑龙费尔默 Hit -1113 (Shadow)", -- [40]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 古德斯尼-逐风者 Tick -193 (Shadow)", -- [41]
				"灌篮高手-逐风者 暗影箭 芬达么有糖-黑龙费尔默 Hit -1080 (Shadow)", -- [42]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 果不其然-逐风者 Tick -214 (Shadow)", -- [43]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 果不其然-逐风者 Tick -215 (Shadow)", -- [44]
				"灌篮高手-逐风者 暗影箭 果不其然-逐风者 Hit -990 (Shadow)", -- [45]
				"灌篮高手-逐风者 腐蚀术 (伤害/跳) 果不其然-逐风者 Tick -214 (Shadow)", -- [46]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -144 (48 被抵抗) (Shadow)", -- [47]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -191 (Shadow)", -- [48]
				"灌篮高手-逐风者 痛苦诅咒 (伤害/跳) 草莓尐布丁-火妖鲁西弗隆 Tick -191 (Shadow)", -- [49]
				"Environment Falling 灌篮高手-逐风者 Hit -603 (Physical)", -- [50]
			},
			["Name"] = "灌篮高手-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				true, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				23418.659, -- [1]
				23420.159, -- [2]
				23425.32, -- [3]
				23430.776, -- [4]
				23433.893, -- [5]
				23439.977, -- [6]
				23452.011, -- [7]
				23457.228, -- [8]
				23457.678, -- [9]
				23457.678, -- [10]
				23457.745, -- [11]
				23459.744, -- [12]
				23460.228, -- [13]
				23461.745, -- [14]
				23468.962, -- [15]
				23472.428, -- [16]
				23475.429, -- [17]
				23475.529, -- [18]
				23477.714, -- [19]
				23478.546, -- [20]
				23487.263, -- [21]
				23490.813, -- [22]
				23492.03, -- [23]
				23492.03, -- [24]
				23494.03, -- [25]
				23496.23, -- [26]
				22982.917, -- [27]
				22983.384, -- [28]
				22984.434, -- [29]
				22984.434, -- [30]
				22984.768, -- [31]
				22985.918, -- [32]
				22985.918, -- [33]
				22986.384, -- [34]
				22986.774, -- [35]
				22988.768, -- [36]
				22988.918, -- [37]
				22989.368, -- [38]
				22990.018, -- [39]
				22990.151, -- [40]
				22990.768, -- [41]
				22995.751, -- [42]
				23002.335, -- [43]
				23005.319, -- [44]
				23007.719, -- [45]
				23008.335, -- [46]
				23113.291, -- [47]
				23115.292, -- [48]
				23117.3, -- [49]
				23415.459, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
							},
							["amount"] = 15,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 26,
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1576,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 13,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 470,
						["Physical"] = 603,
						["Fire"] = 208,
						["Arcane"] = 295,
					},
					["DOT_Time"] = 24,
					["Damage"] = 5955,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 728,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 729,
						["Melee"] = 1,
						["Shadow"] = 5225,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 203,
								},
							},
							["amount"] = 203,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 293,
								},
							},
							["amount"] = 293,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 927,
								},
							},
							["amount"] = 927,
						},
						["根基图腾"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 968,
								},
							},
							["amount"] = 968,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 727,
								},
								["灼热之痛"] = {
									["count"] = 436,
								},
							},
							["amount"] = 1163,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 180,
								},
								["肉搏"] = {
									["count"] = 1,
								},
							},
							["amount"] = 181,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 937,
								},
							},
							["amount"] = 937,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 618,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 405,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 260,
								},
							},
							["amount"] = 1283,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 470,
								},
							},
							["amount"] = 470,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 295,
								},
							},
							["amount"] = 295,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 208,
								},
							},
							["amount"] = 208,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 603,
								},
							},
							["amount"] = 603,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 618,
									["min"] = 618,
									["count"] = 1,
									["amount"] = 618,
								},
							},
							["count"] = 1,
							["amount"] = 618,
						},
					},
					["ManaGainedFrom"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 2952,
								},
							},
							["amount"] = 2952,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["灌篮高手-逐风者"] = {
									["count"] = 2952,
								},
							},
							["amount"] = 2952,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 618,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["根基图腾"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["灼热之痛"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.45,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 5.5,
						},
					},
					["WhoDispelled"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3400,
								},
							},
							["amount"] = 3400,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 19,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 618,
									["min"] = 618,
									["count"] = 1,
									["amount"] = 618,
								},
							},
							["count"] = 1,
							["amount"] = 618,
						},
						["暗影箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 727,
									["min"] = 727,
									["count"] = 1,
									["amount"] = 727,
								},
								["Hit"] = {
									["max"] = 968,
									["min"] = 927,
									["count"] = 3,
									["amount"] = 2832,
								},
							},
							["count"] = 4,
							["amount"] = 3559,
						},
						["灼热之痛"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 436,
									["min"] = 436,
									["count"] = 1,
									["amount"] = 436,
								},
							},
							["count"] = 1,
							["amount"] = 436,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 293,
									["min"] = 293,
									["count"] = 1,
									["amount"] = 293,
								},
							},
							["count"] = 1,
							["amount"] = 293,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 103,
									["min"] = 77,
									["count"] = 5,
									["amount"] = 440,
								},
							},
							["count"] = 5,
							["amount"] = 440,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 203,
									["min"] = 202,
									["count"] = 3,
									["amount"] = 608,
								},
							},
							["count"] = 3,
							["amount"] = 608,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 1,
									["min"] = 1,
									["count"] = 1,
									["amount"] = 1,
								},
							},
							["count"] = 1,
							["amount"] = 1,
						},
					},
					["HealingTaken"] = 3400,
					["RageGain"] = 0,
					["TimeDamage"] = 19,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["根基图腾"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["灼热之痛"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.45,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 5.5,
						},
					},
					["ManaGain"] = 2952,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
								["古德斯尼-逐风者"] = {
									["count"] = 18,
								},
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 9,
								},
								["取名不能骚气-黑龙费尔默"] = {
									["count"] = 6,
								},
								["火焰灬"] = {
									["count"] = 18,
								},
								["龍雲卿"] = {
									["count"] = 9,
								},
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 69,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
								["霜如雪"] = {
									["count"] = 15,
								},
								["取名不能骚气-黑龙费尔默"] = {
									["count"] = 15,
								},
								["果不其然-逐风者"] = {
									["count"] = 18,
								},
								["古德斯尼-逐风者"] = {
									["count"] = 18,
								},
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 18,
								},
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 57,
								},
								["二道沟子靓仔-逐风者"] = {
									["count"] = 6,
								},
								["火焰灬"] = {
									["count"] = 33,
								},
								["龍雲卿"] = {
									["count"] = 24,
								},
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 18,
								},
							},
							["amount"] = 234,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 18,
								},
								["取名不能骚气-黑龙费尔默"] = {
									["count"] = 24,
								},
								["古德斯尼-逐风者"] = {
									["count"] = 36,
								},
								["果不其然-逐风者"] = {
									["count"] = 12,
								},
								["二道沟子靓仔-逐风者"] = {
									["count"] = 12,
								},
								["霜如雪"] = {
									["count"] = 18,
								},
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 27,
								},
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 45,
								},
							},
							["amount"] = 201,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 1278,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 17,
								},
							},
							["amount"] = 19,
						},
					},
					["HealedWho"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 972,
								},
								["防护暗影结界"] = {
									["count"] = 335,
								},
								["死亡缠绕"] = {
									["count"] = 41,
								},
							},
							["amount"] = 1348,
						},
					},
					["ElementDoneAbsorb"] = {
						["Fire"] = 441,
						["Shadow"] = 4042,
					},
					["Absorbs"] = 335,
					["Overhealing"] = 2027,
					["ElementTaken"] = {
						["Frost"] = 1124,
						["Melee"] = 87,
						["Arcane"] = 295,
						["Fire"] = 208,
						["Physical"] = 603,
						["Shadow"] = 3053,
					},
					["DOT_Time"] = 504,
					["Damage"] = 44786,
					["TimeHeal"] = 24.48,
					["Dispels"] = 3,
					["ElementDone"] = {
						["Shadow"] = 42150,
						["Melee"] = 485,
						["Fire"] = 2151,
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 1548,
								},
								["暗影箭"] = {
									["count"] = 477,
								},
								["灼热之痛"] = {
									["count"] = 842,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 526,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 845,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 149,
								},
							},
							["amount"] = 4387,
						},
						["霜如雪"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 859,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 907,
								},
								["肉搏"] = {
									["count"] = 174,
								},
							},
							["amount"] = 1940,
						},
						["根基图腾"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 968,
								},
							},
							["amount"] = 968,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 140,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 726,
								},
								["暗影箭"] = {
									["count"] = 727,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 998,
								},
								["灼热之痛"] = {
									["count"] = 436,
								},
							},
							["amount"] = 3027,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1927,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1251,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 362,
								},
							},
							["amount"] = 3540,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 743,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 420,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1534,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1215,
								},
								["铁皮手雷"] = {
									["count"] = 139,
								},
							},
							["amount"] = 4051,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 3120,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 233,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1313,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 565,
								},
							},
							["amount"] = 5231,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1229,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 70,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3923,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1949,
								},
							},
							["amount"] = 7171,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 293,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 420,
								},
								["暗影箭"] = {
									["count"] = 1980,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 751,
								},
							},
							["amount"] = 3444,
						},
						["火焰灬"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 187,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2048,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 428,
								},
								["肉搏"] = {
									["count"] = 105,
								},
							},
							["amount"] = 2768,
						},
						["龍雲卿"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1624,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 212,
								},
							},
							["amount"] = 1836,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1312,
								},
								["暗影箭"] = {
									["count"] = 1402,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1279,
								},
								["铁皮手雷"] = {
									["count"] = 254,
								},
								["暗影灼烧"] = {
									["count"] = 819,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1151,
								},
								["肉搏"] = {
									["count"] = 206,
								},
							},
							["amount"] = 6423,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 997,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 135,
								},
							},
							["amount"] = 1132,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 295,
								},
								["冰霜新星"] = {
									["count"] = 87,
								},
								["冰锥术"] = {
									["count"] = 1037,
								},
							},
							["amount"] = 1419,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 603,
								},
							},
							["amount"] = 603,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 938,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 432,
								},
							},
							["amount"] = 1370,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 87,
								},
							},
							["amount"] = 87,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 551,
								},
								["铁皮手雷"] = {
									["count"] = 208,
								},
							},
							["amount"] = 759,
						},
					},
					["Absorbed"] = {
						["防护暗影结界"] = {
							["Details"] = {
								["灌篮高手-逐风者"] = {
									["max"] = 200,
									["min"] = 135,
									["count"] = 2,
									["amount"] = 335,
								},
							},
							["count"] = 2,
							["amount"] = 335,
						},
					},
					["TimeHealing"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 19.98,
								},
								["防护暗影结界"] = {
									["count"] = 3,
								},
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 24.48,
						},
					},
					["Dispelled"] = 15,
					["PartialResist"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["灌篮高手-逐风者"] = {
									["count"] = 10595,
								},
							},
							["amount"] = 10595,
						},
					},
					["PartialAbsorb"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 135,
									["min"] = 135,
									["count"] = 1,
									["amount"] = 135,
								},
							},
							["count"] = 1,
							["amount"] = 135,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 200,
									["min"] = 200,
									["count"] = 1,
									["amount"] = 200,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 200,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 227.1600000000001,
					["WhoDispelled"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["疲劳诅咒 (逃命专家)"] = {
									["count"] = 1,
								},
								["致残毒药 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰锥术 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["野性印记 (驱散魔法)"] = {
									["count"] = 1,
								},
								["奥术光辉 (驱散魔法)"] = {
									["count"] = 1,
								},
								["魔甲术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["自由行动 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["克萨苏恩 <灌篮高手-逐风者>"] = {
							["Details"] = {
								["腐蚀术 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["无畏冲锋 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["生命虹吸 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["冰锥术 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["冰霜新星 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["暗言术：痛 (吞噬魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
					},
					["Heals"] = {
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 80,
									["min"] = 38,
									["count"] = 14,
									["amount"] = 972,
								},
							},
							["count"] = 14,
							["amount"] = 972,
						},
						["防护暗影结界"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 200,
									["min"] = 135,
									["count"] = 2,
									["amount"] = 335,
								},
							},
							["count"] = 2,
							["amount"] = 335,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 1,
									["amount"] = 41,
								},
							},
							["count"] = 1,
							["amount"] = 41,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 18,
								},
								["Tick"] = {
									["count"] = 151,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 188,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
					},
					["ElementTakenAbsorb"] = {
						["Shadow"] = 335,
					},
					["OverHeals"] = {
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 70,
									["min"] = 33,
									["count"] = 3,
									["amount"] = 173,
								},
							},
							["count"] = 3,
							["amount"] = 173,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 625,
									["min"] = 611,
									["count"] = 3,
									["amount"] = 1854,
								},
							},
							["count"] = 3,
							["amount"] = 1854,
						},
					},
					["Healing"] = 1013,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 0.4,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["灼热之痛"] = {
									["count"] = 2.4,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.95,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 14.75,
						},
						["霜如雪"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.719999999999999,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.22,
						},
						["根基图腾"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 2.08,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.79,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 6.34,
								},
								["灼热之痛"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 16.21,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 4.23,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.04,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 6.02,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 16.27,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 3,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 7.24,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 15.39,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 7.54,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 12.88,
								},
								["铁皮手雷"] = {
									["count"] = 0.7,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 8.940000000000001,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 31.56,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 19.98,
								},
								["防护暗影结界"] = {
									["count"] = 3,
								},
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 24.48,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.35,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 22.21,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 12.84,
								},
							},
							["amount"] = 36.42,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.65,
								},
								["暗影箭"] = {
									["count"] = 3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.779999999999999,
								},
							},
							["amount"] = 11.93,
						},
						["火焰灬"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 13.5,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 6.75,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 24.75,
						},
						["龍雲卿"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.29,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 2.29,
								},
							},
							["amount"] = 5.58,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 2.1,
								},
								["暗影箭"] = {
									["count"] = 0.43,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.340000000000001,
								},
								["铁皮手雷"] = {
									["count"] = 0.38,
								},
								["暗影灼烧"] = {
									["count"] = 0.25,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 6.17,
								},
								["肉搏"] = {
									["count"] = 2.43,
								},
							},
							["amount"] = 19.1,
						},
					},
					["DamageTaken"] = 5370,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 666,
									["min"] = 611,
									["count"] = 4,
									["amount"] = 2541,
								},
							},
							["count"] = 4,
							["amount"] = 2541,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 80,
									["min"] = 70,
									["count"] = 19,
									["amount"] = 1368,
								},
								["Absorb"] = {
									["max"] = 72,
									["min"] = 70,
									["count"] = 4,
									["amount"] = 284,
								},
							},
							["count"] = 23,
							["amount"] = 1652,
						},
						["腐蚀术"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 436,
									["min"] = 413,
									["count"] = 3,
									["amount"] = 1278,
								},
							},
							["count"] = 3,
							["amount"] = 1278,
						},
						["暗影箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 727,
									["min"] = 727,
									["count"] = 1,
									["amount"] = 727,
								},
								["Hit"] = {
									["max"] = 1113,
									["min"] = 475,
									["count"] = 11,
									["amount"] = 9874,
								},
							},
							["count"] = 12,
							["amount"] = 10601,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 196,
									["min"] = 84,
									["count"] = 2,
									["amount"] = 280,
								},
								["Tick"] = {
									["max"] = 202,
									["min"] = 70,
									["count"] = 65,
									["amount"] = 8271,
								},
							},
							["count"] = 67,
							["amount"] = 8551,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1548,
									["min"] = 1548,
									["count"] = 1,
									["amount"] = 1548,
								},
								["Hit"] = {
									["max"] = 819,
									["min"] = 743,
									["count"] = 2,
									["amount"] = 1562,
								},
							},
							["count"] = 3,
							["amount"] = 3110,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 254,
									["min"] = 187,
									["count"] = 2,
									["amount"] = 441,
								},
								["Crit"] = {
									["max"] = 293,
									["min"] = 293,
									["count"] = 1,
									["amount"] = 293,
								},
								["Hit"] = {
									["max"] = 139,
									["min"] = 139,
									["count"] = 1,
									["amount"] = 139,
								},
							},
							["count"] = 4,
							["amount"] = 873,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 240,
									["min"] = 196,
									["count"] = 11,
									["amount"] = 2266,
								},
								["Tick"] = {
									["max"] = 240,
									["min"] = 29,
									["count"] = 67,
									["amount"] = 13429,
								},
							},
							["count"] = 78,
							["amount"] = 15695,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 205,
									["min"] = 1,
									["count"] = 5,
									["amount"] = 485,
								},
							},
							["count"] = 6,
							["amount"] = 485,
						},
					},
					["HealingTaken"] = 9365,
					["WhoHealed"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 972,
								},
								["防护暗影结界"] = {
									["count"] = 335,
								},
								["死亡缠绕"] = {
									["count"] = 41,
								},
							},
							["amount"] = 1348,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8017,
								},
							},
							["amount"] = 8017,
						},
					},
					["TimeDamage"] = 202.68,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 0.4,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["灼热之痛"] = {
									["count"] = 2.4,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.95,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 14.75,
						},
						["霜如雪"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.719999999999999,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.22,
						},
						["根基图腾"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 2.08,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.79,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 6.34,
								},
								["灼热之痛"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 16.21,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 3,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 7.24,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 15.39,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 7.54,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 12.88,
								},
								["铁皮手雷"] = {
									["count"] = 0.7,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 8.940000000000001,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 31.56,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 4.23,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.04,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 6.02,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 16.27,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.35,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 22.21,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 12.84,
								},
							},
							["amount"] = 36.42,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.65,
								},
								["暗影箭"] = {
									["count"] = 3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.779999999999999,
								},
							},
							["amount"] = 11.93,
						},
						["火焰灬"] = {
							["Details"] = {
								["腐蚀术"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 13.5,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 6.75,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 24.75,
						},
						["龍雲卿"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.29,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 2.29,
								},
							},
							["amount"] = 5.58,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 2.1,
								},
								["暗影箭"] = {
									["count"] = 0.43,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.340000000000001,
								},
								["铁皮手雷"] = {
									["count"] = 0.38,
								},
								["暗影灼烧"] = {
									["count"] = 0.25,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 6.17,
								},
								["肉搏"] = {
									["count"] = 2.43,
								},
							},
							["amount"] = 19.1,
						},
					},
					["ManaGain"] = 10595,
					["ManaGainedFrom"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 10595,
								},
							},
							["amount"] = 10595,
						},
					},
					["DispelledWho"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["疲劳诅咒 (逃命专家)"] = {
									["count"] = 1,
								},
								["致残毒药 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰锥术 (逃命专家)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
				},
			},
			["UnitLockout"] = 21758.331,
			["LastActive"] = 23495.33,
		},
		["克萨苏恩 <灌篮高手-逐风者>"] = {
			["GUID"] = "Pet-0-5427-529-15996-417-060117580E",
			["LastEventHealth"] = {
				2320, -- [1]
				2320, -- [2]
				2320, -- [3]
				2320, -- [4]
				2320, -- [5]
				2320, -- [6]
				2320, -- [7]
				2320, -- [8]
				2320, -- [9]
				2320, -- [10]
				2176, -- [11]
				2176, -- [12]
				2176, -- [13]
				2176, -- [14]
				2320, -- [15]
				2320, -- [16]
				2320, -- [17]
				2320, -- [18]
				2320, -- [19]
				2320, -- [20]
				1806, -- [21]
				1806, -- [22]
				1806, -- [23]
				2320, -- [24]
				2320, -- [25]
				2320, -- [26]
				2320, -- [27]
				2320, -- [28]
				2320, -- [29]
				2320, -- [30]
				2320, -- [31]
				2231, -- [32]
				2320, -- [33]
				2320, -- [34]
				2320, -- [35]
				2320, -- [36]
				2101, -- [37]
				2101, -- [38]
			},
			["LastAttackedBy"] = "古德斯尼-逐风者",
			["LastEventType"] = {
				"MISC", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"MISC", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"MISC", -- [14]
				"DAMAGE", -- [15]
				"MISC", -- [16]
				"MISC", -- [17]
				"DAMAGE", -- [18]
				"MISC", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"MISC", -- [25]
				"DAMAGE", -- [26]
				"MISC", -- [27]
				"MISC", -- [28]
				"MISC", -- [29]
				"MISC", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"MISC", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
			},
			["TimeWindows"] = {
				["Dispelled"] = {
					1, -- [1]
				},
				["Dispels"] = {
					11, -- [1]
				},
				["TimeDamage"] = {
					16.5, -- [1]
				},
				["ActiveTime"] = {
					16.5, -- [1]
				},
				["DamageTaken"] = {
					1829, -- [1]
				},
				["Damage"] = {
					659, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "克萨苏恩",
			["level"] = 1,
			["LastDamageAbility"] = "冰锥术",
			["LastFightIn"] = 12,
			["type"] = "Pet",
			["ownerName"] = "灌篮高手-逐风者",
			["LastDamageTaken"] = 534,
			["LastEventHealthMax"] = {
				2320, -- [1]
				2320, -- [2]
				2320, -- [3]
				2320, -- [4]
				2320, -- [5]
				2320, -- [6]
				2320, -- [7]
				2320, -- [8]
				2320, -- [9]
				2320, -- [10]
				2320, -- [11]
				2320, -- [12]
				2320, -- [13]
				2320, -- [14]
				2320, -- [15]
				2320, -- [16]
				2320, -- [17]
				2320, -- [18]
				2320, -- [19]
				2320, -- [20]
				2320, -- [21]
				2320, -- [22]
				2320, -- [23]
				2320, -- [24]
				2320, -- [25]
				2320, -- [26]
				2320, -- [27]
				2320, -- [28]
				2320, -- [29]
				2320, -- [30]
				2320, -- [31]
				2320, -- [32]
				2320, -- [33]
				2320, -- [34]
				2320, -- [35]
				2320, -- [36]
				2320, -- [37]
				2320, -- [38]
			},
			["TimeLast"] = {
				["TimeDamage"] = 22710.335,
				["Dispelled"] = 22066.332,
				["Dispels"] = 23472.328,
				["ActiveTime"] = 22710.335,
				["OVERALL"] = 23491.33,
				["DamageTaken"] = 23491.33,
				["Damage"] = 22710.335,
			},
			["NextEventNum"] = 39,
			["LastDamageTime"] = 22710.356,
			["LastEvents"] = {
				"克萨苏恩 <灌篮高手-逐风者> dispels 清风徐自来-火妖鲁西弗隆 恢复 (吞噬魔法)", -- [1]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 清风徐自来-火妖鲁西弗隆 Hit -63 (Physical)", -- [2]
				"清风徐自来-火妖鲁西弗隆 虚弱之触 克萨苏恩 <灌篮高手-逐风者> Resist (Shadow)", -- [3]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 清风徐自来-火妖鲁西弗隆 Hit -59 (Physical)", -- [4]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 清风徐自来-火妖鲁西弗隆 Hit -66 (Physical)", -- [5]
				"克萨苏恩 <灌篮高手-逐风者> dispels 特变电工 霜寒刺骨 (吞噬魔法)", -- [6]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 二道沟子靓仔-逐风者 Hit -76 (Physical)", -- [7]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 二道沟子靓仔-逐风者 Crit -126 (Physical)", -- [8]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 二道沟子靓仔-逐风者 Hit -74 (Physical)", -- [9]
				"取名不能骚气-黑龙费尔默 铁皮手雷 克萨苏恩 <灌篮高手-逐风者> Hit -144 (Fire)", -- [10]
				"火焰灬 冰霜新星 克萨苏恩 <灌篮高手-逐风者> Resist (Frost)", -- [11]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 火焰灬 Immune (1)", -- [12]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 火焰灬 Immune (1)", -- [13]
				"克萨苏恩 <灌篮高手-逐风者> dispels 清风徐自来-火妖鲁西弗隆 心灵之火 (吞噬魔法)", -- [14]
				"清风徐自来-火妖鲁西弗隆 心灵尖啸 克萨苏恩 <灌篮高手-逐风者> Resist (Shadow)", -- [15]
				"乌勒哈姆 dispels 克萨苏恩 <灌篮高手-逐风者> 奥术光辉 (吞噬魔法)", -- [16]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 暗言术：痛 (吞噬魔法)", -- [17]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 火焰灬 Hit -73 (Physical)", -- [18]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 无畏冲锋 (吞噬魔法)", -- [19]
				"古德斯尼-逐风者 冰锥术 克萨苏恩 <灌篮高手-逐风者> Hit -514 (Frost)", -- [20]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 火焰灬 Absorb -60 (60 被吸收) (1)", -- [21]
				"克萨苏恩 <灌篮高手-逐风者> 肉搏 火焰灬 Hit -62 (Physical)", -- [22]
				"芬达么有糖-黑龙费尔默 雷霆一击 克萨苏恩 <灌篮高手-逐风者> Hit -73 (Physical)", -- [23]
				"古德斯尼-逐风者 冰霜新星 克萨苏恩 <灌篮高手-逐风者> Resist (Frost)", -- [24]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 冰霜新星 (吞噬魔法)", -- [25]
				"古德斯尼-逐风者 冰锥术 克萨苏恩 <灌篮高手-逐风者> Resist (Frost)", -- [26]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 冰锥术 (吞噬魔法)", -- [27]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 暗言术：痛 (吞噬魔法)", -- [28]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 腐蚀术 (吞噬魔法)", -- [29]
				"克萨苏恩 <灌篮高手-逐风者> dispels 灌篮高手-逐风者 生命虹吸 (吞噬魔法)", -- [30]
				"熔岩图腾 IV 熔岩图腾 克萨苏恩 <灌篮高手-逐风者> Hit -89 (Fire)", -- [31]
				"熔岩图腾 IV 熔岩图腾 克萨苏恩 <灌篮高手-逐风者> Hit -45 (45 被抵抗) (Fire)", -- [32]
				"克萨苏恩 <灌篮高手-逐风者> dispels 清风徐自来-火妖鲁西弗隆 心灵之火 (吞噬魔法)", -- [33]
				"清风徐自来-火妖鲁西弗隆 心灵尖啸 克萨苏恩 <灌篮高手-逐风者> Resist (Shadow)", -- [34]
				"清风徐自来-火妖鲁西弗隆 铁皮手雷 克萨苏恩 <灌篮高手-逐风者> Hit -211 (Fire)", -- [35]
				"古德斯尼-逐风者 魔爆术 克萨苏恩 <灌篮高手-逐风者> Hit -219 (73 被抵抗) (Arcane)", -- [36]
				"古德斯尼-逐风者 霜寒刺骨 克萨苏恩 <灌篮高手-逐风者> Resist (Frost)", -- [37]
				"古德斯尼-逐风者 冰锥术 克萨苏恩 <灌篮高手-逐风者> Hit -534 (Frost)", -- [38]
			},
			["Name"] = "克萨苏恩",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
			},
			["LastEventTimes"] = {
				21781.349, -- [1]
				21786.883, -- [2]
				21786.899, -- [3]
				21788.899, -- [4]
				21790.9, -- [5]
				21803.317, -- [6]
				22029.113, -- [7]
				22032.363, -- [8]
				22034.38, -- [9]
				22035.215, -- [10]
				22035.313, -- [11]
				22047.764, -- [12]
				22049.781, -- [13]
				22060.798, -- [14]
				22064.815, -- [15]
				22067.115, -- [16]
				22589.545, -- [17]
				22702.335, -- [18]
				22704.952, -- [19]
				22704.968, -- [20]
				22707.652, -- [21]
				22710.356, -- [22]
				22715.635, -- [23]
				22933.681, -- [24]
				22940.365, -- [25]
				22943.616, -- [26]
				22948.899, -- [27]
				22963.266, -- [28]
				22972.033, -- [29]
				22990.018, -- [30]
				23452.727, -- [31]
				23454.73, -- [32]
				23472.962, -- [33]
				23477.679, -- [34]
				23477.714, -- [35]
				23490.813, -- [36]
				23492.313, -- [37]
				23492.313, -- [38]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1098,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 345,
						["Frost"] = 534,
						["Arcane"] = 219,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 1,
					["ElementTakenResist"] = {
						["Arcane"] = 73,
						["Fire"] = 45,
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 134,
								},
							},
							["amount"] = 134,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 211,
								},
							},
							["amount"] = 211,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 219,
								},
								["冰锥术"] = {
									["count"] = 534,
								},
							},
							["amount"] = 753,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["熔岩图腾"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 45,
									["min"] = 45,
									["count"] = 1,
									["amount"] = 45,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 45,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 73,
									["min"] = 73,
									["count"] = 1,
									["amount"] = 73,
								},
							},
							["count"] = 73,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵之火 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 1,
					["TimeSpent"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["火焰灬"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["DamageTaken"] = 1829,
					["ElementDoneAbsorb"] = {
						["Melee"] = 60,
					},
					["PartialResist"] = {
						["熔岩图腾"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 45,
									["min"] = 45,
									["count"] = 1,
									["amount"] = 45,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 45,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 73,
									["min"] = 73,
									["count"] = 1,
									["amount"] = 73,
								},
							},
							["count"] = 73,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["PartialAbsorb"] = {
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 16.5,
					["ElementTaken"] = {
						["Frost"] = 1048,
						["Fire"] = 489,
						["Physical"] = 73,
						["Arcane"] = 219,
					},
					["Damage"] = 659,
					["Dispels"] = 11,
					["ElementTakenResist"] = {
						["Arcane"] = 73,
						["Fire"] = 45,
					},
					["WhoDispelled"] = {
						["乌勒哈姆"] = {
							["Details"] = {
								["奥术光辉 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 134,
								},
							},
							["amount"] = 134,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 73,
								},
							},
							["amount"] = 73,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 144,
								},
							},
							["amount"] = 144,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 211,
								},
							},
							["amount"] = 211,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 219,
								},
								["冰锥术"] = {
									["count"] = 1048,
								},
							},
							["amount"] = 1267,
						},
					},
					["ElementDone"] = {
						["Melee"] = 659,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DamagedWho"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 276,
								},
							},
							["amount"] = 276,
						},
						["火焰灬"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 195,
								},
							},
							["amount"] = 195,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 188,
								},
							},
							["amount"] = 188,
						},
					},
					["TimeDamage"] = 16.5,
					["TimeDamaging"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["火焰灬"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 11,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 60,
									["min"] = 60,
									["count"] = 1,
									["amount"] = 60,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 126,
									["min"] = 126,
									["count"] = 1,
									["amount"] = 126,
								},
								["Hit"] = {
									["max"] = 76,
									["min"] = 59,
									["count"] = 7,
									["amount"] = 473,
								},
							},
							["count"] = 11,
							["amount"] = 659,
						},
					},
					["DispelledWho"] = {
						["特变电工"] = {
							["Details"] = {
								["霜寒刺骨 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵之火 (吞噬魔法)"] = {
									["count"] = 2,
								},
								["恢复 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["腐蚀术 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["无畏冲锋 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["生命虹吸 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["冰锥术 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["冰霜新星 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["暗言术：痛 (吞噬魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
					},
				},
			},
			["UnitLockout"] = 21781.332,
			["LastActive"] = 23491.33,
		},
		["啤酒 <一箭情封-逐风者>"] = {
			["GUID"] = "Pet-0-5427-529-15996-10200-02014DFA9F",
			["LastEventHealth"] = {
				3294, -- [1]
				3294, -- [2]
				3294, -- [3]
				3294, -- [4]
				3205, -- [5]
				3205, -- [6]
				3205, -- [7]
				3205, -- [8]
				3116, -- [9]
				2982, -- [10]
				2982, -- [11]
				2982, -- [12]
				2848, -- [13]
				2848, -- [14]
				2848, -- [15]
				2848, -- [16]
				3168, -- [17]
				3168, -- [18]
				3168, -- [19]
				3168, -- [20]
				3168, -- [21]
				3168, -- [22]
				3168, -- [23]
				3168, -- [24]
				3168, -- [25]
				3168, -- [26]
				3168, -- [27]
				3383, -- [28]
				3383, -- [29]
				3383, -- [30]
				3383, -- [31]
				3383, -- [32]
				3383, -- [33]
				3383, -- [34]
				3383, -- [35]
				3383, -- [36]
				3383, -- [37]
				3282, -- [38]
				3282, -- [39]
				3383, -- [40]
				3383, -- [41]
				3383, -- [42]
				3349, -- [43]
				3349, -- [44]
				3383, -- [45]
				3383, -- [46]
				3383, -- [47]
				3383, -- [48]
				3383, -- [49]
				3294, -- [50]
			},
			["LastAttackedBy"] = "熔岩图腾 IV",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					72.59, -- [1]
				},
				["Damage"] = {
					5334, -- [1]
				},
				["DamageTaken"] = {
					3814, -- [1]
				},
				["ActiveTime"] = {
					72.59, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "啤酒",
			["level"] = 1,
			["LastDamageAbility"] = "熔岩图腾",
			["LastFightIn"] = 12,
			["type"] = "Pet",
			["ownerName"] = "一箭情封-逐风者",
			["LastDamageTaken"] = 134,
			["TimeLast"] = {
				["ActiveTime"] = 23462.328,
				["TimeDamage"] = 23462.328,
				["OVERALL"] = 23462.328,
				["DamageTaken"] = 23454.327,
				["Damage"] = 23462.328,
			},
			["LastEventHealthMax"] = {
				3383, -- [1]
				3383, -- [2]
				3383, -- [3]
				3383, -- [4]
				3383, -- [5]
				3383, -- [6]
				3383, -- [7]
				3383, -- [8]
				3383, -- [9]
				3383, -- [10]
				3383, -- [11]
				3383, -- [12]
				3383, -- [13]
				3383, -- [14]
				3383, -- [15]
				3383, -- [16]
				3383, -- [17]
				3383, -- [18]
				3383, -- [19]
				3383, -- [20]
				3383, -- [21]
				3383, -- [22]
				3383, -- [23]
				3383, -- [24]
				3383, -- [25]
				3383, -- [26]
				3383, -- [27]
				3383, -- [28]
				3383, -- [29]
				3383, -- [30]
				3383, -- [31]
				3383, -- [32]
				3383, -- [33]
				3383, -- [34]
				3383, -- [35]
				3383, -- [36]
				3383, -- [37]
				3383, -- [38]
				3383, -- [39]
				3383, -- [40]
				3383, -- [41]
				3383, -- [42]
				3383, -- [43]
				3383, -- [44]
				3383, -- [45]
				3383, -- [46]
				3383, -- [47]
				3383, -- [48]
				3383, -- [49]
				3383, -- [50]
			},
			["NextEventNum"] = 17,
			["LastDamageTime"] = 23462.545,
			["LastEvents"] = {
				"啤酒 <一箭情封-逐风者> 爪击 二道沟子靓仔-逐风者 Hit -44 (Physical)", -- [1]
				"啤酒 <一箭情封-逐风者> 肉搏 二道沟子靓仔-逐风者 Crit -147 (Physical)", -- [2]
				"啤酒 <一箭情封-逐风者> 爪击 二道沟子靓仔-逐风者 Hit -43 (Physical)", -- [3]
				"熔岩图腾 IV 熔岩图腾 啤酒 <一箭情封-逐风者> Hit -89 (Fire)", -- [4]
				"啤酒 <一箭情封-逐风者> 肉搏 二道沟子靓仔-逐风者 Hit -73 (Physical)", -- [5]
				"啤酒 <一箭情封-逐风者> 爪击 二道沟子靓仔-逐风者 Hit -50 (Physical)", -- [6]
				"啤酒 <一箭情封-逐风者> 肉搏 二道沟子靓仔-逐风者 Hit -74 (Physical)", -- [7]
				"熔岩图腾 IV 熔岩图腾 啤酒 <一箭情封-逐风者> Hit -89 (Fire)", -- [8]
				"熔岩图腾 IV 熔岩图腾 啤酒 <一箭情封-逐风者> Crit -134 (Fire)", -- [9]
				"啤酒 <一箭情封-逐风者> 肉搏 二道沟子靓仔-逐风者 Hit -70 (Physical)", -- [10]
				"啤酒 <一箭情封-逐风者> 爪击 二道沟子靓仔-逐风者 Hit -57 (Physical)", -- [11]
				"熔岩图腾 IV 熔岩图腾 啤酒 <一箭情封-逐风者> Crit -134 (Fire)", -- [12]
				"啤酒 <一箭情封-逐风者> 肉搏 二道沟子靓仔-逐风者 Hit -70 (Physical)", -- [13]
				"啤酒 <一箭情封-逐风者> 爪击 二道沟子靓仔-逐风者 Hit -48 (Physical)", -- [14]
				"啤酒 <一箭情封-逐风者> 肉搏 阿拉希的传说-火妖鲁西弗隆 Hit -76 (Physical)", -- [15]
				"啤酒 <一箭情封-逐风者> 爪击 阿拉希的传说-火妖鲁西弗隆 Crit -102 (Physical)", -- [16]
				"啤酒 <一箭情封-逐风者> 爪击 清风徐自来-火妖鲁西弗隆 Absorb -42 (42 被吸收) (Physical)", -- [17]
				"啤酒 <一箭情封-逐风者> 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -56 (56 被吸收) (1)", -- [18]
				"啤酒 <一箭情封-逐风者> 爪击 清风徐自来-火妖鲁西弗隆 Absorb -40 (40 被吸收) (Physical)", -- [19]
				"啤酒 <一箭情封-逐风者> 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -58 (58 被吸收) (1)", -- [20]
				"啤酒 <一箭情封-逐风者> 爪击 清风徐自来-火妖鲁西弗隆 Absorb -47 (47 被吸收) (Physical)", -- [21]
				"啤酒 <一箭情封-逐风者> 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -52 (52 被吸收) (1)", -- [22]
				"啤酒 <一箭情封-逐风者> 肉搏 火焰灬 Hit -66 (Physical)", -- [23]
				"啤酒 <一箭情封-逐风者> 爪击 火焰灬 Hit -52 (Physical)", -- [24]
				"啤酒 <一箭情封-逐风者> 爪击 火焰灬 Hit -44 (Physical)", -- [25]
				"啤酒 <一箭情封-逐风者> 肉搏 火焰灬 Hit -66 (Physical)", -- [26]
				"芬达么有糖-黑龙费尔默 雷霆一击 啤酒 <一箭情封-逐风者> Hit -63 (Physical)", -- [27]
				"啤酒 <一箭情封-逐风者> 肉搏 芬达么有糖-黑龙费尔默 Hit -58 (Physical)", -- [28]
				"啤酒 <一箭情封-逐风者> 爪击 芬达么有糖-黑龙费尔默 Hit -34 (Physical)", -- [29]
				"啤酒 <一箭情封-逐风者> 肉搏 芬达么有糖-黑龙费尔默 Hit -60 (Physical)", -- [30]
				"啤酒 <一箭情封-逐风者> 爪击 芬达么有糖-黑龙费尔默 Hit -33 (Physical)", -- [31]
				"啤酒 <一箭情封-逐风者> 肉搏 芬达么有糖-黑龙费尔默 Hit -49 (Physical)", -- [32]
				"啤酒 <一箭情封-逐风者> 肉搏 火焰灬 Hit -107 (Physical)", -- [33]
				"啤酒 <一箭情封-逐风者> 爪击 火焰灬 Hit -53 (Physical)", -- [34]
				"啤酒 <一箭情封-逐风者> 肉搏 火焰灬 Hit -106 (Physical)", -- [35]
				"啤酒 <一箭情封-逐风者> 爪击 火焰灬 Hit -59 (Physical)", -- [36]
				"古德斯尼-逐风者 冰霜新星 啤酒 <一箭情封-逐风者> Hit -81 (Frost)", -- [37]
				"啤酒 <一箭情封-逐风者> 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -85 (85 被吸收) (1)", -- [38]
				"啤酒 <一箭情封-逐风者> 爪击 清风徐自来-火妖鲁西弗隆 Absorb -52 (52 被吸收) (Physical)", -- [39]
				"啤酒 <一箭情封-逐风者> 肉搏 古德斯尼-逐风者 Hit -71 (Physical)", -- [40]
				"啤酒 <一箭情封-逐风者> 爪击 古德斯尼-逐风者 Hit -58 (Physical)", -- [41]
				"二道沟子靓仔-逐风者 铁皮手雷 啤酒 <一箭情封-逐风者> Hit -147 (Fire)", -- [42]
				"啤酒 <一箭情封-逐风者> 肉搏 取名不能骚气-黑龙费尔默 Hit -93 (Physical)", -- [43]
				"啤酒 <一箭情封-逐风者> 爪击 取名不能骚气-黑龙费尔默 Hit -64 (Physical)", -- [44]
				"啤酒 <一箭情封-逐风者> 肉搏 草莓尐布丁-火妖鲁西弗隆 Hit -69 (Physical)", -- [45]
				"啤酒 <一箭情封-逐风者> 爪击 草莓尐布丁-火妖鲁西弗隆 Hit -49 (Physical)", -- [46]
				"啤酒 <一箭情封-逐风者> 肉搏 果不其然-逐风者 Hit -76 (Physical)", -- [47]
				"啤酒 <一箭情封-逐风者> 爪击 果不其然-逐风者 Hit -59 (Physical)", -- [48]
				"熔岩图腾 IV 熔岩图腾 啤酒 <一箭情封-逐风者> Hit -89 (Fire)", -- [49]
				"啤酒 <一箭情封-逐风者> 肉搏 二道沟子靓仔-逐风者 Hit -64 (Physical)", -- [50]
			},
			["Name"] = "啤酒",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				23446.36, -- [1]
				23447.56, -- [2]
				23447.977, -- [3]
				23448.01, -- [4]
				23449.06, -- [5]
				23449.594, -- [6]
				23450.577, -- [7]
				23450.727, -- [8]
				23452.727, -- [9]
				23453.627, -- [10]
				23453.627, -- [11]
				23454.73, -- [12]
				23455.128, -- [13]
				23455.244, -- [14]
				23462.228, -- [15]
				23462.545, -- [16]
				22701.918, -- [17]
				22703.435, -- [18]
				22703.552, -- [19]
				22704.952, -- [20]
				22705.152, -- [21]
				22706.452, -- [22]
				22708.885, -- [23]
				22709.202, -- [24]
				22710.802, -- [25]
				22710.902, -- [26]
				22715.635, -- [27]
				22794.007, -- [28]
				22794.923, -- [29]
				22795.523, -- [30]
				22796.557, -- [31]
				22797.024, -- [32]
				22837.843, -- [33]
				22838.659, -- [34]
				22839.859, -- [35]
				22840.293, -- [36]
				22852.543, -- [37]
				22920.38, -- [38]
				22921.181, -- [39]
				23060.138, -- [40]
				23060.455, -- [41]
				23117.075, -- [42]
				23281.151, -- [43]
				23282.051, -- [44]
				23432.276, -- [45]
				23432.593, -- [46]
				23439.077, -- [47]
				23439.893, -- [48]
				23446.01, -- [49]
				23446.044, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 535,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 10,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 535,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1328,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 812,
						["Physical"] = 516,
					},
					["PartialAbsorb"] = {
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 69,
								},
							},
							["amount"] = 118,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 64,
								},
								["肉搏"] = {
									["count"] = 93,
								},
							},
							["amount"] = 157,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 102,
								},
								["肉搏"] = {
									["count"] = 76,
								},
							},
							["amount"] = 178,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 59,
								},
								["肉搏"] = {
									["count"] = 76,
								},
							},
							["amount"] = 135,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 242,
								},
								["肉搏"] = {
									["count"] = 498,
								},
							},
							["amount"] = 740,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 535,
								},
							},
							["amount"] = 535,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.82,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.9,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.4,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.82,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.32,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.39,
								},
								["肉搏"] = {
									["count"] = 7.76,
								},
							},
							["amount"] = 9.149999999999999,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 17.51,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["爪击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 102,
									["min"] = 102,
									["count"] = 1,
									["amount"] = 102,
								},
								["Hit"] = {
									["max"] = 64,
									["min"] = 43,
									["count"] = 8,
									["amount"] = 414,
								},
							},
							["count"] = 9,
							["amount"] = 516,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 147,
									["min"] = 147,
									["count"] = 1,
									["amount"] = 147,
								},
								["Hit"] = {
									["max"] = 93,
									["min"] = 64,
									["count"] = 9,
									["amount"] = 665,
								},
							},
							["count"] = 10,
							["amount"] = 812,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 17.51,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.82,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.9,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.4,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.82,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.32,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.39,
								},
								["肉搏"] = {
									["count"] = 7.76,
								},
							},
							["amount"] = 9.149999999999999,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["WhoDamaged"] = {
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 535,
								},
							},
							["amount"] = 535,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 81,
								},
							},
							["amount"] = 81,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 63,
								},
							},
							["amount"] = 63,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 147,
								},
							},
							["amount"] = 147,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 864,
								},
								["铁皮手雷"] = {
									["count"] = 193,
								},
							},
							["amount"] = 1057,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 290,
								},
								["冰锥术"] = {
									["count"] = 1043,
								},
								["冰霜新星"] = {
									["count"] = 88,
								},
							},
							["amount"] = 1421,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["剑刃乱舞"] = {
									["count"] = 211,
								},
							},
							["amount"] = 211,
						},
						["龍雲卿"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 299,
								},
							},
							["amount"] = 299,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 85,
									["min"] = 52,
									["count"] = 5,
									["amount"] = 312,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 183,
									["min"] = 136,
									["count"] = 3,
									["amount"] = 466,
								},
								["Hit"] = {
									["max"] = 107,
									["min"] = 49,
									["count"] = 35,
									["amount"] = 2702,
								},
							},
							["count"] = 44,
							["amount"] = 3480,
						},
						["爪击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 52,
									["min"] = 40,
									["count"] = 4,
									["amount"] = 181,
								},
								["Hit"] = {
									["max"] = 68,
									["min"] = 28,
									["count"] = 31,
									["amount"] = 1571,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 102,
									["min"] = 102,
									["count"] = 1,
									["amount"] = 102,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 38,
							["amount"] = 1854,
						},
					},
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.82,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.27,
								},
								["肉搏"] = {
									["count"] = 4.07,
								},
							},
							["amount"] = 6.34,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.46,
								},
								["肉搏"] = {
									["count"] = 11.78,
								},
							},
							["amount"] = 16.24,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.32,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.32,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.87,
								},
								["肉搏"] = {
									["count"] = 5.95,
								},
							},
							["amount"] = 7.82,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.71,
								},
								["肉搏"] = {
									["count"] = 9.26,
								},
							},
							["amount"] = 10.97,
						},
						["火焰灬"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 3.07,
								},
								["肉搏"] = {
									["count"] = 4.3,
								},
							},
							["amount"] = 7.37,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3.06,
								},
								["爪击"] = {
									["count"] = 5.01,
								},
							},
							["amount"] = 8.07,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 7.2,
								},
							},
							["amount"] = 8.32,
						},
					},
					["DamageTaken"] = 3814,
					["ElementDoneAbsorb"] = {
						["Melee"] = 312,
						["Physical"] = 181,
					},
					["ElementDone"] = {
						["Melee"] = 3480,
						["Physical"] = 1854,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 35,
								},
							},
							["amount"] = 44,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 31,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 38,
						},
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 69,
								},
							},
							["amount"] = 118,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 95,
								},
								["肉搏"] = {
									["count"] = 226,
								},
							},
							["amount"] = 321,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 439,
								},
								["肉搏"] = {
									["count"] = 1009,
								},
							},
							["amount"] = 1448,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 58,
								},
								["肉搏"] = {
									["count"] = 71,
								},
							},
							["amount"] = 129,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 59,
								},
								["肉搏"] = {
									["count"] = 76,
								},
							},
							["amount"] = 135,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 259,
								},
								["肉搏"] = {
									["count"] = 359,
								},
							},
							["amount"] = 618,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 242,
								},
								["肉搏"] = {
									["count"] = 634,
								},
							},
							["amount"] = 876,
						},
						["火焰灬"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 208,
								},
								["肉搏"] = {
									["count"] = 345,
								},
							},
							["amount"] = 553,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 379,
								},
								["爪击"] = {
									["count"] = 264,
								},
							},
							["amount"] = 643,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 181,
								},
								["肉搏"] = {
									["count"] = 312,
								},
							},
							["amount"] = 493,
						},
					},
					["TimeDamage"] = 72.59,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.82,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.27,
								},
								["肉搏"] = {
									["count"] = 4.07,
								},
							},
							["amount"] = 6.34,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 4.46,
								},
								["肉搏"] = {
									["count"] = 11.78,
								},
							},
							["amount"] = 16.24,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.32,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.82,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.32,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.87,
								},
								["肉搏"] = {
									["count"] = 5.95,
								},
							},
							["amount"] = 7.82,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.71,
								},
								["肉搏"] = {
									["count"] = 9.26,
								},
							},
							["amount"] = 10.97,
						},
						["火焰灬"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 3.07,
								},
								["肉搏"] = {
									["count"] = 4.3,
								},
							},
							["amount"] = 7.37,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3.06,
								},
								["爪击"] = {
									["count"] = 5.01,
								},
							},
							["amount"] = 8.07,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 7.2,
								},
							},
							["amount"] = 8.32,
						},
					},
					["ElementTaken"] = {
						["Shadow"] = 864,
						["Arcane"] = 290,
						["Physical"] = 274,
						["Fire"] = 875,
						["Frost"] = 1212,
						["Nature"] = 299,
					},
					["ActiveTime"] = 72.59,
					["Damage"] = 5334,
				},
			},
			["UnitLockout"] = 21775.332,
			["LastActive"] = 23462.328,
		},
		["一箭情封-逐风者"] = {
			["GUID"] = "Player-5451-0327A987",
			["LastEventHealth"] = {
				5420, -- [1]
				5420, -- [2]
				5420, -- [3]
				5420, -- [4]
				5420, -- [5]
				5420, -- [6]
				5420, -- [7]
				5420, -- [8]
				5420, -- [9]
				5420, -- [10]
				5420, -- [11]
				5420, -- [12]
				5420, -- [13]
				5420, -- [14]
				3054, -- [15]
				2760, -- [16]
				2194, -- [17]
				2995, -- [18]
				2995, -- [19]
				2995, -- [20]
				1722, -- [21]
				1722, -- [22]
				1444, -- [23]
				1232, -- [24]
				1232, -- [25]
				1232, -- [26]
				374, -- [27]
				0, -- [28]
				2542, -- [29]
				2542, -- [30]
				2343, -- [31]
				2144, -- [32]
				2144, -- [33]
				1944, -- [34]
				1745, -- [35]
				2566, -- [36]
				4380, -- [37]
				4255, -- [38]
				4255, -- [39]
				3824, -- [40]
				3699, -- [41]
				3699, -- [42]
				3268, -- [43]
				2952, -- [44]
				2952, -- [45]
				5420, -- [46]
				5420, -- [47]
				5420, -- [48]
				5420, -- [49]
				5420, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"HEAL", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					3, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["Healing"] = {
					1622, -- [1]
				},
				["DamageTaken"] = {
					18884, -- [1]
				},
				["HealingTaken"] = {
					4521, -- [1]
				},
				["TimeDamage"] = {
					127.11, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					130.11, -- [1]
				},
				["DOT_Time"] = {
					57, -- [1]
				},
				["Damage"] = {
					52309, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["LastHealTime"] = 23520.248,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
					},
					["Messages"] = {
						"火焰灬 寒冰箭 一箭情封-逐风者 Hit -56 (Frost)", -- [1]
						"火焰灬 火焰冲击 一箭情封-逐风者 Hit -566 (Fire)", -- [2]
						"一箭情封-逐风者 鞭根块茎 一箭情封-逐风者 Hit +801", -- [3]
						"二道沟子靓仔-逐风者 肉搏 一箭情封-逐风者 Crit -511 (Physical)", -- [4]
						"二道沟子靓仔-逐风者 肉搏 一箭情封-逐风者 Parry (1)", -- [5]
						"二道沟子靓仔-逐风者 肉搏 一箭情封-逐风者 Crit -762 (Physical)", -- [6]
						"二道沟子靓仔-逐风者 风暴打击 一箭情封-逐风者 Parry (Physical)", -- [7]
						"火焰灬 魔爆术 一箭情封-逐风者 Hit -278 (Arcane)", -- [8]
						"龍雲卿 肉搏 一箭情封-逐风者 Crit -212 (Physical)", -- [9]
						"一箭情封-逐风者 肉搏 火焰灬 Hit -372 (Physical)", -- [10]
						"一箭情封-逐风者 摔绊 火焰灬 Hit -41 (Physical)", -- [11]
						"二道沟子靓仔-逐风者 冰霜震击 一箭情封-逐风者 Crit -858 (Frost)", -- [12]
						"火焰灬 冰锥术 一箭情封-逐风者 Hit -509 (Frost)", -- [13]
						"一箭情封-逐风者死亡。", -- [14]
					},
					["DeathAt"] = 23524.331,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
					},
					["MessageTimes"] = {
						-3.599999999998545, -- [1]
						-3.066999999999098, -- [2]
						-2.683000000000902, -- [3]
						-2.049999999999272, -- [4]
						-2.049999999999272, -- [5]
						-2.032999999999447, -- [6]
						-1.683000000000902, -- [7]
						-1.532999999999447, -- [8]
						-1.483000000000175, -- [9]
						-1.032999999999447, -- [10]
						-0.9330000000009022, -- [11]
						-0.1830000000009022, -- [12]
						-0.03299999999944703, -- [13]
						0, -- [14]
					},
					["HealthMax"] = {
						5420, -- [1]
						5420, -- [2]
						5420, -- [3]
						5420, -- [4]
						5420, -- [5]
						5420, -- [6]
						5420, -- [7]
						5420, -- [8]
						5420, -- [9]
						5420, -- [10]
						5420, -- [11]
						5420, -- [12]
						5420, -- [13]
						5420, -- [14]
					},
					["Health"] = {
						3054, -- [1]
						2760, -- [2]
						2194, -- [3]
						2995, -- [4]
						2995, -- [5]
						2995, -- [6]
						1722, -- [7]
						1722, -- [8]
						1444, -- [9]
						1232, -- [10]
						1232, -- [11]
						1232, -- [12]
						374, -- [13]
						0, -- [14]
					},
					["KilledBy"] = "火焰灬",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"HEAL", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"MISC", -- [14]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
					},
					["Messages"] = {
						"古德斯尼-逐风者 火焰冲击 一箭情封-逐风者 Hit -627 (Fire)", -- [1]
						"一箭情封-逐风者死亡。", -- [2]
					},
					["DeathAt"] = 22632.331,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
					},
					["MessageTimes"] = {
						-0.03399999999965075, -- [1]
						0, -- [2]
					},
					["HealthMax"] = {
						5211, -- [1]
						5211, -- [2]
					},
					["Health"] = {
						268, -- [1]
						0, -- [2]
					},
					["KilledBy"] = "古德斯尼-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"MISC", -- [2]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "冰锥术",
			["LastFightIn"] = 12,
			["type"] = "Grouped",
			["LastDamageTaken"] = 509,
			["LastEventHealthMax"] = {
				5420, -- [1]
				5420, -- [2]
				5420, -- [3]
				5420, -- [4]
				5420, -- [5]
				5420, -- [6]
				5420, -- [7]
				5420, -- [8]
				5420, -- [9]
				5420, -- [10]
				5420, -- [11]
				5420, -- [12]
				5420, -- [13]
				5420, -- [14]
				5420, -- [15]
				5420, -- [16]
				5420, -- [17]
				5420, -- [18]
				5420, -- [19]
				5420, -- [20]
				5420, -- [21]
				5420, -- [22]
				5420, -- [23]
				5420, -- [24]
				5420, -- [25]
				5420, -- [26]
				5420, -- [27]
				5420, -- [28]
				5420, -- [29]
				5420, -- [30]
				5420, -- [31]
				5420, -- [32]
				5420, -- [33]
				5420, -- [34]
				5420, -- [35]
				5420, -- [36]
				5420, -- [37]
				5420, -- [38]
				5420, -- [39]
				5420, -- [40]
				5420, -- [41]
				5420, -- [42]
				5420, -- [43]
				5420, -- [44]
				5420, -- [45]
				5420, -- [46]
				5420, -- [47]
				5420, -- [48]
				5420, -- [49]
				5420, -- [50]
			},
			["TimeLast"] = {
				["TimeHeal"] = 23519.331,
				["Dispelled"] = 22923.331,
				["OVERALL"] = 23522.331,
				["DamageTaken"] = 23522.331,
				["HealingTaken"] = 23519.331,
				["DeathCount"] = 23522.331,
				["ActiveTime"] = 23521.331,
				["Healing"] = 23519.331,
				["TimeDamage"] = 23521.331,
				["DOT_Time"] = 22939.332,
				["Damage"] = 23521.331,
			},
			["Owner"] = false,
			["Pet"] = {
				"啤酒 <一箭情封-逐风者>", -- [1]
			},
			["NextEventNum"] = 29,
			["LastDamageTime"] = 23521.998,
			["LastEvents"] = {
				"一箭情封-逐风者 自动射击 果不其然-逐风者 Hit -347 (Physical)", -- [1]
				"一箭情封-逐风者 自动射击 二道沟子靓仔-逐风者 Hit -344 (Physical)", -- [2]
				"一箭情封-逐风者 瞄准射击 二道沟子靓仔-逐风者 Hit -742 (Physical)", -- [3]
				"一箭情封-逐风者 自动射击 二道沟子靓仔-逐风者 Crit -777 (Physical)", -- [4]
				"一箭情封-逐风者 多重射击 二道沟子靓仔-逐风者 Hit -485 (Physical)", -- [5]
				"一箭情封-逐风者 自动射击 二道沟子靓仔-逐风者 Hit -341 (Physical)", -- [6]
				"一箭情封-逐风者 自动射击 二道沟子靓仔-逐风者 Hit -318 (Physical)", -- [7]
				"一箭情封-逐风者 肉搏 阿拉希的传说-火妖鲁西弗隆 Hit -287 (Physical)", -- [8]
				"一箭情封-逐风者 瞄准射击 阿拉希的传说-火妖鲁西弗隆 Hit -847 (Physical)", -- [9]
				"一箭情封-逐风者 自动射击 阿拉希的传说-火妖鲁西弗隆 Hit -343 (Physical)", -- [10]
				"一箭情封-逐风者 多重射击 阿拉希的传说-火妖鲁西弗隆 Hit -509 (Physical)", -- [11]
				"一箭情封-逐风者 自动射击 阿拉希的传说-火妖鲁西弗隆 Hit -328 (Physical)", -- [12]
				"一箭情封-逐风者 自动射击 阿拉希的传说-火妖鲁西弗隆 Hit -352 (Physical)", -- [13]
				"一箭情封-逐风者 自动射击 清风徐自来-火妖鲁西弗隆 Absorb -454 (454 被吸收) (Physical)", -- [14]
				"火焰灬 寒冰箭 一箭情封-逐风者 Hit -56 (Frost)", -- [15]
				"火焰灬 火焰冲击 一箭情封-逐风者 Hit -566 (Fire)", -- [16]
				"一箭情封-逐风者 鞭根块茎 一箭情封-逐风者 Hit +801", -- [17]
				"二道沟子靓仔-逐风者 肉搏 一箭情封-逐风者 Crit -511 (Physical)", -- [18]
				"二道沟子靓仔-逐风者 肉搏 一箭情封-逐风者 Parry (1)", -- [19]
				"二道沟子靓仔-逐风者 肉搏 一箭情封-逐风者 Crit -762 (Physical)", -- [20]
				"二道沟子靓仔-逐风者 风暴打击 一箭情封-逐风者 Parry (Physical)", -- [21]
				"火焰灬 魔爆术 一箭情封-逐风者 Hit -278 (Arcane)", -- [22]
				"龍雲卿 肉搏 一箭情封-逐风者 Crit -212 (Physical)", -- [23]
				"一箭情封-逐风者 肉搏 火焰灬 Hit -372 (Physical)", -- [24]
				"一箭情封-逐风者 摔绊 火焰灬 Hit -41 (Physical)", -- [25]
				"二道沟子靓仔-逐风者 冰霜震击 一箭情封-逐风者 Crit -858 (Frost)", -- [26]
				"火焰灬 冰锥术 一箭情封-逐风者 Hit -509 (Frost)", -- [27]
				"一箭情封-逐风者死亡。", -- [28]
				"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 一箭情封-逐风者 Tick -199 (Shadow)", -- [29]
				"一箭情封-逐风者 自动射击 古德斯尼-逐风者 Crit -801 (Physical)", -- [30]
				"草莓尐布丁-火妖鲁西弗隆 射击 一箭情封-逐风者 Hit -199 (Fire)", -- [31]
				"一箭情封-逐风者 奥术射击 古德斯尼-逐风者 Absorb -198 (198 被吸收) (Arcane)", -- [32]
				"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 一箭情封-逐风者 Tick -200 (Shadow)", -- [33]
				"草莓尐布丁-火妖鲁西弗隆 射击 一箭情封-逐风者 Hit -199 (Fire)", -- [34]
				"一箭情封-逐风者 鞭根块茎 一箭情封-逐风者 Hit +821", -- [35]
				"草莓尐布丁-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 一箭情封-逐风者 Tick -200 (Shadow)", -- [36]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 一箭情封-逐风者 Tick -125 (Shadow)", -- [37]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 一箭情封-逐风者 Tick -332 (Shadow)", -- [38]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 一箭情封-逐风者 Tick -99 (Shadow)", -- [39]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 一箭情封-逐风者 Tick -125 (Shadow)", -- [40]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 一箭情封-逐风者 Tick -332 (Shadow)", -- [41]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 一箭情封-逐风者 Tick -99 (Shadow)", -- [42]
				"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 一箭情封-逐风者 Tick -125 (Shadow)", -- [43]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 一箭情封-逐风者 Tick -332 (Shadow)", -- [44]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 一箭情封-逐风者 Tick -99 (Shadow)", -- [45]
				"一箭情封-逐风者 自动射击 草莓尐布丁-火妖鲁西弗隆 Hit -350 (Physical)", -- [46]
				"一箭情封-逐风者 多重射击 草莓尐布丁-火妖鲁西弗隆 Hit -483 (Physical)", -- [47]
				"一箭情封-逐风者 多重射击 芬达么有糖-黑龙费尔默 Hit -409 (Physical)", -- [48]
				"一箭情封-逐风者 自动射击 草莓尐布丁-火妖鲁西弗隆 Crit -845 (Physical)", -- [49]
				"一箭情封-逐风者 驱散射击 果不其然-逐风者 Hit -169 (Physical)", -- [50]
			},
			["Name"] = "一箭情封-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				23438.127, -- [1]
				23445.01, -- [2]
				23448.31, -- [3]
				23448.61, -- [4]
				23450.027, -- [5]
				23450.244, -- [6]
				23451.877, -- [7]
				23452.994, -- [8]
				23458.128, -- [9]
				23458.561, -- [10]
				23459.878, -- [11]
				23460.661, -- [12]
				23463.011, -- [13]
				23473.562, -- [14]
				23519.331, -- [15]
				23519.864, -- [16]
				23520.248, -- [17]
				23520.881, -- [18]
				23520.881, -- [19]
				23520.898, -- [20]
				23521.248, -- [21]
				23521.398, -- [22]
				23521.448, -- [23]
				23521.898, -- [24]
				23521.998, -- [25]
				23522.748, -- [26]
				23522.898, -- [27]
				23522.931, -- [28]
				23112.758, -- [29]
				23112.925, -- [30]
				23114.058, -- [31]
				23115.625, -- [32]
				23115.741, -- [33]
				23116.125, -- [34]
				23117.608, -- [35]
				23118.742, -- [36]
				23281.184, -- [37]
				23281.668, -- [38]
				23281.684, -- [39]
				23283.168, -- [40]
				23284.668, -- [41]
				23284.701, -- [42]
				23285.185, -- [43]
				23287.685, -- [44]
				23287.685, -- [45]
				23430.693, -- [46]
				23431.376, -- [47]
				23431.493, -- [48]
				23433.043, -- [49]
				23433.643, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5420,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 19,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 1423,
						["Melee"] = 1485,
						["Arcane"] = 278,
						["Fire"] = 566,
						["Shadow"] = 1668,
					},
					["DOT_Time"] = 0,
					["Damage"] = 9143,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 454,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 659,
						["Physical"] = 8484,
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 483,
								},
								["自动射击"] = {
									["count"] = 1195,
								},
							},
							["amount"] = 1678,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 409,
								},
							},
							["amount"] = 409,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 454,
								},
							},
							["amount"] = 454,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1780,
								},
								["瞄准射击"] = {
									["count"] = 742,
								},
								["多重射击"] = {
									["count"] = 485,
								},
							},
							["amount"] = 3007,
						},
						["火焰灬"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 41,
								},
								["肉搏"] = {
									["count"] = 372,
								},
							},
							["amount"] = 413,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 169,
								},
								["自动射击"] = {
									["count"] = 347,
								},
							},
							["amount"] = 516,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 509,
								},
								["自动射击"] = {
									["count"] = 1023,
								},
								["瞄准射击"] = {
									["count"] = 847,
								},
								["肉搏"] = {
									["count"] = 287,
								},
							},
							["amount"] = 2666,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 297,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 996,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 375,
								},
							},
							["amount"] = 1668,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 278,
								},
								["寒冰箭"] = {
									["count"] = 56,
								},
								["冰锥术"] = {
									["count"] = 509,
								},
								["火焰冲击"] = {
									["count"] = 566,
								},
							},
							["amount"] = 1409,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 212,
								},
							},
							["amount"] = 212,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 858,
								},
								["肉搏"] = {
									["count"] = 1273,
								},
							},
							["amount"] = 2131,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 801,
								},
							},
							["amount"] = 801,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.68,
								},
								["自动射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.68,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.12,
								},
							},
							["amount"] = 0.12,
						},
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.52,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.42,
								},
							},
							["amount"] = 6.44,
						},
						["火焰灬"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.6,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0.6,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.1,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.32,
								},
								["自动射击"] = {
									["count"] = 2.71,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.12,
								},
							},
							["amount"] = 6.65,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["鞭根块茎"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 801,
									["min"] = 801,
									["count"] = 1,
									["amount"] = 801,
								},
							},
							["count"] = 1,
							["amount"] = 801,
						},
					},
					["WhoHealed"] = {
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 801,
								},
							},
							["amount"] = 801,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 23.59,
					["Healing"] = 801,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 509,
									["min"] = 409,
									["count"] = 4,
									["amount"] = 1886,
								},
							},
							["count"] = 4,
							["amount"] = 1886,
						},
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 1,
									["amount"] = 41,
								},
							},
							["count"] = 1,
							["amount"] = 41,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 847,
									["min"] = 742,
									["count"] = 2,
									["amount"] = 1589,
								},
							},
							["count"] = 2,
							["amount"] = 1589,
						},
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 454,
									["min"] = 454,
									["count"] = 1,
									["amount"] = 454,
								},
								["Crit"] = {
									["max"] = 845,
									["min"] = 777,
									["count"] = 2,
									["amount"] = 1622,
								},
								["Hit"] = {
									["max"] = 352,
									["min"] = 318,
									["count"] = 8,
									["amount"] = 2723,
								},
							},
							["count"] = 11,
							["amount"] = 4799,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 169,
									["min"] = 169,
									["count"] = 1,
									["amount"] = 169,
								},
							},
							["count"] = 1,
							["amount"] = 169,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 372,
									["min"] = 287,
									["count"] = 2,
									["amount"] = 659,
								},
							},
							["count"] = 2,
							["amount"] = 659,
						},
					},
					["HealingTaken"] = 801,
					["RageGain"] = 0,
					["TimeDamage"] = 22.09,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.68,
								},
								["自动射击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.68,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.12,
								},
							},
							["amount"] = 0.12,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3.52,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.42,
								},
							},
							["amount"] = 6.44,
						},
						["火焰灬"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.6,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 0.6,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.1,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.32,
								},
								["自动射击"] = {
									["count"] = 2.71,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.12,
								},
							},
							["amount"] = 6.65,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 15,
								},
								["果不其然-逐风者"] = {
									["count"] = 27,
								},
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 15,
								},
							},
							["amount"] = 57,
						},
					},
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.37,
								},
								["自动射击"] = {
									["count"] = 3.07,
								},
								["多重射击"] = {
									["count"] = 1.41,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.35,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6.02,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 3,
								},
								["自动射击"] = {
									["count"] = 5.2,
								},
								["多重射击"] = {
									["count"] = 0.72,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 19.44,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.85,
								},
								["自动射击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6.35,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.54,
								},
							},
							["amount"] = 1.54,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.44,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 2.71,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.62,
								},
							},
							["amount"] = 9.77,
						},
						["部落军旗"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 6.9,
								},
								["多重射击"] = {
									["count"] = 8.59,
								},
								["肉搏"] = {
									["count"] = 1.68,
								},
							},
							["amount"] = 20.17,
						},
						["霜如雪"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 11.83,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 5.87,
								},
								["驱散射击"] = {
									["count"] = 0.8999999999999999,
								},
								["多重射击"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 20.23,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 5.02,
								},
								["多重射击"] = {
									["count"] = 2.92,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.44,
						},
						["火焰灬"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.1,
								},
								["瞄准射击"] = {
									["count"] = 3,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 3.75,
								},
								["肉搏"] = {
									["count"] = 3.2,
								},
							},
							["amount"] = 11.55,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 3.05,
								},
								["自动射击"] = {
									["count"] = 5.62,
								},
							},
							["amount"] = 8.669999999999998,
						},
						["龍雲卿"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.6,
						},
					},
					["DamageTaken"] = 18884,
					["ElementDoneAbsorb"] = {
						["Physical"] = 6646,
						["Fire"] = 282,
						["Arcane"] = 198,
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 18,
									["min"] = 18,
									["count"] = 1,
									["amount"] = 18,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 12,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 29,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
								["50% 抵抗"] = {
									["max"] = 117,
									["min"] = 117,
									["count"] = 1,
									["amount"] = 117,
								},
								["25% 抵抗"] = {
									["max"] = 64,
									["min"] = 64,
									["count"] = 1,
									["amount"] = 64,
								},
							},
							["count"] = 181,
							["amount"] = 22,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 29,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 130.11,
					["HealedWho"] = {
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 1622,
								},
							},
							["amount"] = 1622,
						},
					},
					["ElementTaken"] = {
						["Shadow"] = 12077,
						["Melee"] = 1785,
						["Arcane"] = 278,
						["Fire"] = 3106,
						["Frost"] = 1533,
						["Physical"] = 105,
					},
					["DOT_Time"] = 57,
					["Damage"] = 52309,
					["Heals"] = {
						["鞭根块茎"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 821,
									["min"] = 801,
									["count"] = 2,
									["amount"] = 1622,
								},
							},
							["count"] = 2,
							["amount"] = 1622,
						},
					},
					["TimeHeal"] = 3,
					["WhoDispelled"] = {
						["乌勒哈姆"] = {
							["Details"] = {
								["自由行动 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["ElementTakenResist"] = {
						["Shadow"] = 199,
					},
					["Healing"] = 1622,
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 71,
								},
							},
							["amount"] = 71,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 787,
								},
								["圣光闪现"] = {
									["count"] = 2112,
								},
							},
							["amount"] = 2899,
						},
						["一箭情封-逐风者"] = {
							["Details"] = {
								["鞭根块茎"] = {
									["count"] = 1622,
								},
							},
							["amount"] = 1622,
						},
					},
					["ElementDone"] = {
						["Physical"] = 46337,
						["Melee"] = 3409,
						["Arcane"] = 198,
						["Fire"] = 438,
						["Nature"] = 1927,
					},
					["HealingTaken"] = 4521,
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 505,
								},
								["自动射击"] = {
									["count"] = 2036,
								},
								["多重射击"] = {
									["count"] = 944,
								},
								["瞄准射击"] = {
									["count"] = 763,
								},
							},
							["amount"] = 4248,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 514,
								},
								["摔绊"] = {
									["count"] = 60,
								},
								["瞄准射击"] = {
									["count"] = 1290,
								},
								["自动射击"] = {
									["count"] = 1419,
								},
								["多重射击"] = {
									["count"] = 1205,
								},
								["肉搏"] = {
									["count"] = 221,
								},
							},
							["amount"] = 4709,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 3593,
								},
								["自动射击"] = {
									["count"] = 1289,
								},
							},
							["amount"] = 4882,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1011,
								},
								["摔绊"] = {
									["count"] = 38,
								},
								["瞄准射击"] = {
									["count"] = 847,
								},
								["自动射击"] = {
									["count"] = 1023,
								},
								["铁皮手雷"] = {
									["count"] = 156,
								},
								["肉搏"] = {
									["count"] = 652,
								},
							},
							["amount"] = 3727,
						},
						["部落军旗"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1262,
								},
							},
							["amount"] = 1262,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1664,
								},
							},
							["amount"] = 1664,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 198,
								},
								["驱散射击"] = {
									["count"] = 189,
								},
								["自动射击"] = {
									["count"] = 3299,
								},
								["多重射击"] = {
									["count"] = 3826,
								},
								["肉搏"] = {
									["count"] = 1013,
								},
							},
							["amount"] = 8525,
						},
						["霜如雪"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 528,
								},
							},
							["amount"] = 528,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 908,
								},
								["瞄准射击"] = {
									["count"] = 855,
								},
								["自动射击"] = {
									["count"] = 2179,
								},
								["驱散射击"] = {
									["count"] = 364,
								},
								["多重射击"] = {
									["count"] = 1081,
								},
							},
							["amount"] = 5387,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2614,
								},
								["多重射击"] = {
									["count"] = 995,
								},
								["瞄准射击"] = {
									["count"] = 742,
								},
							},
							["amount"] = 4351,
						},
						["火焰灬"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 282,
								},
								["摔绊"] = {
									["count"] = 41,
								},
								["瞄准射击"] = {
									["count"] = 2975,
								},
								["自动射击"] = {
									["count"] = 412,
								},
								["多重射击"] = {
									["count"] = 1077,
								},
								["肉搏"] = {
									["count"] = 1203,
								},
							},
							["amount"] = 5990,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 2500,
								},
								["自动射击"] = {
									["count"] = 2661,
								},
							},
							["amount"] = 5161,
						},
						["龍雲卿"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 398,
								},
								["自动射击"] = {
									["count"] = 610,
								},
								["瞄准射击"] = {
									["count"] = 547,
								},
								["肉搏"] = {
									["count"] = 320,
								},
							},
							["amount"] = 1875,
						},
					},
					["TimeDamage"] = 127.11,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.37,
								},
								["自动射击"] = {
									["count"] = 3.07,
								},
								["多重射击"] = {
									["count"] = 1.41,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.35,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6.02,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
								["瞄准射击"] = {
									["count"] = 3,
								},
								["自动射击"] = {
									["count"] = 5.2,
								},
								["多重射击"] = {
									["count"] = 0.72,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 19.44,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.85,
								},
								["自动射击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6.35,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.44,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 2.71,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.62,
								},
							},
							["amount"] = 9.77,
						},
						["部落军旗"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.54,
								},
							},
							["amount"] = 1.54,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 6.9,
								},
								["多重射击"] = {
									["count"] = 8.59,
								},
								["肉搏"] = {
									["count"] = 1.68,
								},
							},
							["amount"] = 20.17,
						},
						["霜如雪"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 11.83,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 5.87,
								},
								["驱散射击"] = {
									["count"] = 0.8999999999999999,
								},
								["多重射击"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 20.23,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 5.02,
								},
								["多重射击"] = {
									["count"] = 2.92,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.44,
						},
						["火焰灬"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.1,
								},
								["瞄准射击"] = {
									["count"] = 3,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 3.75,
								},
								["肉搏"] = {
									["count"] = 3.2,
								},
							},
							["amount"] = 11.55,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 3.05,
								},
								["自动射击"] = {
									["count"] = 5.62,
								},
							},
							["amount"] = 8.669999999999998,
						},
						["龍雲卿"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.6,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.6,
						},
					},
					["Attacks"] = {
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 41,
									["min"] = 28,
									["count"] = 4,
									["amount"] = 139,
								},
							},
							["count"] = 4,
							["amount"] = 139,
						},
						["自动射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 610,
									["min"] = 303,
									["count"] = 8,
									["amount"] = 3407,
								},
								["Crit"] = {
									["max"] = 1262,
									["min"] = 150,
									["count"] = 9,
									["amount"] = 7195,
								},
								["Hit"] = {
									["max"] = 421,
									["min"] = 5,
									["count"] = 27,
									["amount"] = 8730,
								},
							},
							["count"] = 45,
							["amount"] = 19332,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2058,
									["min"] = 2058,
									["count"] = 1,
									["amount"] = 2058,
								},
								["Hit"] = {
									["max"] = 917,
									["min"] = 547,
									["count"] = 8,
									["amount"] = 5961,
								},
							},
							["count"] = 9,
							["amount"] = 8019,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 111,
									["min"] = 100,
									["count"] = 19,
									["amount"] = 1927,
								},
							},
							["count"] = 19,
							["amount"] = 1927,
						},
						["奥术射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 198,
									["min"] = 198,
									["count"] = 1,
									["amount"] = 198,
								},
							},
							["count"] = 1,
							["amount"] = 198,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 282,
									["min"] = 282,
									["count"] = 1,
									["amount"] = 282,
								},
								["Hit"] = {
									["max"] = 156,
									["min"] = 156,
									["count"] = 1,
									["amount"] = 156,
								},
							},
							["count"] = 2,
							["amount"] = 438,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 195,
									["min"] = 169,
									["count"] = 3,
									["amount"] = 553,
								},
							},
							["count"] = 3,
							["amount"] = 553,
						},
						["多重射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 550,
									["min"] = 525,
									["count"] = 2,
									["amount"] = 1075,
								},
								["Crit"] = {
									["max"] = 1543,
									["min"] = 1179,
									["count"] = 4,
									["amount"] = 5658,
								},
								["Hit"] = {
									["max"] = 609,
									["min"] = 20,
									["count"] = 24,
									["amount"] = 11561,
								},
							},
							["count"] = 31,
							["amount"] = 18294,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 677,
									["min"] = 279,
									["count"] = 5,
									["amount"] = 2164,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 372,
									["min"] = 221,
									["count"] = 4,
									["amount"] = 1245,
								},
							},
							["count"] = 10,
							["amount"] = 3409,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1598,
								},
								["射击"] = {
									["count"] = 508,
								},
							},
							["amount"] = 2106,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1193,
								},
							},
							["amount"] = 1193,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 41,
								},
								["肉搏"] = {
									["count"] = 300,
								},
								["雷霆一击"] = {
									["count"] = 64,
								},
							},
							["amount"] = 405,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 940,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5310,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4229,
								},
							},
							["amount"] = 10479,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 278,
								},
								["寒冰箭"] = {
									["count"] = 166,
								},
								["冰锥术"] = {
									["count"] = 509,
								},
								["火焰冲击"] = {
									["count"] = 1405,
								},
							},
							["amount"] = 2358,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 212,
								},
							},
							["amount"] = 212,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 858,
								},
								["肉搏"] = {
									["count"] = 1273,
								},
							},
							["amount"] = 2131,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 10,
								},
								["Crit"] = {
									["count"] = 14,
								},
								["Hit"] = {
									["count"] = 66,
								},
							},
							["amount"] = 92,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 19,
								},
							},
							["amount"] = 19,
						},
					},
				},
			},
			["UnitLockout"] = 21759.331,
			["LastActive"] = 23522.331,
		},
		["晨晨啊"] = {
			["GUID"] = "Player-5458-037E800D",
			["LastEventHealth"] = {
				2850, -- [1]
				2831, -- [2]
				2831, -- [3]
				2831, -- [4]
				2831, -- [5]
				3180, -- [6]
				3180, -- [7]
				3180, -- [8]
				3180, -- [9]
				2618, -- [10]
				2529, -- [11]
				2408, -- [12]
				2408, -- [13]
				3062, -- [14]
				3180, -- [15]
				3180, -- [16]
				3180, -- [17]
				3180, -- [18]
				3180, -- [19]
				3180, -- [20]
				3180, -- [21]
				3180, -- [22]
				2959, -- [23]
				2959, -- [24]
				2740, -- [25]
				2673, -- [26]
				2454, -- [27]
				2454, -- [28]
				2386, -- [29]
				2166, -- [30]
				2166, -- [31]
				2166, -- [32]
				2098, -- [33]
				1811, -- [34]
				3171, -- [35]
				2933, -- [36]
				2933, -- [37]
				2695, -- [38]
				2695, -- [39]
				2695, -- [40]
				2713, -- [41]
				2850, -- [42]
				2850, -- [43]
				2850, -- [44]
				2850, -- [45]
				2850, -- [46]
				2850, -- [47]
				2850, -- [48]
				2850, -- [49]
				2850, -- [50]
			},
			["LastAttackedBy"] = "取名不能骚气-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"HEAL", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"HEAL", -- [13]
				"HEAL", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"HEAL", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					33.64, -- [1]
				},
				["Dispelled"] = {
					4, -- [1]
				},
				["Healing"] = {
					1133, -- [1]
				},
				["DamageTaken"] = {
					21219, -- [1]
				},
				["Absorbs"] = {
					5031, -- [1]
				},
				["HealingTaken"] = {
					10033, -- [1]
				},
				["TimeDamage"] = {
					106.91, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["ManaGain"] = {
					2477, -- [1]
				},
				["ActiveTime"] = {
					140.55, -- [1]
				},
				["Damage"] = {
					33291, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
					},
					["Messages"] = {
						"古德斯尼-逐风者 魔爆术 晨晨啊 Hit -274 (Arcane)", -- [1]
						"芬达么有糖-黑龙费尔默 雷霆一击 晨晨啊 Hit -74 (Physical)", -- [2]
						"古德斯尼-逐风者 冰霜新星 晨晨啊 Hit -80 (Frost)", -- [3]
						"晨晨啊 火焰冲击 古德斯尼-逐风者 Hit -534 (Fire)", -- [4]
						"芬达么有糖-黑龙费尔默 英勇打击 晨晨啊 Hit -485 (Physical)", -- [5]
						"芬达么有糖-黑龙费尔默 拦截昏迷 晨晨啊 Hit -48 (Physical)", -- [6]
						"芬达么有糖-黑龙费尔默 肉搏 晨晨啊 Hit -367 (Physical)", -- [7]
						"晨晨啊死亡。", -- [8]
					},
					["DeathAt"] = 22919.33,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
					},
					["MessageTimes"] = {
						-14.77799999999843, -- [1]
						-13.36699999999837, -- [2]
						-13.26699999999983, -- [3]
						-7.083999999998923, -- [4]
						-4.36699999999837, -- [5]
						-2.316999999999098, -- [6]
						-0.0499999999992724, -- [7]
						0, -- [8]
					},
					["HealthMax"] = {
						3180, -- [1]
						3180, -- [2]
						3180, -- [3]
						3180, -- [4]
						3180, -- [5]
						3180, -- [6]
						3180, -- [7]
						3180, -- [8]
					},
					["Health"] = {
						965, -- [1]
						691, -- [2]
						617, -- [3]
						554, -- [4]
						554, -- [5]
						69, -- [6]
						21, -- [7]
						0, -- [8]
					},
					["KilledBy"] = "芬达么有糖-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"MISC", -- [8]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						false, -- [23]
						false, -- [24]
						false, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
					},
					["Messages"] = {
						"晨晨啊 寒冰箭 芬达么有糖-黑龙费尔默 Hit -661 (Frost)", -- [1]
						"芬达么有糖-黑龙费尔默 旋风斩 晨晨啊 Absorb -456 (456 被吸收) (Physical)", -- [2]
						"果不其然-逐风者 出血 晨晨啊 Absorb -265 (265 被吸收) (Physical)", -- [3]
						"取名不能骚气-黑龙费尔默 肉搏 晨晨啊 Absorb -118 (1)", -- [4]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Tick -125 (118 被吸收) (Shadow)", -- [5]
						"果不其然-逐风者 肉搏 晨晨啊 Crit -628 (Physical)", -- [6]
						"果不其然-逐风者 速效毒药 III 晨晨啊 Hit -56 (Nature)", -- [7]
						"晨晨啊 魔爆术 果不其然-逐风者 Hit -204 (68 被抵抗) (Arcane)", -- [8]
						"果不其然-逐风者 肉搏 晨晨啊 Miss (1)", -- [9]
						"晨晨啊 魔爆术 果不其然-逐风者 Hit -257 (Arcane)", -- [10]
						"晨晨啊 魔爆术 芬达么有糖-黑龙费尔默 Hit -282 (Arcane)", -- [11]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Tick -243 (Shadow)", -- [12]
						"果不其然-逐风者 肉搏 晨晨啊 Crit -184 (Physical)", -- [13]
						"晨晨啊 魔爆术 果不其然-逐风者 Hit -271 (Arcane)", -- [14]
						"晨晨啊 魔爆术 乌勒哈姆 Hit -137 (137 被抵抗) (Arcane)", -- [15]
						"晨晨啊 魔爆术 芬达么有糖-黑龙费尔默 Hit -295 (Arcane)", -- [16]
						"晨晨啊 魔爆术 取名不能骚气-黑龙费尔默 Hit -256 (Arcane)", -- [17]
						"晨晨啊 魔爆术 草莓尐布丁-火妖鲁西弗隆 Hit -262 (Arcane)", -- [18]
						"果不其然-逐风者 肉搏 晨晨啊 Hit -319 (Physical)", -- [19]
						"果不其然-逐风者 出血 晨晨啊 Hit -313 (Physical)", -- [20]
						"芬达么有糖-黑龙费尔默 英勇打击 晨晨啊 Hit -521 (Physical)", -- [21]
						"晨晨啊 魔爆术 乌勒哈姆 Hit -132 (132 被抵抗) (Arcane)", -- [22]
						"晨晨啊 魔爆术 果不其然-逐风者 Hit -270 (Arcane)", -- [23]
						"晨晨啊 魔爆术 芬达么有糖-黑龙费尔默 Hit -298 (Arcane)", -- [24]
						"晨晨啊 魔爆术 取名不能骚气-黑龙费尔默 Hit -269 (Arcane)", -- [25]
						"晨晨啊 魔爆术 草莓尐布丁-火妖鲁西弗隆 Hit -263 (Arcane)", -- [26]
						"果不其然-逐风者 肉搏 晨晨啊 Miss (1)", -- [27]
						"果不其然-逐风者 出血 晨晨啊 Hit -325 (Physical)", -- [28]
						"晨晨啊 治疗药水 晨晨啊 Hit +1133", -- [29]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Tick -243 (Shadow)", -- [30]
						"晨晨啊 魔爆术 果不其然-逐风者 Hit -195 (65 被抵抗) (Arcane)", -- [31]
						"果不其然-逐风者 肉搏 晨晨啊 Miss (1)", -- [32]
						"火焰灬 寒冰箭 晨晨啊 Hit -585 (Frost)", -- [33]
						"果不其然-逐风者 肉搏 晨晨啊 Hit -99 (Physical)", -- [34]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Absorb -243 (243 被吸收) (Shadow)", -- [35]
						"果不其然-逐风者 肉搏 晨晨啊 Absorb -596 (1)", -- [36]
						"果不其然-逐风者 刺骨 晨晨啊 Crit -787 (596 被吸收) (Physical)", -- [37]
						"果不其然-逐风者 肉搏 晨晨啊 Hit -101 (Physical)", -- [38]
						"晨晨啊死亡。", -- [39]
					},
					["DeathAt"] = 21920.324,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
					},
					["MessageTimes"] = {
						-13.66800000000148, -- [1]
						-12.71800000000076, -- [2]
						-10.60000000000218, -- [3]
						-10.13400000000183, -- [4]
						-10.13400000000183, -- [5]
						-10.10100000000239, -- [6]
						-10.08400000000256, -- [7]
						-9.718000000000757, -- [8]
						-9.234000000000378, -- [9]
						-8.201000000000931, -- [10]
						-8.201000000000931, -- [11]
						-7.118000000002212, -- [12]
						-6.934000000001106, -- [13]
						-6.684000000001106, -- [14]
						-6.684000000001106, -- [15]
						-6.684000000001106, -- [16]
						-6.684000000001106, -- [17]
						-6.684000000001106, -- [18]
						-6.584000000002561, -- [19]
						-6.516999999999825, -- [20]
						-5.201000000000931, -- [21]
						-5.184000000001106, -- [22]
						-5.184000000001106, -- [23]
						-5.184000000001106, -- [24]
						-5.184000000001106, -- [25]
						-5.184000000001106, -- [26]
						-4.634000000001834, -- [27]
						-4.324000000000524, -- [28]
						-4.266999999999825, -- [29]
						-4.134000000001834, -- [30]
						-3.684000000001106, -- [31]
						-3.067000000002736, -- [32]
						-2.751000000000204, -- [33]
						-2.334000000002561, -- [34]
						-1.134000000001834, -- [35]
						-0.2620000000024447, -- [36]
						-0.2620000000024447, -- [37]
						-0.03400000000328873, -- [38]
						0, -- [39]
					},
					["HealthMax"] = {
						3370, -- [1]
						3370, -- [2]
						3370, -- [3]
						3370, -- [4]
						3370, -- [5]
						3370, -- [6]
						3370, -- [7]
						3370, -- [8]
						3370, -- [9]
						3370, -- [10]
						3370, -- [11]
						3370, -- [12]
						3370, -- [13]
						3370, -- [14]
						3370, -- [15]
						3370, -- [16]
						3370, -- [17]
						3370, -- [18]
						3370, -- [19]
						3370, -- [20]
						3370, -- [21]
						3370, -- [22]
						3370, -- [23]
						3370, -- [24]
						3370, -- [25]
						3370, -- [26]
						3370, -- [27]
						3370, -- [28]
						3370, -- [29]
						3370, -- [30]
						3370, -- [31]
						3370, -- [32]
						3370, -- [33]
						3370, -- [34]
						3370, -- [35]
						3370, -- [36]
						3370, -- [37]
						3370, -- [38]
						3180, -- [39]
					},
					["Health"] = {
						3370, -- [1]
						3370, -- [2]
						3370, -- [3]
						3370, -- [4]
						3370, -- [5]
						3370, -- [6]
						3370, -- [7]
						2561, -- [8]
						2561, -- [9]
						2561, -- [10]
						2561, -- [11]
						2561, -- [12]
						2318, -- [13]
						2134, -- [14]
						2134, -- [15]
						2134, -- [16]
						2134, -- [17]
						2134, -- [18]
						2134, -- [19]
						1815, -- [20]
						1502, -- [21]
						1502, -- [22]
						1502, -- [23]
						1502, -- [24]
						1502, -- [25]
						1502, -- [26]
						981, -- [27]
						981, -- [28]
						656, -- [29]
						1789, -- [30]
						1546, -- [31]
						1546, -- [32]
						1546, -- [33]
						961, -- [34]
						862, -- [35]
						862, -- [36]
						862, -- [37]
						75, -- [38]
						0, -- [39]
					},
					["KilledBy"] = "果不其然-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"HEAL", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"MISC", -- [39]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "腐蚀术 (伤害/跳)",
			["LastFightIn"] = 12,
			["type"] = "Ungrouped",
			["LastHealTime"] = 23450.277,
			["LastEventHealthMax"] = {
				3180, -- [1]
				3180, -- [2]
				3180, -- [3]
				3180, -- [4]
				3180, -- [5]
				3180, -- [6]
				3180, -- [7]
				3180, -- [8]
				3180, -- [9]
				3180, -- [10]
				3180, -- [11]
				3180, -- [12]
				3180, -- [13]
				3180, -- [14]
				3180, -- [15]
				3180, -- [16]
				3180, -- [17]
				3180, -- [18]
				3180, -- [19]
				3180, -- [20]
				3180, -- [21]
				3180, -- [22]
				3180, -- [23]
				3180, -- [24]
				3180, -- [25]
				3180, -- [26]
				3180, -- [27]
				3180, -- [28]
				3180, -- [29]
				3180, -- [30]
				3180, -- [31]
				3180, -- [32]
				3180, -- [33]
				3180, -- [34]
				3180, -- [35]
				3180, -- [36]
				3180, -- [37]
				3180, -- [38]
				3180, -- [39]
				3180, -- [40]
				3180, -- [41]
				3180, -- [42]
				3180, -- [43]
				3180, -- [44]
				3180, -- [45]
				3180, -- [46]
				3180, -- [47]
				3180, -- [48]
				3180, -- [49]
				3180, -- [50]
			},
			["LastDamageTaken"] = 219,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 23449.327,
				["Dispelled"] = 21778.332,
				["OVERALL"] = 23508.33,
				["DamageTaken"] = 23505.33,
				["Absorbs"] = 23449.327,
				["HealingTaken"] = 23508.33,
				["DeathCount"] = 22917.333,
				["TimeDamage"] = 23503.33,
				["Healing"] = 21914.34,
				["ManaGain"] = 22894.329,
				["ActiveTime"] = 23503.33,
				["Damage"] = 23503.33,
			},
			["NextEventNum"] = 35,
			["LastDamageTime"] = 23504.28,
			["LastEvents"] = {
				"芬达么有糖-黑龙费尔默 撕裂 (伤害/跳) 晨晨啊 Tick -19 (9 被吸收) (Physical)", -- [1]
				"晨晨啊 魔爆术 芬达么有糖-黑龙费尔默 Hit -299 (Arcane)", -- [2]
				"晨晨啊 魔爆术 芬达么有糖-黑龙费尔默 Hit -289 (Arcane)", -- [3]
				"晨晨啊 魔爆术 芬达么有糖-黑龙费尔默 Hit -300 (Arcane)", -- [4]
				"商山-逐风者 圣光闪现 晨晨啊 Hit +683 (334 过量治疗)", -- [5]
				"晨晨啊 寒冰箭 取名不能骚气-黑龙费尔默 Hit -682 (Frost)", -- [6]
				"果不其然-逐风者 肉搏 晨晨啊 Miss (1)", -- [7]
				"晨晨啊 寒冰箭 草莓尐布丁-火妖鲁西弗隆 Hit -614 (Frost)", -- [8]
				"果不其然-逐风者 出血 晨晨啊 Crit -562 (Physical)", -- [9]
				"果不其然-逐风者 肉搏 晨晨啊 Hit -89 (Physical)", -- [10]
				"果不其然-逐风者 绞喉 (伤害/跳) 晨晨啊 Tick -121 (Physical)", -- [11]
				"果不其然-逐风者 绞喉 (伤害/跳) 晨晨啊 Absorb -121 (121 被吸收) (Physical)", -- [12]
				"商山-逐风者 圣光闪现 晨晨啊 Hit +654", -- [13]
				"商山-逐风者 圣光闪现 晨晨啊 Hit +693 (575 过量治疗)", -- [14]
				"果不其然-逐风者 绞喉 (伤害/跳) 晨晨啊 Absorb -121 (121 被吸收) (Physical)", -- [15]
				"晨晨啊 火焰冲击 芬达么有糖-黑龙费尔默 Hit -544 (Fire)", -- [16]
				"果不其然-逐风者 绞喉 (伤害/跳) 晨晨啊 Absorb -121 (121 被吸收) (Physical)", -- [17]
				"晨晨啊 魔爆术 芬达么有糖-黑龙费尔默 Hit -264 (Arcane)", -- [18]
				"果不其然-逐风者 绞喉 (伤害/跳) 晨晨啊 Absorb -121 (121 被吸收) (Physical)", -- [19]
				"晨晨啊 冰霜新星 二道沟子靓仔-逐风者 Hit -24 (Frost)", -- [20]
				"果不其然-逐风者 绞喉 (伤害/跳) 晨晨啊 Absorb -120 (120 被吸收) (Physical)", -- [21]
				"晨晨啊 火焰冲击 二道沟子靓仔-逐风者 Crit -702 (Fire)", -- [22]
				"晨晨啊 寒冰箭 清风徐自来-火妖鲁西弗隆 Absorb -613 (613 被吸收) (Frost)", -- [23]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Tick -219 (Shadow)", -- [24]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 晨晨啊 Tick -67 (Shadow)", -- [25]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Tick -219 (Shadow)", -- [26]
				"晨晨啊 火焰冲击 取名不能骚气-黑龙费尔默 Hit -499 (Fire)", -- [27]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 晨晨啊 Tick -68 (Shadow)", -- [28]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Tick -220 (Shadow)", -- [29]
				"晨晨啊 冰霜新星 乌勒哈姆 Hit -27 (Frost)", -- [30]
				"晨晨啊 冰霜新星 取名不能骚气-黑龙费尔默 Hit -25 (Frost)", -- [31]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 晨晨啊 Tick -68 (Shadow)", -- [32]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 晨晨啊 Tick -219 (Shadow)", -- [33]
				"商山-逐风者 圣光闪现 晨晨啊 Crit +1036", -- [34]
				"二道沟子靓仔-逐风者 闪电之盾 晨晨啊 Hit -238 (Nature)", -- [35]
				"晨晨啊 寒冰箭 二道沟子靓仔-逐风者 Hit -541 (Frost)", -- [36]
				"二道沟子靓仔-逐风者 闪电之盾 晨晨啊 Hit -238 (Nature)", -- [37]
				"晨晨啊 寒冰箭 根基图腾 Hit -618 (Frost)", -- [38]
				"晨晨啊 寒冰箭 二道沟子靓仔-逐风者 Hit -533 (Frost)", -- [39]
				"晨晨啊 寒冰箭 二道沟子靓仔-逐风者 Hit -553 (Frost)", -- [40]
				"晨晨啊 寒冰箭 芬达么有糖-黑龙费尔默 Hit -669 (Frost)", -- [41]
				"芬达么有糖-黑龙费尔默 撕裂 (伤害/跳) 晨晨啊 Absorb -28 (28 被吸收) (Physical)", -- [42]
				"晨晨啊 寒冰箭 芬达么有糖-黑龙费尔默 Hit -678 (Frost)", -- [43]
				"晨晨啊 火焰冲击 芬达么有糖-黑龙费尔默 Hit -603 (Fire)", -- [44]
				"晨晨啊 寒冰箭 芬达么有糖-黑龙费尔默 Hit -662 (Frost)", -- [45]
				"芬达么有糖-黑龙费尔默 肉搏 晨晨啊 Absorb -375 (375 被吸收) (1)", -- [46]
				"芬达么有糖-黑龙费尔默 撕裂 (伤害/跳) 晨晨啊 Absorb -29 (29 被吸收) (Physical)", -- [47]
				"芬达么有糖-黑龙费尔默 旋风斩 晨晨啊 Absorb -342 (342 被吸收) (Physical)", -- [48]
				"晨晨啊 冰锥术 芬达么有糖-黑龙费尔默 Hit -415 (Frost)", -- [49]
				"芬达么有糖-黑龙费尔默 肉搏 晨晨啊 Absorb -9 (1)", -- [50]
			},
			["Name"] = "晨晨啊",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				23392.741, -- [1]
				23392.791, -- [2]
				23394.441, -- [3]
				23395.941, -- [4]
				23401.258, -- [5]
				23425.609, -- [6]
				23432.31, -- [7]
				23432.926, -- [8]
				23433.276, -- [9]
				23433.443, -- [10]
				23435.276, -- [11]
				23438.277, -- [12]
				23438.86, -- [13]
				23440.377, -- [14]
				23441.277, -- [15]
				23444.01, -- [16]
				23444.277, -- [17]
				23445.977, -- [18]
				23447.277, -- [19]
				23448.494, -- [20]
				23450.277, -- [21]
				23454.444, -- [22]
				23485.696, -- [23]
				23497.08, -- [24]
				23498.597, -- [25]
				23500.08, -- [26]
				23500.83, -- [27]
				23501.597, -- [28]
				23503.08, -- [29]
				23504.28, -- [30]
				23504.28, -- [31]
				23504.58, -- [32]
				23506.064, -- [33]
				23508.73, -- [34]
				23194.596, -- [35]
				23198.363, -- [36]
				23198.38, -- [37]
				23201.98, -- [38]
				23204.63, -- [39]
				23207.28, -- [40]
				23220.109, -- [41]
				23386.74, -- [42]
				23386.99, -- [43]
				23389.224, -- [44]
				23389.274, -- [45]
				23389.524, -- [46]
				23389.74, -- [47]
				23390.04, -- [48]
				23390.857, -- [49]
				23392.741, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["晨晨啊"] = {
									["max"] = 375,
									["min"] = 9,
									["count"] = 10,
									["amount"] = 1387,
								},
							},
							["count"] = 10,
							["amount"] = 1387,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3734,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 1387,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 15,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 375,
						["Physical"] = 1012,
					},
					["ElementTaken"] = {
						["Shadow"] = 1080,
						["Physical"] = 1705,
						["Melee"] = 473,
						["Nature"] = 476,
					},
					["DOT_Time"] = 0,
					["Damage"] = 10683,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 12.52,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 613,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 7183,
						["Fire"] = 2348,
						["Arcane"] = 1152,
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 121,
									["min"] = 120,
									["count"] = 5,
									["amount"] = 604,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 604,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 29,
									["min"] = 9,
									["count"] = 3,
									["amount"] = 66,
								},
							},
							["count"] = 3,
							["amount"] = 66,
						},
						["旋风斩"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 342,
									["min"] = 342,
									["count"] = 1,
									["amount"] = 342,
								},
							},
							["count"] = 1,
							["amount"] = 342,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 375,
									["min"] = 375,
									["count"] = 1,
									["amount"] = 375,
								},
							},
							["count"] = 4,
							["amount"] = 375,
						},
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 614,
								},
							},
							["amount"] = 614,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1152,
								},
								["寒冰箭"] = {
									["count"] = 2009,
								},
								["冰锥术"] = {
									["count"] = 415,
								},
								["火焰冲击"] = {
									["count"] = 1147,
								},
							},
							["amount"] = 4723,
						},
						["根基图腾"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 618,
								},
							},
							["amount"] = 618,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 682,
								},
								["冰霜新星"] = {
									["count"] = 25,
								},
								["火焰冲击"] = {
									["count"] = 499,
								},
							},
							["amount"] = 1206,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 613,
								},
							},
							["amount"] = 613,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 2156,
								},
								["火焰冲击"] = {
									["count"] = 702,
								},
								["冰霜新星"] = {
									["count"] = 24,
								},
							},
							["amount"] = 2882,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 476,
								},
							},
							["amount"] = 476,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 877,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 203,
								},
							},
							["amount"] = 1080,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 342,
								},
								["肉搏"] = {
									["count"] = 384,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 76,
								},
							},
							["amount"] = 802,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["绞喉 (伤害/跳)"] = {
									["count"] = 725,
								},
								["出血"] = {
									["count"] = 562,
								},
								["肉搏"] = {
									["count"] = 89,
								},
							},
							["amount"] = 1376,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 12.52,
								},
							},
							["amount"] = 12.52,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1387,
								},
							},
							["amount"] = 1387,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 12.52,
								},
							},
							["amount"] = 12.52,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 6,
								},
								["寒冰箭"] = {
									["count"] = 3.05,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 13.55,
						},
						["根基图腾"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 6,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 375,
									["min"] = 9,
									["count"] = 10,
									["amount"] = 1387,
								},
							},
							["count"] = 10,
							["amount"] = 1387,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2157,
								},
							},
							["amount"] = 2157,
						},
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1387,
								},
							},
							["amount"] = 1387,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 44.07,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 27,
									["min"] = 24,
									["count"] = 3,
									["amount"] = 76,
								},
							},
							["count"] = 3,
							["amount"] = 76,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 300,
									["min"] = 264,
									["count"] = 4,
									["amount"] = 1152,
								},
							},
							["count"] = 4,
							["amount"] = 1152,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 613,
									["min"] = 613,
									["count"] = 1,
									["amount"] = 613,
								},
								["Hit"] = {
									["max"] = 682,
									["min"] = 529,
									["count"] = 10,
									["amount"] = 6079,
								},
							},
							["count"] = 11,
							["amount"] = 6692,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 415,
									["min"] = 415,
									["count"] = 1,
									["amount"] = 415,
								},
							},
							["count"] = 1,
							["amount"] = 415,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 702,
									["min"] = 702,
									["count"] = 1,
									["amount"] = 702,
								},
								["Hit"] = {
									["max"] = 603,
									["min"] = 499,
									["count"] = 3,
									["amount"] = 1646,
								},
							},
							["count"] = 4,
							["amount"] = 2348,
						},
					},
					["HealingTaken"] = 3544,
					["RageGain"] = 0,
					["TimeDamage"] = 31.55,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 6,
								},
								["寒冰箭"] = {
									["count"] = 3.05,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 13.55,
						},
						["根基图腾"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 6,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneResist"] = {
						["Arcane"] = 599,
					},
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 6,
								},
								["寒冰箭"] = {
									["count"] = 6.05,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 8.79,
								},
							},
							["amount"] = 23.84,
						},
						["根基图腾"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 3.57,
								},
							},
							["amount"] = 8.07,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["火球术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9,
						},
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 32.14,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 33.64,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 7.5,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 6,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.5,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 7.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
						["龍雲卿"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["霜如雪"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3869,
								},
							},
							["amount"] = 3869,
						},
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 5031,
								},
								["治疗药水"] = {
									["count"] = 1133,
								},
							},
							["amount"] = 6164,
						},
					},
					["ElementDoneAbsorb"] = {
						["Arcane"] = 1105,
						["Frost"] = 1639,
					},
					["Absorbs"] = 5031,
					["DeathCount"] = 2,
					["ElementTaken"] = {
						["Shadow"] = 6140,
						["Melee"] = 4253,
						["Arcane"] = 1283,
						["Physical"] = 5732,
						["Fire"] = 569,
						["Frost"] = 2259,
						["Nature"] = 983,
					},
					["Damage"] = 33291,
					["TimeHeal"] = 33.64,
					["ElementDone"] = {
						["Fire"] = 8413,
						["Frost"] = 13200,
						["Arcane"] = 11678,
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 525,
								},
								["寒冰箭"] = {
									["count"] = 614,
								},
								["冰霜新星"] = {
									["count"] = 55,
								},
							},
							["amount"] = 1194,
						},
						["霜如雪"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 261,
								},
								["冰霜新星"] = {
									["count"] = 25,
								},
							},
							["amount"] = 286,
						},
						["根基图腾"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 618,
								},
							},
							["amount"] = 618,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 134,
								},
								["魔爆术"] = {
									["count"] = 1187,
								},
								["寒冰箭"] = {
									["count"] = 1270,
								},
								["冰锥术"] = {
									["count"] = 408,
								},
								["火焰冲击"] = {
									["count"] = 1806,
								},
							},
							["amount"] = 4805,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 81,
								},
								["魔爆术"] = {
									["count"] = 804,
								},
								["寒冰箭"] = {
									["count"] = 613,
								},
								["火焰冲击"] = {
									["count"] = 522,
								},
								["冰锥术"] = {
									["count"] = 787,
								},
							},
							["amount"] = 2807,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 603,
								},
								["冰霜新星"] = {
									["count"] = 79,
								},
							},
							["amount"] = 682,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 533,
								},
								["火焰冲击"] = {
									["count"] = 957,
								},
								["冰霜新星"] = {
									["count"] = 50,
								},
							},
							["amount"] = 1540,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1743,
								},
								["火球术"] = {
									["count"] = 30,
								},
							},
							["amount"] = 1773,
						},
						["龍雲卿"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 383,
								},
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 409,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 48,
								},
								["魔爆术"] = {
									["count"] = 1311,
								},
								["寒冰箭"] = {
									["count"] = 2156,
								},
								["火焰冲击"] = {
									["count"] = 702,
								},
								["冰锥术"] = {
									["count"] = 361,
								},
							},
							["amount"] = 4578,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1359,
								},
								["冰霜新星"] = {
									["count"] = 24,
								},
								["冰锥术"] = {
									["count"] = 387,
								},
							},
							["amount"] = 1770,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 25,
								},
								["魔爆术"] = {
									["count"] = 1056,
								},
								["火球术"] = {
									["count"] = 58,
								},
								["火焰冲击"] = {
									["count"] = 1003,
								},
								["冰锥术"] = {
									["count"] = 1178,
								},
							},
							["amount"] = 3320,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 112,
								},
								["魔爆术"] = {
									["count"] = 2296,
								},
								["寒冰箭"] = {
									["count"] = 3351,
								},
								["冰锥术"] = {
									["count"] = 415,
								},
								["火焰冲击"] = {
									["count"] = 3335,
								},
							},
							["amount"] = 9509,
						},
					},
					["WhoDamaged"] = {
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["脚踢"] = {
									["count"] = 116,
								},
								["肉搏"] = {
									["count"] = 454,
								},
							},
							["amount"] = 570,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 245,
								},
								["魔爆术"] = {
									["count"] = 847,
								},
								["冰锥术"] = {
									["count"] = 532,
								},
								["火焰冲击"] = {
									["count"] = 569,
								},
								["肉搏"] = {
									["count"] = 286,
								},
							},
							["amount"] = 2479,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1479,
								},
								["旋风斩"] = {
									["count"] = 798,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 76,
								},
								["拦截昏迷"] = {
									["count"] = 48,
								},
								["肉搏"] = {
									["count"] = 751,
								},
								["雷霆一击"] = {
									["count"] = 155,
								},
							},
							["amount"] = 3307,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 83,
								},
							},
							["amount"] = 83,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5124,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1016,
								},
								["肉搏"] = {
									["count"] = 118,
								},
							},
							["amount"] = 6258,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 436,
								},
								["寒冰箭"] = {
									["count"] = 585,
								},
								["冰霜新星"] = {
									["count"] = 86,
								},
							},
							["amount"] = 1107,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["绞喉 (伤害/跳)"] = {
									["count"] = 725,
								},
								["刺骨"] = {
									["count"] = 787,
								},
								["速效毒药 III"] = {
									["count"] = 56,
								},
								["出血"] = {
									["count"] = 1465,
								},
								["肉搏"] = {
									["count"] = 2016,
								},
							},
							["amount"] = 5049,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 927,
								},
								["冰霜震击"] = {
									["count"] = 811,
								},
								["肉搏"] = {
									["count"] = 628,
								},
							},
							["amount"] = 2366,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["晨晨啊"] = {
									["max"] = 596,
									["min"] = 9,
									["count"] = 25,
									["amount"] = 5031,
								},
							},
							["count"] = 25,
							["amount"] = 5031,
						},
					},
					["TimeHealing"] = {
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 32.14,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 33.64,
						},
					},
					["Dispelled"] = 4,
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["脚踢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["法术反制 - 沉默"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 23,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 21,
						},
					},
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["晨晨啊"] = {
									["count"] = 530,
								},
							},
							["amount"] = 530,
						},
						["补充法力"] = {
							["Details"] = {
								["晨晨啊"] = {
									["count"] = 1947,
								},
							},
							["amount"] = 1947,
						},
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 68,
									["min"] = 68,
									["count"] = 1,
									["amount"] = 68,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 68,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 29,
									["min"] = 9,
									["count"] = 3,
									["amount"] = 66,
								},
							},
							["count"] = 3,
							["amount"] = 66,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 456,
									["min"] = 342,
									["count"] = 2,
									["amount"] = 798,
								},
							},
							["count"] = 2,
							["amount"] = 798,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 436,
									["min"] = 286,
									["count"] = 2,
									["amount"] = 722,
								},
							},
							["count"] = 5,
							["amount"] = 722,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 265,
									["min"] = 265,
									["count"] = 1,
									["amount"] = 265,
								},
							},
							["count"] = 4,
							["amount"] = 265,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 81,
									["min"] = 81,
									["count"] = 1,
									["amount"] = 81,
								},
							},
							["count"] = 2,
							["amount"] = 81,
						},
						["脚踢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 86,
									["min"] = 79,
									["count"] = 2,
									["amount"] = 165,
								},
							},
							["count"] = 4,
							["amount"] = 165,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 237,
									["min"] = 237,
									["count"] = 1,
									["amount"] = 237,
								},
							},
							["count"] = 4,
							["amount"] = 237,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["法术反制 - 沉默"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 121,
									["min"] = 120,
									["count"] = 5,
									["amount"] = 604,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 604,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 596,
									["min"] = 596,
									["count"] = 1,
									["amount"] = 596,
								},
							},
							["count"] = 1,
							["amount"] = 596,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 243,
									["min"] = 118,
									["count"] = 5,
									["amount"] = 1054,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 1054,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 375,
									["min"] = 375,
									["count"] = 1,
									["amount"] = 375,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 375,
						},
					},
					["ActiveTime"] = 140.55,
					["WhoDispelled"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["奥术光辉 (净化术)"] = {
									["count"] = 1,
								},
								["侦测强效隐形 (净化术)"] = {
									["count"] = 1,
								},
								["野性印记 (净化术)"] = {
									["count"] = 1,
								},
								["冰甲术 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 596,
									["min"] = 9,
									["count"] = 25,
									["amount"] = 5031,
								},
							},
							["count"] = 25,
							["amount"] = 5031,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1133,
									["min"] = 1133,
									["count"] = 1,
									["amount"] = 1133,
								},
							},
							["count"] = 1,
							["amount"] = 1133,
						},
					},
					["ElementTakenAbsorb"] = {
						["Frost"] = 165,
						["Melee"] = 375,
						["Arcane"] = 722,
						["Shadow"] = 1122,
						["Physical"] = 2410,
						["Nature"] = 237,
					},
					["Healing"] = 1133,
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 33,
								},
							},
							["amount"] = 38,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 21,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 11,
								},
								["Hit"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 25,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 8,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["DamageTaken"] = 21219,
					["Attacks"] = {
						["火球术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 31,
									["min"] = 27,
									["count"] = 3,
									["amount"] = 88,
								},
							},
							["count"] = 3,
							["amount"] = 88,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 28,
									["min"] = 24,
									["count"] = 3,
									["amount"] = 77,
								},
								["Crit"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 2,
									["amount"] = 110,
								},
								["Hit"] = {
									["max"] = 30,
									["min"] = 24,
									["count"] = 18,
									["amount"] = 472,
								},
							},
							["count"] = 23,
							["amount"] = 659,
						},
						["魔爆术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 292,
									["min"] = 261,
									["count"] = 4,
									["amount"] = 1105,
								},
								["Crit"] = {
									["max"] = 393,
									["min"] = 393,
									["count"] = 1,
									["amount"] = 393,
								},
								["Hit"] = {
									["max"] = 300,
									["min"] = 129,
									["count"] = 40,
									["amount"] = 10180,
								},
							},
							["count"] = 46,
							["amount"] = 11678,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 682,
									["min"] = 529,
									["count"] = 12,
									["amount"] = 7421,
								},
								["Absorb"] = {
									["max"] = 613,
									["min"] = 588,
									["count"] = 2,
									["amount"] = 1201,
								},
							},
							["count"] = 14,
							["amount"] = 8622,
						},
						["冰锥术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 361,
									["min"] = 361,
									["count"] = 1,
									["amount"] = 361,
								},
								["Hit"] = {
									["max"] = 415,
									["min"] = 379,
									["count"] = 9,
									["amount"] = 3558,
								},
							},
							["count"] = 16,
							["amount"] = 3919,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 798,
									["min"] = 702,
									["count"] = 2,
									["amount"] = 1500,
								},
								["Hit"] = {
									["max"] = 603,
									["min"] = 423,
									["count"] = 13,
									["amount"] = 6825,
								},
							},
							["count"] = 15,
							["amount"] = 8325,
						},
					},
					["HealingTaken"] = 10033,
					["HealedWho"] = {
						["晨晨啊"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 5031,
								},
								["治疗药水"] = {
									["count"] = 1133,
								},
							},
							["amount"] = 6164,
						},
					},
					["TimeDamage"] = 106.91,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 6,
								},
								["寒冰箭"] = {
									["count"] = 6.05,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 8.79,
								},
							},
							["amount"] = 23.84,
						},
						["根基图腾"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 3.57,
								},
							},
							["amount"] = 8.07,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["火球术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.5,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 7.5,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 6,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.5,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 7.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
						["龍雲卿"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["霜如雪"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ManaGain"] = 2477,
					["ManaGainedFrom"] = {
						["晨晨啊"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 530,
								},
								["补充法力"] = {
									["count"] = 1947,
								},
							},
							["amount"] = 2477,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 18,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 39,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 3,
								},
							},
							["amount"] = 53,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 40,
								},
							},
							["amount"] = 46,
						},
					},
				},
			},
			["UnitLockout"] = 21739.33,
			["LastActive"] = 23508.33,
		},
		["诺沉遗士"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
					},
					["Messages"] = {
						"诺沉遗士 肉搏 二道沟子靓仔-逐风者 Hit -302 (Physical)", -- [1]
						"诺沉遗士 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -71 (Physical)", -- [2]
						"诺沉遗士 肉搏 芬达么有糖-黑龙费尔默 Crit -578 (Physical)", -- [3]
						"灼热图腾 VI 攻击 诺沉遗士 Hit -61 (Fire)", -- [4]
						"诺沉遗士 致死打击 芬达么有糖-黑龙费尔默 Crit -782 (Physical)", -- [5]
						"诺沉遗士 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -72 (Physical)", -- [6]
						"灼热图腾 VI 攻击 诺沉遗士 Hit -67 (Fire)", -- [7]
						"二道沟子靓仔-逐风者 肉搏 诺沉遗士 Hit -226 (Physical)", -- [8]
						"诺沉遗士 重伤 (伤害/跳) 芬达么有糖-黑龙费尔默 Tick -78 (Physical)", -- [9]
						"诺沉遗士 重伤 (伤害/跳) 二道沟子靓仔-逐风者 Tick -71 (Physical)", -- [10]
						"二道沟子靓仔-逐风者 冰霜震击 诺沉遗士 Crit -906 (Frost)", -- [11]
						"诺沉遗士 拦截昏迷 芬达么有糖-黑龙费尔默 Hit -40 (Physical)", -- [12]
						"灼热图腾 VI 攻击 诺沉遗士 Hit -61 (Fire)", -- [13]
						"二道沟子靓仔-逐风者 肉搏 诺沉遗士 Hit -217 (Physical)", -- [14]
						"二道沟子靓仔-逐风者 风暴打击 诺沉遗士 Hit -259 (Physical)", -- [15]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -258 (Shadow)", -- [16]
						"诺沉遗士 肉搏 二道沟子靓仔-逐风者 Hit -303 (Physical)", -- [17]
						"诺沉遗士 断筋 二道沟子靓仔-逐风者 Hit -32 (Physical)", -- [18]
						"二道沟子靓仔-逐风者 冰霜震击 诺沉遗士 Hit -613 (Frost)", -- [19]
						"火焰新星图腾 V 火焰新星 诺沉遗士 Hit -584 (Fire)", -- [20]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -258 (Shadow)", -- [21]
						"诺沉遗士死亡。", -- [22]
					},
					["DeathAt"] = 23329.337,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
					},
					["MessageTimes"] = {
						-14.83399999999892, -- [1]
						-12.8169999999991, -- [2]
						-10.76699999999983, -- [3]
						-10.36699999999837, -- [4]
						-9.934000000001106, -- [5]
						-9.816999999999098, -- [6]
						-7.450000000000728, -- [7]
						-7.167000000001281, -- [8]
						-6.917000000001281, -- [9]
						-6.799999999999272, -- [10]
						-6.683000000000902, -- [11]
						-5.86699999999837, -- [12]
						-4.983000000000175, -- [13]
						-3.349999999998545, -- [14]
						-3.233000000000175, -- [15]
						-3, -- [16]
						-2.88300000000163, -- [17]
						-2.88300000000163, -- [18]
						-1.183000000000902, -- [19]
						-0.8830000000016298, -- [20]
						-0.01599999999962165, -- [21]
						0, -- [22]
					},
					["HealthMax"] = {
						3919, -- [1]
						3919, -- [2]
						3919, -- [3]
						3919, -- [4]
						3919, -- [5]
						3919, -- [6]
						3919, -- [7]
						3919, -- [8]
						3919, -- [9]
						3919, -- [10]
						3919, -- [11]
						3919, -- [12]
						3919, -- [13]
						3919, -- [14]
						3919, -- [15]
						3919, -- [16]
						3919, -- [17]
						3919, -- [18]
						3919, -- [19]
						3919, -- [20]
						3919, -- [21]
						3919, -- [22]
					},
					["Health"] = {
						3506, -- [1]
						3506, -- [2]
						3506, -- [3]
						3506, -- [4]
						3445, -- [5]
						3445, -- [6]
						3445, -- [7]
						3378, -- [8]
						3152, -- [9]
						3152, -- [10]
						3152, -- [11]
						2246, -- [12]
						2246, -- [13]
						2185, -- [14]
						1968, -- [15]
						1709, -- [16]
						1451, -- [17]
						1451, -- [18]
						1451, -- [19]
						838, -- [20]
						254, -- [21]
						0, -- [22]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"MISC", -- [22]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
					},
					["Messages"] = {
						"二道沟子靓仔-逐风者 铁皮手雷 诺沉遗士 Hit -163 (Fire)", -- [1]
						"诺沉遗士 拦截昏迷 二道沟子靓仔-逐风者 Hit -45 (Physical)", -- [2]
						"诺沉遗士 肉搏 二道沟子靓仔-逐风者 Hit -273 (Physical)", -- [3]
						"诺沉遗士 断筋 二道沟子靓仔-逐风者 Hit -32 (Physical)", -- [4]
						"二道沟子靓仔-逐风者 肉搏 诺沉遗士 Hit -184 (Physical)", -- [5]
						"二道沟子靓仔-逐风者 肉搏 诺沉遗士 Hit -268 (Physical)", -- [6]
						"二道沟子靓仔-逐风者 肉搏 诺沉遗士 Hit -293 (Physical)", -- [7]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -281 (Shadow)", -- [8]
						"诺沉遗士 肉搏 二道沟子靓仔-逐风者 Hit -303 (Physical)", -- [9]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 诺沉遗士 Tick -106 (Shadow)", -- [10]
						"诺沉遗士 断筋 取名不能骚气-黑龙费尔默 Crit -91 (Physical)", -- [11]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -281 (Shadow)", -- [12]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 诺沉遗士 Tick -105 (Shadow)", -- [13]
						"诺沉遗士 肉搏 取名不能骚气-黑龙费尔默 Hit -399 (Physical)", -- [14]
						"诺沉遗士 致死打击 取名不能骚气-黑龙费尔默 Crit -1010 (Physical)", -- [15]
						"取名不能骚气-黑龙费尔默 暗影灼烧 诺沉遗士 Crit -1677 (Shadow)", -- [16]
						"诺沉遗士死亡。", -- [17]
					},
					["DeathAt"] = 22352.332,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
					},
					["MessageTimes"] = {
						-14.11700000000201, -- [1]
						-10.56700000000274, -- [2]
						-9.41700000000128, -- [3]
						-7.350000000002183, -- [4]
						-5.866000000001804, -- [5]
						-5.866000000001804, -- [6]
						-5.866000000001804, -- [7]
						-4.350000000002183, -- [8]
						-4.200000000000728, -- [9]
						-2.659999999999855, -- [10]
						-1.983000000000175, -- [11]
						-1.350000000002183, -- [12]
						-0.6500000000014552, -- [13]
						-0.5, -- [14]
						-0.2330000000001746, -- [15]
						-0.01600000000325963, -- [16]
						0, -- [17]
					},
					["HealthMax"] = {
						4159, -- [1]
						4159, -- [2]
						4159, -- [3]
						4159, -- [4]
						4159, -- [5]
						4159, -- [6]
						4159, -- [7]
						4159, -- [8]
						4159, -- [9]
						4159, -- [10]
						4159, -- [11]
						4159, -- [12]
						4159, -- [13]
						4159, -- [14]
						4159, -- [15]
						4159, -- [16]
						3919, -- [17]
					},
					["Health"] = {
						2448, -- [1]
						2285, -- [2]
						2285, -- [3]
						2285, -- [4]
						2285, -- [5]
						2285, -- [6]
						2285, -- [7]
						1540, -- [8]
						1259, -- [9]
						1259, -- [10]
						1153, -- [11]
						1153, -- [12]
						872, -- [13]
						767, -- [14]
						767, -- [15]
						767, -- [16]
						0, -- [17]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"MISC", -- [17]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
					},
					["Messages"] = {
						"诺沉遗士 dispels 诺沉遗士 冰锥术 (逃命专家)", -- [1]
						"诺沉遗士 dispels 诺沉遗士 冰锥术 (逃命专家)", -- [2]
						"诺沉遗士 拦截昏迷 火焰灬 Absorb -51 (51 被吸收) (Physical)", -- [3]
						"诺沉遗士 肉搏 火焰灬 Absorb -503 (1)", -- [4]
						"诺沉遗士 致死打击 火焰灬 Crit -555 (503 被吸收) (Physical)", -- [5]
						"诺沉遗士 肉搏 火焰灬 Immune (1)", -- [6]
						"诺沉遗士 肉搏 取名不能骚气-黑龙费尔默 Hit -424 (Physical)", -- [7]
						"阿拉希的传说-火妖鲁西弗隆 肉搏 诺沉遗士 Crit -247 (Physical)", -- [8]
						"阿拉希的传说-火妖鲁西弗隆 邪恶攻击 诺沉遗士 Crit -402 (Physical)", -- [9]
						"阿拉希的传说-火妖鲁西弗隆 速效毒药 VI 诺沉遗士 Hit -144 (Nature)", -- [10]
						"诺沉遗士 铁皮手雷 阿拉希的传说-火妖鲁西弗隆 Hit -186 (Fire)", -- [11]
						"阿拉希的传说-火妖鲁西弗隆 肉搏 诺沉遗士 Hit -65 (Physical)", -- [12]
						"诺沉遗士 铁皮手雷 乌勒哈姆 Resist (Fire)", -- [13]
						"诺沉遗士 致死打击 取名不能骚气-黑龙费尔默 Hit -536 (Physical)", -- [14]
						"取名不能骚气-黑龙费尔默 暗影灼烧 诺沉遗士 Hit -803 (Shadow)", -- [15]
						"诺沉遗士死亡。", -- [16]
					},
					["DeathAt"] = 22059.332,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
					},
					["MessageTimes"] = {
						-13.86100000000079, -- [1]
						-13.86100000000079, -- [2]
						-12.20000000000073, -- [3]
						-11.36699999999837, -- [4]
						-11.36699999999837, -- [5]
						-9.782999999999447, -- [6]
						-2.332999999998719, -- [7]
						-1.63300000000163, -- [8]
						-1.63300000000163, -- [9]
						-1.63300000000163, -- [10]
						-0.9830000000001746, -- [11]
						-0.7330000000001746, -- [12]
						-0.6160000000018044, -- [13]
						-0.2999999999992724, -- [14]
						-0.01599999999962165, -- [15]
						0, -- [16]
					},
					["HealthMax"] = {
						3919, -- [1]
						3919, -- [2]
						3919, -- [3]
						3919, -- [4]
						3919, -- [5]
						3919, -- [6]
						3919, -- [7]
						3919, -- [8]
						3919, -- [9]
						3919, -- [10]
						3919, -- [11]
						3919, -- [12]
						3919, -- [13]
						3919, -- [14]
						3919, -- [15]
						3919, -- [16]
					},
					["Health"] = {
						1058, -- [1]
						1058, -- [2]
						1058, -- [3]
						1058, -- [4]
						1058, -- [5]
						1058, -- [6]
						1105, -- [7]
						1105, -- [8]
						1105, -- [9]
						1105, -- [10]
						312, -- [11]
						312, -- [12]
						247, -- [13]
						247, -- [14]
						247, -- [15]
						0, -- [16]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"MISC", -- [1]
						"MISC", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"MISC", -- [16]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						false, -- [19]
						false, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
					},
					["Messages"] = {
						"芬达么有糖-黑龙费尔默 肉搏 诺沉遗士 Hit -101 (Physical)", -- [1]
						"诺沉遗士 肉搏 龍雲卿 Crit -733 (Physical)", -- [2]
						"诺沉遗士 致死打击 龍雲卿 Hit -533 (Physical)", -- [3]
						"芬达么有糖-黑龙费尔默 肉搏 诺沉遗士 Hit -123 (Physical)", -- [4]
						"诺沉遗士 重伤 (伤害/跳) 龍雲卿 Tick -71 (Physical)", -- [5]
						"取名不能骚气-黑龙费尔默 暗影箭 诺沉遗士 Hit -1037 (Shadow)", -- [6]
						"诺沉遗士 英勇打击 龍雲卿 Hit -414 (Physical)", -- [7]
						"诺沉遗士 重伤 (伤害/跳) 龍雲卿 Tick -57 (Physical)", -- [8]
						"阿拉希的传说-火妖鲁西弗隆 肉搏 诺沉遗士 Crit -314 (Physical)", -- [9]
						"阿拉希的传说-火妖鲁西弗隆 邪恶攻击 诺沉遗士 Hit -179 (Physical)", -- [10]
						"取名不能骚气-黑龙费尔默 暗影灼烧 诺沉遗士 Hit -883 (Shadow)", -- [11]
						"阿拉希的传说-火妖鲁西弗隆 肉搏 诺沉遗士 Hit -65 (Physical)", -- [12]
						"诺沉遗士 铁皮手雷 阿拉希的传说-火妖鲁西弗隆 Hit -153 (Fire)", -- [13]
						"诺沉遗士 铁皮手雷 取名不能骚气-黑龙费尔默 Hit -162 (Fire)", -- [14]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 诺沉遗士 Tick -89 (Shadow)", -- [15]
						"诺沉遗士 肉搏 阿拉希的传说-火妖鲁西弗隆 Crit -721 (Physical)", -- [16]
						"诺沉遗士 致死打击 阿拉希的传说-火妖鲁西弗隆 Dodge (Physical)", -- [17]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 诺沉遗士 Tick -90 (Shadow)", -- [18]
						"诺沉遗士 旋风斩 乌勒哈姆 Hit -299 (Physical)", -- [19]
						"诺沉遗士 旋风斩 取名不能骚气-黑龙费尔默 Crit -896 (Physical)", -- [20]
						"诺沉遗士 旋风斩 阿拉希的传说-火妖鲁西弗隆 Hit -324 (Physical)", -- [21]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -288 (Shadow)", -- [22]
						"诺沉遗士死亡。", -- [23]
						"诺沉遗士 重伤 (伤害/跳) 取名不能骚气-黑龙费尔默 Tick -71 (Physical)", -- [24]
					},
					["DeathAt"] = 21908.34,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-14.56800000000294, -- [1]
						-12.96600000000035, -- [2]
						-12.23400000000038, -- [3]
						-10.53399999999965, -- [4]
						-9.934000000001106, -- [5]
						-9.53399999999965, -- [6]
						-9.266999999999825, -- [7]
						-6.934000000001106, -- [8]
						-6.783999999999651, -- [9]
						-6.783999999999651, -- [10]
						-6.667000000001281, -- [11]
						-5.884000000001834, -- [12]
						-5.484000000000378, -- [13]
						-5.484000000000378, -- [14]
						-5.184000000001106, -- [15]
						-3.467000000000553, -- [16]
						-3.334000000002561, -- [17]
						-2.167000000001281, -- [18]
						-1.833000000002357, -- [19]
						-1.833000000002357, -- [20]
						-1.833000000002357, -- [21]
						0, -- [22]
						0, -- [23]
						1.182999999997264, -- [24]
					},
					["HealthMax"] = {
						3919, -- [1]
						3919, -- [2]
						3919, -- [3]
						3919, -- [4]
						3919, -- [5]
						3919, -- [6]
						3919, -- [7]
						3919, -- [8]
						3919, -- [9]
						3919, -- [10]
						3919, -- [11]
						3919, -- [12]
						3919, -- [13]
						3919, -- [14]
						3919, -- [15]
						3919, -- [16]
						3919, -- [17]
						3919, -- [18]
						3919, -- [19]
						3919, -- [20]
						3919, -- [21]
						3919, -- [22]
						3919, -- [23]
						3919, -- [24]
					},
					["Health"] = {
						3053, -- [1]
						2952, -- [2]
						2952, -- [3]
						2952, -- [4]
						2829, -- [5]
						2829, -- [6]
						1792, -- [7]
						1792, -- [8]
						1792, -- [9]
						1792, -- [10]
						1299, -- [11]
						416, -- [12]
						351, -- [13]
						351, -- [14]
						351, -- [15]
						262, -- [16]
						262, -- [17]
						262, -- [18]
						172, -- [19]
						172, -- [20]
						172, -- [21]
						172, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"MISC", -- [23]
						"DAMAGE", -- [24]
					},
				}, -- [4]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
					},
					["Messages"] = {
						"诺沉遗士 肉搏 取名不能骚气-黑龙费尔默 Miss (1)", -- [1]
						"诺沉遗士 肉搏 取名不能骚气-黑龙费尔默 Absorb -589 (1)", -- [2]
						"诺沉遗士 肉搏 取名不能骚气-黑龙费尔默 Crit -194 (589 被吸收) (Physical)", -- [3]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -284 (Shadow)", -- [4]
						"诺沉遗士 致死打击 取名不能骚气-黑龙费尔默 Crit -1102 (Physical)", -- [5]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 诺沉遗士 Tick -107 (Shadow)", -- [6]
						"火焰灬 寒冰箭 诺沉遗士 Crit -1810 (Frost)", -- [7]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 诺沉遗士 Tick -107 (Shadow)", -- [8]
						"诺沉遗士 旋风斩 二道沟子靓仔-逐风者 Hit -320 (Physical)", -- [9]
						"诺沉遗士 旋风斩 取名不能骚气-黑龙费尔默 Crit -798 (Physical)", -- [10]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -284 (Shadow)", -- [11]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 诺沉遗士 Tick -108 (Shadow)", -- [12]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -284 (Shadow)", -- [13]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 诺沉遗士 Tick -108 (Shadow)", -- [14]
						"火焰新星图腾 V 火焰新星 诺沉遗士 Crit -649 (131 被抵抗) (Fire)", -- [15]
						"诺沉遗士 拦截昏迷 火焰灬 Absorb -56 (56 被吸收) (Physical)", -- [16]
						"取名不能骚气-黑龙费尔默 痛苦诅咒 (伤害/跳) 诺沉遗士 Tick -163 (Shadow)", -- [17]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 诺沉遗士 Tick -284 (Shadow)", -- [18]
						"诺沉遗士死亡。", -- [19]
					},
					["DeathAt"] = 21776.332,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
					},
					["MessageTimes"] = {
						-12.98399999999674, -- [1]
						-9.28399999999965, -- [2]
						-9.28399999999965, -- [3]
						-9.016999999999825, -- [4]
						-8.883999999998196, -- [5]
						-8.5, -- [6]
						-7.549999999999272, -- [7]
						-6.5, -- [8]
						-6.399999999997817, -- [9]
						-6.399999999997817, -- [10]
						-6.016999999999825, -- [11]
						-4.5, -- [12]
						-3, -- [13]
						-2.5, -- [14]
						-2.349999999998545, -- [15]
						-1.19999999999709, -- [16]
						-0.5, -- [17]
						-0.01599999999962165, -- [18]
						0, -- [19]
					},
					["HealthMax"] = {
						4289, -- [1]
						4289, -- [2]
						4289, -- [3]
						4289, -- [4]
						4289, -- [5]
						4289, -- [6]
						4289, -- [7]
						4289, -- [8]
						4289, -- [9]
						4289, -- [10]
						4289, -- [11]
						4289, -- [12]
						4289, -- [13]
						4289, -- [14]
						4289, -- [15]
						4289, -- [16]
						4289, -- [17]
						4289, -- [18]
						3919, -- [19]
					},
					["Health"] = {
						4289, -- [1]
						3952, -- [2]
						3952, -- [3]
						3952, -- [4]
						3668, -- [5]
						3668, -- [6]
						3561, -- [7]
						1751, -- [8]
						1644, -- [9]
						1644, -- [10]
						1644, -- [11]
						1360, -- [12]
						1252, -- [13]
						968, -- [14]
						860, -- [15]
						211, -- [16]
						211, -- [17]
						48, -- [18]
						0, -- [19]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"MISC", -- [19]
					},
				}, -- [5]
			},
			["LastEventHealth"] = {
				3919, -- [1]
				3919, -- [2]
				3357, -- [3]
				3357, -- [4]
				3263, -- [5]
				3263, -- [6]
				3263, -- [7]
				3263, -- [8]
				3712, -- [9]
				3919, -- [10]
				3919, -- [11]
				3919, -- [12]
				3582, -- [13]
				3582, -- [14]
				3582, -- [15]
				3484, -- [16]
				3484, -- [17]
				3386, -- [18]
				2992, -- [19]
				2992, -- [20]
				2992, -- [21]
				2894, -- [22]
				2796, -- [23]
				2698, -- [24]
				2698, -- [25]
				2698, -- [26]
				3829, -- [27]
				3829, -- [28]
				3919, -- [29]
				3919, -- [30]
				3919, -- [31]
				3919, -- [32]
				3919, -- [33]
				3919, -- [34]
				3919, -- [35]
				3824, -- [36]
				3824, -- [37]
				3824, -- [38]
				3824, -- [39]
				3824, -- [40]
				3824, -- [41]
				3824, -- [42]
				3824, -- [43]
				3824, -- [44]
				3824, -- [45]
				3824, -- [46]
				3824, -- [47]
				3824, -- [48]
				3919, -- [49]
				3919, -- [50]
			},
			["LastAttackedBy"] = "火焰灬",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"MISC", -- [5]
				"MISC", -- [6]
				"MISC", -- [7]
				"MISC", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"MISC", -- [36]
				"MISC", -- [37]
				"MISC", -- [38]
				"MISC", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"MISC", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					8.5, -- [1]
				},
				["Dispelled"] = {
					16, -- [1]
				},
				["Dispels"] = {
					10, -- [1]
				},
				["Overhealing"] = {
					214, -- [1]
				},
				["Healing"] = {
					1536, -- [1]
				},
				["DamageTaken"] = {
					50228, -- [1]
				},
				["Interrupts"] = {
					2, -- [1]
				},
				["HealingTaken"] = {
					25259, -- [1]
				},
				["DeathCount"] = {
					5, -- [1]
				},
				["HOT_Time"] = {
					21, -- [1]
				},
				["TimeDamage"] = {
					299.3800000000001, -- [1]
				},
				["ActiveTime"] = {
					307.8800000000001, -- [1]
				},
				["RageGain"] = {
					667, -- [1]
				},
				["DOT_Time"] = {
					192, -- [1]
				},
				["Damage"] = {
					69951, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["LastDamageTaken"] = 94,
			["LastHealTime"] = 23307.536,
			["GUID"] = "Player-5458-036447C4",
			["level"] = 60,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 12,
			["LastEventHealthMax"] = {
				3919, -- [1]
				3919, -- [2]
				3919, -- [3]
				3919, -- [4]
				3919, -- [5]
				3919, -- [6]
				3919, -- [7]
				3919, -- [8]
				3919, -- [9]
				3919, -- [10]
				3919, -- [11]
				3919, -- [12]
				3919, -- [13]
				3919, -- [14]
				3919, -- [15]
				3919, -- [16]
				3919, -- [17]
				3919, -- [18]
				3919, -- [19]
				3919, -- [20]
				3919, -- [21]
				3919, -- [22]
				3919, -- [23]
				3919, -- [24]
				3919, -- [25]
				3919, -- [26]
				3919, -- [27]
				3919, -- [28]
				3919, -- [29]
				3919, -- [30]
				3919, -- [31]
				3919, -- [32]
				3919, -- [33]
				3919, -- [34]
				3919, -- [35]
				3919, -- [36]
				3919, -- [37]
				3919, -- [38]
				3919, -- [39]
				3919, -- [40]
				3919, -- [41]
				3919, -- [42]
				3919, -- [43]
				3919, -- [44]
				3919, -- [45]
				3919, -- [46]
				3919, -- [47]
				3919, -- [48]
				3919, -- [49]
				3919, -- [50]
			},
			["type"] = "Grouped",
			["TimeLast"] = {
				["Overhealing"] = 22781.339,
				["TimeHeal"] = 23307.336,
				["Dispelled"] = 23541.332,
				["Dispels"] = 23541.332,
				["Interrupts"] = 23482.329,
				["OVERALL"] = 23541.332,
				["DamageTaken"] = 23540.332,
				["Healing"] = 23307.336,
				["HealingTaken"] = 23461.328,
				["DeathCount"] = 23327.337,
				["HOT_Time"] = 23307.336,
				["TimeDamage"] = 23538.332,
				["ActiveTime"] = 23538.332,
				["RageGain"] = 23535.332,
				["DOT_Time"] = 23487.329,
				["Damage"] = 23538.332,
			},
			["GuardianReverseGUIDs"] = {
				["被禁锢的伊兰尼库斯"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "Creature-0-5427-489-17662-8506-00000A1C85",
					},
				},
			},
			["unit"] = true,
			["Owner"] = false,
			["Pet"] = {
				"被禁锢的伊兰尼库斯 <诺沉遗士>", -- [1]
			},
			["NextEventNum"] = 9,
			["LastDamageTime"] = 23538.516,
			["LastEvents"] = {
				"诺沉遗士 肉搏 二道沟子靓仔-逐风者 Hit -331 (Physical)", -- [1]
				"火焰灬 冰锥术 诺沉遗士 Hit -562 (Frost)", -- [2]
				"诺沉遗士 断筋 火焰灬 Hit -38 (Physical)", -- [3]
				"火焰灬 冰霜新星 诺沉遗士 Hit -94 (Frost)", -- [4]
				"诺沉遗士 dispels 诺沉遗士 冰霜新星 (逃命专家)", -- [5]
				"诺沉遗士 dispels 诺沉遗士 冰霜新星 (逃命专家)", -- [6]
				"诺沉遗士 dispels 诺沉遗士 冰锥术 (逃命专家)", -- [7]
				"诺沉遗士 dispels 诺沉遗士 冰锥术 (逃命专家)", -- [8]
				"诺沉遗士 斩杀 古德斯尼-逐风者 Hit -510 (Physical)", -- [9]
				"诺沉遗士 冲锋击昏 草莓尐布丁-火妖鲁西弗隆 Resist (Physical)", -- [10]
				"诺沉遗士 断筋 草莓尐布丁-火妖鲁西弗隆 Crit -71 (Physical)", -- [11]
				"芬达么有糖-黑龙费尔默 雷霆一击 诺沉遗士 Hit -55 (Physical)", -- [12]
				"诺沉遗士 拦截昏迷 芬达么有糖-黑龙费尔默 Hit -40 (Physical)", -- [13]
				"诺沉遗士 肉搏 芬达么有糖-黑龙费尔默 Hit -232 (Physical)", -- [14]
				"熔岩图腾 IV 熔岩图腾 诺沉遗士 Hit -98 (Fire)", -- [15]
				"诺沉遗士 断筋 芬达么有糖-黑龙费尔默 Hit -30 (Physical)", -- [16]
				"熔岩图腾 IV 熔岩图腾 诺沉遗士 Hit -98 (Fire)", -- [17]
				"芬达么有糖-黑龙费尔默 肉搏 诺沉遗士 Hit -394 (Physical)", -- [18]
				"诺沉遗士 斩杀 芬达么有糖-黑龙费尔默 Crit -1033 (Physical)", -- [19]
				"诺沉遗士 肉搏 二道沟子靓仔-逐风者 Parry (1)", -- [20]
				"熔岩图腾 IV 熔岩图腾 诺沉遗士 Hit -98 (Fire)", -- [21]
				"熔岩图腾 IV 熔岩图腾 诺沉遗士 Hit -98 (Fire)", -- [22]
				"熔岩图腾 IV 熔岩图腾 诺沉遗士 Hit -98 (Fire)", -- [23]
				"诺沉遗士 肉搏 二道沟子靓仔-逐风者 Hit -314 (Physical)", -- [24]
				"诺沉遗士 斩杀 二道沟子靓仔-逐风者 Hit -549 (Physical)", -- [25]
				"商山-逐风者 圣光闪现 诺沉遗士 Crit +1131", -- [26]
				"诺沉遗士 退化 龍雲卿 Immune (Arcane)", -- [27]
				"商山-逐风者 圣光闪现 诺沉遗士 Hit +738 (648 过量治疗)", -- [28]
				"诺沉遗士 肉搏 火焰灬 Absorb -655 (655 被吸收) (1)", -- [29]
				"诺沉遗士 重伤 (伤害/跳) 火焰灬 Tick -61 (Physical)", -- [30]
				"诺沉遗士 重伤 (伤害/跳) 火焰灬 Absorb -61 (61 被吸收) (Physical)", -- [31]
				"诺沉遗士 重伤 (伤害/跳) 火焰灬 Absorb -61 (61 被吸收) (Physical)", -- [32]
				"诺沉遗士 断筋 火焰灬 Absorb -78 (78 被吸收) (Physical)", -- [33]
				"诺沉遗士 肉搏 火焰灬 Absorb -320 (320 被吸收) (1)", -- [34]
				"火焰灬 冰霜新星 诺沉遗士 Hit -95 (Frost)", -- [35]
				"诺沉遗士 dispels 诺沉遗士 冰霜新星 (逃命专家)", -- [36]
				"诺沉遗士 dispels 诺沉遗士 冰霜新星 (逃命专家)", -- [37]
				"诺沉遗士 dispels 诺沉遗士 冰冻 (逃命专家)", -- [38]
				"诺沉遗士 dispels 诺沉遗士 冰冻 (逃命专家)", -- [39]
				"诺沉遗士 重伤 (伤害/跳) 火焰灬 Absorb -61 (61 被吸收) (Physical)", -- [40]
				"诺沉遗士 拳击 火焰灬 Absorb -39 (39 被吸收) (Physical)", -- [41]
				"诺沉遗士 interrupts 火焰灬 变形术 (拳击)", -- [42]
				"诺沉遗士 重伤 (伤害/跳) 火焰灬 Absorb -61 (61 被吸收) (Physical)", -- [43]
				"诺沉遗士 肉搏 火焰灬 Miss (1)", -- [44]
				"诺沉遗士 重伤 (伤害/跳) 火焰灬 Absorb -61 (61 被吸收) (Physical)", -- [45]
				"诺沉遗士 肉搏 火焰灬 Crit -675 (Physical)", -- [46]
				"火焰灬 冰冻 诺沉遗士 Resist (Frost)", -- [47]
				"诺沉遗士 旋风斩 火焰灬 Hit -316 (Physical)", -- [48]
				"诺沉遗士 断筋 取名不能骚气-黑龙费尔默 Crit -90 (Physical)", -- [49]
				"诺沉遗士 肉搏 取名不能骚气-黑龙费尔默 Hit -340 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["Name"] = "诺沉遗士",
			["LastEventTimes"] = {
				23536.382, -- [1]
				23537.582, -- [2]
				23538.516, -- [3]
				23540.599, -- [4]
				23542.282, -- [5]
				23542.282, -- [6]
				23542.282, -- [7]
				23542.282, -- [8]
				23415.642, -- [9]
				23429.593, -- [10]
				23430.226, -- [11]
				23431.46, -- [12]
				23442.243, -- [13]
				23443.277, -- [14]
				23444.01, -- [15]
				23444.477, -- [16]
				23446.01, -- [17]
				23446.094, -- [18]
				23446.51, -- [19]
				23447.91, -- [20]
				23448.01, -- [21]
				23450.727, -- [22]
				23452.727, -- [23]
				23455.311, -- [24]
				23455.311, -- [25]
				23460.394, -- [26]
				23460.428, -- [27]
				23461.861, -- [28]
				23462.245, -- [29]
				23471.328, -- [30]
				23474.329, -- [31]
				23477.312, -- [32]
				23478.729, -- [33]
				23478.796, -- [34]
				23480.079, -- [35]
				23481.329, -- [36]
				23481.329, -- [37]
				23481.329, -- [38]
				23481.329, -- [39]
				23481.762, -- [40]
				23483.162, -- [41]
				23483.162, -- [42]
				23484.763, -- [43]
				23485.679, -- [44]
				23487.763, -- [45]
				23490.679, -- [46]
				23490.679, -- [47]
				23491.846, -- [48]
				23503.43, -- [49]
				23505.547, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 6,
								},
								["二道沟子靓仔-逐风者"] = {
									["count"] = 12,
								},
								["火焰灬"] = {
									["count"] = 18,
								},
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
								["龍雲卿"] = {
									["count"] = 6,
								},
							},
							["amount"] = 45,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5897,
					["RageGainedFrom"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 168,
								},
							},
							["amount"] = 188,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 6,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 44,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 10,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 20,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 561,
						["Melee"] = 956,
						["Shadow"] = 516,
						["Fire"] = 1263,
						["Frost"] = 2363,
						["Nature"] = 238,
					},
					["DOT_Time"] = 48,
					["Damage"] = 14219,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 2.5,
					["RessedWho"] = {
					},
					["Dispels"] = 4,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 1287,
						["Physical"] = 458,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 6784,
						["Physical"] = 7435,
					},
					["PartialAbsorb"] = {
						["攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 71,
								},
							},
							["amount"] = 71,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 782,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 149,
								},
								["旋风斩"] = {
									["count"] = 497,
								},
								["拦截昏迷"] = {
									["count"] = 80,
								},
								["断筋"] = {
									["count"] = 59,
								},
								["斩杀"] = {
									["count"] = 1033,
								},
								["肉搏"] = {
									["count"] = 1376,
								},
							},
							["amount"] = 3976,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 340,
								},
								["断筋"] = {
									["count"] = 90,
								},
							},
							["amount"] = 430,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 36,
								},
								["斩杀"] = {
									["count"] = 510,
								},
								["肉搏"] = {
									["count"] = 312,
								},
							},
							["amount"] = 858,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 313,
								},
							},
							["amount"] = 313,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 312,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 285,
								},
								["断筋"] = {
									["count"] = 96,
								},
								["斩杀"] = {
									["count"] = 1025,
								},
								["肉搏"] = {
									["count"] = 2577,
								},
							},
							["amount"] = 4295,
						},
						["火焰灬"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 366,
								},
								["旋风斩"] = {
									["count"] = 316,
								},
								["断筋"] = {
									["count"] = 116,
								},
								["拳击"] = {
									["count"] = 39,
								},
								["肉搏"] = {
									["count"] = 1650,
								},
							},
							["amount"] = 2487,
						},
						["龍雲卿"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 56,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 143,
								},
								["肉搏"] = {
									["count"] = 220,
								},
							},
							["amount"] = 419,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 740,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 65,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
								["弩射击"] = {
									["count"] = 228,
								},
								["肉搏"] = {
									["count"] = 309,
								},
							},
							["amount"] = 1370,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 490,
								},
							},
							["amount"] = 490,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 394,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 124,
								},
								["雷霆一击"] = {
									["count"] = 178,
								},
							},
							["amount"] = 696,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 516,
								},
							},
							["amount"] = 516,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 189,
								},
							},
							["amount"] = 189,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 259,
								},
								["闪电之盾"] = {
									["count"] = 238,
								},
								["冰霜震击"] = {
									["count"] = 1519,
								},
								["肉搏"] = {
									["count"] = 443,
								},
							},
							["amount"] = 2459,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 562,
								},
								["冰霜新星"] = {
									["count"] = 189,
								},
							},
							["amount"] = 751,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 119,
								},
							},
							["amount"] = 119,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 584,
								},
							},
							["amount"] = 584,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["诺沉遗士"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["诺沉遗士"] = {
									["count"] = 168,
								},
							},
							["amount"] = 168,
						},
					},
					["HealedWho"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 500,
								},
							},
							["amount"] = 500,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 1,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.63,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.13,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.83,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.05,
								},
								["拦截昏迷"] = {
									["count"] = 2.43,
								},
								["断筋"] = {
									["count"] = 2.7,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.03,
								},
							},
							["amount"] = 15.54,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.1,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3.24,
								},
								["断筋"] = {
									["count"] = 0.33,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.37,
								},
							},
							["amount"] = 16.44,
						},
						["火焰灬"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["断筋"] = {
									["count"] = 2.92,
								},
								["拳击"] = {
									["count"] = 1.4,
								},
								["肉搏"] = {
									["count"] = 3.99,
								},
							},
							["amount"] = 18.48,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 0.8,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.12,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["弩射击"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.54,
						},
						["龍雲卿"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 0.25,
								},
								["退化"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.25,
						},
					},
					["WhoDispelled"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["冰锥术 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰冻 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["InterruptData"] = {
						["火焰灬"] = {
							["Details"] = {
								["变形术 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 2,
									["amount"] = 500,
								},
							},
							["count"] = 2,
							["amount"] = 500,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2703,
								},
							},
							["amount"] = 2703,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 500,
								},
							},
							["amount"] = 500,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 76.98,
					["Healing"] = 500,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 4,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 782,
									["min"] = 782,
									["count"] = 1,
									["amount"] = 782,
								},
							},
							["count"] = 1,
							["amount"] = 782,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 740,
									["min"] = 740,
									["count"] = 1,
									["amount"] = 740,
								},
							},
							["count"] = 1,
							["amount"] = 740,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 61,
									["min"] = 61,
									["count"] = 5,
									["amount"] = 305,
								},
								["Tick"] = {
									["max"] = 78,
									["min"] = 61,
									["count"] = 10,
									["amount"] = 703,
								},
							},
							["count"] = 15,
							["amount"] = 1008,
						},
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
							},
							["count"] = 1,
							["amount"] = 39,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 2,
									["amount"] = 80,
								},
							},
							["count"] = 2,
							["amount"] = 80,
						},
						["弩射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 228,
									["min"] = 228,
									["count"] = 1,
									["amount"] = 228,
								},
							},
							["count"] = 1,
							["amount"] = 228,
						},
						["退化"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 316,
									["min"] = 246,
									["count"] = 5,
									["amount"] = 1438,
								},
							},
							["count"] = 5,
							["amount"] = 1438,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 78,
									["min"] = 36,
									["count"] = 2,
									["amount"] = 114,
								},
								["Crit"] = {
									["max"] = 90,
									["min"] = 56,
									["count"] = 3,
									["amount"] = 217,
								},
								["Hit"] = {
									["max"] = 38,
									["min"] = 29,
									["count"] = 6,
									["amount"] = 193,
								},
							},
							["count"] = 11,
							["amount"] = 524,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1033,
									["min"] = 1033,
									["count"] = 1,
									["amount"] = 1033,
								},
								["Hit"] = {
									["max"] = 549,
									["min"] = 476,
									["count"] = 3,
									["amount"] = 1535,
								},
							},
							["count"] = 4,
							["amount"] = 2568,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 655,
									["min"] = 312,
									["count"] = 3,
									["amount"] = 1287,
								},
								["Hit"] = {
									["max"] = 340,
									["min"] = 220,
									["count"] = 10,
									["amount"] = 2992,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 686,
									["min"] = 566,
									["count"] = 4,
									["amount"] = 2505,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 6784,
						},
					},
					["HealingTaken"] = 3203,
					["RageGain"] = 188,
					["TimeDamage"] = 74.48,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.63,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.13,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.83,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.05,
								},
								["拦截昏迷"] = {
									["count"] = 2.43,
								},
								["断筋"] = {
									["count"] = 2.7,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.03,
								},
							},
							["amount"] = 15.54,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.1,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3.24,
								},
								["断筋"] = {
									["count"] = 0.33,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.37,
								},
							},
							["amount"] = 16.44,
						},
						["火焰灬"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["断筋"] = {
									["count"] = 2.92,
								},
								["拳击"] = {
									["count"] = 1.4,
								},
								["肉搏"] = {
									["count"] = 3.99,
								},
							},
							["amount"] = 18.48,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 0.8,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.12,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["弩射击"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.54,
						},
						["龍雲卿"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 0.25,
								},
								["退化"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.25,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["诺沉遗士"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["DispelledWho"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["冰锥术 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰冻 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 33,
								},
								["果不其然-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 45,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["草莓尐布丁-火妖鲁西弗隆"] = {
									["count"] = 15,
								},
								["芬达么有糖-黑龙费尔默"] = {
									["count"] = 30,
								},
								["取名不能骚气-黑龙费尔默"] = {
									["count"] = 27,
								},
								["古德斯尼-逐风者"] = {
									["count"] = 3,
								},
								["阿拉希的传说-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
								["二道沟子靓仔-逐风者"] = {
									["count"] = 12,
								},
								["火焰灬"] = {
									["count"] = 18,
								},
								["龍雲卿"] = {
									["count"] = 30,
								},
								["果不其然-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 144,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 20,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 14,
								},
								["Hit"] = {
									["count"] = 38,
								},
							},
							["amount"] = 56,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 38,
								},
							},
							["amount"] = 45,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 17,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 20,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 39,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 15,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 27,
						},
					},
					["DamageTaken"] = 50228,
					["ElementDoneAbsorb"] = {
						["Melee"] = 2785,
						["Physical"] = 2219,
					},
					["DeathCount"] = 5,
					["HOT_Time"] = 21,
					["ElementTaken"] = {
						["Frost"] = 8845,
						["Melee"] = 10364,
						["Arcane"] = 3068,
						["Shadow"] = 14087,
						["Fire"] = 3585,
						["Physical"] = 7740,
						["Nature"] = 2539,
					},
					["DOT_Time"] = 192,
					["Damage"] = 69951,
					["TimeHeal"] = 8.5,
					["Dispels"] = 10,
					["ElementDone"] = {
						["Fire"] = 793,
						["Physical"] = 41251,
						["Melee"] = 27852,
						["Nature"] = 55,
					},
					["DamagedWho"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 871,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 253,
								},
								["断筋"] = {
									["count"] = 111,
								},
								["拳击"] = {
									["count"] = 44,
								},
								["铁皮手雷"] = {
									["count"] = 150,
								},
								["肉搏"] = {
									["count"] = 1230,
								},
							},
							["amount"] = 2659,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1948,
								},
								["英勇打击"] = {
									["count"] = 1096,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 685,
								},
								["拦截昏迷"] = {
									["count"] = 80,
								},
								["旋风斩"] = {
									["count"] = 756,
								},
								["毒云术 (伤害/跳)"] = {
									["count"] = 55,
								},
								["断筋"] = {
									["count"] = 123,
								},
								["斩杀"] = {
									["count"] = 1979,
								},
								["肉搏"] = {
									["count"] = 3862,
								},
							},
							["amount"] = 10584,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 4753,
								},
								["斩杀"] = {
									["count"] = 701,
								},
								["英勇打击"] = {
									["count"] = 2776,
								},
								["旋风斩"] = {
									["count"] = 1694,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 587,
								},
								["断筋"] = {
									["count"] = 350,
								},
								["铁皮手雷"] = {
									["count"] = 162,
								},
								["肉搏"] = {
									["count"] = 5993,
								},
							},
							["amount"] = 17016,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 32,
								},
							},
							["amount"] = 32,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 299,
								},
							},
							["amount"] = 299,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 81,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 63,
								},
								["英勇打击"] = {
									["count"] = 3720,
								},
								["旋风斩"] = {
									["count"] = 268,
								},
								["铁皮手雷"] = {
									["count"] = 142,
								},
								["断筋"] = {
									["count"] = 204,
								},
								["斩杀"] = {
									["count"] = 1452,
								},
								["肉搏"] = {
									["count"] = 2010,
								},
							},
							["amount"] = 7940,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 420,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 75,
								},
								["拦截昏迷"] = {
									["count"] = 48,
								},
								["压制"] = {
									["count"] = 739,
								},
								["旋风斩"] = {
									["count"] = 313,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 114,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["斩杀"] = {
									["count"] = 693,
								},
								["肉搏"] = {
									["count"] = 1284,
								},
							},
							["amount"] = 3760,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1322,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 285,
								},
								["英勇打击"] = {
									["count"] = 890,
								},
								["旋风斩"] = {
									["count"] = 962,
								},
								["拦截昏迷"] = {
									["count"] = 45,
								},
								["断筋"] = {
									["count"] = 193,
								},
								["斩杀"] = {
									["count"] = 1025,
								},
								["肉搏"] = {
									["count"] = 4776,
								},
							},
							["amount"] = 9498,
						},
						["火焰灬"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 555,
								},
								["旋风斩"] = {
									["count"] = 316,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 366,
								},
								["拳击"] = {
									["count"] = 39,
								},
								["拦截昏迷"] = {
									["count"] = 107,
								},
								["断筋"] = {
									["count"] = 116,
								},
								["肉搏"] = {
									["count"] = 2153,
								},
							},
							["amount"] = 3652,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 383,
								},
								["英勇打击"] = {
									["count"] = 913,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 309,
								},
								["弩射击"] = {
									["count"] = 228,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 136,
								},
								["压制"] = {
									["count"] = 1080,
								},
								["旋风斩"] = {
									["count"] = 324,
								},
								["反击风暴"] = {
									["count"] = 920,
								},
								["断筋"] = {
									["count"] = 106,
								},
								["铁皮手雷"] = {
									["count"] = 339,
								},
								["肉搏"] = {
									["count"] = 4562,
								},
							},
							["amount"] = 9300,
						},
						["龍雲卿"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 533,
								},
								["英勇打击"] = {
									["count"] = 414,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 562,
								},
								["拳击"] = {
									["count"] = 26,
								},
								["旋风斩"] = {
									["count"] = 385,
								},
								["断筋"] = {
									["count"] = 81,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["斩杀"] = {
									["count"] = 1186,
								},
								["肉搏"] = {
									["count"] = 1982,
								},
							},
							["amount"] = 5211,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 111,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 593,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2197,
								},
							},
							["amount"] = 2901,
						},
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 686,
								},
							},
							["amount"] = 686,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 387,
								},
								["旋风斩"] = {
									["count"] = 1102,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 587,
								},
								["拳击"] = {
									["count"] = 64,
								},
								["雷霆一击"] = {
									["count"] = 372,
								},
								["肉搏"] = {
									["count"] = 3350,
								},
							},
							["amount"] = 5862,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 5117,
								},
								["暗影箭"] = {
									["count"] = 1037,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 804,
								},
								["铁皮手雷"] = {
									["count"] = 357,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4049,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 179,
								},
							},
							["amount"] = 11543,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 189,
								},
							},
							["amount"] = 189,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 2592,
								},
								["火焰冲击"] = {
									["count"] = 957,
								},
								["冰锥术"] = {
									["count"] = 1147,
								},
								["冰霜新星"] = {
									["count"] = 466,
								},
							},
							["amount"] = 5162,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 119,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 276,
								},
							},
							["amount"] = 395,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 3330,
								},
								["肉搏"] = {
									["count"] = 3014,
								},
								["闪电之盾"] = {
									["count"] = 1022,
								},
								["铁皮手雷"] = {
									["count"] = 163,
								},
								["风暴打击"] = {
									["count"] = 520,
								},
							},
							["amount"] = 8049,
						},
						["火焰灬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 476,
								},
								["寒冰箭"] = {
									["count"] = 1810,
								},
								["冰锥术"] = {
									["count"] = 1715,
								},
								["冰霜新星"] = {
									["count"] = 377,
								},
							},
							["amount"] = 4378,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["脚踢"] = {
									["count"] = 47,
								},
								["剑刃乱舞"] = {
									["count"] = 1046,
								},
								["凿击"] = {
									["count"] = 45,
								},
								["邪恶攻击"] = {
									["count"] = 1760,
								},
								["刺骨"] = {
									["count"] = 1810,
								},
								["速效毒药 VI"] = {
									["count"] = 915,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 326,
								},
								["肉搏"] = {
									["count"] = 3881,
								},
							},
							["amount"] = 9830,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1233,
								},
							},
							["amount"] = 1233,
						},
					},
					["TimeHealing"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 8.5,
								},
							},
							["amount"] = 8.5,
						},
					},
					["Dispelled"] = 16,
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["50% 抵抗"] = {
									["max"] = 262,
									["min"] = 262,
									["count"] = 1,
									["amount"] = 262,
								},
							},
							["count"] = 262,
							["amount"] = 2,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["恐惧嚎叫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["地缚术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["拳击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["脚踢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 56,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 56,
						},
					},
					["OverHeals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 214,
									["min"] = 214,
									["count"] = 1,
									["amount"] = 214,
								},
							},
							["count"] = 1,
							["amount"] = 214,
						},
					},
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["恐惧嚎叫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["地缚术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["拳击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["脚踢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["剑刃乱舞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 56,
									["amount"] = 0,
								},
							},
							["count"] = 56,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 307.8800000000001,
					["Overhealing"] = 214,
					["InterruptData"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["火焰灬"] = {
							["Details"] = {
								["变形术 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 2,
					["WhoDispelled"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["冰霜震击 (清洁术)"] = {
									["count"] = 1,
								},
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
								["致命毒药 IV (纯净术)"] = {
									["count"] = 2,
								},
								["噬灵瘟疫 (纯净术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["冰冻 (逃命专家)"] = {
									["count"] = 2,
								},
								["冰霜震击 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 5,
								},
								["冰锥术 (逃命专家)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 10,
						},
					},
					["HealedWho"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1536,
								},
							},
							["amount"] = 1536,
						},
					},
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 36,
									["count"] = 7,
									["amount"] = 1536,
								},
							},
							["count"] = 7,
							["amount"] = 1536,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 12,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 2,
								},
								["Resist"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 56,
								},
								["Hit"] = {
									["count"] = 65,
								},
								["Crit"] = {
									["count"] = 34,
								},
								["Dodge"] = {
									["count"] = 5,
								},
							},
							["amount"] = 185,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 10,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 41,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 17,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 80,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["诺沉遗士"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 532,
								},
								["圣光闪现"] = {
									["count"] = 23191,
								},
							},
							["amount"] = 23723,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 1536,
								},
							},
							["amount"] = 1536,
						},
					},
					["Healing"] = 1536,
					["TimeSpent"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.98,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.46,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.59,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 1.18,
								},
								["铁皮手雷"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 17.68,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.26,
								},
								["英勇打击"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12.62,
								},
								["拦截昏迷"] = {
									["count"] = 2.43,
								},
								["断筋"] = {
									["count"] = 2.7,
								},
								["旋风斩"] = {
									["count"] = 2.17,
								},
								["毒云术 (伤害/跳)"] = {
									["count"] = 0.42,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 4.48,
								},
								["肉搏"] = {
									["count"] = 9.36,
								},
							},
							["amount"] = 41.94000000000001,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 5.49,
								},
								["英勇打击"] = {
									["count"] = 4.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 13.07,
								},
								["断筋"] = {
									["count"] = 6.19,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 16.56,
								},
							},
							["amount"] = 51.81,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.38,
								},
							},
							["amount"] = 1.38,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.64,
								},
								["拦截昏迷"] = {
									["count"] = 1.17,
								},
								["压制"] = {
									["count"] = 0.03,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 5.11,
								},
								["断筋"] = {
									["count"] = 2.7,
								},
								["斩杀"] = {
									["count"] = 1.04,
								},
								["肉搏"] = {
									["count"] = 5.22,
								},
							},
							["amount"] = 18.91,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 0.37,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.87,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 7.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.46,
								},
								["重伤"] = {
									["count"] = 0.02,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 0.45,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 6.779999999999999,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.68,
								},
							},
							["amount"] = 33.39,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 8.5,
								},
							},
							["amount"] = 8.5,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.24,
								},
								["英勇打击"] = {
									["count"] = 0.74,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 5.060000000000001,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 18.39,
								},
							},
							["amount"] = 34.93000000000001,
						},
						["火焰灬"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["拳击"] = {
									["count"] = 1.4,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 2.92,
								},
								["肉搏"] = {
									["count"] = 6.32,
								},
							},
							["amount"] = 23.81,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.13,
								},
								["英勇打击"] = {
									["count"] = 1.52,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 11.14,
								},
								["弩射击"] = {
									["count"] = 1.12,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.15,
								},
								["压制"] = {
									["count"] = 1.07,
								},
								["铁皮手雷"] = {
									["count"] = 2.8,
								},
								["撕裂"] = {
									["count"] = 3,
								},
								["反击风暴"] = {
									["count"] = 1.23,
								},
								["断筋"] = {
									["count"] = 3.43,
								},
								["斩杀"] = {
									["count"] = 2.95,
								},
								["肉搏"] = {
									["count"] = 13.65,
								},
							},
							["amount"] = 45.18999999999999,
						},
						["龍雲卿"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.73,
								},
								["英勇打击"] = {
									["count"] = 0.67,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12.94,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["退化"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.87,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.68,
								},
								["肉搏"] = {
									["count"] = 5.58,
								},
							},
							["amount"] = 28.47,
						},
					},
					["RageGainedFrom"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 184,
								},
								["冲锋"] = {
									["count"] = 483,
								},
							},
							["amount"] = 667,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1102,
									["min"] = 555,
									["count"] = 8,
									["amount"] = 7111,
								},
								["Hit"] = {
									["max"] = 547,
									["min"] = 361,
									["count"] = 7,
									["amount"] = 3254,
								},
							},
							["count"] = 17,
							["amount"] = 10365,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 29,
									["min"] = 28,
									["count"] = 15,
									["amount"] = 423,
								},
							},
							["count"] = 15,
							["amount"] = 423,
						},
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
								["Hit"] = {
									["max"] = 44,
									["min"] = 26,
									["count"] = 2,
									["amount"] = 70,
								},
							},
							["count"] = 3,
							["amount"] = 109,
						},
						["退化"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 896,
									["min"] = 798,
									["count"] = 2,
									["amount"] = 1694,
								},
								["Hit"] = {
									["max"] = 385,
									["min"] = 246,
									["count"] = 12,
									["amount"] = 3623,
								},
							},
							["count"] = 14,
							["amount"] = 5317,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 56,
									["min"] = 51,
									["count"] = 2,
									["amount"] = 107,
								},
								["Hit"] = {
									["max"] = 48,
									["min"] = 33,
									["count"] = 7,
									["amount"] = 296,
								},
							},
							["count"] = 10,
							["amount"] = 403,
						},
						["斩杀"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 701,
									["min"] = 451,
									["count"] = 7,
									["amount"] = 3875,
								},
								["Crit"] = {
									["max"] = 1033,
									["min"] = 580,
									["count"] = 4,
									["amount"] = 3161,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 7036,
						},
						["英勇打击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1263,
									["min"] = 747,
									["count"] = 7,
									["amount"] = 6791,
								},
								["Hit"] = {
									["max"] = 480,
									["min"] = 50,
									["count"] = 9,
									["amount"] = 3438,
								},
							},
							["count"] = 17,
							["amount"] = 10229,
						},
						["弩射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 228,
									["min"] = 228,
									["count"] = 1,
									["amount"] = 228,
								},
							},
							["count"] = 1,
							["amount"] = 228,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 740,
									["min"] = 739,
									["count"] = 2,
									["amount"] = 1479,
								},
								["Hit"] = {
									["max"] = 340,
									["min"] = 340,
									["count"] = 1,
									["amount"] = 340,
								},
							},
							["count"] = 3,
							["amount"] = 1819,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 61,
									["min"] = 48,
									["count"] = 7,
									["amount"] = 414,
								},
								["Tick"] = {
									["max"] = 78,
									["min"] = 38,
									["count"] = 41,
									["amount"] = 2598,
								},
							},
							["count"] = 48,
							["amount"] = 3012,
						},
						["撕裂"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重伤"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒云术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 1,
									["amount"] = 55,
								},
							},
							["count"] = 1,
							["amount"] = 55,
						},
						["反击风暴"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 619,
									["min"] = 619,
									["count"] = 1,
									["amount"] = 619,
								},
								["Hit"] = {
									["max"] = 301,
									["min"] = 301,
									["count"] = 1,
									["amount"] = 301,
								},
							},
							["count"] = 2,
							["amount"] = 920,
						},
						["断筋"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 42,
									["min"] = 20,
									["count"] = 18,
									["amount"] = 596,
								},
								["Absorb"] = {
									["max"] = 78,
									["min"] = 36,
									["count"] = 2,
									["amount"] = 114,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 91,
									["min"] = 25,
									["count"] = 10,
									["amount"] = 680,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 33,
							["amount"] = 1390,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 186,
									["min"] = 142,
									["count"] = 5,
									["amount"] = 793,
								},
							},
							["count"] = 6,
							["amount"] = 793,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 656,
									["min"] = 297,
									["count"] = 10,
									["amount"] = 4330,
								},
								["Miss"] = {
									["count"] = 4,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 424,
									["min"] = 1,
									["count"] = 41,
									["amount"] = 12789,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 859,
									["min"] = 194,
									["count"] = 17,
									["amount"] = 10733,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 80,
							["amount"] = 27852,
						},
					},
					["RageGain"] = 667,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["诺沉遗士"] = {
									["count"] = 184,
								},
							},
							["amount"] = 184,
						},
						["冲锋"] = {
							["Details"] = {
								["诺沉遗士"] = {
									["count"] = 483,
								},
							},
							["amount"] = 483,
						},
					},
					["TimeDamage"] = 299.3800000000001,
					["TimeDamaging"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.98,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.46,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.59,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 1.18,
								},
								["铁皮手雷"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 17.68,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.26,
								},
								["英勇打击"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12.62,
								},
								["拦截昏迷"] = {
									["count"] = 2.43,
								},
								["断筋"] = {
									["count"] = 2.7,
								},
								["旋风斩"] = {
									["count"] = 2.17,
								},
								["毒云术 (伤害/跳)"] = {
									["count"] = 0.42,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 4.48,
								},
								["肉搏"] = {
									["count"] = 9.36,
								},
							},
							["amount"] = 41.94000000000001,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 5.49,
								},
								["英勇打击"] = {
									["count"] = 4.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 13.07,
								},
								["断筋"] = {
									["count"] = 6.19,
								},
								["冲锋击昏"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 16.56,
								},
							},
							["amount"] = 51.81,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.38,
								},
							},
							["amount"] = 1.38,
						},
						["乌勒哈姆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 0.37,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.87,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 7.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.46,
								},
								["重伤"] = {
									["count"] = 0.02,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 0.45,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 6.779999999999999,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.68,
								},
							},
							["amount"] = 33.39,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.64,
								},
								["拦截昏迷"] = {
									["count"] = 1.17,
								},
								["压制"] = {
									["count"] = 0.03,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 5.11,
								},
								["断筋"] = {
									["count"] = 2.7,
								},
								["斩杀"] = {
									["count"] = 1.04,
								},
								["肉搏"] = {
									["count"] = 5.22,
								},
							},
							["amount"] = 18.91,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.24,
								},
								["英勇打击"] = {
									["count"] = 0.74,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 5.060000000000001,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 18.39,
								},
							},
							["amount"] = 34.93000000000001,
						},
						["火焰灬"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 9,
								},
								["拳击"] = {
									["count"] = 1.4,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 2.92,
								},
								["肉搏"] = {
									["count"] = 6.32,
								},
							},
							["amount"] = 23.81,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.13,
								},
								["英勇打击"] = {
									["count"] = 1.52,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 11.14,
								},
								["弩射击"] = {
									["count"] = 1.12,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.15,
								},
								["压制"] = {
									["count"] = 1.07,
								},
								["铁皮手雷"] = {
									["count"] = 2.8,
								},
								["撕裂"] = {
									["count"] = 3,
								},
								["反击风暴"] = {
									["count"] = 1.23,
								},
								["断筋"] = {
									["count"] = 3.43,
								},
								["斩杀"] = {
									["count"] = 2.95,
								},
								["肉搏"] = {
									["count"] = 13.65,
								},
							},
							["amount"] = 45.18999999999999,
						},
						["龍雲卿"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.73,
								},
								["英勇打击"] = {
									["count"] = 0.67,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 12.94,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["退化"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.87,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.68,
								},
								["肉搏"] = {
									["count"] = 5.58,
								},
							},
							["amount"] = 28.47,
						},
					},
					["HealingTaken"] = 25259,
					["ElementTakenResist"] = {
						["Fire"] = 262,
					},
					["DispelledWho"] = {
						["诺沉遗士"] = {
							["Details"] = {
								["冰冻 (逃命专家)"] = {
									["count"] = 2,
								},
								["冰霜震击 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 5,
								},
								["冰锥术 (逃命专家)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 10,
						},
					},
				},
			},
			["UnitLockout"] = 22352.332,
			["LastActive"] = 23541.332,
		},
		["商山-逐风者"] = {
			["GUID"] = "Player-5451-031A020F",
			["LastEventHealth"] = {
				3451, -- [1]
				3451, -- [2]
				3165, -- [3]
				3165, -- [4]
				3165, -- [5]
				3911, -- [6]
				3911, -- [7]
				3911, -- [8]
				3911, -- [9]
				3849, -- [10]
				3885, -- [11]
				3911, -- [12]
				3911, -- [13]
				3911, -- [14]
				3380, -- [15]
				3380, -- [16]
				3911, -- [17]
				3519, -- [18]
				2933, -- [19]
				2698, -- [20]
				2698, -- [21]
				2117, -- [22]
				2045, -- [23]
				1847, -- [24]
				1477, -- [25]
				1242, -- [26]
				392, -- [27]
				319, -- [28]
				158, -- [29]
				0, -- [30]
				3374, -- [31]
				3374, -- [32]
				3374, -- [33]
				3911, -- [34]
				3911, -- [35]
				3911, -- [36]
				3911, -- [37]
				3911, -- [38]
				3911, -- [39]
				3911, -- [40]
				3911, -- [41]
				3911, -- [42]
				3911, -- [43]
				3911, -- [44]
				3911, -- [45]
				3911, -- [46]
				3911, -- [47]
				3911, -- [48]
				3797, -- [49]
				3727, -- [50]
			},
			["LastAttackedBy"] = "火焰灬",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"HEAL", -- [4]
				"HEAL", -- [5]
				"MISC", -- [6]
				"HEAL", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"MISC", -- [12]
				"HEAL", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"HEAL", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"MISC", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"MISC", -- [30]
				"HEAL", -- [31]
				"HEAL", -- [32]
				"HEAL", -- [33]
				"HEAL", -- [34]
				"HEAL", -- [35]
				"HEAL", -- [36]
				"HEAL", -- [37]
				"HEAL", -- [38]
				"HEAL", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"HEAL", -- [43]
				"HEAL", -- [44]
				"MISC", -- [45]
				"HEAL", -- [46]
				"HEAL", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					290.79, -- [1]
				},
				["Dispelled"] = {
					9, -- [1]
				},
				["Dispels"] = {
					17, -- [1]
				},
				["Healing"] = {
					147850, -- [1]
				},
				["DamageTaken"] = {
					43183, -- [1]
				},
				["HealingTaken"] = {
					24882, -- [1]
				},
				["Overhealing"] = {
					21416, -- [1]
				},
				["ActiveTime"] = {
					308.7900000000001, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["ManaGain"] = {
					6895, -- [1]
				},
				["TimeDamage"] = {
					18, -- [1]
				},
				["Damage"] = {
					1608, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
					},
					["Messages"] = {
						"商山-逐风者 圣光闪现 商山-逐风者 Hit +731 (200 过量治疗)", -- [1]
						"二道沟子靓仔-逐风者 肉搏 商山-逐风者 Crit -392 (Physical)", -- [2]
						"二道沟子靓仔-逐风者 地震术 商山-逐风者 Hit -586 (Nature)", -- [3]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 商山-逐风者 Tick -235 (Shadow)", -- [4]
						"乌勒哈姆 interrupts 商山-逐风者 圣光闪现 (法术封锁)", -- [5]
						"二道沟子靓仔-逐风者 地震术 商山-逐风者 Hit -581 (Nature)", -- [6]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 商山-逐风者 Tick -72 (Shadow)", -- [7]
						"二道沟子靓仔-逐风者 肉搏 商山-逐风者 Hit -198 (Physical)", -- [8]
						"取名不能骚气-黑龙费尔默 献祭 商山-逐风者 Hit -370 (Fire)", -- [9]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 商山-逐风者 Tick -235 (Shadow)", -- [10]
						"取名不能骚气-黑龙费尔默 灼热之痛 商山-逐风者 Crit -850 (Fire)", -- [11]
						"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 商山-逐风者 Tick -73 (Shadow)", -- [12]
						"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 商山-逐风者 Tick -161 (Fire)", -- [13]
						"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 商山-逐风者 Tick -234 (Shadow)", -- [14]
						"商山-逐风者死亡。", -- [15]
					},
					["DeathAt"] = 23344.338,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
					},
					["MessageTimes"] = {
						-12.03399999999965, -- [1]
						-11.69999999999709, -- [2]
						-11.21700000000055, -- [3]
						-6.016999999999825, -- [4]
						-5.332999999998719, -- [5]
						-4.599999999998545, -- [6]
						-4.532999999999447, -- [7]
						-4.233000000000175, -- [8]
						-3.716000000000349, -- [9]
						-3.032999999999447, -- [10]
						-2.149999999997817, -- [11]
						-1.532999999999447, -- [12]
						-0.7160000000003492, -- [13]
						-0.01599999999962165, -- [14]
						0, -- [15]
					},
					["HealthMax"] = {
						3911, -- [1]
						3911, -- [2]
						3911, -- [3]
						3911, -- [4]
						3911, -- [5]
						3911, -- [6]
						3911, -- [7]
						3911, -- [8]
						3911, -- [9]
						3911, -- [10]
						3911, -- [11]
						3911, -- [12]
						3911, -- [13]
						3911, -- [14]
						3911, -- [15]
					},
					["Health"] = {
						3380, -- [1]
						3911, -- [2]
						3519, -- [3]
						2933, -- [4]
						2698, -- [5]
						2698, -- [6]
						2117, -- [7]
						2045, -- [8]
						1847, -- [9]
						1477, -- [10]
						1242, -- [11]
						392, -- [12]
						319, -- [13]
						158, -- [14]
						0, -- [15]
					},
					["KilledBy"] = "取名不能骚气-黑龙费尔默",
					["MessageType"] = {
						"HEAL", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"MISC", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"MISC", -- [15]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
					},
					["Messages"] = {
						"商山-逐风者 圣光闪现 特变电工 Hit +763", -- [1]
						"商山-逐风者 圣光闪现 特变电工 Hit +743", -- [2]
						"二道沟子靓仔-逐风者 风暴打击 商山-逐风者 Hit -219 (Physical)", -- [3]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -181 (Physical)", -- [4]
						"果不其然-逐风者 肉搏 商山-逐风者 Miss (1)", -- [5]
						"果不其然-逐风者 出血 商山-逐风者 Hit -167 (Physical)", -- [6]
						"二道沟子靓仔-逐风者 肉搏 商山-逐风者 Hit -247 (Physical)", -- [7]
						"果不其然-逐风者 出血 商山-逐风者 Hit -200 (Physical)", -- [8]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -62 (Physical)", -- [9]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -183 (Physical)", -- [10]
						"二道沟子靓仔-逐风者 冰霜震击 商山-逐风者 Resist (Frost)", -- [11]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -57 (Physical)", -- [12]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -159 (Physical)", -- [13]
						"芬达么有糖-黑龙费尔默 雷霆一击 商山-逐风者 Hit -52 (Physical)", -- [14]
						"果不其然-逐风者 肉搏 商山-逐风者 Miss (1)", -- [15]
						"清风徐自来-火妖鲁西弗隆 铁皮手雷 商山-逐风者 Resist (Fire)", -- [16]
						"果不其然-逐风者 肉搏 商山-逐风者 Crit -125 (Physical)", -- [17]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -170 (Physical)", -- [18]
						"取名不能骚气-黑龙费尔默 铁皮手雷 商山-逐风者 Hit -207 (Fire)", -- [19]
						"火焰灬 冰霜新星 商山-逐风者 Hit -81 (Frost)", -- [20]
						"取名不能骚气-黑龙费尔默 暗影灼烧 商山-逐风者 Crit -1455 (Shadow)", -- [21]
						"商山-逐风者 圣疗术 特变电工 Hit +3911", -- [22]
						"火焰灬 冰锥术 商山-逐风者 Crit -1002 (Frost)", -- [23]
						"商山-逐风者死亡。", -- [24]
					},
					["DeathAt"] = 22038.33,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-13.06700000000274, -- [1]
						-11.56700000000274, -- [2]
						-11.18400000000111, -- [3]
						-10.30099999999948, -- [4]
						-9.467000000000553, -- [5]
						-9.334000000002561, -- [6]
						-8.817000000002736, -- [7]
						-8.317000000002736, -- [8]
						-7.751000000000204, -- [9]
						-7.700000000000728, -- [10]
						-6.117000000002008, -- [11]
						-6.05000000000291, -- [12]
						-5.100000000002183, -- [13]
						-5.067000000002736, -- [14]
						-4.350000000002183, -- [15]
						-3.56000000000131, -- [16]
						-2.63300000000163, -- [17]
						-2.5, -- [18]
						-1.632000000001426, -- [19]
						-1.516999999999825, -- [20]
						-1.367000000002008, -- [21]
						-1.317000000002736, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["HealthMax"] = {
						3911, -- [1]
						3911, -- [2]
						3911, -- [3]
						3911, -- [4]
						3911, -- [5]
						3911, -- [6]
						3911, -- [7]
						3911, -- [8]
						3911, -- [9]
						3911, -- [10]
						3911, -- [11]
						3911, -- [12]
						3911, -- [13]
						3911, -- [14]
						3911, -- [15]
						3911, -- [16]
						3911, -- [17]
						3911, -- [18]
						3911, -- [19]
						3911, -- [20]
						3911, -- [21]
						3911, -- [22]
						3911, -- [23]
						3911, -- [24]
					},
					["Health"] = {
						3881, -- [1]
						3881, -- [2]
						3881, -- [3]
						3662, -- [4]
						3481, -- [5]
						3481, -- [6]
						3314, -- [7]
						3067, -- [8]
						2867, -- [9]
						2805, -- [10]
						2622, -- [11]
						2622, -- [12]
						2565, -- [13]
						2406, -- [14]
						2354, -- [15]
						2354, -- [16]
						2354, -- [17]
						2354, -- [18]
						2059, -- [19]
						1852, -- [20]
						1771, -- [21]
						1771, -- [22]
						316, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "火焰灬",
					["MessageType"] = {
						"HEAL", -- [1]
						"HEAL", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"HEAL", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
					},
					["Messages"] = {
						"果不其然-逐风者 速效毒药 III 商山-逐风者 Resist (Nature)", -- [1]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -184 (Physical)", -- [2]
						"果不其然-逐风者 肉搏 商山-逐风者 Miss (1)", -- [3]
						"果不其然-逐风者 出血 商山-逐风者 Hit -186 (Physical)", -- [4]
						"果不其然-逐风者 出血 商山-逐风者 Hit -186 (Physical)", -- [5]
						"果不其然-逐风者 肉搏 商山-逐风者 Miss (1)", -- [6]
						"果不其然-逐风者 肉搏 商山-逐风者 Miss (1)", -- [7]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -66 (Physical)", -- [8]
						"果不其然-逐风者 出血 商山-逐风者 Crit -524 (Physical)", -- [9]
						"果不其然-逐风者 速效毒药 III 商山-逐风者 Hit -45 (Nature)", -- [10]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -215 (Physical)", -- [11]
						"果不其然-逐风者 速效毒药 III 商山-逐风者 Hit -45 (Nature)", -- [12]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -63 (Physical)", -- [13]
						"果不其然-逐风者 致残毒药 商山-逐风者 Resist (Nature)", -- [14]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -61 (Physical)", -- [15]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -211 (Physical)", -- [16]
						"果不其然-逐风者 凿击 商山-逐风者 Hit -43 (Physical)", -- [17]
						"果不其然-逐风者 肉搏 商山-逐风者 Crit -385 (Physical)", -- [18]
						"果不其然-逐风者 出血 商山-逐风者 Hit -202 (Physical)", -- [19]
						"果不其然-逐风者 速效毒药 III 商山-逐风者 Hit -50 (Nature)", -- [20]
						"果不其然-逐风者 肉搏 商山-逐风者 Hit -63 (Physical)", -- [21]
						"果不其然-逐风者 刺骨 商山-逐风者 Crit -1049 (Physical)", -- [22]
						"商山-逐风者死亡。", -- [23]
					},
					["DeathAt"] = 21908.34,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
					},
					["MessageTimes"] = {
						-14.91799999999785, -- [1]
						-14.91799999999785, -- [2]
						-14.05099999999948, -- [3]
						-13.93499999999767, -- [4]
						-12.91799999999785, -- [5]
						-12.35099999999875, -- [6]
						-12.30099999999948, -- [7]
						-10.65099999999802, -- [8]
						-10.53399999999965, -- [9]
						-10.53399999999965, -- [10]
						-9.700999999997293, -- [11]
						-9.700999999997293, -- [12]
						-8.950999999997293, -- [13]
						-7.217999999997119, -- [14]
						-7.217999999997119, -- [15]
						-7.100999999998749, -- [16]
						-5.883999999998196, -- [17]
						-2.200999999997293, -- [18]
						-2.200999999997293, -- [19]
						-2.200999999997293, -- [20]
						-1.341999999996915, -- [21]
						-0.01699999999982538, -- [22]
						0, -- [23]
					},
					["HealthMax"] = {
						3911, -- [1]
						3911, -- [2]
						3911, -- [3]
						3911, -- [4]
						3911, -- [5]
						3911, -- [6]
						3911, -- [7]
						3911, -- [8]
						3911, -- [9]
						3911, -- [10]
						3911, -- [11]
						3911, -- [12]
						3911, -- [13]
						3911, -- [14]
						3911, -- [15]
						3911, -- [16]
						3911, -- [17]
						3911, -- [18]
						3911, -- [19]
						3911, -- [20]
						3911, -- [21]
						3911, -- [22]
						3911, -- [23]
					},
					["Health"] = {
						3473, -- [1]
						3473, -- [2]
						3289, -- [3]
						3289, -- [4]
						3103, -- [5]
						2917, -- [6]
						2917, -- [7]
						2917, -- [8]
						2851, -- [9]
						2851, -- [10]
						2282, -- [11]
						2282, -- [12]
						2022, -- [13]
						1959, -- [14]
						1959, -- [15]
						1959, -- [16]
						1687, -- [17]
						1644, -- [18]
						1644, -- [19]
						1644, -- [20]
						1007, -- [21]
						944, -- [22]
						0, -- [23]
					},
					["KilledBy"] = "果不其然-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"MISC", -- [23]
					},
				}, -- [3]
			},
			["level"] = 60,
			["LastDamageAbility"] = "铁皮手雷",
			["LastFightIn"] = 12,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				3911, -- [1]
				3911, -- [2]
				3911, -- [3]
				3911, -- [4]
				3911, -- [5]
				3911, -- [6]
				3911, -- [7]
				3911, -- [8]
				3911, -- [9]
				3911, -- [10]
				3911, -- [11]
				3911, -- [12]
				3911, -- [13]
				3911, -- [14]
				3911, -- [15]
				3911, -- [16]
				3911, -- [17]
				3911, -- [18]
				3911, -- [19]
				3911, -- [20]
				3911, -- [21]
				3911, -- [22]
				3911, -- [23]
				3911, -- [24]
				3911, -- [25]
				3911, -- [26]
				3911, -- [27]
				3911, -- [28]
				3911, -- [29]
				3911, -- [30]
				3911, -- [31]
				3911, -- [32]
				3911, -- [33]
				3911, -- [34]
				3911, -- [35]
				3911, -- [36]
				3911, -- [37]
				3911, -- [38]
				3911, -- [39]
				3911, -- [40]
				3911, -- [41]
				3911, -- [42]
				3911, -- [43]
				3911, -- [44]
				3911, -- [45]
				3911, -- [46]
				3911, -- [47]
				3911, -- [48]
				3911, -- [49]
				3911, -- [50]
			},
			["LastHealTime"] = 23542.066,
			["LastDamageTaken"] = 133,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 23541.332,
				["Dispelled"] = 23194.329,
				["Dispels"] = 23530.335,
				["OVERALL"] = 23541.332,
				["DamageTaken"] = 23491.33,
				["DeathCount"] = 23342.338,
				["HealingTaken"] = 23403.325,
				["Overhealing"] = 23486.329,
				["ActiveTime"] = 23541.332,
				["Healing"] = 23541.332,
				["ManaGain"] = 23508.33,
				["TimeDamage"] = 23310.336,
				["Damage"] = 23310.336,
			},
			["NextEventNum"] = 14,
			["LastDamageTime"] = 23311.086,
			["LastEvents"] = {
				"阿拉希的传说-火妖鲁西弗隆 肉搏 商山-逐风者 Hit -65 (Physical)", -- [1]
				"阿拉希的传说-火妖鲁西弗隆 肉搏 商山-逐风者 Crit -257 (Physical)", -- [2]
				"商山-逐风者 圣光闪现 诺沉遗士 Crit +1131", -- [3]
				"商山-逐风者 圣光闪现 诺沉遗士 Hit +738 (648 过量治疗)", -- [4]
				"商山-逐风者 圣光闪现 特变电工 Crit +1108 (391 过量治疗)", -- [5]
				"商山-逐风者 dispels 灌篮高手-逐风者 腐蚀术 (清洁术)", -- [6]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Crit +1135", -- [7]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Crit +1092 (226 过量治疗)", -- [8]
				"火焰灬 铁皮手雷 商山-逐风者 Hit -133 (Fire)", -- [9]
				"商山-逐风者 圣光闪现 哔哔妹-老马布兰契 Hit +769", -- [10]
				"商山-逐风者 圣光闪现 晨晨啊 Crit +1036", -- [11]
				"商山-逐风者 dispels 特变电工 侦测魔法 (清洁术)", -- [12]
				"商山-逐风者 圣光闪现 特变电工 Hit +726", -- [13]
				"火焰新星图腾 V 火焰新星 商山-逐风者 Hit -531 (Fire)", -- [14]
				"商山-逐风者 圣光闪现 特变电工 Hit +770", -- [15]
				"商山-逐风者 圣光闪现 商山-逐风者 Hit +731 (200 过量治疗)", -- [16]
				"二道沟子靓仔-逐风者 肉搏 商山-逐风者 Crit -392 (Physical)", -- [17]
				"二道沟子靓仔-逐风者 地震术 商山-逐风者 Hit -586 (Nature)", -- [18]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 商山-逐风者 Tick -235 (Shadow)", -- [19]
				"乌勒哈姆 interrupts 商山-逐风者 圣光闪现 (法术封锁)", -- [20]
				"二道沟子靓仔-逐风者 地震术 商山-逐风者 Hit -581 (Nature)", -- [21]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 商山-逐风者 Tick -72 (Shadow)", -- [22]
				"二道沟子靓仔-逐风者 肉搏 商山-逐风者 Hit -198 (Physical)", -- [23]
				"取名不能骚气-黑龙费尔默 献祭 商山-逐风者 Hit -370 (Fire)", -- [24]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 商山-逐风者 Tick -235 (Shadow)", -- [25]
				"取名不能骚气-黑龙费尔默 灼热之痛 商山-逐风者 Crit -850 (Fire)", -- [26]
				"取名不能骚气-黑龙费尔默 生命虹吸 (伤害/跳) 商山-逐风者 Tick -73 (Shadow)", -- [27]
				"取名不能骚气-黑龙费尔默 献祭 (伤害/跳) 商山-逐风者 Tick -161 (Fire)", -- [28]
				"取名不能骚气-黑龙费尔默 腐蚀术 (伤害/跳) 商山-逐风者 Tick -234 (Shadow)", -- [29]
				"商山-逐风者死亡。", -- [30]
				"商山-逐风者 圣光闪现 特变电工 Hit +730 (211 过量治疗)", -- [31]
				"商山-逐风者 圣光闪现 晨晨啊 Hit +683 (334 过量治疗)", -- [32]
				"商山-逐风者 圣光闪现 商山-逐风者 Hit +772 (235 过量治疗)", -- [33]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Hit +767", -- [34]
				"商山-逐风者 圣光闪现 灌篮高手-逐风者 Crit +1108 (476 过量治疗)", -- [35]
				"商山-逐风者 圣光闪现 特变电工 Hit +752 (112 过量治疗)", -- [36]
				"商山-逐风者 圣光闪现 特变电工 Hit +740", -- [37]
				"商山-逐风者 圣光闪现 特变电工 Hit +731", -- [38]
				"商山-逐风者 圣光闪现 特变电工 Hit +769", -- [39]
				"商山-逐风者 圣光闪现 特变电工 Hit +737", -- [40]
				"商山-逐风者 圣光闪现 晨晨啊 Hit +654", -- [41]
				"商山-逐风者 圣光闪现 晨晨啊 Hit +693 (575 过量治疗)", -- [42]
				"商山-逐风者 圣光闪现 特变电工 Crit +1092", -- [43]
				"商山-逐风者 圣光闪现 特变电工 Hit +768", -- [44]
				"商山-逐风者 dispels 特变电工 生命虹吸 (清洁术)", -- [45]
				"商山-逐风者 圣光闪现 已鱼 Hit +734", -- [46]
				"商山-逐风者 圣光闪现 已鱼 Hit +767", -- [47]
				"阿拉希的传说-火妖鲁西弗隆 肉搏 商山-逐风者 Hit -114 (Physical)", -- [48]
				"阿拉希的传说-火妖鲁西弗隆 肉搏 商山-逐风者 Hit -70 (Physical)", -- [49]
				"阿拉希的传说-火妖鲁西弗隆 刺骨 商山-逐风者 Hit -276 (Physical)", -- [50]
			},
			["Name"] = "商山-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				23453.511, -- [1]
				23453.627, -- [2]
				23460.394, -- [3]
				23461.861, -- [4]
				23463.378, -- [5]
				23475.529, -- [6]
				23478.546, -- [7]
				23487.263, -- [8]
				23492.296, -- [9]
				23501.464, -- [10]
				23508.73, -- [11]
				23530.882, -- [12]
				23542.066, -- [13]
				23327.137, -- [14]
				23327.97, -- [15]
				23331.07, -- [16]
				23331.404, -- [17]
				23331.887, -- [18]
				23337.087, -- [19]
				23337.771, -- [20]
				23338.504, -- [21]
				23338.571, -- [22]
				23338.871, -- [23]
				23339.388, -- [24]
				23340.071, -- [25]
				23340.954, -- [26]
				23341.571, -- [27]
				23342.388, -- [28]
				23343.088, -- [29]
				23343.104, -- [30]
				23397.224, -- [31]
				23401.258, -- [32]
				23403.741, -- [33]
				23418.659, -- [34]
				23420.159, -- [35]
				23421.709, -- [36]
				23432.843, -- [37]
				23434.36, -- [38]
				23435.86, -- [39]
				23437.377, -- [40]
				23438.86, -- [41]
				23440.377, -- [42]
				23441.877, -- [43]
				23443.377, -- [44]
				23445.327, -- [45]
				23448.627, -- [46]
				23450.127, -- [47]
				23450.811, -- [48]
				23451.711, -- [49]
				23452.344, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 13187,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 14,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 4,
								},
							},
							["amount"] = 26,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 10,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 2048,
						["Melee"] = 3291,
						["Frost"] = 554,
						["Fire"] = 2833,
						["Physical"] = 1709,
						["Nature"] = 2752,
					},
					["DOT_Time"] = 0,
					["Damage"] = 277,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 77.91,
					["RessedWho"] = {
					},
					["Dispels"] = 3,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 277,
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["脚踢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 26,
									["amount"] = 0,
								},
							},
							["count"] = 26,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 277,
								},
							},
							["amount"] = 277,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1199,
								},
							},
							["amount"] = 1199,
						},
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 267,
								},
							},
							["amount"] = 267,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["速效毒药 III"] = {
									["count"] = 54,
								},
								["出血"] = {
									["count"] = 154,
								},
								["肉搏"] = {
									["count"] = 490,
								},
							},
							["amount"] = 698,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 145,
								},
								["灼热之痛"] = {
									["count"] = 850,
								},
								["献祭"] = {
									["count"] = 370,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 704,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 161,
								},
							},
							["amount"] = 2230,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 554,
								},
								["闪电之盾"] = {
									["count"] = 238,
								},
								["地震术"] = {
									["count"] = 2352,
								},
								["风暴打击"] = {
									["count"] = 195,
								},
								["肉搏"] = {
									["count"] = 1439,
								},
							},
							["amount"] = 4778,
						},
						["火焰灬"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 133,
								},
							},
							["amount"] = 133,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["脚踢"] = {
									["count"] = 40,
								},
								["邪恶攻击"] = {
									["count"] = 158,
								},
								["刺骨"] = {
									["count"] = 1162,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 108,
								},
								["肉搏"] = {
									["count"] = 1362,
								},
							},
							["amount"] = 2830,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1052,
								},
							},
							["amount"] = 1052,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["脚踢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 26,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 26,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["哔哔妹-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 34.46,
								},
							},
							["amount"] = 35.96,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 5.97,
								},
							},
							["amount"] = 5.97,
						},
						["已鱼"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["晨晨啊"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 5.98,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.5,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["OverHeals"] = {
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 476,
									["min"] = 166,
									["count"] = 4,
									["amount"] = 1259,
								},
								["Hit"] = {
									["max"] = 648,
									["min"] = 112,
									["count"] = 9,
									["amount"] = 2962,
								},
							},
							["count"] = 13,
							["amount"] = 4221,
						},
					},
					["ManaGainedFrom"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["启发"] = {
									["count"] = 1540,
								},
							},
							["amount"] = 1540,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["哔哔妹-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 769,
								},
							},
							["amount"] = 769,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 527,
								},
								["圣光闪现"] = {
									["count"] = 17022,
								},
							},
							["amount"] = 17549,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3400,
								},
							},
							["amount"] = 3400,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2703,
								},
							},
							["amount"] = 2703,
						},
						["已鱼"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1501,
								},
							},
							["amount"] = 1501,
						},
						["晨晨啊"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2157,
								},
							},
							["amount"] = 2157,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8677,
								},
							},
							["amount"] = 8677,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1385,
								},
							},
							["amount"] = 1385,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["启发"] = {
							["Details"] = {
								["商山-逐风者"] = {
									["count"] = 1540,
								},
							},
							["amount"] = 1540,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 4221,
					["TimeSpent"] = {
						["哔哔妹-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 34.46,
								},
							},
							["amount"] = 35.96,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["晨晨啊"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 5.98,
								},
							},
							["amount"] = 5.98,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 5.97,
								},
							},
							["amount"] = 5.97,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.5,
						},
						["已鱼"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["王者祝福 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["神圣震击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 527,
									["min"] = 527,
									["count"] = 1,
									["amount"] = 527,
								},
							},
							["count"] = 1,
							["amount"] = 527,
						},
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1135,
									["min"] = 632,
									["count"] = 11,
									["amount"] = 10883,
								},
								["Hit"] = {
									["max"] = 772,
									["min"] = 90,
									["count"] = 40,
									["amount"] = 26731,
								},
							},
							["count"] = 51,
							["amount"] = 37614,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8677,
								},
							},
							["amount"] = 8677,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 80.91,
					["Healing"] = 38141,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 142,
									["min"] = 135,
									["count"] = 2,
									["amount"] = 277,
								},
							},
							["count"] = 2,
							["amount"] = 277,
						},
					},
					["HealingTaken"] = 8677,
					["RageGain"] = 0,
					["TimeDamage"] = 3,
					["TimeDamaging"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 1540,
					["HOTs"] = {
					},
					["DispelledWho"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["特变电工"] = {
							["Details"] = {
								["生命虹吸 (清洁术)"] = {
									["count"] = 1,
								},
								["侦测魔法 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 30,
								},
							},
							["amount"] = 47,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 13,
								},
								["Immune"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 22,
								},
								["Hit"] = {
									["count"] = 71,
								},
							},
							["amount"] = 120,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 30,
								},
							},
							["amount"] = 32,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 17,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 17,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 9,
								},
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 18,
								},
							},
							["amount"] = 35,
						},
					},
					["WhoHealed"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1322,
								},
								["圣光闪现"] = {
									["count"] = 23560,
								},
							},
							["amount"] = 24882,
						},
					},
					["ElementTakenResist"] = {
						["Shadow"] = 117,
					},
					["DeathCount"] = 3,
					["Overhealing"] = 21416,
					["ElementTaken"] = {
						["Physical"] = 10150,
						["Melee"] = 13102,
						["Arcane"] = 1191,
						["Shadow"] = 6683,
						["Fire"] = 3921,
						["Frost"] = 3687,
						["Nature"] = 4449,
					},
					["Damage"] = 1608,
					["TimeHeal"] = 290.79,
					["Dispels"] = 17,
					["ElementDone"] = {
						["Melee"] = 1358,
						["Holy"] = 250,
					},
					["ManaGainedFrom"] = {
						["商山-逐风者"] = {
							["Details"] = {
								["启发"] = {
									["count"] = 6895,
								},
							},
							["amount"] = 6895,
						},
					},
					["WhoDamaged"] = {
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1599,
								},
							},
							["amount"] = 1599,
						},
						["熔岩图腾 IV"] = {
							["Details"] = {
								["熔岩图腾"] = {
									["count"] = 267,
								},
							},
							["amount"] = 267,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 415,
								},
								["肉搏"] = {
									["count"] = 539,
								},
								["嗜血"] = {
									["count"] = 259,
								},
								["雷霆一击"] = {
									["count"] = 117,
								},
							},
							["amount"] = 1330,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 1455,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 765,
								},
								["灼热之痛"] = {
									["count"] = 850,
								},
								["铁皮手雷"] = {
									["count"] = 421,
								},
								["献祭"] = {
									["count"] = 370,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2864,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 161,
								},
							},
							["amount"] = 6886,
						},
						["作战小鸡"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 156,
								},
							},
							["amount"] = 156,
						},
						["古德斯尼-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1191,
								},
								["冰锥术"] = {
									["count"] = 516,
								},
								["冰霜新星"] = {
									["count"] = 341,
								},
							},
							["amount"] = 2048,
						},
						["果不其然-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 1049,
								},
								["凿击"] = {
									["count"] = 43,
								},
								["速效毒药 III"] = {
									["count"] = 355,
								},
								["出血"] = {
									["count"] = 2952,
								},
								["肉搏"] = {
									["count"] = 4538,
								},
							},
							["amount"] = 8937,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1282,
								},
							},
							["amount"] = 1282,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 238,
								},
								["冰霜震击"] = {
									["count"] = 1108,
								},
								["肉搏"] = {
									["count"] = 3261,
								},
								["地震术"] = {
									["count"] = 3067,
								},
								["铁皮手雷"] = {
									["count"] = 153,
								},
								["风暴打击"] = {
									["count"] = 817,
								},
							},
							["amount"] = 8644,
						},
						["火焰灬"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1002,
								},
								["寒冰箭"] = {
									["count"] = 639,
								},
								["铁皮手雷"] = {
									["count"] = 133,
								},
								["冰霜新星"] = {
									["count"] = 81,
								},
							},
							["amount"] = 1855,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["脚踢"] = {
									["count"] = 161,
								},
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 108,
								},
								["刺骨"] = {
									["count"] = 1975,
								},
								["邪恶攻击"] = {
									["count"] = 1043,
								},
								["速效毒药 VI"] = {
									["count"] = 681,
								},
								["凿击"] = {
									["count"] = 37,
								},
								["肉搏"] = {
									["count"] = 4608,
								},
							},
							["amount"] = 8613,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 1566,
								},
							},
							["amount"] = 1566,
						},
					},
					["TimeHealing"] = {
						["哔哔妹-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
								["神圣震击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 7.5,
								},
								["圣光术"] = {
									["count"] = 6,
								},
								["圣疗术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 98.87,
								},
							},
							["amount"] = 113.87,
						},
						["熊一-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 17.99,
								},
							},
							["amount"] = 17.99,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["一箭情封-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6,
						},
						["已鱼"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.5,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 46.45,
								},
							},
							["amount"] = 47.95,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 3,
								},
								["圣光闪现"] = {
									["count"] = 48,
								},
							},
							["amount"] = 51,
						},
						["晨晨啊"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8.98,
								},
							},
							["amount"] = 8.98,
						},
					},
					["OverHeals"] = {
						["圣光术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 381,
									["min"] = 381,
									["count"] = 1,
									["amount"] = 381,
								},
							},
							["count"] = 1,
							["amount"] = 381,
						},
						["神圣震击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 790,
									["min"] = 86,
									["count"] = 3,
									["amount"] = 1038,
								},
							},
							["count"] = 3,
							["amount"] = 1038,
						},
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1033,
									["min"] = 83,
									["count"] = 15,
									["amount"] = 6652,
								},
								["Hit"] = {
									["max"] = 769,
									["min"] = 18,
									["count"] = 39,
									["amount"] = 13345,
								},
							},
							["count"] = 54,
							["amount"] = 19997,
						},
					},
					["PartialResist"] = {
						["法术封锁"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["脚踢"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["嗜血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
								["50% 抵抗"] = {
									["max"] = 117,
									["min"] = 117,
									["count"] = 1,
									["amount"] = 117,
								},
							},
							["count"] = 117,
							["amount"] = 12,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 120,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 120,
						},
					},
					["ManaGained"] = {
						["启发"] = {
							["Details"] = {
								["商山-逐风者"] = {
									["count"] = 6895,
								},
							},
							["amount"] = 6895,
						},
					},
					["PartialAbsorb"] = {
						["法术封锁"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["熔岩图腾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["速效毒药 III"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["脚踢"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["嗜血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 120,
									["amount"] = 0,
								},
							},
							["count"] = 120,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 308.7900000000001,
					["WhoDispelled"] = {
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["王者祝福 (净化术)"] = {
									["count"] = 2,
								},
								["野性印记 (净化术)"] = {
									["count"] = 1,
								},
								["奥术光辉 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["草莓尐布丁-火妖鲁西弗隆"] = {
							["Details"] = {
								["王者祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["生命虹吸 (清洁术)"] = {
									["count"] = 1,
								},
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
								["地缚术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["语言诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["圣光术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2077,
									["min"] = 1655,
									["count"] = 4,
									["amount"] = 7777,
								},
							},
							["count"] = 4,
							["amount"] = 7777,
						},
						["神圣震击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 798,
									["min"] = 616,
									["count"] = 6,
									["amount"] = 4473,
								},
								["Hit"] = {
									["max"] = 534,
									["min"] = 523,
									["count"] = 4,
									["amount"] = 2116,
								},
							},
							["count"] = 10,
							["amount"] = 6589,
						},
						["圣疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 3911,
									["min"] = 3911,
									["count"] = 1,
									["amount"] = 3911,
								},
							},
							["count"] = 1,
							["amount"] = 3911,
						},
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1154,
									["min"] = 96,
									["count"] = 38,
									["amount"] = 35760,
								},
								["Hit"] = {
									["max"] = 772,
									["min"] = 2,
									["count"] = 141,
									["amount"] = 93813,
								},
							},
							["count"] = 179,
							["amount"] = 129573,
						},
					},
					["Dispelled"] = 9,
					["DamagedWho"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 238,
								},
							},
							["amount"] = 238,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 250,
								},
								["肉搏"] = {
									["count"] = 130,
								},
							},
							["amount"] = 380,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 277,
								},
							},
							["amount"] = 277,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 490,
								},
							},
							["amount"] = 490,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 223,
								},
							},
							["amount"] = 223,
						},
					},
					["Healing"] = 147850,
					["TimeSpent"] = {
						["哔哔妹-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
								["神圣震击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 7.5,
								},
								["圣光术"] = {
									["count"] = 6,
								},
								["圣疗术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 98.87,
								},
							},
							["amount"] = 113.87,
						},
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["熊一-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 17.99,
								},
							},
							["amount"] = 17.99,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["一箭情封-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 6,
						},
						["已鱼"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 16.5,
								},
							},
							["amount"] = 16.5,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 46.45,
								},
							},
							["amount"] = 47.95,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 3,
								},
								["圣光闪现"] = {
									["count"] = 48,
								},
							},
							["amount"] = 51,
						},
						["晨晨啊"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8.98,
								},
							},
							["amount"] = 8.98,
						},
					},
					["DamageTaken"] = 43183,
					["Attacks"] = {
						["神圣震击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 1,
									["amount"] = 250,
								},
							},
							["count"] = 1,
							["amount"] = 250,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 179,
									["min"] = 95,
									["count"] = 10,
									["amount"] = 1358,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 1358,
						},
					},
					["HealingTaken"] = 24882,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 10,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 11,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 18,
					["TimeDamaging"] = {
						["芬达么有糖-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["取名不能骚气-黑龙费尔默"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["二道沟子靓仔-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["阿拉希的传说-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["龍雲卿"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 6895,
					["HealedWho"] = {
						["哔哔妹-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 769,
								},
								["神圣震击"] = {
									["count"] = 616,
								},
							},
							["amount"] = 1385,
						},
						["特变电工"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 3332,
								},
								["圣光术"] = {
									["count"] = 7777,
								},
								["圣疗术"] = {
									["count"] = 3911,
								},
								["圣光闪现"] = {
									["count"] = 48060,
								},
							},
							["amount"] = 63080,
						},
						["熊一-老马布兰契"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8741,
								},
							},
							["amount"] = 8741,
						},
						["莫妍-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2334,
								},
							},
							["amount"] = 2334,
						},
						["一箭情封-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 787,
								},
								["圣光闪现"] = {
									["count"] = 2112,
								},
							},
							["amount"] = 2899,
						},
						["已鱼"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8920,
								},
							},
							["amount"] = 8920,
						},
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 8017,
								},
							},
							["amount"] = 8017,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 532,
								},
								["圣光闪现"] = {
									["count"] = 23191,
								},
							},
							["amount"] = 23723,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["神圣震击"] = {
									["count"] = 1322,
								},
								["圣光闪现"] = {
									["count"] = 23560,
								},
							},
							["amount"] = 24882,
						},
						["晨晨啊"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3869,
								},
							},
							["amount"] = 3869,
						},
					},
					["DispelledWho"] = {
						["灌篮高手-逐风者"] = {
							["Details"] = {
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["特变电工"] = {
							["Details"] = {
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
								["侦测魔法 (清洁术)"] = {
									["count"] = 1,
								},
								["生命虹吸 (清洁术)"] = {
									["count"] = 1,
								},
								["腐蚀术 (清洁术)"] = {
									["count"] = 2,
								},
								["精灵之火 (清洁术)"] = {
									["count"] = 1,
								},
								["噬灵瘟疫 (纯净术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
						["商山-逐风者"] = {
							["Details"] = {
								["生命虹吸 (清洁术)"] = {
									["count"] = 1,
								},
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
								["地缚术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["诺沉遗士"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["冰霜震击 (清洁术)"] = {
									["count"] = 1,
								},
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
								["致命毒药 IV (纯净术)"] = {
									["count"] = 2,
								},
								["噬灵瘟疫 (纯净术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
					},
				},
			},
			["UnitLockout"] = 21736.33,
			["LastActive"] = 23541.332,
		},
	},
	["FightNum"] = 13,
	["CombatTimes"] = {
		{
			21755.331, -- [1]
			21837.336, -- [2]
			"19:14:30", -- [3]
			"19:15:52", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [1]
		{
			21837.336, -- [1]
			21944.325, -- [2]
			"19:15:52", -- [3]
			"19:17:39", -- [4]
			"芬达么有糖-黑龙费尔默", -- [5]
		}, -- [2]
		{
			21971.327, -- [1]
			22073.332, -- [2]
			"19:18:06", -- [3]
			"19:19:48", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [3]
		{
			22111.335, -- [1]
			22208.34, -- [2]
			"19:20:27", -- [3]
			"19:22:03", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [4]
		{
			22212.324, -- [1]
			22219.324, -- [2]
			"19:22:07", -- [3]
			"19:22:14", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [5]
		{
			22232.325, -- [1]
			22264.327, -- [2]
			"19:22:27", -- [3]
			"19:22:59", -- [4]
			"Environment", -- [5]
		}, -- [6]
		{
			22301.329, -- [1]
			22379.333, -- [2]
			"19:23:36", -- [3]
			"19:24:54", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [7]
		{
			22398.334, -- [1]
			22417.335, -- [2]
			"19:25:13", -- [3]
			"19:25:32", -- [4]
			"Environment", -- [5]
		}, -- [8]
		{
			22442.339, -- [1]
			22543.326, -- [2]
			"19:25:57", -- [3]
			"19:27:38", -- [4]
			"芬达么有糖-黑龙费尔默", -- [5]
		}, -- [9]
		{
			22575.328, -- [1]
			22745.337, -- [2]
			"19:28:10", -- [3]
			"19:31:00", -- [4]
			"古德斯尼-逐风者", -- [5]
		}, -- [10]
		{
			22751.338, -- [1]
			22869.328, -- [2]
			"19:31:07", -- [3]
			"19:33:04", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [11]
		{
			22877.328, -- [1]
			23164.328, -- [2]
			"19:33:13", -- [3]
			"19:37:59", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [12]
		{
			23170.328, -- [1]
			23543.332, -- [2]
			"19:38:06", -- [3]
			"19:44:18", -- [4]
			"取名不能骚气-黑龙费尔默", -- [5]
		}, -- [13]
	},
	["FoughtWho"] = {
	},
}
