
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						false, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						false, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						false, -- [44]
						true, -- [45]
						false, -- [46]
						true, -- [47]
						true, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"丷光头强丷 出血 特变电工 Hit -117 (Physical)", -- [1]
						"Environment Falling 特变电工 Hit -1175 (Physical)", -- [2]
						"丷光头强丷 肾击 特变电工 Immune (Physical)", -- [3]
						"丷光头强丷 肉搏 特变电工 Crit -169 (Physical)", -- [4]
						"丷光头强丷 肉搏 特变电工 Parry (1)", -- [5]
						"特变电工 肉搏 丷光头强丷 Hit -471 (Physical)", -- [6]
						"特变电工 嗜血 特变电工 Hit +20", -- [7]
						"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -25 (Nature)", -- [8]
						"特变电工 重伤 (伤害/跳) 丷光头强丷 Tick -90 (Physical)", -- [9]
						"紫衣战天下 dispels 特变电工 自由行动 (驱散魔法)", -- [10]
						"丷光头强丷 肉搏 特变电工 Hit -60 (Physical)", -- [11]
						"丷光头强丷 肉搏 特变电工 Miss (1)", -- [12]
						"目空一切-逐风者 风暴打击 特变电工 Hit -264 (Physical)", -- [13]
						"特变电工 断筋 丷光头强丷 Hit -42 (Physical)", -- [14]
						"特变电工 嗜血 特变电工 Hit +20", -- [15]
						"目空一切-逐风者 肉搏 特变电工 Hit -266 (Physical)", -- [16]
						"目空一切-逐风者 肉搏 特变电工 Hit -337 (Physical)", -- [17]
						"目空一切-逐风者 肉搏 特变电工 Hit -348 (Physical)", -- [18]
						"特变电工 肉搏 丷光头强丷 Crit -1082 (Physical)", -- [19]
						"特变电工 嗜血 特变电工 Hit +20", -- [20]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -353 (Shadow)", -- [21]
						"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -36 (Nature)", -- [22]
						"目空一切-逐风者 地震术 特变电工 Resist (Nature)", -- [23]
						"丷光头强丷 肉搏 特变电工 Hit -57 (Physical)", -- [24]
						"特变电工 嗜血 丷光头强丷 Hit -533 (Physical)", -- [25]
						"特变电工 嗜血 特变电工 Hit +20", -- [26]
						"丷光头强丷 肉搏 特变电工 Miss (1)", -- [27]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -348 (Shadow)", -- [28]
						"紫衣战天下 心灵震爆 特变电工 Hit -707 (Shadow)", -- [29]
						"特变电工 英勇打击 丷光头强丷 Crit -1652 (Physical)", -- [30]
						"特变电工 嗜血 特变电工 Hit +20", -- [31]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -348 (Shadow)", -- [32]
						"特变电工 生命赐福 特变电工 Hit +1073", -- [33]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -364 (Shadow)", -- [34]
						"目空一切-逐风者 肉搏 特变电工 Parry (1)", -- [35]
						"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -36 (Nature)", -- [36]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -348 (Shadow)", -- [37]
						"村里老中医-黑龙费尔默 月火术 特变电工 Hit -227 (Arcane)", -- [38]
						"特变电工 拦截昏迷 牧老-火妖鲁西弗隆 Hit -44 (Physical)", -- [39]
						"牧老-火妖鲁西弗隆 暗影守卫 特变电工 Hit -396 (Shadow)", -- [40]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -375 (Shadow)", -- [41]
						"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -36 (Nature)", -- [42]
						"村里老中医-黑龙费尔默 月火术 (伤害/跳) 特变电工 Tick -111 (Arcane)", -- [43]
						"特变电工 肉搏 牧老-火妖鲁西弗隆 Hit -391 (Physical)", -- [44]
						"特变电工 嗜血 特变电工 Hit +20", -- [45]
						"特变电工 嗜血 牧老-火妖鲁西弗隆 Hit -420 (Physical)", -- [46]
						"特变电工 嗜血 特变电工 Hit +20", -- [47]
						"牧老-火妖鲁西弗隆 暗影守卫 特变电工 Hit -407 (Shadow)", -- [48]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -385 (Shadow)", -- [49]
						"特变电工死亡。", -- [50]
					},
					["DeathAt"] = 5115.513,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-13.73499999999967, -- [1]
						-13.0619999999999, -- [2]
						-12.63499999999931, -- [3]
						-12.45199999999932, -- [4]
						-12.05199999999968, -- [5]
						-12.01499999999942, -- [6]
						-11.98499999999967, -- [7]
						-11.70199999999932, -- [8]
						-11.66799999999967, -- [9]
						-11.28499999999985, -- [10]
						-9.734999999999673, -- [11]
						-9.652000000000044, -- [12]
						-9.617999999999483, -- [13]
						-9.43499999999949, -- [14]
						-9.411999999999352, -- [15]
						-9.335000000000036, -- [16]
						-9.335000000000036, -- [17]
						-9.335000000000036, -- [18]
						-9.30199999999968, -- [19]
						-9.30199999999968, -- [20]
						-9.034999999999854, -- [21]
						-8.717999999999847, -- [22]
						-8.117999999999483, -- [23]
						-7.934999999999491, -- [24]
						-7.917999999999665, -- [25]
						-7.917999999999665, -- [26]
						-7.634999999999309, -- [27]
						-7.550999999999476, -- [28]
						-7.234999999999673, -- [29]
						-6.600999999999658, -- [30]
						-6.578999999999724, -- [31]
						-6.550999999999476, -- [32]
						-6.382999999999811, -- [33]
						-6.034999999999855, -- [34]
						-5.934999999999491, -- [35]
						-5.717999999999847, -- [36]
						-5.550999999999476, -- [37]
						-5.335000000000036, -- [38]
						-5.184999999999491, -- [39]
						-4.317999999999302, -- [40]
						-3.034999999999855, -- [41]
						-2.717999999999847, -- [42]
						-2.335000000000036, -- [43]
						-1.233999999999469, -- [44]
						-1.233999999999469, -- [45]
						-1.167999999999665, -- [46]
						-1.146999999999935, -- [47]
						-1.117999999999483, -- [48]
						-0.03499999999985448, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
						6219, -- [25]
						6219, -- [26]
						6219, -- [27]
						6219, -- [28]
						6219, -- [29]
						6219, -- [30]
						6219, -- [31]
						6219, -- [32]
						6219, -- [33]
						7151, -- [34]
						7151, -- [35]
						7151, -- [36]
						7151, -- [37]
						7151, -- [38]
						7151, -- [39]
						7151, -- [40]
						7151, -- [41]
						7151, -- [42]
						7151, -- [43]
						7151, -- [44]
						7151, -- [45]
						7151, -- [46]
						7151, -- [47]
						7151, -- [48]
						7151, -- [49]
						6219, -- [50]
					},
					["Health"] = {
						4958, -- [1]
						4841, -- [2]
						3666, -- [3]
						3666, -- [4]
						3497, -- [5]
						3497, -- [6]
						3497, -- [7]
						3497, -- [8]
						3492, -- [9]
						3492, -- [10]
						3492, -- [11]
						3432, -- [12]
						3432, -- [13]
						3168, -- [14]
						3168, -- [15]
						3188, -- [16]
						3188, -- [17]
						3188, -- [18]
						3188, -- [19]
						2237, -- [20]
						2257, -- [21]
						1904, -- [22]
						1868, -- [23]
						1868, -- [24]
						1868, -- [25]
						1868, -- [26]
						1831, -- [27]
						1831, -- [28]
						1483, -- [29]
						776, -- [30]
						776, -- [31]
						796, -- [32]
						448, -- [33]
						2453, -- [34]
						2089, -- [35]
						2089, -- [36]
						2053, -- [37]
						1705, -- [38]
						1478, -- [39]
						1478, -- [40]
						1082, -- [41]
						707, -- [42]
						671, -- [43]
						560, -- [44]
						560, -- [45]
						580, -- [46]
						580, -- [47]
						600, -- [48]
						193, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "牧老-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"MISC", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"HEAL", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"HEAL", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"HEAL", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"HEAL", -- [31]
						"DAMAGE", -- [32]
						"HEAL", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"HEAL", -- [45]
						"DAMAGE", -- [46]
						"HEAL", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
					},
					["Messages"] = {
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -411 (Shadow)", -- [1]
						"特变电工 拦截昏迷 目空一切-逐风者 Absorb -42 (42 被吸收) (Physical)", -- [2]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -399 (Shadow)", -- [3]
						"特变电工 肉搏 目空一切-逐风者 Absorb -19 (1)", -- [4]
						"特变电工 肉搏 目空一切-逐风者 Hit -373 (19 被吸收) (Physical)", -- [5]
						"特变电工 嗜血 目空一切-逐风者 Crit -814 (Physical)", -- [6]
						"特变电工 嗜血 特变电工 Hit +20", -- [7]
						"特变电工 肉搏 目空一切-逐风者 Hit -354 (Physical)", -- [8]
						"特变电工 嗜血 特变电工 Hit +20", -- [9]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -400 (Shadow)", -- [10]
						"特变电工 重伤 (伤害/跳) 目空一切-逐风者 Tick -94 (Physical)", -- [11]
						"特变电工 斩杀 目空一切-逐风者 Hit -479 (Physical)", -- [12]
						"特变电工 嗜血 特变电工 Hit +20", -- [13]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -306 (Shadow)", -- [14]
						"特变电工 肉搏 延陵斩蛟-黑龙费尔默 Hit -253 (Physical)", -- [15]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -367 (Shadow)", -- [16]
						"李老三 暗言术：痛 (伤害/跳) 特变电工 Tick -290 (Shadow)", -- [17]
						"特变电工 断筋 延陵斩蛟-黑龙费尔默 Block (Physical)", -- [18]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -367 (Shadow)", -- [19]
						"延陵斩蛟-黑龙费尔默 肉搏 特变电工 Dodge (1)", -- [20]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -394 (Shadow)", -- [21]
						"延陵斩蛟-黑龙费尔默 断筋 特变电工 Hit -30 (Physical)", -- [22]
						"李老三 心灵震爆 特变电工 Hit -1003 (Shadow)", -- [23]
						"特变电工死亡。", -- [24]
					},
					["DeathAt"] = 4963.521,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-13.78299999999945, -- [1]
						-11.64999999999964, -- [2]
						-10.78299999999945, -- [3]
						-10.76699999999983, -- [4]
						-10.76699999999983, -- [5]
						-10.48299999999927, -- [6]
						-10.46099999999933, -- [7]
						-8, -- [8]
						-7.982999999999265, -- [9]
						-7.782999999999447, -- [10]
						-7.46599999999944, -- [11]
						-7.449999999999818, -- [12]
						-7.427999999999884, -- [13]
						-3.115999999999985, -- [14]
						-2.315999999999804, -- [15]
						-2.098999999999251, -- [16]
						-1.71599999999944, -- [17]
						-1.248999999999796, -- [18]
						-1.098999999999251, -- [19]
						-1.080999999999222, -- [20]
						-0.1159999999999855, -- [21]
						-0.1159999999999855, -- [22]
						-0.0319999999992433, -- [23]
						0, -- [24]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
					},
					["Health"] = {
						3636, -- [1]
						2888, -- [2]
						2888, -- [3]
						2888, -- [4]
						2888, -- [5]
						2489, -- [6]
						2489, -- [7]
						2509, -- [8]
						2509, -- [9]
						2529, -- [10]
						2129, -- [11]
						2129, -- [12]
						2129, -- [13]
						2149, -- [14]
						1843, -- [15]
						1839, -- [16]
						1472, -- [17]
						1182, -- [18]
						1182, -- [19]
						815, -- [20]
						815, -- [21]
						815, -- [22]
						391, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "李老三",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"HEAL", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
					},
					["Messages"] = {
						"特变电工 急救 特变电工 Tick +250", -- [1]
						"特变电工 急救 特变电工 Tick +250", -- [2]
						"特变电工 急救 特变电工 Tick +250", -- [3]
						"特变电工 急救 特变电工 Tick +250", -- [4]
						"特变电工 急救 特变电工 Tick +250", -- [5]
						"特变电工 急救 特变电工 Tick +250", -- [6]
						"特变电工 急救 特变电工 Tick +250", -- [7]
						"目空一切-逐风者 风暴打击 特变电工 Dodge (Physical)", -- [8]
						"目空一切-逐风者 肉搏 特变电工 Hit -221 (Physical)", -- [9]
						"特变电工 肉搏 目空一切-逐风者 Crit -844 (Physical)", -- [10]
						"目空一切-逐风者 闪电之盾 特变电工 Hit -198 (Nature)", -- [11]
						"特变电工 断筋 目空一切-逐风者 Hit -17 (Physical)", -- [12]
						"子弹舍普琴科 肉搏 特变电工 Crit -849 (Physical)", -- [13]
						"子弹舍普琴科 断筋 特变电工 Hit -34 (Physical)", -- [14]
						"特变电工 嗜血 李老三 Hit -405 (Physical)", -- [15]
						"特变电工 嗜血 特变电工 Hit +20", -- [16]
						"特变电工 肉搏 目空一切-逐风者 Hit -504 (Physical)", -- [17]
						"特变电工 嗜血 特变电工 Hit +20", -- [18]
						"特变电工 重伤 (伤害/跳) 目空一切-逐风者 Tick -68 (Physical)", -- [19]
						"目空一切-逐风者 肉搏 特变电工 Crit -494 (Physical)", -- [20]
						"子弹舍普琴科 致死打击 特变电工 Hit -370 (Physical)", -- [21]
						"李老三 暗言术：痛 (伤害/跳) 特变电工 Tick -283 (Shadow)", -- [22]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -373 (Shadow)", -- [23]
						"特变电工 旋风斩 子弹舍普琴科 Hit -471 (Physical)", -- [24]
						"特变电工 旋风斩 目空一切-逐风者 Hit -506 (Physical)", -- [25]
						"特变电工 旋风斩 牧老-火妖鲁西弗隆 Crit -879 (Physical)", -- [26]
						"特变电工 嗜血 特变电工 Hit +10", -- [27]
						"特变电工 嗜血 特变电工 Hit +10", -- [28]
						"特变电工 嗜血 特变电工 Hit +10", -- [29]
						"牧老-火妖鲁西弗隆 暗影守卫 特变电工 Hit -409 (Shadow)", -- [30]
						"子弹舍普琴科 重伤 (伤害/跳) 特变电工 Tick -131 (Physical)", -- [31]
						"目空一切-逐风者 地震术 特变电工 Crit -956 (Nature)", -- [32]
						"特变电工死亡。", -- [33]
					},
					["DeathAt"] = 4881.516000000001,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
					},
					["MessageTimes"] = {
						-14.45700000000034, -- [1]
						-13.44000000000051, -- [2]
						-12.44000000000051, -- [3]
						-11.44000000000051, -- [4]
						-10.45700000000034, -- [5]
						-9.44000000000051, -- [6]
						-8.456000000000131, -- [7]
						-5.222999999999956, -- [8]
						-5.123000000000502, -- [9]
						-4.890000000000327, -- [10]
						-4.856000000000677, -- [11]
						-4.819000000000415, -- [12]
						-3.256000000000313, -- [13]
						-3.256000000000313, -- [14]
						-2.706000000000131, -- [15]
						-2.682000000000699, -- [16]
						-2.021999999999935, -- [17]
						-2.006000000000313, -- [18]
						-1.856000000000677, -- [19]
						-1.722000000000662, -- [20]
						-1.703000000000429, -- [21]
						-1.273000000000138, -- [22]
						-1.256000000000313, -- [23]
						-1.189000000000306, -- [24]
						-1.189000000000306, -- [25]
						-1.189000000000306, -- [26]
						-1.167000000000371, -- [27]
						-1.167000000000371, -- [28]
						-1.167000000000371, -- [29]
						-1.088999999999942, -- [30]
						-0.2229999999999563, -- [31]
						-0.03900000000066939, -- [32]
						0, -- [33]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
						6219, -- [25]
						6219, -- [26]
						6219, -- [27]
						6219, -- [28]
						6219, -- [29]
						6219, -- [30]
						6219, -- [31]
						6219, -- [32]
						6219, -- [33]
					},
					["Health"] = {
						2009, -- [1]
						2259, -- [2]
						2509, -- [3]
						2807, -- [4]
						3057, -- [5]
						3356, -- [6]
						3606, -- [7]
						3952, -- [8]
						3952, -- [9]
						3731, -- [10]
						3731, -- [11]
						3533, -- [12]
						3533, -- [13]
						3533, -- [14]
						2650, -- [15]
						2650, -- [16]
						2670, -- [17]
						2670, -- [18]
						2690, -- [19]
						2690, -- [20]
						2196, -- [21]
						1826, -- [22]
						1826, -- [23]
						1170, -- [24]
						1170, -- [25]
						1170, -- [26]
						1170, -- [27]
						1170, -- [28]
						1170, -- [29]
						1200, -- [30]
						791, -- [31]
						660, -- [32]
						0, -- [33]
					},
					["KilledBy"] = "目空一切-逐风者",
					["MessageType"] = {
						"HEAL", -- [1]
						"HEAL", -- [2]
						"HEAL", -- [3]
						"HEAL", -- [4]
						"HEAL", -- [5]
						"HEAL", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"HEAL", -- [16]
						"DAMAGE", -- [17]
						"HEAL", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"HEAL", -- [27]
						"HEAL", -- [28]
						"HEAL", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"MISC", -- [33]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
					},
					["Messages"] = {
						"广坤叔来啦-火妖鲁西弗隆 炎爆术 特变电工 Crit -2503 (Fire)", -- [1]
						"广坤叔来啦-火妖鲁西弗隆 火焰冲击 特变电工 Hit -874 (Fire)", -- [2]
						"广坤叔来啦-火妖鲁西弗隆 冰霜新星 特变电工 Hit -34 (Frost)", -- [3]
						"广坤叔来啦-火妖鲁西弗隆 点燃 (伤害/跳) 特变电工 Tick -300 (Fire)", -- [4]
						"广坤叔来啦-火妖鲁西弗隆 冰冻 特变电工 Immune (Frost)", -- [5]
						"特变电工 断筋 广坤叔来啦-火妖鲁西弗隆 Hit -24 (Physical)", -- [6]
						"广坤叔来啦-火妖鲁西弗隆 炎爆术 (伤害/跳) 特变电工 Tick -194 (Fire)", -- [7]
						"特变电工 肉搏 广坤叔来啦-火妖鲁西弗隆 Hit -531 (Physical)", -- [8]
						"广坤叔来啦-火妖鲁西弗隆 冰冻 特变电工 Immune (Frost)", -- [9]
						"广坤叔来啦-火妖鲁西弗隆 冰锥术 特变电工 Hit -491 (Frost)", -- [10]
						"广坤叔来啦-火妖鲁西弗隆 点燃 (伤害/跳) 特变电工 Tick -331 (Fire)", -- [11]
						"广坤叔来啦-火妖鲁西弗隆 冰冻 特变电工 Immune (Frost)", -- [12]
						"特变电工 嗜血 广坤叔来啦-火妖鲁西弗隆 Hit -532 (Physical)", -- [13]
						"特变电工 嗜血 特变电工 Hit +20", -- [14]
						"广坤叔来啦-火妖鲁西弗隆 炎爆术 (伤害/跳) 特变电工 Tick -158 (Fire)", -- [15]
						"广坤叔来啦-火妖鲁西弗隆 灼烧 特变电工 Hit -518 (Fire)", -- [16]
						"广坤叔来啦-火妖鲁西弗隆 冲击波 特变电工 Hit -596 (Fire)", -- [17]
						"广坤叔来啦-火妖鲁西弗隆 冲击 特变电工 Immune (Fire)", -- [18]
						"特变电工 生命赐福 特变电工 Hit +1072", -- [19]
						"Environment Falling 特变电工 Hit -1060 (Physical)", -- [20]
						"特变电工 肉搏 目空一切-逐风者 Hit -425 (Physical)", -- [21]
						"特变电工 嗜血 特变电工 Hit +20", -- [22]
						"目空一切-逐风者 闪电之盾 特变电工 Absorb -178 (178 被吸收) (Nature)", -- [23]
						"广坤叔来啦-火妖鲁西弗隆 炎爆术 (伤害/跳) 特变电工 Tick -163 (Fire)", -- [24]
						"目空一切-逐风者 肉搏 特变电工 Hit -187 (Physical)", -- [25]
						"广坤叔来啦-火妖鲁西弗隆 火焰冲击 特变电工 Hit -894 (Fire)", -- [26]
						"特变电工死亡。", -- [27]
					},
					["DeathAt"] = 4696.522,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["MessageTimes"] = {
						-9.678000000000793, -- [1]
						-9.462000000000444, -- [2]
						-7.962000000000444, -- [3]
						-7.662000000000262, -- [4]
						-6.86200000000008, -- [5]
						-6.86200000000008, -- [6]
						-6.662000000000262, -- [7]
						-6.512000000000626, -- [8]
						-6.512000000000626, -- [9]
						-6.262000000000626, -- [10]
						-5.645000000000437, -- [11]
						-5.345000000000255, -- [12]
						-5.345000000000255, -- [13]
						-5.345000000000255, -- [14]
						-3.661000000000058, -- [15]
						-3.2450000000008, -- [16]
						-2.861000000000786, -- [17]
						-2.861000000000786, -- [18]
						-1.811000000000604, -- [19]
						-1.345000000000255, -- [20]
						-0.7450000000008004, -- [21]
						-0.7280000000000655, -- [22]
						-0.7280000000000655, -- [23]
						-0.6610000000000582, -- [24]
						-0.511000000000422, -- [25]
						-0.02800000000024738, -- [26]
						0, -- [27]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						7151, -- [20]
						7151, -- [21]
						7151, -- [22]
						7151, -- [23]
						7151, -- [24]
						7151, -- [25]
						7151, -- [26]
						6219, -- [27]
					},
					["Health"] = {
						6219, -- [1]
						3716, -- [2]
						2842, -- [3]
						2808, -- [4]
						2508, -- [5]
						2508, -- [6]
						2508, -- [7]
						2314, -- [8]
						2314, -- [9]
						2314, -- [10]
						1823, -- [11]
						1492, -- [12]
						1492, -- [13]
						1492, -- [14]
						1512, -- [15]
						1354, -- [16]
						836, -- [17]
						240, -- [18]
						240, -- [19]
						2244, -- [20]
						1184, -- [21]
						1184, -- [22]
						1204, -- [23]
						1204, -- [24]
						1041, -- [25]
						854, -- [26]
						0, -- [27]
					},
					["KilledBy"] = "广坤叔来啦-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"HEAL", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"HEAL", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"HEAL", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"MISC", -- [27]
					},
				}, -- [4]
			},
			["TimeLast"] = {
				["TimeHeal"] = 5111.513,
				["Dispelled"] = 5101.512,
				["Healing"] = 5111.513,
				["OVERALL"] = 5113.513,
				["DamageTaken"] = 5113.513,
				["DeathCount"] = 5113.513,
				["Absorbs"] = 4693.521,
				["RageGain"] = 5111.513,
				["HOT_Time"] = 4871.515,
				["TimeDamage"] = 5111.513,
				["ActiveTime"] = 5111.513,
				["HealingTaken"] = 5111.513,
				["DOT_Time"] = 5101.512,
				["Damage"] = 5111.513,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"MISC", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"MISC", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"HEAL", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"HEAL", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"HEAL", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					75.89000000000001, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["Healing"] = {
					6472, -- [1]
				},
				["DamageTaken"] = {
					43206, -- [1]
				},
				["DeathCount"] = {
					4, -- [1]
				},
				["Absorbs"] = {
					1027, -- [1]
				},
				["HealingTaken"] = {
					7499, -- [1]
				},
				["HOT_Time"] = {
					24, -- [1]
				},
				["TimeDamage"] = {
					122.01, -- [1]
				},
				["ActiveTime"] = {
					197.8999999999999, -- [1]
				},
				["RageGain"] = {
					200, -- [1]
				},
				["DOT_Time"] = {
					69, -- [1]
				},
				["Damage"] = {
					41943, -- [1]
				},
			},
			["LastHealTime"] = 5112.45,
			["LastDamageTaken"] = 385,
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 10,
			["GUID"] = "Player-5458-02F6D2A3",
			["type"] = "Self",
			["LastEventHealth"] = {
				193, -- [1]
				0, -- [2]
				4958, -- [3]
				4841, -- [4]
				3666, -- [5]
				3666, -- [6]
				3497, -- [7]
				3497, -- [8]
				3497, -- [9]
				3497, -- [10]
				3492, -- [11]
				3492, -- [12]
				3492, -- [13]
				3432, -- [14]
				3432, -- [15]
				3168, -- [16]
				3168, -- [17]
				3188, -- [18]
				3188, -- [19]
				3188, -- [20]
				3188, -- [21]
				2237, -- [22]
				2257, -- [23]
				1904, -- [24]
				1868, -- [25]
				1868, -- [26]
				1868, -- [27]
				1868, -- [28]
				1831, -- [29]
				1831, -- [30]
				1483, -- [31]
				776, -- [32]
				776, -- [33]
				796, -- [34]
				448, -- [35]
				2453, -- [36]
				2089, -- [37]
				2089, -- [38]
				2053, -- [39]
				1705, -- [40]
				1478, -- [41]
				1478, -- [42]
				1082, -- [43]
				707, -- [44]
				671, -- [45]
				560, -- [46]
				560, -- [47]
				580, -- [48]
				580, -- [49]
				600, -- [50]
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["Owner"] = false,
			["LastEventHealthMax"] = {
				7151, -- [1]
				6219, -- [2]
				6219, -- [3]
				6219, -- [4]
				6219, -- [5]
				6219, -- [6]
				6219, -- [7]
				6219, -- [8]
				6219, -- [9]
				6219, -- [10]
				6219, -- [11]
				6219, -- [12]
				6219, -- [13]
				6219, -- [14]
				6219, -- [15]
				6219, -- [16]
				6219, -- [17]
				6219, -- [18]
				6219, -- [19]
				6219, -- [20]
				6219, -- [21]
				6219, -- [22]
				6219, -- [23]
				6219, -- [24]
				6219, -- [25]
				6219, -- [26]
				6219, -- [27]
				6219, -- [28]
				6219, -- [29]
				6219, -- [30]
				6219, -- [31]
				6219, -- [32]
				6219, -- [33]
				6219, -- [34]
				6219, -- [35]
				7151, -- [36]
				7151, -- [37]
				7151, -- [38]
				7151, -- [39]
				7151, -- [40]
				7151, -- [41]
				7151, -- [42]
				7151, -- [43]
				7151, -- [44]
				7151, -- [45]
				7151, -- [46]
				7151, -- [47]
				7151, -- [48]
				7151, -- [49]
				7151, -- [50]
			},
			["NextEventNum"] = 3,
			["LastDamageTime"] = 5112.429,
			["LastEvents"] = {
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -385 (Shadow)", -- [1]
				"特变电工死亡。", -- [2]
				"丷光头强丷 出血 特变电工 Hit -117 (Physical)", -- [3]
				"Environment Falling 特变电工 Hit -1175 (Physical)", -- [4]
				"丷光头强丷 肾击 特变电工 Immune (Physical)", -- [5]
				"丷光头强丷 肉搏 特变电工 Crit -169 (Physical)", -- [6]
				"丷光头强丷 肉搏 特变电工 Parry (1)", -- [7]
				"特变电工 肉搏 丷光头强丷 Hit -471 (Physical)", -- [8]
				"特变电工 嗜血 特变电工 Hit +20", -- [9]
				"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -25 (Nature)", -- [10]
				"特变电工 重伤 (伤害/跳) 丷光头强丷 Tick -90 (Physical)", -- [11]
				"紫衣战天下 dispels 特变电工 自由行动 (驱散魔法)", -- [12]
				"丷光头强丷 肉搏 特变电工 Hit -60 (Physical)", -- [13]
				"丷光头强丷 肉搏 特变电工 Miss (1)", -- [14]
				"目空一切-逐风者 风暴打击 特变电工 Hit -264 (Physical)", -- [15]
				"特变电工 断筋 丷光头强丷 Hit -42 (Physical)", -- [16]
				"特变电工 嗜血 特变电工 Hit +20", -- [17]
				"目空一切-逐风者 肉搏 特变电工 Hit -266 (Physical)", -- [18]
				"目空一切-逐风者 肉搏 特变电工 Hit -337 (Physical)", -- [19]
				"目空一切-逐风者 肉搏 特变电工 Hit -348 (Physical)", -- [20]
				"特变电工 肉搏 丷光头强丷 Crit -1082 (Physical)", -- [21]
				"特变电工 嗜血 特变电工 Hit +20", -- [22]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -353 (Shadow)", -- [23]
				"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -36 (Nature)", -- [24]
				"目空一切-逐风者 地震术 特变电工 Resist (Nature)", -- [25]
				"丷光头强丷 肉搏 特变电工 Hit -57 (Physical)", -- [26]
				"特变电工 嗜血 丷光头强丷 Hit -533 (Physical)", -- [27]
				"特变电工 嗜血 特变电工 Hit +20", -- [28]
				"丷光头强丷 肉搏 特变电工 Miss (1)", -- [29]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -348 (Shadow)", -- [30]
				"紫衣战天下 心灵震爆 特变电工 Hit -707 (Shadow)", -- [31]
				"特变电工 英勇打击 丷光头强丷 Crit -1652 (Physical)", -- [32]
				"特变电工 嗜血 特变电工 Hit +20", -- [33]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -348 (Shadow)", -- [34]
				"特变电工 生命赐福 特变电工 Hit +1073", -- [35]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -364 (Shadow)", -- [36]
				"目空一切-逐风者 肉搏 特变电工 Parry (1)", -- [37]
				"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -36 (Nature)", -- [38]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 特变电工 Tick -348 (Shadow)", -- [39]
				"村里老中医-黑龙费尔默 月火术 特变电工 Hit -227 (Arcane)", -- [40]
				"特变电工 拦截昏迷 牧老-火妖鲁西弗隆 Hit -44 (Physical)", -- [41]
				"牧老-火妖鲁西弗隆 暗影守卫 特变电工 Hit -396 (Shadow)", -- [42]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -375 (Shadow)", -- [43]
				"丷光头强丷 致命毒药 IV (伤害/跳) 特变电工 Tick -36 (Nature)", -- [44]
				"村里老中医-黑龙费尔默 月火术 (伤害/跳) 特变电工 Tick -111 (Arcane)", -- [45]
				"特变电工 肉搏 牧老-火妖鲁西弗隆 Hit -391 (Physical)", -- [46]
				"特变电工 嗜血 特变电工 Hit +20", -- [47]
				"特变电工 嗜血 牧老-火妖鲁西弗隆 Hit -420 (Physical)", -- [48]
				"特变电工 嗜血 特变电工 Hit +20", -- [49]
				"牧老-火妖鲁西弗隆 暗影守卫 特变电工 Hit -407 (Shadow)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["Name"] = "特变电工",
			["LastEventTimes"] = {
				5113.562, -- [1]
				5113.597, -- [2]
				5099.862, -- [3]
				5100.535, -- [4]
				5100.962, -- [5]
				5101.145, -- [6]
				5101.545, -- [7]
				5101.582, -- [8]
				5101.612, -- [9]
				5101.895, -- [10]
				5101.929, -- [11]
				5102.312, -- [12]
				5103.862, -- [13]
				5103.945, -- [14]
				5103.979, -- [15]
				5104.162, -- [16]
				5104.185, -- [17]
				5104.262, -- [18]
				5104.262, -- [19]
				5104.262, -- [20]
				5104.295, -- [21]
				5104.295, -- [22]
				5104.562, -- [23]
				5104.879, -- [24]
				5105.479, -- [25]
				5105.662, -- [26]
				5105.679, -- [27]
				5105.679, -- [28]
				5105.962, -- [29]
				5106.046, -- [30]
				5106.362, -- [31]
				5106.996, -- [32]
				5107.018, -- [33]
				5107.046, -- [34]
				5107.214, -- [35]
				5107.562, -- [36]
				5107.662, -- [37]
				5107.879, -- [38]
				5108.046, -- [39]
				5108.262, -- [40]
				5108.412, -- [41]
				5109.279, -- [42]
				5110.562, -- [43]
				5110.879, -- [44]
				5111.262, -- [45]
				5112.363, -- [46]
				5112.363, -- [47]
				5112.429, -- [48]
				5112.45, -- [49]
				5112.479, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["丷光头强丷"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 8768,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 3,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 18,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 12,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 7,
								},
							},
							["amount"] = 10,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 1652,
						["Melee"] = 1402,
						["Arcane"] = 718,
						["Fire"] = 832,
						["Shadow"] = 4031,
						["Nature"] = 133,
					},
					["DOT_Time"] = 3,
					["Damage"] = 8040,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 9.120000000000001,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 3348,
						["Physical"] = 4692,
					},
					["PartialAbsorb"] = {
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["偷袭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["肾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["嗜血"] = {
									["count"] = 420,
								},
								["肉搏"] = {
									["count"] = 391,
								},
							},
							["amount"] = 855,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 960,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 90,
								},
								["断筋"] = {
									["count"] = 42,
								},
								["英勇打击"] = {
									["count"] = 1652,
								},
								["肉搏"] = {
									["count"] = 2539,
								},
							},
							["amount"] = 5283,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1484,
								},
								["肉搏"] = {
									["count"] = 418,
								},
							},
							["amount"] = 1902,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 803,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1477,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1044,
								},
							},
							["amount"] = 3324,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 133,
								},
								["出血"] = {
									["count"] = 213,
								},
								["肉搏"] = {
									["count"] = 451,
								},
							},
							["amount"] = 797,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1175,
								},
							},
							["amount"] = 1175,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 227,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 111,
								},
							},
							["amount"] = 338,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 951,
								},
								["风暴打击"] = {
									["count"] = 264,
								},
							},
							["amount"] = 1215,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 707,
								},
							},
							["amount"] = 707,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 380,
								},
								["火焰冲击"] = {
									["count"] = 832,
								},
							},
							["amount"] = 1212,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["偷袭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["肾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 8.92,
								},
								["生命赐福"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 9.120000000000001,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 160,
								},
								["生命赐福"] = {
									["count"] = 1073,
								},
							},
							["amount"] = 1233,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.42,
								},
								["嗜血"] = {
									["count"] = 0.07,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.99,
						},
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 8.92,
								},
								["生命赐福"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 9.120000000000001,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.86,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.32,
								},
								["肉搏"] = {
									["count"] = 3.13,
								},
							},
							["amount"] = 8.16,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.62,
								},
							},
							["amount"] = 3.62,
						},
					},
					["WhoDispelled"] = {
						["紫衣战天下"] = {
							["Details"] = {
								["自由行动 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 8,
									["amount"] = 160,
								},
							},
							["count"] = 8,
							["amount"] = 160,
						},
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1073,
									["count"] = 1,
									["amount"] = 1073,
								},
							},
							["count"] = 1,
							["amount"] = 1073,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 160,
								},
								["生命赐福"] = {
									["count"] = 1073,
								},
							},
							["amount"] = 1233,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 23.89,
					["Healing"] = 1233,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 1,
							["amount"] = 44,
						},
						["英勇打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1652,
									["min"] = 1652,
									["count"] = 1,
									["amount"] = 1652,
								},
							},
							["count"] = 1,
							["amount"] = 1652,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 533,
									["min"] = 420,
									["count"] = 3,
									["amount"] = 1380,
								},
							},
							["count"] = 3,
							["amount"] = 1380,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 90,
									["min"] = 90,
									["count"] = 1,
									["amount"] = 90,
								},
							},
							["count"] = 1,
							["amount"] = 90,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 1,
							["amount"] = 42,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1484,
									["min"] = 1484,
									["count"] = 1,
									["amount"] = 1484,
								},
							},
							["count"] = 1,
							["amount"] = 1484,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1082,
									["min"] = 986,
									["count"] = 2,
									["amount"] = 2068,
								},
								["Hit"] = {
									["max"] = 471,
									["min"] = 391,
									["count"] = 3,
									["amount"] = 1280,
								},
							},
							["count"] = 5,
							["amount"] = 3348,
						},
					},
					["HealingTaken"] = 1233,
					["RageGain"] = 18,
					["TimeDamage"] = 14.77,
					["TimeDamaging"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.42,
								},
								["嗜血"] = {
									["count"] = 0.07,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.99,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.86,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.32,
								},
								["肉搏"] = {
									["count"] = 3.13,
								},
							},
							["amount"] = 8.16,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.62,
								},
							},
							["amount"] = 3.62,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["目空一切-逐风者"] = {
									["count"] = 6,
								},
								["牧老-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
								["丷光头强丷"] = {
									["count"] = 3,
								},
								["子弹舍普琴科"] = {
									["count"] = 12,
								},
								["村里老中医-黑龙费尔默"] = {
									["count"] = 3,
								},
								["延陵斩蛟-黑龙费尔默"] = {
									["count"] = 3,
								},
								["李老三"] = {
									["count"] = 9,
								},
								["美女婉君-老马布兰契"] = {
									["count"] = 24,
								},
							},
							["amount"] = 69,
						},
					},
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 57.99,
								},
								["治疗药水"] = {
									["count"] = 0.2,
								},
								["生命赐福"] = {
									["count"] = 1.7,
								},
								["防护暗影"] = {
									["count"] = 7.5,
								},
								["急救"] = {
									["count"] = 8.5,
								},
							},
							["amount"] = 75.89000000000001,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 0.42,
								},
								["缴械"] = {
									["count"] = 1.93,
								},
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["旋风斩"] = {
									["count"] = 0.67,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.489999999999999,
								},
							},
							["amount"] = 20.14,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.38,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.07,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 5.63,
								},
							},
							["amount"] = 8.91,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["嗜血"] = {
									["count"] = 1.21,
								},
								["肉搏"] = {
									["count"] = 2.13,
								},
							},
							["amount"] = 7.84,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.17,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.97,
								},
							},
							["amount"] = 6.64,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.42,
								},
								["旋风斩"] = {
									["count"] = 0.92,
								},
								["嗜血"] = {
									["count"] = 2.49,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.58,
								},
								["压制"] = {
									["count"] = 1.48,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 10.83,
								},
							},
							["amount"] = 20.95,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.86,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.32,
								},
								["肉搏"] = {
									["count"] = 3.13,
								},
							},
							["amount"] = 8.16,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.23,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.58,
								},
								["肉搏"] = {
									["count"] = 3.42,
								},
							},
							["amount"] = 8.559999999999999,
						},
						["李老三"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.72,
								},
								["旋风斩"] = {
									["count"] = 0.78,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.07,
								},
								["肉搏"] = {
									["count"] = 4.42,
								},
							},
							["amount"] = 13.99,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.7000000000000001,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["斩杀"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 6.779999999999999,
								},
							},
							["amount"] = 9.35,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 12,
								},
								["冲锋击昏"] = {
									["count"] = 0.25,
								},
								["断筋"] = {
									["count"] = 3.07,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 17.47,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["防护自然"] = {
									["count"] = 178,
								},
								["嗜血"] = {
									["count"] = 950,
								},
								["治疗药水"] = {
									["count"] = 1377,
								},
								["生命赐福"] = {
									["count"] = 2145,
								},
								["防护暗影"] = {
									["count"] = 849,
								},
								["急救"] = {
									["count"] = 2000,
								},
							},
							["amount"] = 7499,
						},
					},
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 80,
								},
								["怒不可遏"] = {
									["count"] = 15,
								},
								["冲锋"] = {
									["count"] = 105,
								},
							},
							["amount"] = 200,
						},
					},
					["Absorbs"] = 1027,
					["DeathCount"] = 4,
					["HOT_Time"] = 24,
					["ElementTaken"] = {
						["Physical"] = 6704,
						["Melee"] = 5428,
						["Arcane"] = 3850,
						["Shadow"] = 17103,
						["Fire"] = 8052,
						["Frost"] = 525,
						["Nature"] = 1544,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 105,
								},
							},
							["amount"] = 105,
						},
					},
					["Damage"] = 41943,
					["TimeHeal"] = 75.89000000000001,
					["ElementDone"] = {
						["Melee"] = 21036,
						["Physical"] = 20907,
					},
					["DamagedWho"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 524,
								},
								["嗜血"] = {
									["count"] = 800,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 618,
								},
								["旋风斩"] = {
									["count"] = 471,
								},
								["断筋"] = {
									["count"] = 43,
								},
								["压制"] = {
									["count"] = 912,
								},
								["肉搏"] = {
									["count"] = 1794,
								},
							},
							["amount"] = 5162,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 52,
								},
								["旋风斩"] = {
									["count"] = 255,
								},
								["嗜血"] = {
									["count"] = 211,
								},
								["肉搏"] = {
									["count"] = 1545,
								},
							},
							["amount"] = 2063,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 55,
								},
								["断筋"] = {
									["count"] = 54,
								},
								["嗜血"] = {
									["count"] = 907,
								},
								["肉搏"] = {
									["count"] = 2044,
								},
							},
							["amount"] = 3060,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1484,
								},
								["断筋"] = {
									["count"] = 24,
								},
								["嗜血"] = {
									["count"] = 532,
								},
								["肉搏"] = {
									["count"] = 949,
								},
							},
							["amount"] = 2989,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["压制"] = {
									["count"] = 618,
								},
								["嗜血"] = {
									["count"] = 1674,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 219,
								},
								["旋风斩"] = {
									["count"] = 1174,
								},
								["断筋"] = {
									["count"] = 118,
								},
								["斩杀"] = {
									["count"] = 1019,
								},
								["肉搏"] = {
									["count"] = 4122,
								},
							},
							["amount"] = 8988,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 960,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 90,
								},
								["断筋"] = {
									["count"] = 42,
								},
								["英勇打击"] = {
									["count"] = 1652,
								},
								["肉搏"] = {
									["count"] = 2539,
								},
							},
							["amount"] = 5283,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 394,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 85,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 50,
								},
								["斩杀"] = {
									["count"] = 499,
								},
								["肉搏"] = {
									["count"] = 1772,
								},
							},
							["amount"] = 2837,
						},
						["李老三"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 827,
								},
								["旋风斩"] = {
									["count"] = 557,
								},
								["英勇打击"] = {
									["count"] = 965,
								},
								["断筋"] = {
									["count"] = 53,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 264,
								},
								["肉搏"] = {
									["count"] = 1754,
								},
							},
							["amount"] = 4420,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 506,
								},
								["嗜血"] = {
									["count"] = 814,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 162,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["断筋"] = {
									["count"] = 17,
								},
								["斩杀"] = {
									["count"] = 479,
								},
								["肉搏"] = {
									["count"] = 2945,
								},
							},
							["amount"] = 4965,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 75,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 529,
								},
								["肉搏"] = {
									["count"] = 1572,
								},
							},
							["amount"] = 2176,
						},
					},
					["WhoDamaged"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 370,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 769,
								},
								["断筋"] = {
									["count"] = 34,
								},
								["旋风斩"] = {
									["count"] = 684,
								},
								["肉搏"] = {
									["count"] = 2066,
								},
							},
							["amount"] = 3923,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 190,
								},
								["心灵震爆"] = {
									["count"] = 707,
								},
							},
							["amount"] = 897,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 34,
								},
								["炎爆术"] = {
									["count"] = 2503,
								},
								["炎爆术 (伤害/跳)"] = {
									["count"] = 515,
								},
								["魔爆术"] = {
									["count"] = 1348,
								},
								["灼烧"] = {
									["count"] = 518,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 631,
								},
								["冲击波"] = {
									["count"] = 596,
								},
								["冰锥术"] = {
									["count"] = 491,
								},
								["火焰冲击"] = {
									["count"] = 2600,
								},
							},
							["amount"] = 9236,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 111,
								},
								["月火术"] = {
									["count"] = 227,
								},
								["荆棘术"] = {
									["count"] = 79,
								},
							},
							["amount"] = 417,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 2470,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 8458,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 2205,
								},
							},
							["amount"] = 13133,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 133,
								},
								["出血"] = {
									["count"] = 213,
								},
								["肉搏"] = {
									["count"] = 451,
								},
							},
							["amount"] = 797,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 4004,
								},
							},
							["amount"] = 4004,
						},
						["李老三"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1003,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2070,
								},
								["肉搏"] = {
									["count"] = 115,
								},
							},
							["amount"] = 3188,
						},
						["Aoo-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 2164,
								},
							},
							["amount"] = 2164,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 47,
								},
								["出血"] = {
									["count"] = 289,
								},
								["肉搏"] = {
									["count"] = 943,
								},
							},
							["amount"] = 1279,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 264,
								},
								["地震术"] = {
									["count"] = 956,
								},
								["烈焰震击"] = {
									["count"] = 313,
								},
								["闪电之盾"] = {
									["count"] = 376,
								},
								["烈焰震击 (伤害/跳)"] = {
									["count"] = 331,
								},
								["肉搏"] = {
									["count"] = 1853,
								},
							},
							["amount"] = 4093,
						},
					},
					["Absorbed"] = {
						["防护暗影"] = {
							["Details"] = {
								["特变电工"] = {
									["max"] = 217,
									["min"] = 83,
									["count"] = 5,
									["amount"] = 849,
								},
							},
							["count"] = 5,
							["amount"] = 849,
						},
						["防护自然"] = {
							["Details"] = {
								["特变电工"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
							},
							["count"] = 1,
							["amount"] = 178,
						},
					},
					["ElementDoneBlock"] = {
						["Melee"] = 164,
						["Physical"] = 0,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 57.99,
								},
								["治疗药水"] = {
									["count"] = 0.2,
								},
								["生命赐福"] = {
									["count"] = 1.7,
								},
								["防护暗影"] = {
									["count"] = 7.5,
								},
								["急救"] = {
									["count"] = 8.5,
								},
							},
							["amount"] = 75.89000000000001,
						},
					},
					["Dispelled"] = 1,
					["PartialResist"] = {
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["偷袭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["缴械"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 32,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 32,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["攻击"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 14,
									["min"] = 14,
									["count"] = 1,
									["amount"] = 14,
								},
							},
							["count"] = 14,
							["amount"] = 1,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["烈焰震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["烈焰震击 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 38,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 38,
						},
					},
					["ElementTakenAbsorb"] = {
						["Nature"] = 178,
						["Shadow"] = 849,
					},
					["ActiveTime"] = 197.8999999999999,
					["WhoDispelled"] = {
						["紫衣战天下"] = {
							["Details"] = {
								["自由行动 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["Heals"] = {
						["防护自然"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
							},
							["count"] = 1,
							["amount"] = 178,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 10,
									["count"] = 49,
									["amount"] = 950,
								},
							},
							["count"] = 49,
							["amount"] = 950,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1377,
									["min"] = 1377,
									["count"] = 1,
									["amount"] = 1377,
								},
							},
							["count"] = 1,
							["amount"] = 1377,
						},
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1072,
									["count"] = 2,
									["amount"] = 2145,
								},
							},
							["count"] = 2,
							["amount"] = 2145,
						},
						["防护暗影"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 217,
									["min"] = 83,
									["count"] = 5,
									["amount"] = 849,
								},
							},
							["count"] = 5,
							["amount"] = 849,
						},
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 8,
									["amount"] = 2000,
								},
							},
							["count"] = 8,
							["amount"] = 2000,
						},
					},
					["ElementTakenResist"] = {
						["Fire"] = 14,
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 343,
						["Physical"] = 111,
					},
					["DOT_Time"] = 69,
					["Healing"] = 6472,
					["PartialAbsorb"] = {
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
							},
							["count"] = 2,
							["amount"] = 178,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["偷袭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["致残毒药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["缴械"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 217,
									["min"] = 115,
									["count"] = 4,
									["amount"] = 766,
								},
							},
							["count"] = 32,
							["amount"] = 766,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["烈焰震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["烈焰震击 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 2,
							["amount"] = 83,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["荆棘术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 38,
									["amount"] = 0,
								},
							},
							["count"] = 38,
							["amount"] = 0,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 15,
								},
								["Tick"] = {
									["count"] = 9,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 30,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 19,
								},
								["Miss"] = {
									["count"] = 6,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Parry"] = {
									["count"] = 3,
								},
							},
							["amount"] = 38,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 10,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 9,
								},
								["Tick"] = {
									["count"] = 35,
								},
							},
							["amount"] = 48,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 18,
						},
						["Frost"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 13,
						},
					},
					["Attacks"] = {
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 912,
									["min"] = 618,
									["count"] = 2,
									["amount"] = 1530,
								},
							},
							["count"] = 2,
							["amount"] = 1530,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 69,
									["min"] = 69,
									["count"] = 1,
									["amount"] = 69,
								},
								["Tick"] = {
									["max"] = 155,
									["min"] = 52,
									["count"] = 22,
									["amount"] = 1950,
								},
							},
							["count"] = 23,
							["amount"] = 2019,
						},
						["英勇打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1652,
									["min"] = 965,
									["count"] = 2,
									["amount"] = 2617,
								},
								["Hit"] = {
									["max"] = 524,
									["min"] = 524,
									["count"] = 1,
									["amount"] = 524,
								},
							},
							["count"] = 3,
							["amount"] = 3141,
						},
						["缴械"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
								["Hit"] = {
									["max"] = 55,
									["min"] = 44,
									["count"] = 3,
									["amount"] = 149,
								},
							},
							["count"] = 5,
							["amount"] = 191,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 879,
									["min"] = 879,
									["count"] = 1,
									["amount"] = 879,
								},
								["Hit"] = {
									["max"] = 557,
									["min"] = 255,
									["count"] = 5,
									["amount"] = 2084,
								},
							},
							["count"] = 6,
							["amount"] = 2963,
						},
						["嗜血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 814,
									["min"] = 655,
									["count"] = 3,
									["amount"] = 2269,
								},
								["Hit"] = {
									["max"] = 533,
									["min"] = 211,
									["count"] = 12,
									["amount"] = 4850,
								},
							},
							["count"] = 15,
							["amount"] = 7119,
						},
						["断筋"] = {
							["Details"] = {
								["Block"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 64,
									["min"] = 39,
									["count"] = 4,
									["amount"] = 210,
								},
								["Hit"] = {
									["max"] = 42,
									["min"] = 14,
									["count"] = 10,
									["amount"] = 253,
								},
							},
							["count"] = 15,
							["amount"] = 463,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1484,
									["min"] = 1019,
									["count"] = 2,
									["amount"] = 2503,
								},
								["Hit"] = {
									["max"] = 499,
									["min"] = 479,
									["count"] = 2,
									["amount"] = 978,
								},
							},
							["count"] = 4,
							["amount"] = 3481,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 324,
									["min"] = 19,
									["count"] = 2,
									["amount"] = 343,
								},
								["Hit"] = {
									["max"] = 587,
									["min"] = 218,
									["count"] = 23,
									["amount"] = 9475,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1082,
									["min"] = 533,
									["count"] = 14,
									["amount"] = 10630,
								},
								["Hit (被格挡)"] = {
									["max"] = 332,
									["min"] = 256,
									["count"] = 2,
									["amount"] = 588,
								},
							},
							["count"] = 43,
							["amount"] = 21036,
						},
					},
					["RageGain"] = 200,
					["DamageTaken"] = 43206,
					["TimeDamage"] = 122.01,
					["TimeDamaging"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 0.42,
								},
								["缴械"] = {
									["count"] = 1.93,
								},
								["嗜血"] = {
									["count"] = 0.13,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["旋风斩"] = {
									["count"] = 0.67,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.489999999999999,
								},
							},
							["amount"] = 20.14,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.38,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.07,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 5.63,
								},
							},
							["amount"] = 8.91,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["嗜血"] = {
									["count"] = 1.21,
								},
								["肉搏"] = {
									["count"] = 2.13,
								},
							},
							["amount"] = 7.84,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.17,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.97,
								},
							},
							["amount"] = 6.64,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.42,
								},
								["旋风斩"] = {
									["count"] = 0.92,
								},
								["嗜血"] = {
									["count"] = 2.49,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.58,
								},
								["压制"] = {
									["count"] = 1.48,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 10.83,
								},
							},
							["amount"] = 20.95,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.86,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.32,
								},
								["肉搏"] = {
									["count"] = 3.13,
								},
							},
							["amount"] = 8.16,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.23,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.58,
								},
								["肉搏"] = {
									["count"] = 3.42,
								},
							},
							["amount"] = 8.559999999999999,
						},
						["李老三"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.72,
								},
								["旋风斩"] = {
									["count"] = 0.78,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.07,
								},
								["肉搏"] = {
									["count"] = 4.42,
								},
							},
							["amount"] = 13.99,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.7000000000000001,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["斩杀"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 6.779999999999999,
								},
							},
							["amount"] = 9.35,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 12,
								},
								["冲锋击昏"] = {
									["count"] = 0.25,
								},
								["断筋"] = {
									["count"] = 3.07,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 17.47,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["防护自然"] = {
									["count"] = 178,
								},
								["嗜血"] = {
									["count"] = 950,
								},
								["治疗药水"] = {
									["count"] = 1377,
								},
								["生命赐福"] = {
									["count"] = 2145,
								},
								["防护暗影"] = {
									["count"] = 849,
								},
								["急救"] = {
									["count"] = 2000,
								},
							},
							["amount"] = 7499,
						},
					},
					["HealingTaken"] = 7499,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 25,
								},
								["Block"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 14,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 45,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 33,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 14,
								},
								["Tick"] = {
									["count"] = 22,
								},
							},
							["amount"] = 78,
						},
					},
				},
			},
			["UnitLockout"] = 4513.51,
			["LastActive"] = 5113.513,
		},
		["阿拉瑟希斯 <激光碎石-逐风者>"] = {
			["GUID"] = "Pet-0-5427-489-12952-5349-0701536D49",
			["LastEventHealth"] = {
				3452, -- [1]
				3452, -- [2]
				3452, -- [3]
				3452, -- [4]
				3452, -- [5]
				3452, -- [6]
				3452, -- [7]
				3452, -- [8]
				3005, -- [9]
				2498, -- [10]
				2142, -- [11]
				2142, -- [12]
				1793, -- [13]
				1447, -- [14]
				1447, -- [15]
				1105, -- [16]
				758, -- [17]
				3084, -- [18]
				2728, -- [19]
				2450, -- [20]
				2450, -- [21]
				2049, -- [22]
				1689, -- [23]
				1330, -- [24]
				954, -- [25]
				595, -- [26]
				595, -- [27]
				595, -- [28]
				219, -- [29]
				0, -- [30]
				3452, -- [31]
				3452, -- [32]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"MISC", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					16.7, -- [1]
				},
				["TimeDamage"] = {
					16.7, -- [1]
				},
				["DamageTaken"] = {
					6382, -- [1]
				},
				["Damage"] = {
					1213, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "阿拉瑟希斯",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
					},
					["Messages"] = {
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -356 (Shadow)", -- [1]
						"子弹舍普琴科 肉搏 阿拉瑟希斯 <激光碎石-逐风者> Hit -278 (Physical)", -- [2]
						"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 牧老-火妖鲁西弗隆 Crit -150 (Physical)", -- [3]
						"牧老-火妖鲁西弗隆 暗影守卫 阿拉瑟希斯 <激光碎石-逐风者> Hit -401 (Shadow)", -- [4]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -360 (Shadow)", -- [5]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -359 (Shadow)", -- [6]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -376 (Shadow)", -- [7]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -359 (Shadow)", -- [8]
						"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 牧老-火妖鲁西弗隆 Hit -69 (Physical)", -- [9]
						"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 牧老-火妖鲁西弗隆 Hit -70 (Physical)", -- [10]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -376 (Shadow)", -- [11]
						"子弹舍普琴科 旋风斩 阿拉瑟希斯 <激光碎石-逐风者> Hit -326 (Physical)", -- [12]
						"阿拉瑟希斯 <激光碎石-逐风者>死亡。", -- [13]
					},
					["DeathAt"] = 4935.519,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["MessageTimes"] = {
						-6.6850000000004, -- [1]
						-6.252000000000408, -- [2]
						-6.034999999999855, -- [3]
						-5.868000000000393, -- [4]
						-5.215000000000146, -- [5]
						-4.217999999999847, -- [6]
						-3.701000000000022, -- [7]
						-3.217999999999847, -- [8]
						-2.751000000000204, -- [9]
						-0.7349999999996726, -- [10]
						-0.6850000000004002, -- [11]
						-0.0180000000000291, -- [12]
						0, -- [13]
					},
					["HealthMax"] = {
						3452, -- [1]
						3452, -- [2]
						3452, -- [3]
						3452, -- [4]
						3452, -- [5]
						3452, -- [6]
						3452, -- [7]
						3452, -- [8]
						3452, -- [9]
						3452, -- [10]
						3452, -- [11]
						3452, -- [12]
						3452, -- [13]
					},
					["Health"] = {
						3084, -- [1]
						2728, -- [2]
						2450, -- [3]
						2450, -- [4]
						2049, -- [5]
						1689, -- [6]
						1330, -- [7]
						954, -- [8]
						595, -- [9]
						595, -- [10]
						595, -- [11]
						219, -- [12]
						0, -- [13]
					},
					["KilledBy"] = "子弹舍普琴科",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"MISC", -- [13]
					},
				}, -- [1]
			},
			["level"] = 1,
			["LastDamageAbility"] = "旋风斩",
			["LastFightIn"] = 9,
			["type"] = "Pet",
			["ownerName"] = "激光碎石-逐风者",
			["LastDamageTaken"] = 326,
			["TimeLast"] = {
				["DeathCount"] = 4933.519,
				["ActiveTime"] = 5028.509,
				["TimeDamage"] = 5028.509,
				["OVERALL"] = 5028.509,
				["DamageTaken"] = 4933.519,
				["Damage"] = 5028.509,
			},
			["LastEventHealthMax"] = {
				3452, -- [1]
				3452, -- [2]
				3452, -- [3]
				3452, -- [4]
				3452, -- [5]
				3452, -- [6]
				3452, -- [7]
				3452, -- [8]
				3452, -- [9]
				3452, -- [10]
				3452, -- [11]
				3452, -- [12]
				3452, -- [13]
				3452, -- [14]
				3452, -- [15]
				3452, -- [16]
				3452, -- [17]
				3452, -- [18]
				3452, -- [19]
				3452, -- [20]
				3452, -- [21]
				3452, -- [22]
				3452, -- [23]
				3452, -- [24]
				3452, -- [25]
				3452, -- [26]
				3452, -- [27]
				3452, -- [28]
				3452, -- [29]
				3452, -- [30]
				3452, -- [31]
				3452, -- [32]
			},
			["NextEventNum"] = 33,
			["LastDamageTime"] = 5029.158,
			["LastEvents"] = {
				"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 美女婉君-老马布兰契 Miss (1)", -- [1]
				"阿拉瑟希斯 <激光碎石-逐风者> 闪电吐息 美女婉君-老马布兰契 Hit -130 (Nature)", -- [2]
				"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 美女婉君-老马布兰契 Hit -85 (Physical)", -- [3]
				"阿拉瑟希斯 <激光碎石-逐风者> 闪电吐息 美女婉君-老马布兰契 Hit -130 (Nature)", -- [4]
				"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 美女婉君-老马布兰契 Hit -95 (Physical)", -- [5]
				"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 美女婉君-老马布兰契 Dodge (1)", -- [6]
				"美女婉君-老马布兰契 鬼魅攻击 阿拉瑟希斯 <激光碎石-逐风者> Crit -342 (Physical)", -- [7]
				"广坤叔来啦-火妖鲁西弗隆 冰锥术 阿拉瑟希斯 <激光碎石-逐风者> Hit -447 (Frost)", -- [8]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 阿拉瑟希斯 <激光碎石-逐风者> Crit -507 (Arcane)", -- [9]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 阿拉瑟希斯 <激光碎石-逐风者> Hit -356 (Arcane)", -- [10]
				"阿拉瑟希斯 <激光碎石-逐风者> 闪电吐息 目空一切-逐风者 Hit -112 (Nature)", -- [11]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 阿拉瑟希斯 <激光碎石-逐风者> Hit -349 (Arcane)", -- [12]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 阿拉瑟希斯 <激光碎石-逐风者> Hit -346 (Arcane)", -- [13]
				"阿拉瑟希斯 <激光碎石-逐风者> 闪电吐息 目空一切-逐风者 Hit -112 (Nature)", -- [14]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 阿拉瑟希斯 <激光碎石-逐风者> Hit -342 (Arcane)", -- [15]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 阿拉瑟希斯 <激光碎石-逐风者> Hit -347 (Arcane)", -- [16]
				"延陵斩蛟-黑龙费尔默 旋风斩 阿拉瑟希斯 <激光碎石-逐风者> Hit -155 (Physical)", -- [17]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -356 (Shadow)", -- [18]
				"子弹舍普琴科 肉搏 阿拉瑟希斯 <激光碎石-逐风者> Hit -278 (Physical)", -- [19]
				"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 牧老-火妖鲁西弗隆 Crit -150 (Physical)", -- [20]
				"牧老-火妖鲁西弗隆 暗影守卫 阿拉瑟希斯 <激光碎石-逐风者> Hit -401 (Shadow)", -- [21]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -360 (Shadow)", -- [22]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -359 (Shadow)", -- [23]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -376 (Shadow)", -- [24]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -359 (Shadow)", -- [25]
				"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 牧老-火妖鲁西弗隆 Hit -69 (Physical)", -- [26]
				"阿拉瑟希斯 <激光碎石-逐风者> 肉搏 牧老-火妖鲁西弗隆 Hit -70 (Physical)", -- [27]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 阿拉瑟希斯 <激光碎石-逐风者> Tick -376 (Shadow)", -- [28]
				"子弹舍普琴科 旋风斩 阿拉瑟希斯 <激光碎石-逐风者> Hit -326 (Physical)", -- [29]
				"阿拉瑟希斯 <激光碎石-逐风者>死亡。", -- [30]
				"阿拉瑟希斯 <激光碎石-逐风者> 闪电吐息 子弹舍普琴科 Hit -143 (Nature)", -- [31]
				"阿拉瑟希斯 <激光碎石-逐风者> 闪电吐息 子弹舍普琴科 Hit -117 (Nature)", -- [32]
			},
			["Name"] = "阿拉瑟希斯",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
			},
			["LastEventTimes"] = {
				4582.015, -- [1]
				4582.015, -- [2]
				4584.031, -- [3]
				4584.232, -- [4]
				4586.031, -- [5]
				4588.048, -- [6]
				4589.898, -- [7]
				4829.979, -- [8]
				4831.479, -- [9]
				4832.980000000001, -- [10]
				4833.28, -- [11]
				4834.480000000001, -- [12]
				4836.046, -- [13]
				4836.546, -- [14]
				4837.546, -- [15]
				4839.047000000001, -- [16]
				4839.097, -- [17]
				4927.235, -- [18]
				4927.668, -- [19]
				4927.885, -- [20]
				4928.052, -- [21]
				4928.705, -- [22]
				4929.702, -- [23]
				4930.219, -- [24]
				4930.702, -- [25]
				4931.169, -- [26]
				4933.185, -- [27]
				4933.235, -- [28]
				4933.902, -- [29]
				4933.92, -- [30]
				5027.541, -- [31]
				5029.158, -- [32]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DamagedWho"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 260,
								},
							},
							["amount"] = 260,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 289,
								},
							},
							["amount"] = 289,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 224,
								},
							},
							["amount"] = 224,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 180,
								},
								["闪电吐息"] = {
									["count"] = 260,
								},
							},
							["amount"] = 440,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["PartialAbsorb"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["鬼魅攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["鬼魅攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["闪电吐息"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 143,
									["min"] = 112,
									["count"] = 6,
									["amount"] = 744,
								},
							},
							["count"] = 6,
							["amount"] = 744,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 95,
									["min"] = 69,
									["count"] = 4,
									["amount"] = 319,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 150,
									["min"] = 150,
									["count"] = 1,
									["amount"] = 150,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 469,
						},
					},
					["TimeSpent"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6.2,
						},
					},
					["DamageTaken"] = 6382,
					["WhoDamaged"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 401,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1108,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1078,
								},
							},
							["amount"] = 2587,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 326,
								},
								["肉搏"] = {
									["count"] = 278,
								},
							},
							["amount"] = 604,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 155,
								},
							},
							["amount"] = 155,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 2247,
								},
								["冰锥术"] = {
									["count"] = 447,
								},
							},
							["amount"] = 2694,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["鬼魅攻击"] = {
									["count"] = 342,
								},
							},
							["amount"] = 342,
						},
					},
					["ElementDone"] = {
						["Melee"] = 469,
						["Nature"] = 744,
					},
					["DeathCount"] = 1,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeDamage"] = 16.7,
					["TimeDamaging"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 0.2,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6.2,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 447,
						["Melee"] = 278,
						["Arcane"] = 2247,
						["Shadow"] = 2587,
						["Physical"] = 823,
					},
					["ActiveTime"] = 16.7,
					["Damage"] = 1213,
				},
			},
			["UnitLockout"] = 4581.515,
			["LastActive"] = 5028.509,
		},
		["谁是小个子-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-03512EC4",
			["LastEventHealth"] = {
				3180, -- [1]
				3180, -- [2]
				3180, -- [3]
				3180, -- [4]
				3180, -- [5]
				3180, -- [6]
				3155, -- [7]
				2978, -- [8]
				2595, -- [9]
				1558, -- [10]
				1558, -- [11]
				1558, -- [12]
				1558, -- [13]
				1106, -- [14]
				996, -- [15]
				913, -- [16]
				489, -- [17]
				3180, -- [18]
				3180, -- [19]
				3180, -- [20]
				3180, -- [21]
				3180, -- [22]
				3180, -- [23]
				3180, -- [24]
				2971, -- [25]
				2808, -- [26]
				2569, -- [27]
				2335, -- [28]
				2335, -- [29]
				2335, -- [30]
				2335, -- [31]
				2335, -- [32]
				3180, -- [33]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"MISC", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
			},
			["TimeWindows"] = {
				["Absorbs"] = {
					1890, -- [1]
				},
				["TimeHeal"] = {
					10.03, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					16.03, -- [1]
				},
				["HealingTaken"] = {
					1890, -- [1]
				},
				["TimeDamage"] = {
					6, -- [1]
				},
				["DamageTaken"] = {
					5880, -- [1]
				},
				["Damage"] = {
					2624, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "谁是小个子-火妖鲁西弗隆",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 7,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				3180, -- [1]
				3180, -- [2]
				3180, -- [3]
				3180, -- [4]
				3180, -- [5]
				3180, -- [6]
				3180, -- [7]
				3180, -- [8]
				3180, -- [9]
				3180, -- [10]
				3180, -- [11]
				3180, -- [12]
				3180, -- [13]
				3180, -- [14]
				3180, -- [15]
				3180, -- [16]
				3180, -- [17]
				3180, -- [18]
				3180, -- [19]
				3180, -- [20]
				3180, -- [21]
				3180, -- [22]
				3180, -- [23]
				3180, -- [24]
				3180, -- [25]
				3180, -- [26]
				3180, -- [27]
				3180, -- [28]
				3180, -- [29]
				3180, -- [30]
				3180, -- [31]
				3180, -- [32]
				3180, -- [33]
			},
			["LastHealTime"] = 4812.512,
			["LastDamageTaken"] = 250,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 4811.512,
				["Dispelled"] = 4804.511,
				["OVERALL"] = 4882.516000000001,
				["DamageTaken"] = 4882.516000000001,
				["Absorbs"] = 4811.512,
				["HealingTaken"] = 4811.512,
				["TimeDamage"] = 4801.511,
				["ActiveTime"] = 4811.512,
				["Damage"] = 4801.511,
			},
			["NextEventNum"] = 34,
			["LastDamageTime"] = 4801.611,
			["LastEvents"] = {
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Absorb -203 (203 被吸收) (1)", -- [1]
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Absorb -92 (92 被吸收) (1)", -- [2]
				"丷光头强丷 出血 谁是小个子-火妖鲁西弗隆 Absorb -188 (188 被吸收) (Physical)", -- [3]
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Absorb -208 (208 被吸收) (1)", -- [4]
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Absorb -175 (1)", -- [5]
				"丷光头强丷 出血 谁是小个子-火妖鲁西弗隆 Hit -25 (175 被吸收) (Physical)", -- [6]
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Crit -177 (Physical)", -- [7]
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Crit -383 (Physical)", -- [8]
				"丷光头强丷 刺骨 谁是小个子-火妖鲁西弗隆 Hit -1037 (Physical)", -- [9]
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Miss (1)", -- [10]
				"谁是小个子-火妖鲁西弗隆 冰霜新星 丷光头强丷 Hit -96 (Frost)", -- [11]
				"丷光头强丷 刺骨 谁是小个子-火妖鲁西弗隆 Hit -273 (Physical)", -- [12]
				"丷光头强丷 肉搏 谁是小个子-火妖鲁西弗隆 Hit -179 (Physical)", -- [13]
				"丷光头强丷 致命毒药 IV (伤害/跳) 谁是小个子-火妖鲁西弗隆 Tick -110 (Nature)", -- [14]
				"丷光头强丷 致命毒药 IV (伤害/跳) 谁是小个子-火妖鲁西弗隆 Tick -83 (28 被抵抗) (Nature)", -- [15]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 谁是小个子-火妖鲁西弗隆 Tick -314 (Shadow)", -- [16]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 谁是小个子-火妖鲁西弗隆 Tick -314 (Shadow)", -- [17]
				"谁是小个子-火妖鲁西弗隆 寒冰箭 延陵斩蛟-黑龙费尔默 Hit -840 (Frost)", -- [18]
				"延陵斩蛟-黑龙费尔默 弓射击 谁是小个子-火妖鲁西弗隆 Absorb -133 (133 被吸收) (Physical)", -- [19]
				"谁是小个子-火妖鲁西弗隆 寒冰箭 延陵斩蛟-黑龙费尔默 Hit -842 (Frost)", -- [20]
				"谁是小个子-火妖鲁西弗隆 寒冰箭 目空一切-逐风者 Hit -846 (Frost)", -- [21]
				"目空一切-逐风者 闪电之盾 谁是小个子-火妖鲁西弗隆 Absorb -174 (174 被吸收) (Nature)", -- [22]
				"广坤叔来啦-火妖鲁西弗隆 肉搏 谁是小个子-火妖鲁西弗隆 Absorb -559 (1)", -- [23]
				"广坤叔来啦-火妖鲁西弗隆 火焰冲击 谁是小个子-火妖鲁西弗隆 Hit -209 (559 被吸收) (Fire)", -- [24]
				"广坤叔来啦-火妖鲁西弗隆 铁皮手雷 谁是小个子-火妖鲁西弗隆 Hit -163 (Fire)", -- [25]
				"延陵斩蛟-黑龙费尔默 肉搏 谁是小个子-火妖鲁西弗隆 Hit -239 (Physical)", -- [26]
				"李老三 暗言术：痛 (伤害/跳) 谁是小个子-火妖鲁西弗隆 Tick -234 (Shadow)", -- [27]
				"李老三 dispels 谁是小个子-火妖鲁西弗隆 魔甲术 (驱散魔法)", -- [28]
				"李老三 dispels 谁是小个子-火妖鲁西弗隆 奥术智慧 (驱散魔法)", -- [29]
				"李老三 精神鞭笞 谁是小个子-火妖鲁西弗隆 Immune (Shadow)", -- [30]
				"子弹舍普琴科 冲锋击昏 谁是小个子-火妖鲁西弗隆 Immune (Physical)", -- [31]
				"李老三 噬灵瘟疫 (伤害/跳) 谁是小个子-火妖鲁西弗隆 Absorb -158 (158 被吸收) (Shadow)", -- [32]
				"Environment Falling 谁是小个子-火妖鲁西弗隆 Hit -250 (Physical)", -- [33]
			},
			["Name"] = "谁是小个子-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
			},
			["LastEventTimes"] = {
				4603.416, -- [1]
				4604.316, -- [2]
				4604.949000000001, -- [3]
				4605.216, -- [4]
				4605.949000000001, -- [5]
				4605.949000000001, -- [6]
				4606.133, -- [7]
				4607.016000000001, -- [8]
				4607.799, -- [9]
				4607.933, -- [10]
				4608.783, -- [11]
				4608.816, -- [12]
				4608.833000000001, -- [13]
				4608.983, -- [14]
				4611.966, -- [15]
				4612.6, -- [16]
				4615.583000000001, -- [17]
				4791.427, -- [18]
				4791.761, -- [19]
				4793.977, -- [20]
				4801.611, -- [21]
				4801.628, -- [22]
				4803.128, -- [23]
				4803.128, -- [24]
				4803.828, -- [25]
				4804.778, -- [26]
				4804.828, -- [27]
				4805.095, -- [28]
				4805.095, -- [29]
				4806.661, -- [30]
				4809.312, -- [31]
				4812.512, -- [32]
				4883.366, -- [33]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["谁是小个子-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 10.03,
								},
							},
							["amount"] = 10.03,
						},
					},
					["Dispelled"] = 2,
					["TimeSpent"] = {
						["目空一切-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["谁是小个子-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 10.03,
								},
							},
							["amount"] = 10.03,
						},
					},
					["DamageTaken"] = 5880,
					["ElementTakenResist"] = {
						["Nature"] = 28,
					},
					["PartialResist"] = {
						["精神鞭笞"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["弓射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 2,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
					},
					["PartialAbsorb"] = {
						["精神鞭笞"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 158,
									["min"] = 158,
									["count"] = 1,
									["amount"] = 158,
								},
							},
							["count"] = 1,
							["amount"] = 158,
						},
						["弓射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 133,
									["min"] = 133,
									["count"] = 1,
									["amount"] = 133,
								},
							},
							["count"] = 1,
							["amount"] = 133,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 559,
									["min"] = 559,
									["count"] = 1,
									["amount"] = 559,
								},
							},
							["count"] = 1,
							["amount"] = 559,
						},
						["闪电之盾"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 174,
									["min"] = 174,
									["count"] = 1,
									["amount"] = 174,
								},
							},
							["count"] = 1,
							["amount"] = 174,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 188,
									["min"] = 175,
									["count"] = 2,
									["amount"] = 363,
								},
							},
							["count"] = 2,
							["amount"] = 363,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 208,
									["min"] = 92,
									["count"] = 3,
									["amount"] = 503,
								},
							},
							["count"] = 10,
							["amount"] = 503,
						},
					},
					["ActiveTime"] = 16.03,
					["ElementTaken"] = {
						["Physical"] = 1906,
						["Melee"] = 2215,
						["Fire"] = 372,
						["Shadow"] = 1020,
						["Nature"] = 367,
					},
					["WhoDispelled"] = {
						["李老三"] = {
							["Details"] = {
								["魔甲术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["奥术智慧 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Damage"] = 2624,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 559,
									["min"] = 92,
									["count"] = 9,
									["amount"] = 1890,
								},
							},
							["count"] = 9,
							["amount"] = 1890,
						},
					},
					["HealedWho"] = {
						["谁是小个子-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1890,
								},
							},
							["amount"] = 1890,
						},
					},
					["ElementDone"] = {
						["Frost"] = 2624,
					},
					["TimeHeal"] = 10.03,
					["TimeDamaging"] = {
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ElementTakenAbsorb"] = {
						["Physical"] = 496,
						["Melee"] = 503,
						["Fire"] = 559,
						["Shadow"] = 158,
						["Nature"] = 174,
					},
					["WhoHealed"] = {
						["谁是小个子-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1890,
								},
							},
							["amount"] = 1890,
						},
					},
					["Attacks"] = {
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 846,
									["min"] = 840,
									["count"] = 3,
									["amount"] = 2528,
								},
							},
							["count"] = 3,
							["amount"] = 2528,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 96,
									["min"] = 96,
									["count"] = 1,
									["amount"] = 96,
								},
							},
							["count"] = 1,
							["amount"] = 96,
						},
					},
					["HealingTaken"] = 1890,
					["DamagedWho"] = {
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1682,
								},
							},
							["amount"] = 1682,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 96,
								},
							},
							["amount"] = 96,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 846,
								},
							},
							["amount"] = 846,
						},
					},
					["TimeDamage"] = 6,
					["WhoDamaged"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 628,
								},
							},
							["amount"] = 628,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 193,
								},
								["刺骨"] = {
									["count"] = 1310,
								},
								["出血"] = {
									["count"] = 213,
								},
								["肉搏"] = {
									["count"] = 1417,
								},
							},
							["amount"] = 3133,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 250,
								},
							},
							["amount"] = 250,
						},
						["李老三"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 234,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 158,
								},
							},
							["amount"] = 392,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 239,
								},
								["弓射击"] = {
									["count"] = 133,
								},
							},
							["amount"] = 372,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 209,
								},
								["铁皮手雷"] = {
									["count"] = 163,
								},
								["肉搏"] = {
									["count"] = 559,
								},
							},
							["amount"] = 931,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 174,
								},
							},
							["amount"] = 174,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 10,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["Absorbs"] = 1890,
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["谁是小个子-火妖鲁西弗隆"] = {
									["max"] = 559,
									["min"] = 92,
									["count"] = 9,
									["amount"] = 1890,
								},
							},
							["count"] = 9,
							["amount"] = 1890,
						},
					},
				},
			},
			["UnitLockout"] = 4790.51,
			["LastActive"] = 4882.516000000001,
		},
		["作战小鸡"] = {
			["GUID"] = "Creature-0-5427-489-12952-8836-00001F4C77",
			["Name"] = "作战小鸡",
			["Fights"] = {
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
			},
			["Owner"] = false,
			["UnitLockout"] = 4827.513,
			["LastFightIn"] = 6,
		},
		["怒剑长空-火妖鲁西弗隆"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						false, -- [29]
						false, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
						true, -- [35]
						false, -- [36]
						false, -- [37]
						false, -- [38]
						false, -- [39]
						true, -- [40]
						true, -- [41]
						false, -- [42]
						true, -- [43]
						true, -- [44]
					},
					["Messages"] = {
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Hit -146 (Physical)", -- [1]
						"怒剑长空-火妖鲁西弗隆 致死打击 目空一切-逐风者 Hit -433 (Physical)", -- [2]
						"目空一切-逐风者 闪电之盾 怒剑长空-火妖鲁西弗隆 Hit -218 (Nature)", -- [3]
						"怒剑长空-火妖鲁西弗隆 肉搏 目空一切-逐风者 Hit -354 (Physical)", -- [4]
						"怒剑长空-火妖鲁西弗隆 旋风斩 延陵斩蛟-黑龙费尔默 Hit -229 (Physical)", -- [5]
						"怒剑长空-火妖鲁西弗隆 旋风斩 紫衣战天下 Hit -442 (Physical)", -- [6]
						"怒剑长空-火妖鲁西弗隆 旋风斩 目空一切-逐风者 Hit -364 (Physical)", -- [7]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Hit -178 (Physical)", -- [8]
						"延陵斩蛟-黑龙费尔默 盾牌猛击 怒剑长空-火妖鲁西弗隆 Hit -333 (Physical)", -- [9]
						"紫衣战天下 心灵震爆 怒剑长空-火妖鲁西弗隆 Hit -168 (456 被抵抗) (Shadow)", -- [10]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Crit -281 (Physical)", -- [11]
						"怒剑长空-火妖鲁西弗隆 拳击 目空一切-逐风者 Hit -42 (Physical)", -- [12]
						"怒剑长空-火妖鲁西弗隆 interrupts 目空一切-逐风者 次级治疗波 (拳击)", -- [13]
						"目空一切-逐风者 闪电之盾 怒剑长空-火妖鲁西弗隆 Hit -218 (Nature)", -- [14]
						"怒剑长空-火妖鲁西弗隆 英勇打击 目空一切-逐风者 Dodge (Physical)", -- [15]
						"紫衣战天下 惩击 怒剑长空-火妖鲁西弗隆 Hit -577 (Holy)", -- [16]
						"怒剑长空-火妖鲁西弗隆 压制 目空一切-逐风者 Absorb -976 (976 被吸收) (Physical)", -- [17]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [18]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Hit -178 (Physical)", -- [19]
						"延陵斩蛟-黑龙费尔默 重伤 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -38 (Physical)", -- [20]
						"延陵斩蛟-黑龙费尔默 盾牌猛击 怒剑长空-火妖鲁西弗隆 Hit -331 (Physical)", -- [21]
						"怒剑长空-火妖鲁西弗隆 断筋 紫衣战天下 Hit -49 (Physical)", -- [22]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [23]
						"目空一切-逐风者 冰霜震击 怒剑长空-火妖鲁西弗隆 Hit -587 (Frost)", -- [24]
						"怒剑长空-火妖鲁西弗隆 重伤 (伤害/跳) 目空一切-逐风者 Absorb -120 (120 被吸收) (Physical)", -- [25]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Crit -353 (Physical)", -- [26]
						"怒剑长空-火妖鲁西弗隆 肉搏 紫衣战天下 Crit -1087 (Physical)", -- [27]
						"延陵斩蛟-黑龙费尔默 拳击 怒剑长空-火妖鲁西弗隆 Hit -34 (Physical)", -- [28]
						"怒剑长空-火妖鲁西弗隆 致死打击 紫衣战天下 Hit -741 (Physical)", -- [29]
						"怒剑长空-火妖鲁西弗隆 致死打击 (剑类武器专精) 紫衣战天下 Hit -509 (Physical)", -- [30]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Hit -160 (Physical)", -- [31]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [32]
						"延陵斩蛟-黑龙费尔默 斩杀 怒剑长空-火妖鲁西弗隆 Hit -489 (Physical)", -- [33]
						"怒剑长空-火妖鲁西弗隆 重伤 (伤害/跳) 目空一切-逐风者 Tick -120 (Physical)", -- [34]
						"延陵斩蛟-黑龙费尔默 重伤 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -39 (Physical)", -- [35]
						"怒剑长空-火妖鲁西弗隆 旋风斩 紫衣战天下 Hit -493 (Physical)", -- [36]
						"怒剑长空-火妖鲁西弗隆 旋风斩 延陵斩蛟-黑龙费尔默 Hit -308 (Physical)", -- [37]
						"怒剑长空-火妖鲁西弗隆 英勇打击 紫衣战天下 Hit -758 (Physical)", -- [38]
						"怒剑长空-火妖鲁西弗隆 重伤 (伤害/跳) 紫衣战天下 Tick -120 (Physical)", -- [39]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Dodge (1)", -- [40]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [41]
						"怒剑长空-火妖鲁西弗隆 斩杀 紫衣战天下 Hit -733 (Physical)", -- [42]
						"延陵斩蛟-黑龙费尔默 斩杀 怒剑长空-火妖鲁西弗隆 Hit -416 (Physical)", -- [43]
						"怒剑长空-火妖鲁西弗隆死亡。", -- [44]
					},
					["DeathAt"] = 4957.52,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
					},
					["MessageTimes"] = {
						-14.58399999999983, -- [1]
						-14.19999999999982, -- [2]
						-14.1840000000002, -- [3]
						-13.98400000000038, -- [4]
						-12.69999999999982, -- [5]
						-12.69999999999982, -- [6]
						-12.69999999999982, -- [7]
						-12.68299999999999, -- [8]
						-12.61700000000019, -- [9]
						-11.1840000000002, -- [10]
						-10.26699999999983, -- [11]
						-10.19999999999982, -- [12]
						-10.19999999999982, -- [13]
						-10.16700000000037, -- [14]
						-9.78399999999965, -- [15]
						-9.182999999999993, -- [16]
						-8.582999999999629, -- [17]
						-8.25, -- [18]
						-7.350000000000364, -- [19]
						-7.230999999999767, -- [20]
						-6.382999999999811, -- [21]
						-6.300000000000182, -- [22]
						-6.266999999999825, -- [23]
						-6.216000000000349, -- [24]
						-5.550000000000182, -- [25]
						-5.432999999999993, -- [26]
						-5.067000000000007, -- [27]
						-4.865999999999985, -- [28]
						-4.350000000000364, -- [29]
						-4.332999999999629, -- [30]
						-3.533000000000357, -- [31]
						-3.432999999999993, -- [32]
						-2.699999999999818, -- [33]
						-2.565999999999804, -- [34]
						-2.399999999999636, -- [35]
						-2.233000000000175, -- [36]
						-2.233000000000175, -- [37]
						-2.233000000000175, -- [38]
						-2.033000000000357, -- [39]
						-1.632999999999811, -- [40]
						-1.432999999999993, -- [41]
						-0.7330000000001746, -- [42]
						-0.01599999999962165, -- [43]
						0, -- [44]
					},
					["HealthMax"] = {
						7029, -- [1]
						7029, -- [2]
						7029, -- [3]
						7029, -- [4]
						7029, -- [5]
						7029, -- [6]
						7029, -- [7]
						7029, -- [8]
						7029, -- [9]
						7029, -- [10]
						7029, -- [11]
						7029, -- [12]
						7029, -- [13]
						7029, -- [14]
						7029, -- [15]
						7029, -- [16]
						7029, -- [17]
						7029, -- [18]
						7029, -- [19]
						7029, -- [20]
						7029, -- [21]
						7029, -- [22]
						7029, -- [23]
						7029, -- [24]
						7029, -- [25]
						7029, -- [26]
						7029, -- [27]
						7029, -- [28]
						7029, -- [29]
						7029, -- [30]
						7029, -- [31]
						7029, -- [32]
						7029, -- [33]
						7029, -- [34]
						7029, -- [35]
						7029, -- [36]
						7029, -- [37]
						7029, -- [38]
						7029, -- [39]
						7029, -- [40]
						7029, -- [41]
						7029, -- [42]
						7029, -- [43]
						7029, -- [44]
					},
					["Health"] = {
						4575, -- [1]
						4092, -- [2]
						4092, -- [3]
						3874, -- [4]
						3874, -- [5]
						3874, -- [6]
						3874, -- [7]
						3874, -- [8]
						3693, -- [9]
						3360, -- [10]
						3192, -- [11]
						2911, -- [12]
						2911, -- [13]
						2911, -- [14]
						2693, -- [15]
						2693, -- [16]
						2116, -- [17]
						2116, -- [18]
						2186, -- [19]
						2008, -- [20]
						1970, -- [21]
						1639, -- [22]
						1639, -- [23]
						1709, -- [24]
						1122, -- [25]
						1122, -- [26]
						769, -- [27]
						769, -- [28]
						735, -- [29]
						735, -- [30]
						735, -- [31]
						575, -- [32]
						645, -- [33]
						156, -- [34]
						156, -- [35]
						117, -- [36]
						117, -- [37]
						117, -- [38]
						114, -- [39]
						114, -- [40]
						114, -- [41]
						184, -- [42]
						184, -- [43]
						0, -- [44]
					},
					["KilledBy"] = "延陵斩蛟-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"MISC", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"HEAL", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"HEAL", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"HEAL", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"HEAL", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"MISC", -- [44]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
					},
					["Messages"] = {
						"延陵斩蛟-黑龙费尔默 拦截昏迷 怒剑长空-火妖鲁西弗隆 Hit -46 (Physical)", -- [1]
						"怒剑长空-火妖鲁西弗隆 重伤 (伤害/跳) 子弹舍普琴科 Absorb -82 (82 被吸收) (Physical)", -- [2]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [3]
						"丷光头强丷 致命毒药 IV (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -31 (Nature)", -- [4]
						"怒剑长空-火妖鲁西弗隆 肉搏 延陵斩蛟-黑龙费尔默 Hit -361 (Physical)", -- [5]
						"怒剑长空-火妖鲁西弗隆 断筋 延陵斩蛟-黑龙费尔默 Hit -27 (Physical)", -- [6]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Crit -299 (Physical)", -- [7]
						"延陵斩蛟-黑龙费尔默 旋风斩 怒剑长空-火妖鲁西弗隆 Crit -460 (Physical)", -- [8]
						"怒剑长空-火妖鲁西弗隆 钻石水瓶 怒剑长空-火妖鲁西弗隆 Tick +9", -- [9]
						"丷光头强丷 致命毒药 IV (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -30 (Nature)", -- [10]
						"延陵斩蛟-黑龙费尔默 dispels 怒剑长空-火妖鲁西弗隆 诺格弗格药剂 (盾牌猛击)", -- [11]
						"延陵斩蛟-黑龙费尔默 盾牌猛击 怒剑长空-火妖鲁西弗隆 Hit -271 (Physical)", -- [12]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [13]
						"延陵斩蛟-黑龙费尔默 重伤 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -48 (Physical)", -- [14]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Hit -181 (Physical)", -- [15]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [16]
						"怒剑长空-火妖鲁西弗隆 钻石水瓶 怒剑长空-火妖鲁西弗隆 Tick +9", -- [17]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +71", -- [18]
						"延陵斩蛟-黑龙费尔默 重伤 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -40 (Physical)", -- [19]
						"目空一切-逐风者 冰霜震击 怒剑长空-火妖鲁西弗隆 Hit -488 (Frost)", -- [20]
						"延陵斩蛟-黑龙费尔默 重伤 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -33 (Physical)", -- [21]
						"子弹舍普琴科 断筋 怒剑长空-火妖鲁西弗隆 Hit -30 (Physical)", -- [22]
						"怒剑长空-火妖鲁西弗隆 肉搏 子弹舍普琴科 Dodge (1)", -- [23]
						"怒剑长空-火妖鲁西弗隆 肉搏 子弹舍普琴科 Absorb -48 (1)", -- [24]
						"怒剑长空-火妖鲁西弗隆 断筋 子弹舍普琴科 Crit -27 (48 被吸收) (Physical)", -- [25]
						"怒剑长空-火妖鲁西弗隆 钻石水瓶 怒剑长空-火妖鲁西弗隆 Tick +9", -- [26]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -357 (Shadow)", -- [27]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -373 (Shadow)", -- [28]
						"子弹舍普琴科 斩杀 怒剑长空-火妖鲁西弗隆 Hit -536 (Physical)", -- [29]
						"怒剑长空-火妖鲁西弗隆死亡。", -- [30]
						"怒剑长空-火妖鲁西弗隆 重伤 (伤害/跳) 子弹舍普琴科 Tick -142 (Physical)", -- [31]
					},
					["DeathAt"] = 4868.515,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
					},
					["MessageTimes"] = {
						-14.46799999999985, -- [1]
						-14.16800000000058, -- [2]
						-13.98500000000058, -- [3]
						-12.76800000000003, -- [4]
						-11.33399999999983, -- [5]
						-11.16800000000058, -- [6]
						-10.96799999999985, -- [7]
						-10.95100000000002, -- [8]
						-10.65099999999984, -- [9]
						-9.768000000000029, -- [10]
						-9.134000000000015, -- [11]
						-9.134000000000015, -- [12]
						-8.951000000000022, -- [13]
						-7.918000000000575, -- [14]
						-7.384000000000015, -- [15]
						-6.951000000000022, -- [16]
						-5.65099999999984, -- [17]
						-4.934000000000197, -- [18]
						-4.917000000000371, -- [19]
						-3.634000000000015, -- [20]
						-1.917000000000371, -- [21]
						-1.551000000000386, -- [22]
						-1.400000000000546, -- [23]
						-1.167000000000371, -- [24]
						-1.167000000000371, -- [25]
						-0.6500000000005457, -- [26]
						-0.5839999999998327, -- [27]
						-0.1170000000001892, -- [28]
						-0.01699999999982538, -- [29]
						0, -- [30]
						1.865999999999985, -- [31]
					},
					["HealthMax"] = {
						7029, -- [1]
						7029, -- [2]
						7029, -- [3]
						7029, -- [4]
						7029, -- [5]
						7029, -- [6]
						7029, -- [7]
						7029, -- [8]
						7029, -- [9]
						7029, -- [10]
						7029, -- [11]
						7029, -- [12]
						7029, -- [13]
						7029, -- [14]
						7029, -- [15]
						7029, -- [16]
						7029, -- [17]
						7029, -- [18]
						7029, -- [19]
						7029, -- [20]
						7029, -- [21]
						7029, -- [22]
						7029, -- [23]
						7029, -- [24]
						7029, -- [25]
						7029, -- [26]
						7029, -- [27]
						7029, -- [28]
						7029, -- [29]
						7029, -- [30]
						7029, -- [31]
					},
					["Health"] = {
						2788, -- [1]
						2742, -- [2]
						2742, -- [3]
						2812, -- [4]
						2781, -- [5]
						2778, -- [6]
						2774, -- [7]
						2475, -- [8]
						2015, -- [9]
						2024, -- [10]
						1994, -- [11]
						1994, -- [12]
						1723, -- [13]
						1793, -- [14]
						1745, -- [15]
						1564, -- [16]
						1634, -- [17]
						1643, -- [18]
						1643, -- [19]
						1674, -- [20]
						1186, -- [21]
						1153, -- [22]
						1123, -- [23]
						1123, -- [24]
						1123, -- [25]
						1123, -- [26]
						1123, -- [27]
						775, -- [28]
						402, -- [29]
						0, -- [30]
						0, -- [31]
					},
					["KilledBy"] = "子弹舍普琴科",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"HEAL", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"HEAL", -- [9]
						"DAMAGE", -- [10]
						"MISC", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"HEAL", -- [16]
						"HEAL", -- [17]
						"HEAL", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"HEAL", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"MISC", -- [30]
						"DAMAGE", -- [31]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						true, -- [47]
						true, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"目空一切-逐风者 肉搏 怒剑长空-火妖鲁西弗隆 Hit -321 (Physical)", -- [1]
						"村里老中医-黑龙费尔默 月火术 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -101 (Arcane)", -- [2]
						"延陵斩蛟-黑龙费尔默 冲锋击昏 怒剑长空-火妖鲁西弗隆 Immune (Physical)", -- [3]
						"目空一切-逐风者 地震术 怒剑长空-火妖鲁西弗隆 Resist (Nature)", -- [4]
						"子弹舍普琴科 断筋 怒剑长空-火妖鲁西弗隆 Hit -25 (Physical)", -- [5]
						"紫衣战天下 dispels 怒剑长空-火妖鲁西弗隆 诺格弗格药剂 (驱散魔法)", -- [6]
						"紫衣战天下 dispels 怒剑长空-火妖鲁西弗隆 自由行动 (驱散魔法)", -- [7]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +69", -- [8]
						"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Hit -148 (Physical)", -- [9]
						"怒剑长空-火妖鲁西弗隆 生命赐福 怒剑长空-火妖鲁西弗隆 Hit +1183", -- [10]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [11]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [12]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +79", -- [13]
						"村里老中医-黑龙费尔默 月火术 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -102 (Arcane)", -- [14]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [15]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [16]
						"子弹舍普琴科 拦截昏迷 怒剑长空-火妖鲁西弗隆 Hit -36 (Physical)", -- [17]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +79", -- [18]
						"目空一切-逐风者 冰霜震击 怒剑长空-火妖鲁西弗隆 Hit -533 (Frost)", -- [19]
						"子弹舍普琴科 肉搏 怒剑长空-火妖鲁西弗隆 Hit -247 (Physical)", -- [20]
						"村里老中医-黑龙费尔默 月火术 怒剑长空-火妖鲁西弗隆 Hit -224 (Arcane)", -- [21]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [22]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [23]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Miss (1)", -- [24]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [25]
						"怒剑长空-火妖鲁西弗隆 逃跑 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -349 (Physical)", -- [26]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Crit -121 (Physical)", -- [27]
						"丷光头强丷 出血 怒剑长空-火妖鲁西弗隆 Crit -291 (Physical)", -- [28]
						"村里老中医-黑龙费尔默 月火术 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -101 (Arcane)", -- [29]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -345 (Shadow)", -- [30]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Hit -115 (Physical)", -- [31]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Hit -55 (Physical)", -- [32]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -345 (Shadow)", -- [33]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +79", -- [34]
						"丷光头强丷 出血 怒剑长空-火妖鲁西弗隆 Crit -249 (Physical)", -- [35]
						"丷光头强丷 致命毒药 IV 怒剑长空-火妖鲁西弗隆 Resist (Nature)", -- [36]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -345 (Shadow)", -- [37]
						"紫衣战天下 心灵震爆 怒剑长空-火妖鲁西弗隆 Crit -929 (Shadow)", -- [38]
						"村里老中医-黑龙费尔默 月火术 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -102 (Arcane)", -- [39]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Hit -126 (Physical)", -- [40]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Hit -58 (Physical)", -- [41]
						"目空一切-逐风者 肉搏 怒剑长空-火妖鲁西弗隆 Hit -253 (Physical)", -- [42]
						"目空一切-逐风者 肉搏 怒剑长空-火妖鲁西弗隆 Hit -315 (Physical)", -- [43]
						"目空一切-逐风者 肉搏 怒剑长空-火妖鲁西弗隆 Hit -291 (Physical)", -- [44]
						"丷光头强丷 刺骨 怒剑长空-火妖鲁西弗隆 Hit -328 (Physical)", -- [45]
						"丷光头强丷 致命毒药 IV 怒剑长空-火妖鲁西弗隆 Resist (Nature)", -- [46]
						"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +79", -- [47]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Miss (1)", -- [48]
						"目空一切-逐风者 地震术 怒剑长空-火妖鲁西弗隆 Hit -570 (Nature)", -- [49]
						"怒剑长空-火妖鲁西弗隆死亡。", -- [50]
					},
					["DeathAt"] = 4677.52,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-14.60099999999966, -- [1]
						-13.36699999999928, -- [2]
						-13.18399999999929, -- [3]
						-13.09999999999945, -- [4]
						-13.09999999999945, -- [5]
						-13.06700000000001, -- [6]
						-13.06700000000001, -- [7]
						-12.60099999999966, -- [8]
						-12.18399999999929, -- [9]
						-11.59999999999945, -- [10]
						-11.25, -- [11]
						-11.25, -- [12]
						-10.59999999999945, -- [13]
						-10.34999999999945, -- [14]
						-9.25, -- [15]
						-9.25, -- [16]
						-8.649999999999636, -- [17]
						-8.599999999999454, -- [18]
						-8.099999999999454, -- [19]
						-8.016999999999825, -- [20]
						-8, -- [21]
						-7.25, -- [22]
						-7.25, -- [23]
						-6, -- [24]
						-5.25, -- [25]
						-5.25, -- [26]
						-5.082999999999629, -- [27]
						-5.016999999999825, -- [28]
						-5, -- [29]
						-4.232999999999265, -- [30]
						-3.682999999999993, -- [31]
						-3.282999999999447, -- [32]
						-3.25, -- [33]
						-3.016999999999825, -- [34]
						-2.582999999999629, -- [35]
						-2.565999999999804, -- [36]
						-2.232999999999265, -- [37]
						-2.21599999999944, -- [38]
						-2, -- [39]
						-1.882999999999811, -- [40]
						-1.46599999999944, -- [41]
						-1.016999999999825, -- [42]
						-1.016999999999825, -- [43]
						-1.016999999999825, -- [44]
						-0.2659999999996217, -- [45]
						-0.2659999999996217, -- [46]
						-0.2159999999994398, -- [47]
						-0.08299999999962893, -- [48]
						-0.01599999999962165, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						6859, -- [1]
						6859, -- [2]
						6859, -- [3]
						6859, -- [4]
						6859, -- [5]
						6859, -- [6]
						6859, -- [7]
						6859, -- [8]
						6859, -- [9]
						6859, -- [10]
						7887, -- [11]
						7887, -- [12]
						7887, -- [13]
						7887, -- [14]
						7887, -- [15]
						7887, -- [16]
						7887, -- [17]
						7887, -- [18]
						7887, -- [19]
						7887, -- [20]
						7887, -- [21]
						7887, -- [22]
						7887, -- [23]
						7887, -- [24]
						7887, -- [25]
						7887, -- [26]
						7887, -- [27]
						7887, -- [28]
						7887, -- [29]
						7887, -- [30]
						7887, -- [31]
						7887, -- [32]
						7887, -- [33]
						7887, -- [34]
						7887, -- [35]
						7887, -- [36]
						7887, -- [37]
						7887, -- [38]
						7887, -- [39]
						7887, -- [40]
						7887, -- [41]
						7887, -- [42]
						7887, -- [43]
						7887, -- [44]
						7887, -- [45]
						7887, -- [46]
						7887, -- [47]
						7887, -- [48]
						7887, -- [49]
						6859, -- [50]
					},
					["Health"] = {
						6696, -- [1]
						5222, -- [2]
						4772, -- [3]
						4772, -- [4]
						4772, -- [5]
						4747, -- [6]
						4747, -- [7]
						4747, -- [8]
						4816, -- [9]
						4668, -- [10]
						6879, -- [11]
						6879, -- [12]
						6530, -- [13]
						6609, -- [14]
						6507, -- [15]
						6507, -- [16]
						6158, -- [17]
						6122, -- [18]
						6201, -- [19]
						5668, -- [20]
						5421, -- [21]
						5197, -- [22]
						5197, -- [23]
						4848, -- [24]
						4848, -- [25]
						4848, -- [26]
						4499, -- [27]
						4378, -- [28]
						4378, -- [29]
						3986, -- [30]
						3641, -- [31]
						3526, -- [32]
						3471, -- [33]
						3126, -- [34]
						3205, -- [35]
						2956, -- [36]
						2956, -- [37]
						2611, -- [38]
						1682, -- [39]
						1580, -- [40]
						1454, -- [41]
						1396, -- [42]
						1396, -- [43]
						1396, -- [44]
						537, -- [45]
						537, -- [46]
						209, -- [47]
						288, -- [48]
						288, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "目空一切-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"MISC", -- [6]
						"MISC", -- [7]
						"HEAL", -- [8]
						"DAMAGE", -- [9]
						"HEAL", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"HEAL", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"HEAL", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"HEAL", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
					},
					["Messages"] = {
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Miss (1)", -- [1]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Hit -60 (Physical)", -- [2]
						"丷光头强丷 刺骨 怒剑长空-火妖鲁西弗隆 Hit -388 (Physical)", -- [3]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Hit -118 (Physical)", -- [4]
						"丷光头强丷 刺骨 怒剑长空-火妖鲁西弗隆 Hit -190 (Physical)", -- [5]
						"丷光头强丷 肉搏 怒剑长空-火妖鲁西弗隆 Hit -53 (Physical)", -- [6]
						"丷光头强丷 速效毒药 VI 怒剑长空-火妖鲁西弗隆 Hit -131 (Nature)", -- [7]
						"怒剑长空-火妖鲁西弗隆死亡。", -- [8]
					},
					["DeathAt"] = 4577.514,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
					},
					["MessageTimes"] = {
						-2.75, -- [1]
						-1.849999999999454, -- [2]
						-1.599999999999454, -- [3]
						-0.9499999999998181, -- [4]
						-0.532999999999447, -- [5]
						-0.0499999999992724, -- [6]
						-0.0499999999992724, -- [7]
						0, -- [8]
					},
					["HealthMax"] = {
						7029, -- [1]
						7029, -- [2]
						7029, -- [3]
						7029, -- [4]
						7029, -- [5]
						7029, -- [6]
						7029, -- [7]
						7029, -- [8]
					},
					["Health"] = {
						824, -- [1]
						824, -- [2]
						764, -- [3]
						376, -- [4]
						258, -- [5]
						68, -- [6]
						68, -- [7]
						0, -- [8]
					},
					["KilledBy"] = "丷光头强丷",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"MISC", -- [8]
					},
				}, -- [4]
			},
			["TimeLast"] = {
				["TimeHeal"] = 5102.512,
				["Dispelled"] = 4937.519,
				["Interrupts"] = 4945.519,
				["Healing"] = 5102.512,
				["OVERALL"] = 5111.513,
				["DamageTaken"] = 5111.513,
				["RageGain"] = 4951.52,
				["FDamage"] = 4670.52,
				["DeathCount"] = 4955.52,
				["HOT_Time"] = 5102.512,
				["ActiveTime"] = 5102.512,
				["HealingTaken"] = 5102.512,
				["TimeDamage"] = 5097.512,
				["DOT_Time"] = 4953.52,
				["Damage"] = 5097.512,
			},
			["LastAttackedBy"] = "李老三",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"MISC", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"HEAL", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"HEAL", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"HEAL", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					38.54000000000001, -- [1]
				},
				["Dispelled"] = {
					4, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["Healing"] = {
					2627, -- [1]
				},
				["DamageTaken"] = {
					29244, -- [1]
				},
				["HealingTaken"] = {
					2627, -- [1]
				},
				["RageGain"] = {
					70, -- [1]
				},
				["DeathCount"] = {
					4, -- [1]
				},
				["HOT_Time"] = {
					78, -- [1]
				},
				["ActiveTime"] = {
					97.64999999999999, -- [1]
				},
				["FDamage"] = {
					1396, -- [1]
				},
				["TimeDamage"] = {
					59.10999999999999, -- [1]
				},
				["DOT_Time"] = {
					45, -- [1]
				},
				["Damage"] = {
					19446, -- [1]
				},
			},
			["LastHealTime"] = 5102.796,
			["LastDamageTaken"] = 170,
			["level"] = 60,
			["LastDamageAbility"] = "噬灵瘟疫 (伤害/跳)",
			["LastFightIn"] = 10,
			["GUID"] = "Player-5445-0311179B",
			["type"] = "Ungrouped",
			["LastEventHealth"] = {
				156, -- [1]
				117, -- [2]
				117, -- [3]
				117, -- [4]
				114, -- [5]
				114, -- [6]
				114, -- [7]
				184, -- [8]
				184, -- [9]
				0, -- [10]
				6859, -- [11]
				6817, -- [12]
				6817, -- [13]
				6568, -- [14]
				6568, -- [15]
				6568, -- [16]
				6568, -- [17]
				6142, -- [18]
				6142, -- [19]
				5943, -- [20]
				5943, -- [21]
				5788, -- [22]
				5568, -- [23]
				5568, -- [24]
				5568, -- [25]
				5247, -- [26]
				5247, -- [27]
				5247, -- [28]
				4821, -- [29]
				4821, -- [30]
				4901, -- [31]
				4970, -- [32]
				4970, -- [33]
				4544, -- [34]
				4613, -- [35]
				4681, -- [36]
				4681, -- [37]
				4343, -- [38]
				4343, -- [39]
				4190, -- [40]
				4190, -- [41]
				4328, -- [42]
				4328, -- [43]
				769, -- [44]
				735, -- [45]
				735, -- [46]
				735, -- [47]
				575, -- [48]
				645, -- [49]
				156, -- [50]
			},
			["enClass"] = "WARRIOR",
			["unit"] = "怒剑长空-火妖鲁西弗隆",
			["Owner"] = false,
			["LastEventHealthMax"] = {
				7029, -- [1]
				7029, -- [2]
				7029, -- [3]
				7029, -- [4]
				7029, -- [5]
				7029, -- [6]
				7029, -- [7]
				7029, -- [8]
				7029, -- [9]
				7029, -- [10]
				6859, -- [11]
				6859, -- [12]
				6859, -- [13]
				6859, -- [14]
				6859, -- [15]
				6859, -- [16]
				6859, -- [17]
				6859, -- [18]
				6859, -- [19]
				6859, -- [20]
				6859, -- [21]
				6859, -- [22]
				6859, -- [23]
				6859, -- [24]
				6859, -- [25]
				6859, -- [26]
				6859, -- [27]
				6859, -- [28]
				6859, -- [29]
				6859, -- [30]
				6859, -- [31]
				6859, -- [32]
				6859, -- [33]
				6859, -- [34]
				6859, -- [35]
				6859, -- [36]
				6859, -- [37]
				6859, -- [38]
				6859, -- [39]
				6859, -- [40]
				6859, -- [41]
				6859, -- [42]
				6859, -- [43]
				7029, -- [44]
				7029, -- [45]
				7029, -- [46]
				7029, -- [47]
				7029, -- [48]
				7029, -- [49]
				7029, -- [50]
			},
			["NextEventNum"] = 44,
			["LastDamageTime"] = 5097.628,
			["LastEvents"] = {
				"延陵斩蛟-黑龙费尔默 重伤 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -39 (Physical)", -- [1]
				"怒剑长空-火妖鲁西弗隆 旋风斩 紫衣战天下 Hit -493 (Physical)", -- [2]
				"怒剑长空-火妖鲁西弗隆 旋风斩 延陵斩蛟-黑龙费尔默 Hit -308 (Physical)", -- [3]
				"怒剑长空-火妖鲁西弗隆 英勇打击 紫衣战天下 Hit -758 (Physical)", -- [4]
				"怒剑长空-火妖鲁西弗隆 重伤 (伤害/跳) 紫衣战天下 Tick -120 (Physical)", -- [5]
				"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Dodge (1)", -- [6]
				"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [7]
				"怒剑长空-火妖鲁西弗隆 斩杀 紫衣战天下 Hit -733 (Physical)", -- [8]
				"延陵斩蛟-黑龙费尔默 斩杀 怒剑长空-火妖鲁西弗隆 Hit -416 (Physical)", -- [9]
				"怒剑长空-火妖鲁西弗隆死亡。", -- [10]
				"李老三 肉搏 怒剑长空-火妖鲁西弗隆 Hit -42 (Physical)", -- [11]
				"怒剑长空-火妖鲁西弗隆 肉搏 美女婉君-老马布兰契 Hit -187 (Physical)", -- [12]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -249 (Shadow)", -- [13]
				"怒剑长空-火妖鲁西弗隆 断筋 美女婉君-老马布兰契 Hit -32 (Physical)", -- [14]
				"怒剑长空-火妖鲁西弗隆 肉搏 美女婉君-老马布兰契 Hit -199 (Physical)", -- [15]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -257 (Shadow)", -- [16]
				"李老三 噬灵瘟疫 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -169 (Shadow)", -- [17]
				"美女婉君-老马布兰契 肉搏 怒剑长空-火妖鲁西弗隆 Hit -94 (Physical)", -- [18]
				"美女婉君-老马布兰契 出血 怒剑长空-火妖鲁西弗隆 Hit -105 (Physical)", -- [19]
				"美女婉君-老马布兰契 肉搏 怒剑长空-火妖鲁西弗隆 Hit -38 (Physical)", -- [20]
				"美女婉君-老马布兰契 速效毒药 VI 怒剑长空-火妖鲁西弗隆 Hit -117 (Nature)", -- [21]
				"美女婉君-老马布兰契 出血 怒剑长空-火妖鲁西弗隆 Crit -220 (Physical)", -- [22]
				"美女婉君-老马布兰契 肉搏 怒剑长空-火妖鲁西弗隆 Miss (1)", -- [23]
				"美女婉君-老马布兰契 肉搏 怒剑长空-火妖鲁西弗隆 Crit -86 (Physical)", -- [24]
				"美女婉君-老马布兰契 出血 怒剑长空-火妖鲁西弗隆 Crit -235 (Physical)", -- [25]
				"怒剑长空-火妖鲁西弗隆 断筋 美女婉君-老马布兰契 Dodge (Physical)", -- [26]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -257 (Shadow)", -- [27]
				"李老三 噬灵瘟疫 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -169 (Shadow)", -- [28]
				"怒剑长空-火妖鲁西弗隆 神圣力量 怒剑长空-火妖鲁西弗隆 Hit +80", -- [29]
				"怒剑长空-火妖鲁西弗隆 肉搏 美女婉君-老马布兰契 Hit -222 (Physical)", -- [30]
				"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +69", -- [31]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -257 (Shadow)", -- [32]
				"李老三 噬灵瘟疫 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -169 (Shadow)", -- [33]
				"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +69", -- [34]
				"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +68", -- [35]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -257 (Shadow)", -- [36]
				"李老三 噬灵瘟疫 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -170 (Shadow)", -- [37]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -256 (Shadow)", -- [38]
				"李老三 噬灵瘟疫 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -169 (Shadow)", -- [39]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -242 (Shadow)", -- [40]
				"李老三 噬灵瘟疫 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -169 (Shadow)", -- [41]
				"李老三 暗言术：痛 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -242 (Shadow)", -- [42]
				"李老三 噬灵瘟疫 (伤害/跳) 怒剑长空-火妖鲁西弗隆 Tick -170 (Shadow)", -- [43]
				"延陵斩蛟-黑龙费尔默 拳击 怒剑长空-火妖鲁西弗隆 Hit -34 (Physical)", -- [44]
				"怒剑长空-火妖鲁西弗隆 致死打击 紫衣战天下 Hit -741 (Physical)", -- [45]
				"怒剑长空-火妖鲁西弗隆 致死打击 (剑类武器专精) 紫衣战天下 Hit -509 (Physical)", -- [46]
				"延陵斩蛟-黑龙费尔默 肉搏 怒剑长空-火妖鲁西弗隆 Hit -160 (Physical)", -- [47]
				"怒剑长空-火妖鲁西弗隆 血之狂热 怒剑长空-火妖鲁西弗隆 Tick +70", -- [48]
				"延陵斩蛟-黑龙费尔默 斩杀 怒剑长空-火妖鲁西弗隆 Hit -489 (Physical)", -- [49]
				"怒剑长空-火妖鲁西弗隆 重伤 (伤害/跳) 目空一切-逐风者 Tick -120 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["Name"] = "怒剑长空-火妖鲁西弗隆",
			["LastEventTimes"] = {
				4953.953, -- [1]
				4954.12, -- [2]
				4954.12, -- [3]
				4954.12, -- [4]
				4954.32, -- [5]
				4954.72, -- [6]
				4954.92, -- [7]
				4955.62, -- [8]
				4956.337, -- [9]
				4956.353, -- [10]
				5087.411, -- [11]
				5090.395, -- [12]
				5091.495, -- [13]
				5093.711, -- [14]
				5094.012, -- [15]
				5094.495, -- [16]
				5094.495, -- [17]
				5094.661, -- [18]
				5094.661, -- [19]
				5095.362, -- [20]
				5095.378, -- [21]
				5095.778, -- [22]
				5096.462, -- [23]
				5096.778, -- [24]
				5096.778, -- [25]
				5097.245, -- [26]
				5097.478, -- [27]
				5097.495, -- [28]
				5097.628, -- [29]
				5097.628, -- [30]
				5098.795, -- [31]
				5100.495, -- [32]
				5100.495, -- [33]
				5100.779, -- [34]
				5102.796, -- [35]
				5103.479, -- [36]
				5103.495, -- [37]
				5106.479, -- [38]
				5106.496, -- [39]
				5109.479, -- [40]
				5109.496, -- [41]
				5112.479, -- [42]
				5112.479, -- [43]
				4951.487, -- [44]
				4952.003, -- [45]
				4952.02, -- [46]
				4952.82, -- [47]
				4952.92, -- [48]
				4953.653, -- [49]
				4953.787, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4139,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 9,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 560,
						["Shadow"] = 3202,
						["Melee"] = 260,
						["Nature"] = 117,
					},
					["DOT_Time"] = 0,
					["Damage"] = 640,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 5.67,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 608,
						["Physical"] = 32,
					},
					["PartialAbsorb"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 32,
								},
								["肉搏"] = {
									["count"] = 608,
								},
							},
							["amount"] = 640,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["李老三"] = {
							["Details"] = {
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 1185,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2017,
								},
								["肉搏"] = {
									["count"] = 42,
								},
							},
							["amount"] = 3244,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 117,
								},
								["出血"] = {
									["count"] = 560,
								},
								["肉搏"] = {
									["count"] = 218,
								},
							},
							["amount"] = 895,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 4.17,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 5.67,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 206,
								},
								["神圣力量"] = {
									["count"] = 80,
								},
							},
							["amount"] = 286,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 4.17,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 5.67,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 5.18,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 69,
									["min"] = 68,
									["count"] = 3,
									["amount"] = 206,
								},
							},
							["count"] = 3,
							["amount"] = 206,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 80,
									["min"] = 80,
									["count"] = 1,
									["amount"] = 80,
								},
							},
							["count"] = 1,
							["amount"] = 80,
						},
					},
					["WhoHealed"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 206,
								},
								["神圣力量"] = {
									["count"] = 80,
								},
							},
							["amount"] = 286,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 10.85,
					["Healing"] = 286,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["断筋"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 32,
									["min"] = 32,
									["count"] = 1,
									["amount"] = 32,
								},
							},
							["count"] = 2,
							["amount"] = 32,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 222,
									["min"] = 187,
									["count"] = 3,
									["amount"] = 608,
								},
							},
							["count"] = 3,
							["amount"] = 608,
						},
					},
					["HealingTaken"] = 286,
					["RageGain"] = 0,
					["TimeDamage"] = 5.18,
					["TimeDamaging"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 5.18,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["怒剑长空-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["目空一切-逐风者"] = {
									["count"] = 6,
								},
								["紫衣战天下"] = {
									["count"] = 3,
								},
								["子弹舍普琴科"] = {
									["count"] = 24,
								},
							},
							["amount"] = 33,
						},
						["逃跑 (伤害/跳)"] = {
							["Details"] = {
								["怒剑长空-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["TimeSpent"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 5.18,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.18,
								},
								["英勇打击"] = {
									["count"] = 0.42,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.25,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.2,
								},
								["旋风斩"] = {
									["count"] = 1.25,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.28,
								},
								["斩杀"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 5.45,
								},
							},
							["amount"] = 20.18,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.18,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.06,
								},
								["肉搏"] = {
									["count"] = 3.23,
								},
							},
							["amount"] = 13.47,
						},
						["李老三"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.85,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.67,
								},
								["旋风斩"] = {
									["count"] = 1.28,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.45,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.82,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.2,
								},
								["旋风斩"] = {
									["count"] = 0.33,
								},
								["致死打击 (剑类武器专精)"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 2.8,
								},
								["肉搏"] = {
									["count"] = 0.81,
								},
							},
							["amount"] = 7.98,
						},
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["钻石水瓶"] = {
									["count"] = 10.65,
								},
								["生命赐福"] = {
									["count"] = 1,
								},
								["血之狂热"] = {
									["count"] = 25.39,
								},
								["逃跑 (伤害/跳)"] = {
									["count"] = 6,
								},
							},
							["amount"] = 44.54000000000001,
						},
					},
					["HealedWho"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["钻石水瓶"] = {
									["count"] = 72,
								},
								["血之狂热"] = {
									["count"] = 1292,
								},
								["神圣力量"] = {
									["count"] = 80,
								},
								["生命赐福"] = {
									["count"] = 1183,
								},
							},
							["amount"] = 2627,
						},
					},
					["ElementTakenResist"] = {
						["Shadow"] = 456,
						["Arcane"] = 54,
					},
					["DeathCount"] = 4,
					["HOT_Time"] = 78,
					["ElementTaken"] = {
						["Holy"] = 577,
						["Physical"] = 7913,
						["Melee"] = 6462,
						["Arcane"] = 1816,
						["Shadow"] = 6484,
						["Fire"] = 703,
						["Frost"] = 1646,
						["Nature"] = 3643,
					},
					["DOT_Time"] = 45,
					["Damage"] = 19446,
					["TimeHeal"] = 38.54000000000001,
					["FAttacks"] = {
						["逃跑 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 349,
									["min"] = 349,
									["count"] = 4,
									["amount"] = 1396,
								},
							},
							["count"] = 4,
							["amount"] = 1396,
						},
					},
					["ElementDone"] = {
						["Melee"] = 6050,
						["Physical"] = 13396,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 11,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 17,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 23,
								},
							},
							["amount"] = 44,
						},
					},
					["WhoDamaged"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 36,
								},
								["断筋"] = {
									["count"] = 55,
								},
								["斩杀"] = {
									["count"] = 536,
								},
								["肉搏"] = {
									["count"] = 247,
								},
							},
							["amount"] = 874,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 198,
								},
								["盾牌猛击"] = {
									["count"] = 935,
								},
								["拳击"] = {
									["count"] = 34,
								},
								["雷霆之怒"] = {
									["count"] = 690,
								},
								["旋风斩"] = {
									["count"] = 648,
								},
								["断筋"] = {
									["count"] = 30,
								},
								["拦截昏迷"] = {
									["count"] = 46,
								},
								["斩杀"] = {
									["count"] = 905,
								},
								["肉搏"] = {
									["count"] = 2411,
								},
							},
							["amount"] = 5897,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1097,
								},
								["惩击"] = {
									["count"] = 577,
								},
							},
							["amount"] = 1674,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 772,
								},
								["射击"] = {
									["count"] = 251,
								},
								["灼烧"] = {
									["count"] = 654,
								},
								["冰霜新星"] = {
									["count"] = 38,
								},
							},
							["amount"] = 1715,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 117,
								},
								["出血"] = {
									["count"] = 560,
								},
								["肉搏"] = {
									["count"] = 218,
								},
							},
							["amount"] = 895,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 373,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1392,
								},
							},
							["amount"] = 1765,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 121,
								},
								["速效毒药 VI"] = {
									["count"] = 131,
								},
								["刺骨"] = {
									["count"] = 906,
								},
								["出血"] = {
									["count"] = 779,
								},
								["肉搏"] = {
									["count"] = 1241,
								},
							},
							["amount"] = 3178,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1250,
								},
							},
							["amount"] = 1250,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 387,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 406,
								},
							},
							["amount"] = 793,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 49,
								},
							},
							["amount"] = 49,
						},
						["李老三"] = {
							["Details"] = {
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 1185,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2437,
								},
								["肉搏"] = {
									["count"] = 99,
								},
							},
							["amount"] = 3721,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["重创"] = {
									["count"] = 292,
								},
								["冰霜震击"] = {
									["count"] = 1608,
								},
								["闪电之盾"] = {
									["count"] = 634,
								},
								["地震术"] = {
									["count"] = 1950,
								},
								["风暴打击"] = {
									["count"] = 703,
								},
								["肉搏"] = {
									["count"] = 2246,
								},
							},
							["amount"] = 7433,
						},
					},
					["TimeHealing"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["钻石水瓶"] = {
									["count"] = 10.65,
								},
								["血之狂热"] = {
									["count"] = 25.39,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["生命赐福"] = {
									["count"] = 1,
								},
							},
							["amount"] = 38.54000000000001,
						},
					},
					["Dispelled"] = 4,
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["25% 抵抗"] = {
									["max"] = 54,
									["min"] = 54,
									["count"] = 1,
									["amount"] = 54,
								},
							},
							["count"] = 54,
							["amount"] = 2,
						},
						["攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["拳击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["雷霆之怒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵震爆"] = {
							["Details"] = {
								["75% 抵抗"] = {
									["max"] = 456,
									["min"] = 456,
									["count"] = 1,
									["amount"] = 456,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 456,
							["amount"] = 2,
						},
						["惩击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重创"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 42,
						},
					},
					["FDamage"] = 1396,
					["ActiveTime"] = 97.64999999999999,
					["InterruptData"] = {
						["目空一切-逐风者"] = {
							["Details"] = {
								["次级治疗波 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 1,
					["ElementDoneAbsorb"] = {
						["Physical"] = 1827,
					},
					["WhoDispelled"] = {
						["紫衣战天下"] = {
							["Details"] = {
								["诺格弗格药剂 (驱散魔法)"] = {
									["count"] = 1,
								},
								["自由行动 (驱散魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["诺格弗格药剂 (盾牌猛击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 32,
								},
								["肉搏"] = {
									["count"] = 608,
								},
							},
							["amount"] = 640,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 93,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 920,
								},
								["肉搏"] = {
									["count"] = 435,
								},
							},
							["amount"] = 1448,
						},
						["李老三"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 592,
								},
								["断筋"] = {
									["count"] = 44,
								},
							},
							["amount"] = 636,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 361,
								},
								["旋风斩"] = {
									["count"] = 802,
								},
							},
							["amount"] = 1212,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2587,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 120,
								},
								["英勇打击"] = {
									["count"] = 758,
								},
								["旋风斩"] = {
									["count"] = 935,
								},
								["致死打击 (剑类武器专精)"] = {
									["count"] = 509,
								},
								["断筋"] = {
									["count"] = 98,
								},
								["斩杀"] = {
									["count"] = 2443,
								},
								["肉搏"] = {
									["count"] = 1769,
								},
							},
							["amount"] = 9219,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1393,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 240,
								},
								["压制"] = {
									["count"] = 976,
								},
								["旋风斩"] = {
									["count"] = 757,
								},
								["拳击"] = {
									["count"] = 42,
								},
								["断筋"] = {
									["count"] = 60,
								},
								["斩杀"] = {
									["count"] = 538,
								},
								["肉搏"] = {
									["count"] = 2285,
								},
							},
							["amount"] = 6291,
						},
					},
					["Heals"] = {
						["钻石水瓶"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 9,
									["min"] = 9,
									["count"] = 8,
									["amount"] = 72,
								},
							},
							["count"] = 8,
							["amount"] = 72,
						},
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 79,
									["min"] = 68,
									["count"] = 18,
									["amount"] = 1292,
								},
							},
							["count"] = 18,
							["amount"] = 1292,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 80,
									["min"] = 80,
									["count"] = 1,
									["amount"] = 80,
								},
							},
							["count"] = 1,
							["amount"] = 80,
						},
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1183,
									["min"] = 1183,
									["count"] = 1,
									["amount"] = 1183,
								},
							},
							["count"] = 1,
							["amount"] = 1183,
						},
					},
					["RageGainedFrom"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 40,
								},
								["冲锋"] = {
									["count"] = 30,
								},
							},
							["amount"] = 70,
						},
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["怒剑长空-火妖鲁西弗隆"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
						["冲锋"] = {
							["Details"] = {
								["怒剑长空-火妖鲁西弗隆"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["RageGain"] = 70,
					["Healing"] = 2627,
					["WhoHealed"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["钻石水瓶"] = {
									["count"] = 72,
								},
								["血之狂热"] = {
									["count"] = 1292,
								},
								["神圣力量"] = {
									["count"] = 80,
								},
								["生命赐福"] = {
									["count"] = 1183,
								},
							},
							["amount"] = 2627,
						},
					},
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 24,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 37,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 30,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Miss"] = {
									["count"] = 4,
								},
							},
							["amount"] = 42,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 10,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 22,
								},
							},
							["amount"] = 24,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 17,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 520,
									["min"] = 520,
									["count"] = 1,
									["amount"] = 520,
								},
								["Crit"] = {
									["max"] = 1846,
									["min"] = 1846,
									["count"] = 1,
									["amount"] = 1846,
								},
								["Hit"] = {
									["max"] = 741,
									["min"] = 433,
									["count"] = 3,
									["amount"] = 1614,
								},
							},
							["count"] = 5,
							["amount"] = 3980,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 758,
									["min"] = 758,
									["count"] = 1,
									["amount"] = 758,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 758,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 120,
									["min"] = 81,
									["count"] = 3,
									["amount"] = 283,
								},
								["Tick"] = {
									["max"] = 156,
									["min"] = 81,
									["count"] = 8,
									["amount"] = 997,
								},
							},
							["count"] = 11,
							["amount"] = 1280,
						},
						["致死打击 (剑类武器专精)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 509,
									["min"] = 509,
									["count"] = 1,
									["amount"] = 509,
								},
							},
							["count"] = 1,
							["amount"] = 509,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 42,
									["min"] = 42,
									["count"] = 1,
									["amount"] = 42,
								},
							},
							["count"] = 1,
							["amount"] = 42,
						},
						["压制"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 976,
									["min"] = 976,
									["count"] = 1,
									["amount"] = 976,
								},
							},
							["count"] = 1,
							["amount"] = 976,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 493,
									["min"] = 229,
									["count"] = 7,
									["amount"] = 2494,
								},
							},
							["count"] = 7,
							["amount"] = 2494,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 49,
									["min"] = 22,
									["count"] = 8,
									["amount"] = 283,
								},
								["Crit"] = {
									["max"] = 66,
									["min"] = 27,
									["count"] = 2,
									["amount"] = 93,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 376,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1710,
									["min"] = 1710,
									["count"] = 1,
									["amount"] = 1710,
								},
								["Hit"] = {
									["max"] = 733,
									["min"] = 538,
									["count"] = 2,
									["amount"] = 1271,
								},
							},
							["count"] = 3,
							["amount"] = 2981,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 48,
									["min"] = 48,
									["count"] = 1,
									["amount"] = 48,
								},
								["Hit"] = {
									["max"] = 682,
									["min"] = 187,
									["count"] = 11,
									["amount"] = 4124,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1087,
									["min"] = 791,
									["count"] = 2,
									["amount"] = 1878,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 6050,
						},
					},
					["HealingTaken"] = 2627,
					["DamageTaken"] = 29244,
					["TimeDamage"] = 59.10999999999999,
					["TimeDamaging"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 5.18,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.18,
								},
								["英勇打击"] = {
									["count"] = 0.42,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.25,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.2,
								},
								["旋风斩"] = {
									["count"] = 1.25,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.28,
								},
								["斩杀"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 5.45,
								},
							},
							["amount"] = 20.18,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.18,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.06,
								},
								["肉搏"] = {
									["count"] = 3.23,
								},
							},
							["amount"] = 13.47,
						},
						["李老三"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.85,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.67,
								},
								["旋风斩"] = {
									["count"] = 1.28,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.45,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.82,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.2,
								},
								["旋风斩"] = {
									["count"] = 0.33,
								},
								["致死打击 (剑类武器专精)"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 2.8,
								},
								["肉搏"] = {
									["count"] = 0.81,
								},
							},
							["amount"] = 7.98,
						},
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["逃跑 (伤害/跳)"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["拳击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["雷霆之怒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["惩击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重创"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 42,
							["amount"] = 0,
						},
					},
					["HOTs"] = {
						["钻石水瓶"] = {
							["Details"] = {
								["怒剑长空-火妖鲁西弗隆"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
						["血之狂热"] = {
							["Details"] = {
								["怒剑长空-火妖鲁西弗隆"] = {
									["count"] = 54,
								},
							},
							["amount"] = 54,
						},
					},
					["FDamagedWho"] = {
						["怒剑长空-火妖鲁西弗隆"] = {
							["Details"] = {
								["逃跑 (伤害/跳)"] = {
									["count"] = 1396,
								},
							},
							["amount"] = 1396,
						},
					},
				},
			},
			["UnitLockout"] = 4658.519,
			["LastActive"] = 5111.513,
		},
		["激光碎石-逐风者"] = {
			["GUID"] = "Player-5451-035C9D58",
			["LastEventHealth"] = {
				1707, -- [1]
				1504, -- [2]
				983, -- [3]
				740, -- [4]
				395, -- [5]
				367, -- [6]
				14, -- [7]
				0, -- [8]
				3262, -- [9]
				2923, -- [10]
				2603, -- [11]
				2283, -- [12]
				2283, -- [13]
				2283, -- [14]
				2283, -- [15]
				1963, -- [16]
				1963, -- [17]
				1963, -- [18]
				2030, -- [19]
				2030, -- [20]
				2030, -- [21]
				2030, -- [22]
				2030, -- [23]
				2030, -- [24]
				4854, -- [25]
				4854, -- [26]
				4854, -- [27]
				4604, -- [28]
				4604, -- [29]
				4569, -- [30]
				4569, -- [31]
				4341, -- [32]
				4114, -- [33]
				3864, -- [34]
				3637, -- [35]
				3417, -- [36]
				3220, -- [37]
				3288, -- [38]
				3288, -- [39]
				3288, -- [40]
				3288, -- [41]
				3288, -- [42]
				3443, -- [43]
				3443, -- [44]
				3443, -- [45]
				3152, -- [46]
				3152, -- [47]
				1915, -- [48]
				1707, -- [49]
				1707, -- [50]
			},
			["LastAttackedBy"] = "延陵斩蛟-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"MISC", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					32.01000000000001, -- [1]
				},
				["TimeDamage"] = {
					32.01000000000001, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					12521, -- [1]
				},
				["Damage"] = {
					12471, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = "激光碎石-逐风者",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
					},
					["Messages"] = {
						"激光碎石-逐风者 驱散射击 李老三 Hit -147 (Physical)", -- [1]
						"广坤叔来啦-火妖鲁西弗隆 火焰冲击 激光碎石-逐风者 Hit -811 (Fire)", -- [2]
						"广坤叔来啦-火妖鲁西弗隆 冰锥术 激光碎石-逐风者 Hit -441 (Frost)", -- [3]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Hit -356 (Arcane)", -- [4]
						"激光碎石-逐风者 多重射击 延陵斩蛟-黑龙费尔默 Hit -289 (Physical)", -- [5]
						"激光碎石-逐风者 多重射击 目空一切-逐风者 Crit -998 (Physical)", -- [6]
						"激光碎石-逐风者 自动射击 目空一切-逐风者 Hit -268 (Physical)", -- [7]
						"丷光头强丷 出血 激光碎石-逐风者 Hit -107 (Physical)", -- [8]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Hit -355 (Arcane)", -- [9]
						"丷光头强丷 肉搏 激光碎石-逐风者 Hit -116 (Physical)", -- [10]
						"丷光头强丷 出血 激光碎石-逐风者 Parry (Physical)", -- [11]
						"丷光头强丷 肉搏 激光碎石-逐风者 Miss (1)", -- [12]
						"激光碎石-逐风者 奥术射击 目空一切-逐风者 Absorb -198 (198 被吸收) (Arcane)", -- [13]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Hit -347 (Arcane)", -- [14]
						"激光碎石-逐风者 肉搏 目空一切-逐风者 Absorb -438 (1)", -- [15]
						"激光碎石-逐风者 自动射击 目空一切-逐风者 Crit -121 (438 被吸收) (Physical)", -- [16]
						"丷光头强丷 肉搏 激光碎石-逐风者 Crit -256 (Physical)", -- [17]
						"李老三 精神鞭笞 (伤害/跳) 激光碎石-逐风者 Tick -243 (Shadow)", -- [18]
						"丷光头强丷 刺骨 激光碎石-逐风者 Hit -208 (Physical)", -- [19]
						"丷光头强丷 致命毒药 IV 激光碎石-逐风者 Resist (Nature)", -- [20]
						"丷光头强丷 肉搏 激光碎石-逐风者 Hit -60 (Physical)", -- [21]
						"丷光头强丷 速效毒药 VI 激光碎石-逐风者 Hit -143 (Nature)", -- [22]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Crit -521 (Arcane)", -- [23]
						"李老三 精神鞭笞 (伤害/跳) 激光碎石-逐风者 Tick -243 (Shadow)", -- [24]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Hit -345 (Arcane)", -- [25]
						"丷光头强丷 致命毒药 IV (伤害/跳) 激光碎石-逐风者 Tick -28 (Nature)", -- [26]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Hit -353 (Arcane)", -- [27]
						"延陵斩蛟-黑龙费尔默 旋风斩 激光碎石-逐风者 Hit -168 (Physical)", -- [28]
						"激光碎石-逐风者死亡。", -- [29]
					},
					["DeathAt"] = 4840.513,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
					},
					["MessageTimes"] = {
						-13.91700000000037, -- [1]
						-10.88400000000002, -- [2]
						-9.134000000000015, -- [3]
						-7.634000000000015, -- [4]
						-7.067000000000007, -- [5]
						-6.967000000000553, -- [6]
						-6.583000000000538, -- [7]
						-6.5, -- [8]
						-6.132999999999811, -- [9]
						-6, -- [10]
						-5.5, -- [11]
						-5.367000000000189, -- [12]
						-4.949999999999818, -- [13]
						-4.632999999999811, -- [14]
						-4.400000000000546, -- [15]
						-4.400000000000546, -- [16]
						-3.75, -- [17]
						-3.600000000000364, -- [18]
						-3.350000000000364, -- [19]
						-3.333000000000538, -- [20]
						-3.117000000000189, -- [21]
						-3.117000000000189, -- [22]
						-3.067000000000007, -- [23]
						-2.583000000000538, -- [24]
						-1.567000000000007, -- [25]
						-0.7330000000001746, -- [26]
						-0.06599999999980355, -- [27]
						-0.01600000000053115, -- [28]
						0, -- [29]
					},
					["HealthMax"] = {
						4947, -- [1]
						4947, -- [2]
						4947, -- [3]
						4947, -- [4]
						4947, -- [5]
						4947, -- [6]
						4947, -- [7]
						4947, -- [8]
						4947, -- [9]
						4947, -- [10]
						4947, -- [11]
						4947, -- [12]
						4947, -- [13]
						4947, -- [14]
						4947, -- [15]
						4947, -- [16]
						4947, -- [17]
						4947, -- [18]
						4947, -- [19]
						4947, -- [20]
						4947, -- [21]
						4947, -- [22]
						4947, -- [23]
						4947, -- [24]
						4947, -- [25]
						4947, -- [26]
						4947, -- [27]
						4947, -- [28]
						4947, -- [29]
					},
					["Health"] = {
						4947, -- [1]
						4947, -- [2]
						4136, -- [3]
						3695, -- [4]
						3339, -- [5]
						3339, -- [6]
						3339, -- [7]
						3339, -- [8]
						3232, -- [9]
						2877, -- [10]
						2761, -- [11]
						2761, -- [12]
						2761, -- [13]
						2761, -- [14]
						2414, -- [15]
						2414, -- [16]
						2414, -- [17]
						2158, -- [18]
						1915, -- [19]
						1707, -- [20]
						1707, -- [21]
						1707, -- [22]
						1504, -- [23]
						983, -- [24]
						740, -- [25]
						395, -- [26]
						367, -- [27]
						14, -- [28]
						0, -- [29]
					},
					["KilledBy"] = "延陵斩蛟-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"MISC", -- [29]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "断筋",
			["LastFightIn"] = 10,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				4947, -- [1]
				4947, -- [2]
				4947, -- [3]
				4947, -- [4]
				4947, -- [5]
				4947, -- [6]
				4947, -- [7]
				4947, -- [8]
				4947, -- [9]
				4947, -- [10]
				4947, -- [11]
				4947, -- [12]
				4947, -- [13]
				4947, -- [14]
				4947, -- [15]
				4947, -- [16]
				4947, -- [17]
				4947, -- [18]
				4947, -- [19]
				4947, -- [20]
				4947, -- [21]
				4947, -- [22]
				4947, -- [23]
				4947, -- [24]
				4947, -- [25]
				4947, -- [26]
				4947, -- [27]
				4947, -- [28]
				4947, -- [29]
				4947, -- [30]
				4947, -- [31]
				4947, -- [32]
				4947, -- [33]
				4947, -- [34]
				4947, -- [35]
				4947, -- [36]
				4947, -- [37]
				4947, -- [38]
				4947, -- [39]
				4947, -- [40]
				4947, -- [41]
				4947, -- [42]
				4947, -- [43]
				4947, -- [44]
				4947, -- [45]
				4947, -- [46]
				4947, -- [47]
				4947, -- [48]
				4947, -- [49]
				4947, -- [50]
			},
			["LastDamageTaken"] = 69,
			["TimeLast"] = {
				["DeathCount"] = 4838.513,
				["Healing"] = 4581.515,
				["ActiveTime"] = 5110.513,
				["TimeDamage"] = 5110.513,
				["OVERALL"] = 5112.513,
				["DamageTaken"] = 5112.513,
				["Damage"] = 5110.513,
			},
			["Owner"] = false,
			["Pet"] = {
				"阿拉瑟希斯 <激光碎石-逐风者>", -- [1]
			},
			["NextEventNum"] = 48,
			["LastDamageTime"] = 5110.862,
			["LastEvents"] = {
				"丷光头强丷 速效毒药 VI 激光碎石-逐风者 Hit -143 (Nature)", -- [1]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Crit -521 (Arcane)", -- [2]
				"李老三 精神鞭笞 (伤害/跳) 激光碎石-逐风者 Tick -243 (Shadow)", -- [3]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Hit -345 (Arcane)", -- [4]
				"丷光头强丷 致命毒药 IV (伤害/跳) 激光碎石-逐风者 Tick -28 (Nature)", -- [5]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 激光碎石-逐风者 Hit -353 (Arcane)", -- [6]
				"延陵斩蛟-黑龙费尔默 旋风斩 激光碎石-逐风者 Hit -168 (Physical)", -- [7]
				"激光碎石-逐风者死亡。", -- [8]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -339 (Shadow)", -- [9]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -320 (Shadow)", -- [10]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -320 (Shadow)", -- [11]
				"激光碎石-逐风者 多重射击 子弹舍普琴科 Crit -991 (Physical)", -- [12]
				"激光碎石-逐风者 多重射击 牧老-火妖鲁西弗隆 Hit -341 (Physical)", -- [13]
				"激光碎石-逐风者 自动射击 子弹舍普琴科 Hit -236 (Physical)", -- [14]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -320 (Shadow)", -- [15]
				"激光碎石-逐风者 自动射击 牧老-火妖鲁西弗隆 Hit -197 (Physical)", -- [16]
				"激光碎石-逐风者 奥术射击 牧老-火妖鲁西弗隆 Crit -471 (Arcane)", -- [17]
				"激光碎石-逐风者 自动射击 子弹舍普琴科 Crit -596 (Physical)", -- [18]
				"激光碎石-逐风者 多重射击 目空一切-逐风者 Crit -964 (Physical)", -- [19]
				"激光碎石-逐风者 自动射击 目空一切-逐风者 Crit -515 (Physical)", -- [20]
				"激光碎石-逐风者 奥术射击 目空一切-逐风者 Hit -198 (Arcane)", -- [21]
				"激光碎石-逐风者 自动射击 牧老-火妖鲁西弗隆 Hit -224 (Physical)", -- [22]
				"激光碎石-逐风者 奥术射击 牧老-火妖鲁西弗隆 Hit -198 (Arcane)", -- [23]
				"牧老-火妖鲁西弗隆 暗影守卫 激光碎石-逐风者 Hit -351 (Shadow)", -- [24]
				"激光碎石-逐风者 瞄准射击 子弹舍普琴科 Hit -698 (Physical)", -- [25]
				"激光碎石-逐风者 自动射击 子弹舍普琴科 Crit -552 (Physical)", -- [26]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -250 (Shadow)", -- [27]
				"激光碎石-逐风者 多重射击 子弹舍普琴科 Crit -611 (Physical)", -- [28]
				"李老三 肉搏 激光碎石-逐风者 Hit -35 (Physical)", -- [29]
				"激光碎石-逐风者 驱散射击 李老三 Hit -109 (Physical)", -- [30]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -250 (Shadow)", -- [31]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -249 (Shadow)", -- [32]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -250 (Shadow)", -- [33]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -249 (Shadow)", -- [34]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -242 (Shadow)", -- [35]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -242 (Shadow)", -- [36]
				"李老三 暗言术：痛 (伤害/跳) 激光碎石-逐风者 Tick -242 (Shadow)", -- [37]
				"牧老-火妖鲁西弗隆 暗言术：痛 激光碎石-逐风者 Resist (Shadow)", -- [38]
				"激光碎石-逐风者 多重射击 子弹舍普琴科 Hit -401 (Physical)", -- [39]
				"激光碎石-逐风者 多重射击 延陵斩蛟-黑龙费尔默 Hit -258 (Physical)", -- [40]
				"激光碎石-逐风者 多重射击 美女婉君-老马布兰契 Hit -452 (Physical)", -- [41]
				"激光碎石-逐风者 自动射击 延陵斩蛟-黑龙费尔默 Hit -166 (Physical)", -- [42]
				"激光碎石-逐风者 自动射击 延陵斩蛟-黑龙费尔默 Hit -149 (Physical)", -- [43]
				"子弹舍普琴科 断筋 激光碎石-逐风者 Dodge (Physical)", -- [44]
				"子弹舍普琴科 肉搏 激光碎石-逐风者 Hit -291 (Physical)", -- [45]
				"延陵斩蛟-黑龙费尔默 肉搏 激光碎石-逐风者 Crit -387 (Physical)", -- [46]
				"延陵斩蛟-黑龙费尔默 断筋 激光碎石-逐风者 Crit -69 (Physical)", -- [47]
				"丷光头强丷 刺骨 激光碎石-逐风者 Hit -208 (Physical)", -- [48]
				"丷光头强丷 致命毒药 IV 激光碎石-逐风者 Resist (Nature)", -- [49]
				"丷光头强丷 肉搏 激光碎石-逐风者 Hit -60 (Physical)", -- [50]
			},
			["Name"] = "激光碎石-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				4835.996, -- [1]
				4836.046, -- [2]
				4836.53, -- [3]
				4837.546, -- [4]
				4838.38, -- [5]
				4839.047000000001, -- [6]
				4839.097, -- [7]
				4839.113, -- [8]
				4926.452, -- [9]
				4929.469, -- [10]
				4932.452, -- [11]
				4933.202, -- [12]
				4933.269, -- [13]
				4933.569, -- [14]
				4935.452, -- [15]
				4935.869, -- [16]
				4936.602, -- [17]
				4941.303, -- [18]
				4953.487, -- [19]
				4953.803, -- [20]
				4954.353, -- [21]
				4960.537, -- [22]
				4961.537, -- [23]
				4961.604, -- [24]
				5027.891000000001, -- [25]
				5028.424, -- [26]
				5028.441, -- [27]
				5029.341, -- [28]
				5029.558, -- [29]
				5030.774, -- [30]
				5031.441, -- [31]
				5034.441, -- [32]
				5037.442, -- [33]
				5040.442, -- [34]
				5043.458000000001, -- [35]
				5046.442, -- [36]
				5049.442, -- [37]
				5077.877, -- [38]
				5082.627, -- [39]
				5082.694, -- [40]
				5082.761, -- [41]
				5082.911, -- [42]
				5110.862, -- [43]
				5111.846000000001, -- [44]
				5112.013, -- [45]
				5112.879, -- [46]
				5112.879, -- [47]
				4835.763, -- [48]
				4835.78, -- [49]
				4835.996, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 747,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 0,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 0,
						["Melee"] = 678,
						["Physical"] = 69,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1426,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 1426,
					},
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 258,
								},
								["自动射击"] = {
									["count"] = 315,
								},
							},
							["amount"] = 573,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 452,
								},
							},
							["amount"] = 452,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 401,
								},
							},
							["amount"] = 401,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["李老三"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 69,
								},
								["肉搏"] = {
									["count"] = 387,
								},
							},
							["amount"] = 456,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 291,
								},
							},
							["amount"] = 291,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.07,
								},
								["自动射击"] = {
									["count"] = 1.65,
								},
							},
							["amount"] = 1.72,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 0.07,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3.29,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 452,
									["min"] = 258,
									["count"] = 3,
									["amount"] = 1111,
								},
							},
							["count"] = 3,
							["amount"] = 1111,
						},
						["自动射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 166,
									["min"] = 149,
									["count"] = 2,
									["amount"] = 315,
								},
							},
							["count"] = 2,
							["amount"] = 315,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3.29,
					["TimeDamaging"] = {
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.07,
								},
								["自动射击"] = {
									["count"] = 1.65,
								},
							},
							["amount"] = 1.72,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 0.07,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2.49,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 7.060000000000001,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
								["奥术射击"] = {
									["count"] = 1.73,
								},
							},
							["amount"] = 4.8,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 2.05,
								},
								["自动射击"] = {
									["count"] = 0.7,
								},
								["多重射击"] = {
									["count"] = 1.6,
								},
								["肉搏"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 4.9,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2.33,
								},
								["多重射击"] = {
									["count"] = 3.92,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.75,
						},
						["李老三"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 2.93,
								},
							},
							["amount"] = 2.93,
						},
						["Aoo-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 1.57,
						},
					},
					["DamageTaken"] = 12521,
					["ElementDoneAbsorb"] = {
						["Physical"] = 438,
						["Arcane"] = 396,
					},
					["PartialResist"] = {
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 23,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["致命毒药 IV (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 23,
									["amount"] = 0,
								},
							},
							["count"] = 23,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 32.01000000000001,
					["ElementTaken"] = {
						["Physical"] = 985,
						["Melee"] = 2440,
						["Arcane"] = 2277,
						["Shadow"] = 4808,
						["Fire"] = 1399,
						["Frost"] = 441,
						["Nature"] = 171,
					},
					["Damage"] = 12471,
					["Healing"] = 0,
					["ElementDone"] = {
						["Physical"] = 10252,
						["Melee"] = 438,
						["Arcane"] = 1781,
					},
					["Attacks"] = {
						["奥术射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 198,
									["min"] = 198,
									["count"] = 2,
									["amount"] = 396,
								},
								["Crit"] = {
									["max"] = 518,
									["min"] = 471,
									["count"] = 2,
									["amount"] = 989,
								},
								["Hit"] = {
									["max"] = 198,
									["min"] = 198,
									["count"] = 2,
									["amount"] = 396,
								},
							},
							["count"] = 6,
							["amount"] = 1781,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 147,
									["min"] = 109,
									["count"] = 2,
									["amount"] = 256,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 256,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 998,
									["min"] = 611,
									["count"] = 4,
									["amount"] = 3564,
								},
								["Hit"] = {
									["max"] = 452,
									["min"] = 247,
									["count"] = 6,
									["amount"] = 1988,
								},
							},
							["count"] = 10,
							["amount"] = 5552,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 596,
									["min"] = 121,
									["count"] = 4,
									["amount"] = 1784,
								},
								["Hit"] = {
									["max"] = 268,
									["min"] = 147,
									["count"] = 8,
									["amount"] = 1542,
								},
							},
							["count"] = 12,
							["amount"] = 3326,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 698,
									["min"] = 420,
									["count"] = 2,
									["amount"] = 1118,
								},
							},
							["count"] = 2,
							["amount"] = 1118,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 438,
									["min"] = 438,
									["count"] = 1,
									["amount"] = 438,
								},
							},
							["count"] = 1,
							["amount"] = 438,
						},
					},
					["DamagedWho"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 452,
								},
							},
							["amount"] = 452,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 421,
								},
								["多重射击"] = {
									["count"] = 341,
								},
								["奥术射击"] = {
									["count"] = 669,
								},
							},
							["amount"] = 1431,
						},
						["Aoo-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 518,
								},
							},
							["amount"] = 518,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1384,
								},
								["多重射击"] = {
									["count"] = 2003,
								},
								["瞄准射击"] = {
									["count"] = 698,
								},
							},
							["amount"] = 4085,
						},
						["李老三"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 256,
								},
							},
							["amount"] = 256,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 617,
								},
								["瞄准射击"] = {
									["count"] = 420,
								},
								["多重射击"] = {
									["count"] = 794,
								},
							},
							["amount"] = 1831,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 198,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 396,
								},
								["自动射击"] = {
									["count"] = 904,
								},
								["多重射击"] = {
									["count"] = 1962,
								},
								["肉搏"] = {
									["count"] = 438,
								},
							},
							["amount"] = 3700,
						},
					},
					["TimeDamage"] = 32.01000000000001,
					["TimeDamaging"] = {
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2.49,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 7.060000000000001,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 3,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
								["奥术射击"] = {
									["count"] = 1.73,
								},
							},
							["amount"] = 4.8,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 2.05,
								},
								["自动射击"] = {
									["count"] = 0.7,
								},
								["多重射击"] = {
									["count"] = 1.6,
								},
								["肉搏"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 4.9,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 2.33,
								},
								["多重射击"] = {
									["count"] = 3.92,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.75,
						},
						["李老三"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 2.93,
								},
							},
							["amount"] = 2.93,
						},
						["Aoo-火妖鲁西弗隆"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 1.57,
						},
					},
					["WhoDamaged"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 291,
								},
							},
							["amount"] = 291,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 69,
								},
								["肉搏"] = {
									["count"] = 387,
								},
								["旋风斩"] = {
									["count"] = 168,
								},
							},
							["amount"] = 624,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 2277,
								},
								["冰锥术"] = {
									["count"] = 441,
								},
								["火焰冲击"] = {
									["count"] = 811,
								},
							},
							["amount"] = 3529,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1299,
								},
								["暗影守卫"] = {
									["count"] = 351,
								},
							},
							["amount"] = 1650,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["致命毒药 IV (伤害/跳)"] = {
									["count"] = 28,
								},
								["速效毒药 VI"] = {
									["count"] = 143,
								},
								["刺骨"] = {
									["count"] = 208,
								},
								["出血"] = {
									["count"] = 107,
								},
								["肉搏"] = {
									["count"] = 432,
								},
							},
							["amount"] = 918,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 140,
								},
							},
							["amount"] = 140,
						},
						["李老三"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 698,
								},
								["肉搏"] = {
									["count"] = 35,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1974,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 486,
								},
							},
							["amount"] = 3193,
						},
						["Aoo-火妖鲁西弗隆"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 588,
								},
							},
							["amount"] = 588,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 293,
								},
								["肉搏"] = {
									["count"] = 1295,
								},
							},
							["amount"] = 1588,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 5,
								},
							},
							["amount"] = 23,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 14,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 17,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 18,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 27,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
					},
				},
			},
			["UnitLockout"] = 4730.507000000001,
			["LastActive"] = 5112.513,
		},
		["乐儿-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02E72D78",
			["LastEventHealth"] = {
				2740, -- [1]
				2740, -- [2]
				2740, -- [3]
				2740, -- [4]
				2740, -- [5]
				2740, -- [6]
				2740, -- [7]
				2740, -- [8]
				2740, -- [9]
				2740, -- [10]
				2740, -- [11]
				2740, -- [12]
				2740, -- [13]
				2740, -- [14]
				2740, -- [15]
				1601, -- [16]
				1601, -- [17]
				1185, -- [18]
				1048, -- [19]
				1048, -- [20]
				720, -- [21]
				583, -- [22]
				583, -- [23]
				250, -- [24]
			},
			["LastAttackedBy"] = "广坤叔来啦-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					2490, -- [1]
				},
				["ActiveTime"] = {
					22.02, -- [1]
				},
				["TimeDamage"] = {
					22.02, -- [1]
				},
				["ManaGain"] = {
					204, -- [1]
				},
				["DOT_Time"] = {
					15, -- [1]
				},
				["Damage"] = {
					8143, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "乐儿-火妖鲁西弗隆",
			["level"] = 60,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 10,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 333,
			["TimeLast"] = {
				["DamageTaken"] = 5093.516000000001,
				["TimeDamage"] = 5094.512,
				["ActiveTime"] = 5094.512,
				["ManaGain"] = 5080.511,
				["OVERALL"] = 5094.512,
				["DOT_Time"] = 5084.511,
				["Damage"] = 5094.512,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2740, -- [1]
				2740, -- [2]
				2740, -- [3]
				2740, -- [4]
				2740, -- [5]
				2740, -- [6]
				2740, -- [7]
				2740, -- [8]
				2740, -- [9]
				2740, -- [10]
				2740, -- [11]
				2740, -- [12]
				2740, -- [13]
				2740, -- [14]
				2740, -- [15]
				2740, -- [16]
				2740, -- [17]
				2740, -- [18]
				2740, -- [19]
				2740, -- [20]
				2740, -- [21]
				2740, -- [22]
				2740, -- [23]
				2740, -- [24]
			},
			["NextEventNum"] = 25,
			["LastDamageTime"] = 5095.311,
			["LastEvents"] = {
				"乐儿-火妖鲁西弗隆 火焰冲击 广坤叔来啦-火妖鲁西弗隆 Crit -1021 (Fire)", -- [1]
				"乐儿-火妖鲁西弗隆 冰霜新星 广坤叔来啦-火妖鲁西弗隆 Hit -92 (Frost)", -- [2]
				"乐儿-火妖鲁西弗隆 点燃 (伤害/跳) 广坤叔来啦-火妖鲁西弗隆 Tick -205 (Fire)", -- [3]
				"乐儿-火妖鲁西弗隆 冲击波 广坤叔来啦-火妖鲁西弗隆 Hit -588 (Fire)", -- [4]
				"乐儿-火妖鲁西弗隆 火焰冲击 子弹舍普琴科 Absorb -908 (908 被吸收) (Fire)", -- [5]
				"乐儿-火妖鲁西弗隆 魔爆术 子弹舍普琴科 Hit -323 (Arcane)", -- [6]
				"乐儿-火妖鲁西弗隆 点燃 (伤害/跳) 子弹舍普琴科 Tick -182 (Fire)", -- [7]
				"乐儿-火妖鲁西弗隆 魔爆术 李老三 Hit -325 (Arcane)", -- [8]
				"乐儿-火妖鲁西弗隆 魔爆术 子弹舍普琴科 Hit -327 (Arcane)", -- [9]
				"乐儿-火妖鲁西弗隆 点燃 (伤害/跳) 子弹舍普琴科 Tick -182 (Fire)", -- [10]
				"乐儿-火妖鲁西弗隆 火焰冲击 广坤叔来啦-火妖鲁西弗隆 Crit -1080 (Fire)", -- [11]
				"乐儿-火妖鲁西弗隆 点燃 (伤害/跳) 广坤叔来啦-火妖鲁西弗隆 Tick -216 (Fire)", -- [12]
				"乐儿-火妖鲁西弗隆 点燃 (伤害/跳) 广坤叔来啦-火妖鲁西弗隆 Tick -216 (Fire)", -- [13]
				"乐儿-火妖鲁西弗隆 火焰冲击 广坤叔来啦-火妖鲁西弗隆 Hit -712 (Fire)", -- [14]
				"广坤叔来啦-火妖鲁西弗隆 火焰冲击 乐儿-火妖鲁西弗隆 Crit -1139 (Fire)", -- [15]
				"乐儿-火妖鲁西弗隆 冲击波 广坤叔来啦-火妖鲁西弗隆 Hit -568 (Fire)", -- [16]
				"广坤叔来啦-火妖鲁西弗隆 冰锥术 乐儿-火妖鲁西弗隆 Hit -416 (Frost)", -- [17]
				"广坤叔来啦-火妖鲁西弗隆 点燃 (伤害/跳) 乐儿-火妖鲁西弗隆 Tick -137 (Fire)", -- [18]
				"乐儿-火妖鲁西弗隆 冰锥术 广坤叔来啦-火妖鲁西弗隆 Hit -425 (Frost)", -- [19]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 乐儿-火妖鲁西弗隆 Hit -328 (Arcane)", -- [20]
				"广坤叔来啦-火妖鲁西弗隆 点燃 (伤害/跳) 乐儿-火妖鲁西弗隆 Tick -137 (Fire)", -- [21]
				"乐儿-火妖鲁西弗隆 魔爆术 广坤叔来啦-火妖鲁西弗隆 Hit -300 (Arcane)", -- [22]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 乐儿-火妖鲁西弗隆 Hit -333 (Arcane)", -- [23]
				"乐儿-火妖鲁西弗隆 魔爆术 广坤叔来啦-火妖鲁西弗隆 Crit -473 (Arcane)", -- [24]
			},
			["Name"] = "乐儿-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				false, -- [22]
				true, -- [23]
				false, -- [24]
			},
			["LastEventTimes"] = {
				4855.181000000001, -- [1]
				4856.681000000001, -- [2]
				4857.214, -- [3]
				4858.198, -- [4]
				4865.265, -- [5]
				4866.765, -- [6]
				4867.298, -- [7]
				4868.282, -- [8]
				4868.282, -- [9]
				4869.282, -- [10]
				5081.028, -- [11]
				5083.061, -- [12]
				5085.061, -- [13]
				5089.295, -- [14]
				5089.611, -- [15]
				5090.795, -- [16]
				5091.128, -- [17]
				5091.645, -- [18]
				5092.295, -- [19]
				5092.628, -- [20]
				5093.645, -- [21]
				5093.811, -- [22]
				5094.128, -- [23]
				5095.311, -- [24]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["广坤叔来啦-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2490,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 1413,
						["Frost"] = 416,
						["Arcane"] = 661,
					},
					["DOT_Time"] = 6,
					["Damage"] = 3990,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 2792,
						["Frost"] = 425,
						["Arcane"] = 773,
					},
					["PartialAbsorb"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 773,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 432,
								},
								["冲击波"] = {
									["count"] = 568,
								},
								["冰锥术"] = {
									["count"] = 425,
								},
								["火焰冲击"] = {
									["count"] = 1792,
								},
							},
							["amount"] = 3990,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 274,
								},
								["魔爆术"] = {
									["count"] = 661,
								},
								["冰锥术"] = {
									["count"] = 416,
								},
								["火焰冲击"] = {
									["count"] = 1139,
								},
							},
							["amount"] = 2490,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["乐儿-火妖鲁西弗隆"] = {
							["Details"] = {
								["元素大师"] = {
									["count"] = 68,
								},
							},
							["amount"] = 68,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["元素大师"] = {
							["Details"] = {
								["乐儿-火妖鲁西弗隆"] = {
									["count"] = 68,
								},
							},
							["amount"] = 68,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 3,
								},
								["冲击波"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 12,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["魔爆术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 473,
									["min"] = 473,
									["count"] = 1,
									["amount"] = 473,
								},
								["Hit"] = {
									["max"] = 300,
									["min"] = 300,
									["count"] = 1,
									["amount"] = 300,
								},
							},
							["count"] = 2,
							["amount"] = 773,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 216,
									["min"] = 216,
									["count"] = 2,
									["amount"] = 432,
								},
							},
							["count"] = 2,
							["amount"] = 432,
						},
						["冲击波"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 568,
									["min"] = 568,
									["count"] = 1,
									["amount"] = 568,
								},
							},
							["count"] = 1,
							["amount"] = 568,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 425,
									["min"] = 425,
									["count"] = 1,
									["amount"] = 425,
								},
							},
							["count"] = 1,
							["amount"] = 425,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1080,
									["min"] = 1080,
									["count"] = 1,
									["amount"] = 1080,
								},
								["Hit"] = {
									["max"] = 712,
									["min"] = 712,
									["count"] = 1,
									["amount"] = 712,
								},
							},
							["count"] = 2,
							["amount"] = 1792,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 12,
					["TimeDamaging"] = {
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 3,
								},
								["冲击波"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
					},
					["ManaGain"] = 68,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["子弹舍普琴科"] = {
									["count"] = 6,
								},
								["广坤叔来啦-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
							},
							["amount"] = 15,
						},
					},
					["TimeSpent"] = {
						["李老三"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 0.98,
								},
							},
							["amount"] = 0.98,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 1.53,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.53,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 3.53,
								},
								["冲击波"] = {
									["count"] = 2.48,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 16.51,
						},
					},
					["DamageTaken"] = 2490,
					["ElementDoneAbsorb"] = {
						["Fire"] = 908,
					},
					["PartialResist"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["元素大师"] = {
							["Details"] = {
								["乐儿-火妖鲁西弗隆"] = {
									["count"] = 204,
								},
							},
							["amount"] = 204,
						},
					},
					["PartialAbsorb"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 22.02,
					["ElementTaken"] = {
						["Fire"] = 1413,
						["Frost"] = 416,
						["Arcane"] = 661,
					},
					["DOT_Time"] = 15,
					["Damage"] = 8143,
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["WhoDamaged"] = {
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 274,
								},
								["魔爆术"] = {
									["count"] = 661,
								},
								["冰锥术"] = {
									["count"] = 416,
								},
								["火焰冲击"] = {
									["count"] = 1139,
								},
							},
							["amount"] = 2490,
						},
					},
					["ElementDone"] = {
						["Fire"] = 5878,
						["Frost"] = 517,
						["Arcane"] = 1748,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 11,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["DamagedWho"] = {
						["李老三"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 325,
								},
							},
							["amount"] = 325,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 650,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 364,
								},
								["火焰冲击"] = {
									["count"] = 908,
								},
							},
							["amount"] = 1922,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 773,
								},
								["冰霜新星"] = {
									["count"] = 92,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 637,
								},
								["冲击波"] = {
									["count"] = 1156,
								},
								["冰锥术"] = {
									["count"] = 425,
								},
								["火焰冲击"] = {
									["count"] = 2813,
								},
							},
							["amount"] = 5896,
						},
					},
					["TimeDamage"] = 22.02,
					["TimeDamaging"] = {
						["李老三"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 0.98,
								},
							},
							["amount"] = 0.98,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 1.53,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.53,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 3.53,
								},
								["冲击波"] = {
									["count"] = 2.48,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 16.51,
						},
					},
					["ManaGain"] = 204,
					["Attacks"] = {
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 425,
									["min"] = 425,
									["count"] = 1,
									["amount"] = 425,
								},
							},
							["count"] = 1,
							["amount"] = 425,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
							},
							["count"] = 1,
							["amount"] = 92,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 216,
									["min"] = 182,
									["count"] = 5,
									["amount"] = 1001,
								},
							},
							["count"] = 5,
							["amount"] = 1001,
						},
						["冲击波"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 588,
									["min"] = 568,
									["count"] = 2,
									["amount"] = 1156,
								},
							},
							["count"] = 2,
							["amount"] = 1156,
						},
						["魔爆术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 473,
									["min"] = 473,
									["count"] = 1,
									["amount"] = 473,
								},
								["Hit"] = {
									["max"] = 327,
									["min"] = 300,
									["count"] = 4,
									["amount"] = 1275,
								},
							},
							["count"] = 5,
							["amount"] = 1748,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 908,
									["min"] = 908,
									["count"] = 1,
									["amount"] = 908,
								},
								["Crit"] = {
									["max"] = 1080,
									["min"] = 1021,
									["count"] = 2,
									["amount"] = 2101,
								},
								["Hit"] = {
									["max"] = 712,
									["min"] = 712,
									["count"] = 1,
									["amount"] = 712,
								},
							},
							["count"] = 4,
							["amount"] = 3721,
						},
					},
					["ManaGainedFrom"] = {
						["乐儿-火妖鲁西弗隆"] = {
							["Details"] = {
								["元素大师"] = {
									["count"] = 204,
								},
							},
							["amount"] = 204,
						},
					},
				},
			},
			["UnitLockout"] = 4854.514,
			["LastActive"] = 5094.512,
		},
		["银虎丶"] = {
			["GUID"] = "Player-5458-02FB62A9",
			["LastEventHealth"] = {
				3000, -- [1]
				3000, -- [2]
				2626, -- [3]
				2626, -- [4]
				2626, -- [5]
				1290, -- [6]
				1290, -- [7]
				1290, -- [8]
				1290, -- [9]
				932, -- [10]
				547, -- [11]
				188, -- [12]
				0, -- [13]
				3000, -- [14]
				3000, -- [15]
			},
			["LastAttackedBy"] = "广坤叔来啦-火妖鲁西弗隆",
			["LastEventType"] = {
				"MISC", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"MISC", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					1.5, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					1.5, -- [1]
				},
				["DOT_Time"] = {
					3, -- [1]
				},
				["ManaGain"] = {
					285, -- [1]
				},
				["DamageTaken"] = {
					3632, -- [1]
				},
				["Damage"] = {
					155, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "银虎丶",
			["LastEventHealthMax"] = {
				3000, -- [1]
				3000, -- [2]
				3000, -- [3]
				3000, -- [4]
				3000, -- [5]
				3000, -- [6]
				3000, -- [7]
				3000, -- [8]
				3000, -- [9]
				3000, -- [10]
				3000, -- [11]
				3000, -- [12]
				3000, -- [13]
				3000, -- [14]
				3000, -- [15]
			},
			["level"] = 60,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 7,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
					},
					["Messages"] = {
						"牧老-火妖鲁西弗隆 dispels 银虎丶 寒冰护体 (驱散魔法)", -- [1]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 银虎丶 Tick -374 (Shadow)", -- [2]
						"丷光头强丷 肉搏 银虎丶 Miss (1)", -- [3]
						"丷光头强丷 出血 银虎丶 Hit -205 (Physical)", -- [4]
						"牧老-火妖鲁西弗隆 心灵震爆 银虎丶 Hit -1131 (Shadow)", -- [5]
						"牧老-火妖鲁西弗隆 暗影易伤 银虎丶 Resist (Shadow)", -- [6]
						"丷光头强丷 肉搏 银虎丶 Miss (1)", -- [7]
						"丷光头强丷 肾击 银虎丶 Immune (Physical)", -- [8]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 银虎丶 Tick -358 (Shadow)", -- [9]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 银虎丶 Tick -385 (Shadow)", -- [10]
						"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 银虎丶 Tick -359 (Shadow)", -- [11]
						"丷光头强丷 刺骨 银虎丶 Hit -303 (Physical)", -- [12]
						"银虎丶死亡。", -- [13]
					},
					["DeathAt"] = 4659.519,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["MessageTimes"] = {
						-5.099999999999454, -- [1]
						-3.599999999999454, -- [2]
						-2.332999999999629, -- [3]
						-2.332999999999629, -- [4]
						-2.25, -- [5]
						-2.067000000000007, -- [6]
						-1.416999999999462, -- [7]
						-1.266999999999825, -- [8]
						-1.067000000000007, -- [9]
						-0.6170000000001892, -- [10]
						-0.0500000000001819, -- [11]
						-0.01599999999962165, -- [12]
						0, -- [13]
					},
					["HealthMax"] = {
						3000, -- [1]
						3000, -- [2]
						3000, -- [3]
						3000, -- [4]
						3000, -- [5]
						3000, -- [6]
						3000, -- [7]
						3000, -- [8]
						3000, -- [9]
						3000, -- [10]
						3000, -- [11]
						3000, -- [12]
						3000, -- [13]
					},
					["Health"] = {
						3000, -- [1]
						3000, -- [2]
						2626, -- [3]
						2626, -- [4]
						2626, -- [5]
						1290, -- [6]
						1290, -- [7]
						1290, -- [8]
						1290, -- [9]
						932, -- [10]
						547, -- [11]
						188, -- [12]
						0, -- [13]
					},
					["KilledBy"] = "丷光头强丷",
					["MessageType"] = {
						"MISC", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"MISC", -- [13]
					},
				}, -- [1]
			},
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 517,
			["Owner"] = false,
			["TimeLast"] = {
				["Dispelled"] = 4652.519,
				["OVERALL"] = 4958.52,
				["DamageTaken"] = 4958.52,
				["DeathCount"] = 4657.519,
				["TimeDamage"] = 4939.519,
				["ActiveTime"] = 4939.519,
				["ManaGain"] = 4655.519,
				["DOT_Time"] = 4939.519,
				["Damage"] = 4939.519,
			},
			["NextEventNum"] = 16,
			["LastDamageTime"] = 4940.269,
			["LastEvents"] = {
				"牧老-火妖鲁西弗隆 dispels 银虎丶 寒冰护体 (驱散魔法)", -- [1]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 银虎丶 Tick -374 (Shadow)", -- [2]
				"丷光头强丷 肉搏 银虎丶 Miss (1)", -- [3]
				"丷光头强丷 出血 银虎丶 Hit -205 (Physical)", -- [4]
				"牧老-火妖鲁西弗隆 心灵震爆 银虎丶 Hit -1131 (Shadow)", -- [5]
				"牧老-火妖鲁西弗隆 暗影易伤 银虎丶 Resist (Shadow)", -- [6]
				"丷光头强丷 肉搏 银虎丶 Miss (1)", -- [7]
				"丷光头强丷 肾击 银虎丶 Immune (Physical)", -- [8]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 银虎丶 Tick -358 (Shadow)", -- [9]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 银虎丶 Tick -385 (Shadow)", -- [10]
				"牧老-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 银虎丶 Tick -359 (Shadow)", -- [11]
				"丷光头强丷 刺骨 银虎丶 Hit -303 (Physical)", -- [12]
				"银虎丶死亡。", -- [13]
				"银虎丶 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -155 (Frost)", -- [14]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 银虎丶 Crit -517 (Arcane)", -- [15]
			},
			["Name"] = "银虎丶",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				true, -- [15]
			},
			["LastEventTimes"] = {
				4652.819, -- [1]
				4654.319, -- [2]
				4655.586, -- [3]
				4655.586, -- [4]
				4655.669, -- [5]
				4655.852, -- [6]
				4656.502, -- [7]
				4656.652, -- [8]
				4656.852, -- [9]
				4657.302, -- [10]
				4657.869, -- [11]
				4657.903, -- [12]
				4657.919, -- [13]
				4940.269, -- [14]
				4959.471000000001, -- [15]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 1,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 3632,
					["PartialResist"] = {
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影易伤"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["银虎丶"] = {
									["count"] = 285,
								},
							},
							["amount"] = 285,
						},
					},
					["PartialAbsorb"] = {
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影易伤"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 1.5,
					["ElementTaken"] = {
						["Shadow"] = 2607,
						["Physical"] = 508,
						["Arcane"] = 517,
					},
					["DOT_Time"] = 3,
					["WhoDispelled"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 155,
								},
							},
							["amount"] = 155,
						},
					},
					["ElementDone"] = {
						["Frost"] = 155,
					},
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["目空一切-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Damage"] = 155,
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 155,
									["min"] = 155,
									["count"] = 1,
									["amount"] = 155,
								},
							},
							["count"] = 1,
							["amount"] = 155,
						},
					},
					["TimeDamaging"] = {
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGainedFrom"] = {
						["银虎丶"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 285,
								},
							},
							["amount"] = 285,
						},
					},
					["TimeDamage"] = 1.5,
					["WhoDamaged"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1131,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 759,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 717,
								},
							},
							["amount"] = 2607,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 205,
								},
								["刺骨"] = {
									["count"] = 303,
								},
							},
							["amount"] = 508,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 517,
								},
							},
							["amount"] = 517,
						},
					},
					["ManaGain"] = 285,
					["TimeSpent"] = {
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DeathCount"] = 1,
				},
			},
			["UnitLockout"] = 4655.519,
			["LastActive"] = 4958.52,
		},
		["Aoo-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-030D7F9A",
			["LastEventHealth"] = {
				1605, -- [1]
				1256, -- [2]
				715, -- [3]
				617, -- [4]
				617, -- [5]
				0, -- [6]
				4660, -- [7]
				4644, -- [8]
				4660, -- [9]
				4660, -- [10]
				4660, -- [11]
				4014, -- [12]
				3860, -- [13]
				3860, -- [14]
				3860, -- [15]
				3527, -- [16]
				3389, -- [17]
				3031, -- [18]
				2696, -- [19]
				556, -- [20]
				0, -- [21]
				4530, -- [22]
				3751, -- [23]
				3770, -- [24]
				3770, -- [25]
				4530, -- [26]
				4473, -- [27]
				4473, -- [28]
				4130, -- [29]
				4091, -- [30]
				3710, -- [31]
				3710, -- [32]
				2667, -- [33]
				1731, -- [34]
				806, -- [35]
				4478, -- [36]
				4478, -- [37]
				4478, -- [38]
				4478, -- [39]
				4478, -- [40]
				3790, -- [41]
				3790, -- [42]
				3790, -- [43]
				3790, -- [44]
				3790, -- [45]
				3592, -- [46]
				3231, -- [47]
				2892, -- [48]
				2543, -- [49]
				1868, -- [50]
			},
			["LastAttackedBy"] = "牧老-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"MISC", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"MISC", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"MISC", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					14179, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["HealingTaken"] = {
					121, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					46.02, -- [1]
				},
				["TimeDamage"] = {
					46.02, -- [1]
				},
				["ManaGain"] = {
					2145, -- [1]
				},
				["DOT_Time"] = {
					60, -- [1]
				},
				["Damage"] = {
					19073, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "Aoo-火妖鲁西弗隆",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
					},
					["Messages"] = {
						"Aoo-火妖鲁西弗隆 火焰冲击 广坤叔来啦-火妖鲁西弗隆 Hit -847 (Fire)", -- [1]
						"广坤叔来啦-火妖鲁西弗隆 火焰冲击 Aoo-火妖鲁西弗隆 Hit -646 (215 被抵抗) (Fire)", -- [2]
						"丷光头强丷 肉搏 Aoo-火妖鲁西弗隆 Hit -154 (Physical)", -- [3]
						"丷光头强丷 肉搏 Aoo-火妖鲁西弗隆 Crit -139 (Physical)", -- [4]
						"丷光头强丷 冰霜冲击 Aoo-火妖鲁西弗隆 Hit -46 (Frost)", -- [5]
						"丷光头强丷 速效毒药 VI Aoo-火妖鲁西弗隆 Hit -148 (Nature)", -- [6]
						"丷光头强丷 出血 Aoo-火妖鲁西弗隆 Hit -138 (Physical)", -- [7]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 Aoo-火妖鲁西弗隆 Hit -358 (Arcane)", -- [8]
						"丷光头强丷 肉搏 Aoo-火妖鲁西弗隆 Crit -335 (Physical)", -- [9]
						"丷光头强丷 刺骨 Aoo-火妖鲁西弗隆 Crit -2140 (Physical)", -- [10]
						"美女婉君-老马布兰契 伏击 Aoo-火妖鲁西弗隆 Crit -1424 (Physical)", -- [11]
						"Aoo-火妖鲁西弗隆死亡。", -- [12]
					},
					["DeathAt"] = 4959.52,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["MessageTimes"] = {
						-9.801000000000386, -- [1]
						-4.967000000000553, -- [2]
						-2.431999999999789, -- [3]
						-1.53400000000056, -- [4]
						-1.53400000000056, -- [5]
						-1.53400000000056, -- [6]
						-1.451000000000022, -- [7]
						-1.184000000000197, -- [8]
						-0.6340000000000146, -- [9]
						-0.4510000000000218, -- [10]
						-0.03400000000056025, -- [11]
						0, -- [12]
					},
					["HealthMax"] = {
						4660, -- [1]
						4660, -- [2]
						4660, -- [3]
						4660, -- [4]
						4660, -- [5]
						4660, -- [6]
						4660, -- [7]
						4660, -- [8]
						4660, -- [9]
						4660, -- [10]
						4660, -- [11]
						4660, -- [12]
					},
					["Health"] = {
						4660, -- [1]
						4660, -- [2]
						4014, -- [3]
						3860, -- [4]
						3860, -- [5]
						3860, -- [6]
						3527, -- [7]
						3389, -- [8]
						3031, -- [9]
						2696, -- [10]
						556, -- [11]
						0, -- [12]
					},
					["KilledBy"] = "美女婉君-老马布兰契",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
					},
					["Messages"] = {
						"Aoo-火妖鲁西弗隆 冲击波 广坤叔来啦-火妖鲁西弗隆 Hit -604 (Fire)", -- [1]
						"Aoo-火妖鲁西弗隆 火焰冲击 延陵斩蛟-黑龙费尔默 Hit -484 (179 被抵抗) (Fire)", -- [2]
						"Aoo-火妖鲁西弗隆 冰霜新星 目空一切-逐风者 Hit -80 (Frost)", -- [3]
						"Aoo-火妖鲁西弗隆 冰霜新星 牧老-火妖鲁西弗隆 Hit -90 (Frost)", -- [4]
						"目空一切-逐风者 闪电之盾 Aoo-火妖鲁西弗隆 Hit -198 (Nature)", -- [5]
						"牧老-火妖鲁西弗隆 暗影守卫 Aoo-火妖鲁西弗隆 Hit -361 (Shadow)", -- [6]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -339 (Shadow)", -- [7]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -349 (Shadow)", -- [8]
						"火焰新星图腾 V 火焰新星 Aoo-火妖鲁西弗隆 Crit -675 (Fire)", -- [9]
						"李老三 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -263 (Shadow)", -- [10]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -349 (Shadow)", -- [11]
						"子弹舍普琴科 肉搏 Aoo-火妖鲁西弗隆 Hit -541 (Physical)", -- [12]
						"子弹舍普琴科 断筋 Aoo-火妖鲁西弗隆 Crit -98 (Physical)", -- [13]
						"目空一切-逐风者 地震术 Aoo-火妖鲁西弗隆 Hit -556 (Nature)", -- [14]
						"李老三 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -271 (Shadow)", -- [15]
						"Aoo-火妖鲁西弗隆死亡。", -- [16]
					},
					["DeathAt"] = 4873.515,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
					},
					["MessageTimes"] = {
						-14.73400000000038, -- [1]
						-12.58399999999983, -- [2]
						-9.266999999999825, -- [3]
						-9.266999999999825, -- [4]
						-9.234000000000378, -- [5]
						-8.717000000000553, -- [6]
						-6.851000000000568, -- [7]
						-3.850000000000364, -- [8]
						-3.367000000000189, -- [9]
						-3, -- [10]
						-0.8670000000001892, -- [11]
						-0.6170000000001892, -- [12]
						-0.1670000000003711, -- [13]
						-0.03300000000035652, -- [14]
						0, -- [15]
						0, -- [16]
					},
					["HealthMax"] = {
						4660, -- [1]
						4660, -- [2]
						4660, -- [3]
						4660, -- [4]
						4660, -- [5]
						4660, -- [6]
						4660, -- [7]
						4660, -- [8]
						4660, -- [9]
						4660, -- [10]
						4660, -- [11]
						4660, -- [12]
						4660, -- [13]
						4660, -- [14]
						4660, -- [15]
						4660, -- [16]
					},
					["Health"] = {
						3790, -- [1]
						3790, -- [2]
						3790, -- [3]
						3790, -- [4]
						3790, -- [5]
						3592, -- [6]
						3231, -- [7]
						2892, -- [8]
						2543, -- [9]
						1868, -- [10]
						1605, -- [11]
						1256, -- [12]
						715, -- [13]
						617, -- [14]
						617, -- [15]
						0, -- [16]
					},
					["KilledBy"] = "李老三",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"MISC", -- [16]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 10,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				4660, -- [1]
				4660, -- [2]
				4660, -- [3]
				4660, -- [4]
				4660, -- [5]
				4660, -- [6]
				4660, -- [7]
				4660, -- [8]
				4660, -- [9]
				4660, -- [10]
				4660, -- [11]
				4660, -- [12]
				4660, -- [13]
				4660, -- [14]
				4660, -- [15]
				4660, -- [16]
				4660, -- [17]
				4660, -- [18]
				4660, -- [19]
				4660, -- [20]
				4660, -- [21]
				4530, -- [22]
				4530, -- [23]
				4530, -- [24]
				4530, -- [25]
				4530, -- [26]
				4530, -- [27]
				4530, -- [28]
				4530, -- [29]
				4530, -- [30]
				4530, -- [31]
				4530, -- [32]
				4530, -- [33]
				4530, -- [34]
				4530, -- [35]
				4660, -- [36]
				4660, -- [37]
				4660, -- [38]
				4660, -- [39]
				4660, -- [40]
				4660, -- [41]
				4660, -- [42]
				4660, -- [43]
				4660, -- [44]
				4660, -- [45]
				4660, -- [46]
				4660, -- [47]
				4660, -- [48]
				4660, -- [49]
				4660, -- [50]
			},
			["LastDamageTaken"] = 355,
			["Owner"] = false,
			["TimeLast"] = {
				["OVERALL"] = 5099.512,
				["DamageTaken"] = 5099.512,
				["Interrupts"] = 4941.519,
				["HealingTaken"] = 4590.515,
				["DeathCount"] = 4957.52,
				["TimeDamage"] = 5090.511,
				["ActiveTime"] = 5090.511,
				["ManaGain"] = 5088.511,
				["DOT_Time"] = 4850.514,
				["Damage"] = 5090.511,
			},
			["NextEventNum"] = 36,
			["LastDamageTime"] = 5091.161,
			["LastEvents"] = {
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -349 (Shadow)", -- [1]
				"子弹舍普琴科 肉搏 Aoo-火妖鲁西弗隆 Hit -541 (Physical)", -- [2]
				"子弹舍普琴科 断筋 Aoo-火妖鲁西弗隆 Crit -98 (Physical)", -- [3]
				"目空一切-逐风者 地震术 Aoo-火妖鲁西弗隆 Hit -556 (Nature)", -- [4]
				"李老三 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -271 (Shadow)", -- [5]
				"Aoo-火妖鲁西弗隆死亡。", -- [6]
				"Environment Falling Aoo-火妖鲁西弗隆 Hit -345 (Physical)", -- [7]
				"Aoo-火妖鲁西弗隆 火焰冲击 李老三 Hit -801 (Fire)", -- [8]
				"Aoo-火妖鲁西弗隆 interrupts 广坤叔来啦-火妖鲁西弗隆 炎爆术 (法术反制)", -- [9]
				"Aoo-火妖鲁西弗隆 火焰冲击 广坤叔来啦-火妖鲁西弗隆 Hit -847 (Fire)", -- [10]
				"广坤叔来啦-火妖鲁西弗隆 火焰冲击 Aoo-火妖鲁西弗隆 Hit -646 (215 被抵抗) (Fire)", -- [11]
				"丷光头强丷 肉搏 Aoo-火妖鲁西弗隆 Hit -154 (Physical)", -- [12]
				"丷光头强丷 肉搏 Aoo-火妖鲁西弗隆 Crit -139 (Physical)", -- [13]
				"丷光头强丷 冰霜冲击 Aoo-火妖鲁西弗隆 Hit -46 (Frost)", -- [14]
				"丷光头强丷 速效毒药 VI Aoo-火妖鲁西弗隆 Hit -148 (Nature)", -- [15]
				"丷光头强丷 出血 Aoo-火妖鲁西弗隆 Hit -138 (Physical)", -- [16]
				"广坤叔来啦-火妖鲁西弗隆 魔爆术 Aoo-火妖鲁西弗隆 Hit -358 (Arcane)", -- [17]
				"丷光头强丷 肉搏 Aoo-火妖鲁西弗隆 Crit -335 (Physical)", -- [18]
				"丷光头强丷 刺骨 Aoo-火妖鲁西弗隆 Crit -2140 (Physical)", -- [19]
				"美女婉君-老马布兰契 伏击 Aoo-火妖鲁西弗隆 Crit -1424 (Physical)", -- [20]
				"Aoo-火妖鲁西弗隆死亡。", -- [21]
				"Environment Falling Aoo-火妖鲁西弗隆 Hit -835 (Physical)", -- [22]
				"Aoo-火妖鲁西弗隆 奥术飞弹 村里老中医-黑龙费尔默 Hit -303 (Arcane)", -- [23]
				"Aoo-火妖鲁西弗隆 奥术飞弹 村里老中医-黑龙费尔默 Hit -303 (Arcane)", -- [24]
				"Aoo-火妖鲁西弗隆 火焰冲击 村里老中医-黑龙费尔默 Hit -792 (Fire)", -- [25]
				"子弹舍普琴科 拦截昏迷 Aoo-火妖鲁西弗隆 Hit -57 (Physical)", -- [26]
				"子弹舍普琴科 肉搏 Aoo-火妖鲁西弗隆 Hit -343 (Physical)", -- [27]
				"子弹舍普琴科 锤击昏迷效果 Aoo-火妖鲁西弗隆 Resist (Physical)", -- [28]
				"子弹舍普琴科 断筋 Aoo-火妖鲁西弗隆 Hit -39 (Physical)", -- [29]
				"子弹舍普琴科 旋风斩 Aoo-火妖鲁西弗隆 Hit -381 (Physical)", -- [30]
				"Aoo-火妖鲁西弗隆 冰霜新星 子弹舍普琴科 Hit -106 (Frost)", -- [31]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -355 (Shadow)", -- [32]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -355 (Shadow)", -- [33]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -355 (Shadow)", -- [34]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -355 (Shadow)", -- [35]
				"Aoo-火妖鲁西弗隆 火球术 (伤害/跳) 子弹舍普琴科 Absorb -19 (19 被吸收) (Fire)", -- [36]
				"Aoo-火妖鲁西弗隆 火球术 丷光头强丷 Crit -1985 (Fire)", -- [37]
				"Aoo-火妖鲁西弗隆 灼烧 丷光头强丷 Crit -790 (Fire)", -- [38]
				"Aoo-火妖鲁西弗隆 火球术 (伤害/跳) 子弹舍普琴科 Absorb -19 (19 被吸收) (Fire)", -- [39]
				"Environment Falling Aoo-火妖鲁西弗隆 Hit -688 (Physical)", -- [40]
				"Aoo-火妖鲁西弗隆 冲击波 广坤叔来啦-火妖鲁西弗隆 Hit -604 (Fire)", -- [41]
				"Aoo-火妖鲁西弗隆 火焰冲击 延陵斩蛟-黑龙费尔默 Hit -484 (179 被抵抗) (Fire)", -- [42]
				"Aoo-火妖鲁西弗隆 冰霜新星 目空一切-逐风者 Hit -80 (Frost)", -- [43]
				"Aoo-火妖鲁西弗隆 冰霜新星 牧老-火妖鲁西弗隆 Hit -90 (Frost)", -- [44]
				"目空一切-逐风者 闪电之盾 Aoo-火妖鲁西弗隆 Hit -198 (Nature)", -- [45]
				"牧老-火妖鲁西弗隆 暗影守卫 Aoo-火妖鲁西弗隆 Hit -361 (Shadow)", -- [46]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -339 (Shadow)", -- [47]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -349 (Shadow)", -- [48]
				"火焰新星图腾 V 火焰新星 Aoo-火妖鲁西弗隆 Crit -675 (Fire)", -- [49]
				"李老三 暗言术：痛 (伤害/跳) Aoo-火妖鲁西弗隆 Tick -263 (Shadow)", -- [50]
			},
			["Name"] = "Aoo-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				4871.465, -- [1]
				4871.715, -- [2]
				4872.165, -- [3]
				4872.299, -- [4]
				4872.332, -- [5]
				4872.332, -- [6]
				4888.383, -- [7]
				4921.602, -- [8]
				4942.52, -- [9]
				4947.803, -- [10]
				4952.637, -- [11]
				4955.172000000001, -- [12]
				4956.07, -- [13]
				4956.07, -- [14]
				4956.07, -- [15]
				4956.153, -- [16]
				4956.42, -- [17]
				4956.97, -- [18]
				4957.153, -- [19]
				4957.57, -- [20]
				4957.604, -- [21]
				4988.472, -- [22]
				4995.072, -- [23]
				4996.073, -- [24]
				4996.172000000001, -- [25]
				5087.728, -- [26]
				5088.678, -- [27]
				5088.695, -- [28]
				5088.728, -- [29]
				5091.111, -- [30]
				5091.161, -- [31]
				5091.461, -- [32]
				5094.461, -- [33]
				5097.462, -- [34]
				5100.462, -- [35]
				4849.514, -- [36]
				4851.181000000001, -- [37]
				4851.397, -- [38]
				4851.514, -- [39]
				4856.898, -- [40]
				4857.598, -- [41]
				4859.748000000001, -- [42]
				4863.065000000001, -- [43]
				4863.065000000001, -- [44]
				4863.098, -- [45]
				4863.615, -- [46]
				4865.481, -- [47]
				4868.482, -- [48]
				4868.965, -- [49]
				4869.332, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2240,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 477,
						["Melee"] = 343,
						["Shadow"] = 1420,
					},
					["DOT_Time"] = 0,
					["Damage"] = 106,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 106,
					},
					["PartialAbsorb"] = {
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 106,
								},
							},
							["amount"] = 106,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1420,
								},
							},
							["amount"] = 1420,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 381,
								},
								["拦截昏迷"] = {
									["count"] = 57,
								},
								["断筋"] = {
									["count"] = 39,
								},
								["肉搏"] = {
									["count"] = 343,
								},
							},
							["amount"] = 820,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["Aoo-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["Aoo-火妖鲁西弗隆"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 106,
									["min"] = 106,
									["count"] = 1,
									["amount"] = 106,
								},
							},
							["count"] = 1,
							["amount"] = 106,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["火球术 (伤害/跳)"] = {
							["Details"] = {
								["子弹舍普琴科"] = {
									["count"] = 12,
								},
								["紫衣战天下"] = {
									["count"] = 24,
								},
								["目空一切-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 48,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["紫衣战天下"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 184,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 13,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DamageTaken"] = 14179,
					["ElementDoneAbsorb"] = {
						["Fire"] = 1195,
					},
					["PartialResist"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["伏击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 215,
									["min"] = 215,
									["count"] = 1,
									["amount"] = 215,
								},
							},
							["count"] = 215,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["ManaGained"] = {
						["恢复法力"] = {
							["Details"] = {
								["Aoo-火妖鲁西弗隆"] = {
									["count"] = 2145,
								},
							},
							["amount"] = 2145,
						},
						["魔法吸收"] = {
							["Details"] = {
								["Aoo-火妖鲁西弗隆"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["PartialAbsorb"] = {
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["伏击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 46.02,
					["ElementTaken"] = {
						["Shadow"] = 3352,
						["Melee"] = 1512,
						["Arcane"] = 358,
						["Frost"] = 46,
						["Fire"] = 1321,
						["Physical"] = 6490,
						["Nature"] = 1100,
					},
					["DOT_Time"] = 60,
					["Damage"] = 19073,
					["ElementTakenResist"] = {
						["Fire"] = 215,
					},
					["InterruptData"] = {
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["炎爆术 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 1,
					["DeathCount"] = 2,
					["ManaGainedFrom"] = {
						["Aoo-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复法力"] = {
									["count"] = 2145,
								},
								["魔法吸收"] = {
									["count"] = 0,
								},
							},
							["amount"] = 2145,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 130,
						["Melee"] = 974,
						["Arcane"] = 606,
						["Fire"] = 17087,
						["Frost"] = 276,
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 15,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 17,
								},
							},
							["amount"] = 38,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["冲击"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火球术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1985,
									["min"] = 1985,
									["count"] = 1,
									["amount"] = 1985,
								},
								["Hit"] = {
									["max"] = 1463,
									["min"] = 314,
									["count"] = 5,
									["amount"] = 5980,
								},
							},
							["count"] = 6,
							["amount"] = 7965,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 303,
									["min"] = 303,
									["count"] = 2,
									["amount"] = 606,
								},
							},
							["count"] = 2,
							["amount"] = 606,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 183,
									["min"] = 183,
									["count"] = 1,
									["amount"] = 183,
								},
								["Tick"] = {
									["max"] = 183,
									["min"] = 183,
									["count"] = 3,
									["amount"] = 549,
								},
							},
							["count"] = 4,
							["amount"] = 732,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 106,
									["min"] = 80,
									["count"] = 3,
									["amount"] = 276,
								},
							},
							["count"] = 3,
							["amount"] = 276,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 847,
									["min"] = 484,
									["count"] = 4,
									["amount"] = 2924,
								},
							},
							["count"] = 4,
							["amount"] = 2924,
						},
						["冲击波"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 604,
									["min"] = 604,
									["count"] = 1,
									["amount"] = 604,
								},
							},
							["count"] = 1,
							["amount"] = 604,
						},
						["火球术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 19,
									["min"] = 19,
									["count"] = 2,
									["amount"] = 38,
								},
								["Tick"] = {
									["max"] = 21,
									["min"] = 15,
									["count"] = 14,
									["amount"] = 277,
								},
							},
							["count"] = 16,
							["amount"] = 315,
						},
						["炎爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1710,
									["min"] = 1710,
									["count"] = 1,
									["amount"] = 1710,
								},
							},
							["count"] = 1,
							["amount"] = 1710,
						},
						["射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 130,
									["min"] = 130,
									["count"] = 1,
									["amount"] = 130,
								},
							},
							["count"] = 1,
							["amount"] = 130,
						},
						["灼烧"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 790,
									["min"] = 790,
									["count"] = 1,
									["amount"] = 790,
								},
								["Hit"] = {
									["max"] = 525,
									["min"] = 491,
									["count"] = 4,
									["amount"] = 2047,
								},
							},
							["count"] = 5,
							["amount"] = 2837,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 974,
									["min"] = 974,
									["count"] = 1,
									["amount"] = 974,
								},
							},
							["count"] = 1,
							["amount"] = 974,
						},
					},
					["HealingTaken"] = 121,
					["DamagedWho"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["火球术 (伤害/跳)"] = {
									["count"] = 72,
								},
								["火球术"] = {
									["count"] = 1463,
								},
								["冰霜新星"] = {
									["count"] = 106,
								},
							},
							["amount"] = 1641,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 484,
								},
							},
							["amount"] = 484,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 1537,
								},
								["肉搏"] = {
									["count"] = 974,
								},
								["火球术 (伤害/跳)"] = {
									["count"] = 167,
								},
								["炎爆术"] = {
									["count"] = 1710,
								},
								["火球术"] = {
									["count"] = 1768,
								},
								["炎爆术 (伤害/跳)"] = {
									["count"] = 732,
								},
							},
							["amount"] = 6888,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 847,
								},
								["冲击波"] = {
									["count"] = 604,
								},
							},
							["amount"] = 1451,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1985,
								},
								["灼烧"] = {
									["count"] = 790,
								},
							},
							["amount"] = 2775,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 792,
								},
								["奥术飞弹"] = {
									["count"] = 606,
								},
							},
							["amount"] = 1398,
						},
						["李老三"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 801,
								},
							},
							["amount"] = 801,
						},
						["风之优雅图腾 III"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 130,
								},
							},
							["amount"] = 130,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1440,
								},
							},
							["amount"] = 1440,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["火球术 (伤害/跳)"] = {
									["count"] = 76,
								},
								["火球术"] = {
									["count"] = 1309,
								},
								["灼烧"] = {
									["count"] = 510,
								},
								["冰霜新星"] = {
									["count"] = 80,
								},
							},
							["amount"] = 1975,
						},
					},
					["TimeDamage"] = 46.02,
					["WhoDamaged"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 381,
								},
								["断筋"] = {
									["count"] = 137,
								},
								["拦截昏迷"] = {
									["count"] = 57,
								},
								["肉搏"] = {
									["count"] = 884,
								},
							},
							["amount"] = 1459,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 358,
								},
								["火焰冲击"] = {
									["count"] = 646,
								},
							},
							["amount"] = 1004,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2457,
								},
								["暗影守卫"] = {
									["count"] = 361,
								},
							},
							["amount"] = 2818,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["冰霜冲击"] = {
									["count"] = 46,
								},
								["刺骨"] = {
									["count"] = 2140,
								},
								["速效毒药 VI"] = {
									["count"] = 148,
								},
								["出血"] = {
									["count"] = 138,
								},
								["肉搏"] = {
									["count"] = 628,
								},
							},
							["amount"] = 3100,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2213,
								},
							},
							["amount"] = 2213,
						},
						["李老三"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 534,
								},
							},
							["amount"] = 534,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1424,
								},
							},
							["amount"] = 1424,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 675,
								},
							},
							["amount"] = 675,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 556,
								},
								["闪电之盾"] = {
									["count"] = 396,
								},
							},
							["amount"] = 952,
						},
					},
					["ManaGain"] = 2145,
					["TimeSpent"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["火球术 (伤害/跳)"] = {
									["count"] = 4.62,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.62,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 2.52,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["火球术 (伤害/跳)"] = {
									["count"] = 9.600000000000001,
								},
								["炎爆术"] = {
									["count"] = 0.36,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
								["炎爆术 (伤害/跳)"] = {
									["count"] = 3.14,
								},
							},
							["amount"] = 18.62,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冲击波"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
								["灼烧"] = {
									["count"] = 0.22,
								},
							},
							["amount"] = 1.72,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 0.1,
								},
								["奥术飞弹"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.6,
						},
						["李老三"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["风之优雅图腾 III"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["火球术 (伤害/跳)"] = {
									["count"] = 5.03,
								},
								["火球术"] = {
									["count"] = 1.17,
								},
								["灼烧"] = {
									["count"] = 0.18,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.88,
						},
					},
					["TimeDamaging"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["火球术 (伤害/跳)"] = {
									["count"] = 4.62,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.62,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 2.52,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["火球术 (伤害/跳)"] = {
									["count"] = 9.600000000000001,
								},
								["炎爆术"] = {
									["count"] = 0.36,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
								["炎爆术 (伤害/跳)"] = {
									["count"] = 3.14,
								},
							},
							["amount"] = 18.62,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冲击波"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
								["灼烧"] = {
									["count"] = 0.22,
								},
							},
							["amount"] = 1.72,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 0.1,
								},
								["奥术飞弹"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.6,
						},
						["李老三"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["风之优雅图腾 III"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 0.08,
								},
							},
							["amount"] = 0.08,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["火球术 (伤害/跳)"] = {
									["count"] = 5.03,
								},
								["火球术"] = {
									["count"] = 1.17,
								},
								["灼烧"] = {
									["count"] = 0.18,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.88,
						},
					},
				},
			},
			["UnitLockout"] = 4700.522,
			["LastActive"] = 5099.512,
		},
		["于秋如梦"] = {
			["GUID"] = "Player-5458-02EBA3F0",
			["LastEventHealth"] = {
				2868, -- [1]
				2868, -- [2]
				2868, -- [3]
				2868, -- [4]
				2868, -- [5]
				2440, -- [6]
				2135, -- [7]
				1812, -- [8]
				1812, -- [9]
				1812, -- [10]
				1812, -- [11]
				1812, -- [12]
				885, -- [13]
				538, -- [14]
				498, -- [15]
				470, -- [16]
				297, -- [17]
				268, -- [18]
				95, -- [19]
				1441, -- [20]
				1460, -- [21]
				1323, -- [22]
				3409, -- [23]
				3410, -- [24]
				3410, -- [25]
				3410, -- [26]
				3410, -- [27]
				3410, -- [28]
				3410, -- [29]
				3410, -- [30]
				3410, -- [31]
				3410, -- [32]
				3410, -- [33]
				3410, -- [34]
				3410, -- [35]
				3410, -- [36]
				3410, -- [37]
				3410, -- [38]
				3410, -- [39]
				3410, -- [40]
				3410, -- [41]
				3410, -- [42]
				3410, -- [43]
				3410, -- [44]
				3351, -- [45]
				3351, -- [46]
				3368, -- [47]
				3368, -- [48]
				3368, -- [49]
				3194, -- [50]
			},
			["LastAttackedBy"] = "李老三",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"MISC", -- [8]
				"MISC", -- [9]
				"DAMAGE", -- [10]
				"MISC", -- [11]
				"MISC", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"MISC", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"MISC", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					14.27, -- [1]
				},
				["Dispelled"] = {
					4, -- [1]
				},
				["Healing"] = {
					1346, -- [1]
				},
				["DamageTaken"] = {
					5152, -- [1]
				},
				["Absorbs"] = {
					2301, -- [1]
				},
				["HealingTaken"] = {
					3647, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					32.41, -- [1]
				},
				["ActiveTime"] = {
					46.68, -- [1]
				},
				["ManaGain"] = {
					67, -- [1]
				},
				["DOT_Time"] = {
					123, -- [1]
				},
				["Damage"] = {
					11457, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "于秋如梦",
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 10,
			["type"] = "Ungrouped",
			["LastHealTime"] = 5112.465,
			["LastDamageTaken"] = 59,
			["TimeLast"] = {
				["TimeHeal"] = 5111.513,
				["Dispelled"] = 4878.516000000001,
				["OVERALL"] = 5112.513,
				["DamageTaken"] = 5111.513,
				["Interrupts"] = 5108.512,
				["Absorbs"] = 5111.513,
				["HealingTaken"] = 5111.513,
				["Healing"] = 5027.508,
				["TimeDamage"] = 5112.513,
				["ActiveTime"] = 5112.513,
				["ManaGain"] = 4854.514,
				["DOT_Time"] = 5112.513,
				["Damage"] = 5112.513,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3410, -- [1]
				3410, -- [2]
				3410, -- [3]
				3410, -- [4]
				3410, -- [5]
				3410, -- [6]
				3410, -- [7]
				3410, -- [8]
				3410, -- [9]
				3410, -- [10]
				3410, -- [11]
				3410, -- [12]
				3410, -- [13]
				3410, -- [14]
				3410, -- [15]
				3410, -- [16]
				3410, -- [17]
				3410, -- [18]
				3410, -- [19]
				3410, -- [20]
				3410, -- [21]
				3410, -- [22]
				3410, -- [23]
				3410, -- [24]
				3410, -- [25]
				3410, -- [26]
				3410, -- [27]
				3410, -- [28]
				3410, -- [29]
				3410, -- [30]
				3410, -- [31]
				3410, -- [32]
				3410, -- [33]
				3410, -- [34]
				3410, -- [35]
				3410, -- [36]
				3410, -- [37]
				3410, -- [38]
				3410, -- [39]
				3410, -- [40]
				3410, -- [41]
				3410, -- [42]
				3410, -- [43]
				3410, -- [44]
				3410, -- [45]
				3410, -- [46]
				3410, -- [47]
				3410, -- [48]
				3410, -- [49]
				3410, -- [50]
			},
			["NextEventNum"] = 47,
			["LastDamageTime"] = 5113.013,
			["LastEvents"] = {
				"于秋如梦 魔爆术 李老三 Crit -495 (Arcane)", -- [1]
				"于秋如梦 魔爆术 子弹舍普琴科 Hit -333 (Arcane)", -- [2]
				"于秋如梦 魔爆术 目空一切-逐风者 Hit -337 (Arcane)", -- [3]
				"于秋如梦 魔爆术 牧老-火妖鲁西弗隆 Hit -328 (Arcane)", -- [4]
				"火焰新星图腾 V 火焰新星 于秋如梦 Hit -428 (Fire)", -- [5]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 于秋如梦 Tick -323 (Shadow)", -- [6]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 于秋如梦 Tick -323 (Shadow)", -- [7]
				"李老三 dispels 于秋如梦 寒冰护体 (驱散魔法)", -- [8]
				"李老三 dispels 于秋如梦 奥术智慧 (驱散魔法)", -- [9]
				"美女婉君-老马布兰契 肉搏 于秋如梦 Miss (1)", -- [10]
				"牧老-火妖鲁西弗隆 dispels 于秋如梦 魔法抑制 (驱散魔法)", -- [11]
				"牧老-火妖鲁西弗隆 dispels 于秋如梦 冰甲术 (驱散魔法)", -- [12]
				"子弹舍普琴科 肉搏 于秋如梦 Hit -347 (Physical)", -- [13]
				"子弹舍普琴科 断筋 于秋如梦 Hit -40 (Physical)", -- [14]
				"子弹舍普琴科 撕裂 (伤害/跳) 于秋如梦 Tick -28 (Physical)", -- [15]
				"紫衣战天下 暗言术：痛 (伤害/跳) 于秋如梦 Tick -173 (Shadow)", -- [16]
				"子弹舍普琴科 撕裂 (伤害/跳) 于秋如梦 Tick -29 (Physical)", -- [17]
				"紫衣战天下 暗言术：痛 (伤害/跳) 于秋如梦 Tick -173 (Shadow)", -- [18]
				"于秋如梦 治疗药水 于秋如梦 Hit +1346", -- [19]
				"子弹舍普琴科 撕裂 (伤害/跳) 于秋如梦 Absorb -28 (28 被吸收) (Physical)", -- [20]
				"紫衣战天下 暗言术：痛 (伤害/跳) 于秋如梦 Tick -173 (Shadow)", -- [21]
				"紫衣战天下 暗言术：痛 (伤害/跳) 于秋如梦 Tick -173 (Shadow)", -- [22]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -45 (Frost)", -- [23]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -45 (Frost)", -- [24]
				"目空一切-逐风者 地震术 于秋如梦 Absorb -521 (521 被吸收) (Nature)", -- [25]
				"目空一切-逐风者 interrupts 于秋如梦 寒冰箭 (地震术)", -- [26]
				"灼热图腾 VI 攻击 于秋如梦 Absorb -40 (40 被吸收) (Fire)", -- [27]
				"李老三 暗言术：痛 (伤害/跳) 于秋如梦 Absorb -233 (233 被吸收) (Shadow)", -- [28]
				"于秋如梦 肉搏 目空一切-逐风者 Absorb -31 (1)", -- [29]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -14 (31 被吸收) (Frost)", -- [30]
				"于秋如梦 暴风雪 (伤害/跳) 李老三 Tick -49 (Frost)", -- [31]
				"于秋如梦 暴风雪 (伤害/跳) 丷光头强丷 Tick -50 (Frost)", -- [32]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -44 (Frost)", -- [33]
				"于秋如梦 暴风雪 (伤害/跳) 丷光头强丷 Tick -50 (Frost)", -- [34]
				"李老三 暗言术：痛 (伤害/跳) 于秋如梦 Absorb -234 (234 被吸收) (Shadow)", -- [35]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -44 (Frost)", -- [36]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -45 (Frost)", -- [37]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -45 (Frost)", -- [38]
				"李老三 暗言术：痛 (伤害/跳) 于秋如梦 Absorb -234 (234 被吸收) (Shadow)", -- [39]
				"于秋如梦 interrupts 李老三 精神鞭笞 (法术反制)", -- [40]
				"于秋如梦 暴风雪 (伤害/跳) 李老三 Tick -49 (Frost)", -- [41]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -45 (Frost)", -- [42]
				"李老三 肉搏 于秋如梦 Absorb -175 (1)", -- [43]
				"李老三 暗言术：痛 (伤害/跳) 于秋如梦 Tick -59 (175 被吸收) (Shadow)", -- [44]
				"于秋如梦 暴风雪 (伤害/跳) 李老三 Tick -49 (Frost)", -- [45]
				"于秋如梦 暴风雪 (伤害/跳) 目空一切-逐风者 Tick -44 (Frost)", -- [46]
				"于秋如梦 魔爆术 目空一切-逐风者 Hit -335 (Arcane)", -- [47]
				"于秋如梦 魔爆术 牧老-火妖鲁西弗隆 Hit -342 (Arcane)", -- [48]
				"目空一切-逐风者 闪电之盾 于秋如梦 Hit -174 (Nature)", -- [49]
				"牧老-火妖鲁西弗隆 暗影守卫 于秋如梦 Hit -326 (Shadow)", -- [50]
			},
			["Name"] = "于秋如梦",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				4868.582, -- [1]
				4868.582, -- [2]
				4868.582, -- [3]
				4868.582, -- [4]
				4868.965, -- [5]
				4872.615, -- [6]
				4875.615, -- [7]
				4877.732, -- [8]
				4877.732, -- [9]
				4878.016000000001, -- [10]
				4878.849, -- [11]
				4878.849, -- [12]
				5022.174, -- [13]
				5022.491, -- [14]
				5022.807, -- [15]
				5024.741, -- [16]
				5025.824000000001, -- [17]
				5027.757000000001, -- [18]
				5028.058, -- [19]
				5028.824000000001, -- [20]
				5030.758, -- [21]
				5033.758, -- [22]
				5089.128, -- [23]
				5090.111, -- [24]
				5090.611, -- [25]
				5090.628, -- [26]
				5093.978, -- [27]
				5103.462, -- [28]
				5105.162, -- [29]
				5105.162, -- [30]
				5105.162, -- [31]
				5105.162, -- [32]
				5106.162, -- [33]
				5106.162, -- [34]
				5106.462, -- [35]
				5107.162, -- [36]
				5108.162, -- [37]
				5109.162, -- [38]
				5109.462, -- [39]
				5109.462, -- [40]
				5112.013, -- [41]
				5112.013, -- [42]
				5112.465, -- [43]
				5112.465, -- [44]
				5113.013, -- [45]
				5113.013, -- [46]
				4867.082, -- [47]
				4867.082, -- [48]
				4867.098, -- [49]
				4867.798, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["于秋如梦"] = {
									["max"] = 521,
									["min"] = 175,
									["count"] = 5,
									["amount"] = 1397,
								},
							},
							["count"] = 5,
							["amount"] = 1397,
						},
					},
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["李老三"] = {
									["count"] = 9,
								},
								["丷光头强丷"] = {
									["count"] = 6,
								},
								["目空一切-逐风者"] = {
									["count"] = 27,
								},
							},
							["amount"] = 42,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1496,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 1397,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 14,
								},
							},
							["amount"] = 14,
						},
					},
					["ElementTakenAbsorb"] = {
						["Fire"] = 40,
						["Shadow"] = 876,
						["Nature"] = 521,
					},
					["ElementTaken"] = {
						["Shadow"] = 760,
						["Fire"] = 40,
						["Melee"] = 175,
						["Nature"] = 521,
					},
					["DOT_Time"] = 42,
					["Damage"] = 649,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 7.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 31,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 31,
						["Frost"] = 618,
					},
					["PartialAbsorb"] = {
						["攻击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["地震术"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 521,
									["min"] = 521,
									["count"] = 1,
									["amount"] = 521,
								},
							},
							["count"] = 1,
							["amount"] = 521,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 234,
									["min"] = 175,
									["count"] = 4,
									["amount"] = 876,
								},
							},
							["count"] = 4,
							["amount"] = 876,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["李老三"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 147,
								},
							},
							["amount"] = 147,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 100,
								},
							},
							["amount"] = 100,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 371,
								},
								["肉搏"] = {
									["count"] = 31,
								},
							},
							["amount"] = 402,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["李老三"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 760,
								},
								["肉搏"] = {
									["count"] = 175,
								},
							},
							["amount"] = 935,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 521,
								},
							},
							["amount"] = 521,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1397,
								},
							},
							["amount"] = 1397,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 1,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["李老三"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.48,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.98,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
						["李老三"] = {
							["Details"] = {
								["精神鞭笞 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 521,
									["min"] = 175,
									["count"] = 5,
									["amount"] = 1397,
								},
							},
							["count"] = 5,
							["amount"] = 1397,
						},
					},
					["WhoHealed"] = {
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1397,
								},
							},
							["amount"] = 1397,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 17.98,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 50,
									["min"] = 14,
									["count"] = 14,
									["amount"] = 618,
								},
							},
							["count"] = 14,
							["amount"] = 618,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
							},
							["count"] = 1,
							["amount"] = 31,
						},
					},
					["HealingTaken"] = 1397,
					["RageGain"] = 0,
					["TimeDamage"] = 10.48,
					["TimeDamaging"] = {
						["李老三"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 2.5,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.48,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.98,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["丷光头强丷"] = {
									["count"] = 30,
								},
								["李老三"] = {
									["count"] = 18,
								},
								["延陵斩蛟-黑龙费尔默"] = {
									["count"] = 24,
								},
								["目空一切-逐风者"] = {
									["count"] = 27,
								},
								["广坤叔来啦-火妖鲁西弗隆"] = {
									["count"] = 24,
								},
							},
							["amount"] = 123,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 11,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["HealedWho"] = {
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 2273,
								},
								["法力护盾"] = {
									["count"] = 28,
								},
								["治疗药水"] = {
									["count"] = 1346,
								},
							},
							["amount"] = 3647,
						},
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 31,
					},
					["Absorbs"] = 2301,
					["ElementTaken"] = {
						["Physical"] = 372,
						["Melee"] = 851,
						["Arcane"] = 42,
						["Fire"] = 468,
						["Shadow"] = 2424,
						["Nature"] = 995,
					},
					["DOT_Time"] = 123,
					["Damage"] = 11457,
					["TimeHeal"] = 14.27,
					["ElementDone"] = {
						["Frost"] = 6257,
						["Melee"] = 31,
						["Arcane"] = 5169,
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 41,
								},
							},
							["amount"] = 45,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 15,
						},
					},
					["WhoDamaged"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 40,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 85,
								},
								["肉搏"] = {
									["count"] = 347,
								},
							},
							["amount"] = 472,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["雷霆之怒"] = {
									["count"] = 300,
								},
								["旋风斩"] = {
									["count"] = 247,
								},
								["肉搏"] = {
									["count"] = 216,
								},
							},
							["amount"] = 763,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 692,
								},
							},
							["amount"] = 692,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["射击"] = {
									["count"] = 42,
								},
								["肉搏"] = {
									["count"] = 113,
								},
							},
							["amount"] = 155,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 646,
								},
								["暗影守卫"] = {
									["count"] = 326,
								},
							},
							["amount"] = 972,
						},
						["李老三"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 760,
								},
								["肉搏"] = {
									["count"] = 175,
								},
							},
							["amount"] = 935,
						},
						["灼热图腾 VI"] = {
							["Details"] = {
								["攻击"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 521,
								},
								["闪电之盾"] = {
									["count"] = 174,
								},
							},
							["amount"] = 695,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 428,
								},
							},
							["amount"] = 428,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["于秋如梦"] = {
									["max"] = 521,
									["min"] = 29,
									["count"] = 10,
									["amount"] = 2273,
								},
							},
							["count"] = 10,
							["amount"] = 2273,
						},
						["法力护盾"] = {
							["Details"] = {
								["于秋如梦"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
					},
					["TimeHealing"] = {
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 12,
								},
								["法力护盾"] = {
									["count"] = 0.77,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 14.27,
						},
					},
					["Dispelled"] = 4,
					["PartialResist"] = {
						["攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["法术反制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆之怒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["ManaGained"] = {
						["魔法吸收"] = {
							["Details"] = {
								["于秋如梦"] = {
									["count"] = 67,
								},
							},
							["amount"] = 67,
						},
					},
					["PartialAbsorb"] = {
						["攻击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["法术反制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 521,
									["min"] = 521,
									["count"] = 1,
									["amount"] = 521,
								},
							},
							["count"] = 1,
							["amount"] = 521,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 28,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 247,
									["min"] = 247,
									["count"] = 1,
									["amount"] = 247,
								},
							},
							["count"] = 1,
							["amount"] = 247,
						},
						["雷霆之怒"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 300,
									["min"] = 300,
									["count"] = 1,
									["amount"] = 300,
								},
							},
							["count"] = 1,
							["amount"] = 300,
						},
						["射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 113,
									["min"] = 113,
									["count"] = 1,
									["amount"] = 113,
								},
							},
							["count"] = 1,
							["amount"] = 113,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 234,
									["min"] = 175,
									["count"] = 4,
									["amount"] = 876,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 876,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 216,
									["min"] = 216,
									["count"] = 1,
									["amount"] = 216,
								},
							},
							["count"] = 5,
							["amount"] = 216,
						},
					},
					["ActiveTime"] = 46.68,
					["WhoDispelled"] = {
						["李老三"] = {
							["Details"] = {
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
								["奥术智慧 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔法抑制 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰甲术 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 521,
									["min"] = 29,
									["count"] = 10,
									["amount"] = 2273,
								},
							},
							["count"] = 10,
							["amount"] = 2273,
						},
						["法力护盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1346,
									["min"] = 1346,
									["count"] = 1,
									["amount"] = 1346,
								},
							},
							["count"] = 1,
							["amount"] = 1346,
						},
					},
					["InterruptData"] = {
						["李老三"] = {
							["Details"] = {
								["精神鞭笞 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Interrupts"] = 1,
					["ManaGainedFrom"] = {
						["于秋如梦"] = {
							["Details"] = {
								["魔法吸收"] = {
									["count"] = 67,
								},
							},
							["amount"] = 67,
						},
					},
					["Healing"] = 1346,
					["TimeSpent"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 0.02,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.48,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.48,
						},
						["李老三"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 3.52,
								},
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.02,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 5.88,
								},
							},
							["amount"] = 5.88,
						},
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 12,
								},
								["法力护盾"] = {
									["count"] = 0.77,
								},
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 14.27,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 7.51,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.01,
						},
					},
					["DamageTaken"] = 5152,
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 199,
									["min"] = 14,
									["count"] = 41,
									["amount"] = 3980,
								},
							},
							["count"] = 41,
							["amount"] = 3980,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
							},
							["count"] = 1,
							["amount"] = 178,
						},
						["魔爆术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 495,
									["min"] = 495,
									["count"] = 1,
									["amount"] = 495,
								},
								["Hit"] = {
									["max"] = 363,
									["min"] = 299,
									["count"] = 14,
									["amount"] = 4674,
								},
							},
							["count"] = 15,
							["amount"] = 5169,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
							},
							["count"] = 1,
							["amount"] = 31,
						},
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 872,
									["min"] = 772,
									["count"] = 2,
									["amount"] = 1644,
								},
								["Hit"] = {
									["max"] = 455,
									["min"] = 455,
									["count"] = 1,
									["amount"] = 455,
								},
							},
							["count"] = 3,
							["amount"] = 2099,
						},
					},
					["HealingTaken"] = 3647,
					["ElementTakenAbsorb"] = {
						["Physical"] = 275,
						["Melee"] = 216,
						["Arcane"] = 113,
						["Fire"] = 40,
						["Shadow"] = 876,
						["Nature"] = 821,
					},
					["TimeDamage"] = 32.41,
					["TimeDamaging"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 0.02,
						},
						["李老三"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 3.52,
								},
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.02,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 5.88,
								},
							},
							["amount"] = 5.88,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.48,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.48,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 7.51,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.01,
						},
					},
					["ManaGain"] = 67,
					["WhoHealed"] = {
						["于秋如梦"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 2273,
								},
								["法力护盾"] = {
									["count"] = 28,
								},
								["治疗药水"] = {
									["count"] = 1346,
								},
							},
							["amount"] = 3647,
						},
					},
					["DamagedWho"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 670,
								},
								["冰锥术"] = {
									["count"] = 872,
								},
							},
							["amount"] = 1542,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1149,
								},
								["魔爆术"] = {
									["count"] = 339,
								},
							},
							["amount"] = 1488,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 661,
								},
							},
							["amount"] = 661,
						},
						["李老三"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 294,
								},
								["魔爆术"] = {
									["count"] = 836,
								},
								["冰锥术"] = {
									["count"] = 455,
								},
							},
							["amount"] = 1585,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1159,
								},
								["魔爆术"] = {
									["count"] = 1678,
								},
							},
							["amount"] = 2837,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 371,
								},
								["冰霜新星"] = {
									["count"] = 178,
								},
								["魔爆术"] = {
									["count"] = 672,
								},
								["肉搏"] = {
									["count"] = 31,
								},
								["冰锥术"] = {
									["count"] = 772,
								},
							},
							["amount"] = 2024,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1007,
								},
								["魔爆术"] = {
									["count"] = 313,
								},
							},
							["amount"] = 1320,
						},
					},
				},
			},
			["UnitLockout"] = 4844.514,
			["LastActive"] = 5112.513,
		},
		["西部信托-老马布兰契"] = {
			["GUID"] = "Player-5447-0358C15A",
			["LastEventHealth"] = {
				1, -- [1]
				4363, -- [2]
				4363, -- [3]
				4363, -- [4]
				4363, -- [5]
				4363, -- [6]
				4363, -- [7]
				4363, -- [8]
				4363, -- [9]
				4363, -- [10]
				4363, -- [11]
				4363, -- [12]
				4363, -- [13]
				4156, -- [14]
				4029, -- [15]
				4029, -- [16]
				4029, -- [17]
				3901, -- [18]
				3686, -- [19]
				3553, -- [20]
				3498, -- [21]
				3498, -- [22]
				3498, -- [23]
				3498, -- [24]
				3498, -- [25]
				3301, -- [26]
				3066, -- [27]
				3066, -- [28]
				2837, -- [29]
				2837, -- [30]
				2386, -- [31]
				2386, -- [32]
				2386, -- [33]
				1672, -- [34]
				1672, -- [35]
				1672, -- [36]
				1434, -- [37]
				665, -- [38]
				665, -- [39]
				665, -- [40]
				665, -- [41]
				665, -- [42]
				665, -- [43]
				580, -- [44]
				580, -- [45]
				261, -- [46]
				233, -- [47]
				0, -- [48]
				1, -- [49]
				1, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"MISC", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					75, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					34.37000000000001, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["TimeDamage"] = {
					34.37000000000001, -- [1]
				},
				["DamageTaken"] = {
					11653, -- [1]
				},
				["Damage"] = {
					11415, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "西部信托-老马布兰契",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						false, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						false, -- [38]
					},
					["Messages"] = {
						"村里老中医-黑龙费尔默 精灵之火 西部信托-老马布兰契 Resist (Nature)", -- [1]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -207 (Physical)", -- [2]
						"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Hit -127 (Physical)", -- [3]
						"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Miss (1)", -- [4]
						"村里老中医-黑龙费尔默 精灵之火 西部信托-老马布兰契 Resist (Nature)", -- [5]
						"美女婉君-老马布兰契 出血 西部信托-老马布兰契 Hit -128 (Physical)", -- [6]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -215 (Physical)", -- [7]
						"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Hit -133 (Physical)", -- [8]
						"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Hit -55 (Physical)", -- [9]
						"子弹舍普琴科 冲锋击昏 西部信托-老马布兰契 Immune (Physical)", -- [10]
						"牧老-火妖鲁西弗隆 暗言术：痛 西部信托-老马布兰契 Resist (Shadow)", -- [11]
						"延陵斩蛟-黑龙费尔默 断筋 西部信托-老马布兰契 Dodge (Physical)", -- [12]
						"西部信托-老马布兰契 凿击 美女婉君-老马布兰契 Hit -53 (Physical)", -- [13]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -197 (Physical)", -- [14]
						"目空一切-逐风者 烈焰震击 西部信托-老马布兰契 Hit -235 (78 被抵抗) (Fire)", -- [15]
						"子弹舍普琴科 撕裂 西部信托-老马布兰契 Dodge (Physical)", -- [16]
						"村里老中医-黑龙费尔默 月火术 西部信托-老马布兰契 Hit -229 (Arcane)", -- [17]
						"延陵斩蛟-黑龙费尔默 撕裂 (伤害/跳) 西部信托-老马布兰契 Tick -28 (Physical)", -- [18]
						"延陵斩蛟-黑龙费尔默 盾牌猛击 西部信托-老马布兰契 Hit -423 (Physical)", -- [19]
						"西部信托-老马布兰契 肉搏 美女婉君-老马布兰契 Miss (1)", -- [20]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Dodge (1)", -- [21]
						"子弹舍普琴科 压制 西部信托-老马布兰契 Crit -714 (Physical)", -- [22]
						"西部信托-老马布兰契 肉搏 美女婉君-老马布兰契 Hit -54 (Physical)", -- [23]
						"西部信托-老马布兰契 背刺 美女婉君-老马布兰契 Hit -480 (Physical)", -- [24]
						"延陵斩蛟-黑龙费尔默 压制 西部信托-老马布兰契 Hit -238 (Physical)", -- [25]
						"子弹舍普琴科 肉搏 西部信托-老马布兰契 Crit -769 (Physical)", -- [26]
						"西部信托-老马布兰契 肉搏 美女婉君-老马布兰契 Miss (1)", -- [27]
						"目空一切-逐风者 烈焰震击 (伤害/跳) 西部信托-老马布兰契 Tick -44 (44 被抵抗) (Fire)", -- [28]
						"西部信托-老马布兰契 割裂 (伤害/跳) 美女婉君-老马布兰契 Tick -77 (Physical)", -- [29]
						"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Dodge (1)", -- [30]
						"子弹舍普琴科 断筋 西部信托-老马布兰契 Hit -41 (Physical)", -- [31]
						"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Dodge (1)", -- [32]
						"村里老中医-黑龙费尔默 月火术 (伤害/跳) 西部信托-老马布兰契 Tick -101 (Arcane)", -- [33]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -218 (Physical)", -- [34]
						"延陵斩蛟-黑龙费尔默 撕裂 (伤害/跳) 西部信托-老马布兰契 Tick -28 (Physical)", -- [35]
						"延陵斩蛟-黑龙费尔默 斩杀 西部信托-老马布兰契 Hit -747 (Physical)", -- [36]
						"西部信托-老马布兰契死亡。", -- [37]
						"西部信托-老马布兰契 割裂 (伤害/跳) 美女婉君-老马布兰契 Tick -76 (Physical)", -- [38]
					},
					["DeathAt"] = 5086.511,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
					},
					["MessageTimes"] = {
						-8.216999999999643, -- [1]
						-7.884000000000015, -- [2]
						-7.634000000000015, -- [3]
						-6.933999999999287, -- [4]
						-6.716999999999644, -- [5]
						-6.666999999999462, -- [6]
						-5.983999999999469, -- [7]
						-5.832999999999629, -- [8]
						-5.533999999999651, -- [9]
						-4.983999999999469, -- [10]
						-4.849999999999454, -- [11]
						-4.533999999999651, -- [12]
						-4.233999999999469, -- [13]
						-4.067000000000007, -- [14]
						-3.799999999999272, -- [15]
						-3.5, -- [16]
						-3.317000000000007, -- [17]
						-3.016999999999825, -- [18]
						-3.016999999999825, -- [19]
						-2.666999999999462, -- [20]
						-2.166999999999462, -- [21]
						-2, -- [22]
						-1.86699999999928, -- [23]
						-1.61699999999928, -- [24]
						-1.5, -- [25]
						-1.183999999999287, -- [26]
						-0.8499999999994543, -- [27]
						-0.7999999999992724, -- [28]
						-0.6499999999996362, -- [29]
						-0.5999999999994543, -- [30]
						-0.5, -- [31]
						-0.5, -- [32]
						-0.2999999999992724, -- [33]
						-0.25, -- [34]
						-0.03299999999944703, -- [35]
						0, -- [36]
						0, -- [37]
						1.350000000000364, -- [38]
					},
					["HealthMax"] = {
						4363, -- [1]
						4363, -- [2]
						4363, -- [3]
						4363, -- [4]
						4363, -- [5]
						4363, -- [6]
						4363, -- [7]
						4363, -- [8]
						4363, -- [9]
						4363, -- [10]
						4363, -- [11]
						4363, -- [12]
						4363, -- [13]
						4363, -- [14]
						4363, -- [15]
						4363, -- [16]
						4363, -- [17]
						4363, -- [18]
						4363, -- [19]
						4363, -- [20]
						4363, -- [21]
						4363, -- [22]
						4363, -- [23]
						4363, -- [24]
						4363, -- [25]
						4363, -- [26]
						4363, -- [27]
						4363, -- [28]
						4363, -- [29]
						4363, -- [30]
						4363, -- [31]
						4363, -- [32]
						4363, -- [33]
						4363, -- [34]
						4363, -- [35]
						4363, -- [36]
						4363, -- [37]
						4363, -- [38]
					},
					["Health"] = {
						4363, -- [1]
						4363, -- [2]
						4156, -- [3]
						4029, -- [4]
						4029, -- [5]
						4029, -- [6]
						3901, -- [7]
						3686, -- [8]
						3553, -- [9]
						3498, -- [10]
						3498, -- [11]
						3498, -- [12]
						3498, -- [13]
						3498, -- [14]
						3301, -- [15]
						3066, -- [16]
						3066, -- [17]
						2837, -- [18]
						2837, -- [19]
						2386, -- [20]
						2386, -- [21]
						2386, -- [22]
						1672, -- [23]
						1672, -- [24]
						1672, -- [25]
						1434, -- [26]
						665, -- [27]
						665, -- [28]
						665, -- [29]
						665, -- [30]
						665, -- [31]
						665, -- [32]
						580, -- [33]
						580, -- [34]
						261, -- [35]
						233, -- [36]
						0, -- [37]
						1, -- [38]
					},
					["KilledBy"] = "延陵斩蛟-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"MISC", -- [37]
						"DAMAGE", -- [38]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						false, -- [29]
						true, -- [30]
						true, -- [31]
					},
					["Messages"] = {
						"西部信托-老马布兰契 肉搏 牧老-火妖鲁西弗隆 Absorb -95 (95 被吸收) (1)", -- [1]
						"西部信托-老马布兰契 肉搏 牧老-火妖鲁西弗隆 Absorb -205 (205 被吸收) (1)", -- [2]
						"西部信托-老马布兰契 肉搏 牧老-火妖鲁西弗隆 Absorb -47 (47 被吸收) (1)", -- [3]
						"西部信托-老马布兰契 肉搏 牧老-火妖鲁西弗隆 Absorb -429 (1)", -- [4]
						"西部信托-老马布兰契 刺骨 牧老-火妖鲁西弗隆 Hit -117 (429 被吸收) (Physical)", -- [5]
						"西部信托-老马布兰契 肉搏 牧老-火妖鲁西弗隆 Hit -108 (Physical)", -- [6]
						"延陵斩蛟-黑龙费尔默 断筋 西部信托-老马布兰契 Hit -37 (Physical)", -- [7]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -180 (Physical)", -- [8]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 西部信托-老马布兰契 Hit -340 (Arcane)", -- [9]
						"延陵斩蛟-黑龙费尔默 盾牌猛击 西部信托-老马布兰契 Hit -339 (Physical)", -- [10]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 西部信托-老马布兰契 Hit -344 (Arcane)", -- [11]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -198 (Physical)", -- [12]
						"延陵斩蛟-黑龙费尔默 雷霆之怒 西部信托-老马布兰契 Hit -300 (Nature)", -- [13]
						"延陵斩蛟-黑龙费尔默 断筋 西部信托-老马布兰契 Hit -37 (Physical)", -- [14]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 西部信托-老马布兰契 Hit -354 (Arcane)", -- [15]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -166 (Physical)", -- [16]
						"西部信托-老马布兰契 背刺 丷光头强丷 Crit -1087 (Physical)", -- [17]
						"西部信托-老马布兰契 肉搏 丷光头强丷 Miss (1)", -- [18]
						"延陵斩蛟-黑龙费尔默 断筋 西部信托-老马布兰契 Hit -37 (Physical)", -- [19]
						"延陵斩蛟-黑龙费尔默 雷霆之怒 西部信托-老马布兰契 Hit -300 (Nature)", -- [20]
						"子弹舍普琴科 拦截昏迷 西部信托-老马布兰契 Hit -48 (Physical)", -- [21]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 西部信托-老马布兰契 Hit -353 (Arcane)", -- [22]
						"子弹舍普琴科 肉搏 西部信托-老马布兰契 Hit -346 (Physical)", -- [23]
						"子弹舍普琴科 断筋 西部信托-老马布兰契 Hit -33 (Physical)", -- [24]
						"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -161 (Physical)", -- [25]
						"延陵斩蛟-黑龙费尔默 雷霆之怒 西部信托-老马布兰契 Hit -300 (Nature)", -- [26]
						"广坤叔来啦-火妖鲁西弗隆 魔爆术 西部信托-老马布兰契 Hit -341 (Arcane)", -- [27]
						"西部信托-老马布兰契 肉搏 丷光头强丷 Miss (1)", -- [28]
						"西部信托-老马布兰契 割裂 丷光头强丷 Dodge (Physical)", -- [29]
						"子弹舍普琴科 斩杀 西部信托-老马布兰契 Hit -773 (Physical)", -- [30]
						"西部信托-老马布兰契死亡。", -- [31]
					},
					["DeathAt"] = 4839.513,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
					},
					["MessageTimes"] = {
						-14.96699999999964, -- [1]
						-14.26699999999983, -- [2]
						-13.36700000000019, -- [3]
						-13.33399999999983, -- [4]
						-13.33399999999983, -- [5]
						-12.46699999999964, -- [6]
						-7.199999999999818, -- [7]
						-7, -- [8]
						-6.783999999999651, -- [9]
						-5.699999999999818, -- [10]
						-5.282999999999447, -- [11]
						-5.099999999999454, -- [12]
						-5.099999999999454, -- [13]
						-4.117000000000189, -- [14]
						-3.782999999999447, -- [15]
						-3.166999999999462, -- [16]
						-3.149999999999636, -- [17]
						-3.132999999999811, -- [18]
						-2.617000000000189, -- [19]
						-2.617000000000189, -- [20]
						-2.349999999999454, -- [21]
						-2.216999999999644, -- [22]
						-1.716999999999644, -- [23]
						-1.516999999999825, -- [24]
						-1.282999999999447, -- [25]
						-1.282999999999447, -- [26]
						-0.7169999999996435, -- [27]
						-0.6729999999997744, -- [28]
						-0.4659999999994398, -- [29]
						-0.01599999999962165, -- [30]
						0, -- [31]
					},
					["HealthMax"] = {
						4363, -- [1]
						4363, -- [2]
						4363, -- [3]
						4363, -- [4]
						4363, -- [5]
						4363, -- [6]
						4363, -- [7]
						4363, -- [8]
						4363, -- [9]
						4363, -- [10]
						4363, -- [11]
						4363, -- [12]
						4363, -- [13]
						4363, -- [14]
						4363, -- [15]
						4363, -- [16]
						4363, -- [17]
						4363, -- [18]
						4363, -- [19]
						4363, -- [20]
						4363, -- [21]
						4363, -- [22]
						4363, -- [23]
						4363, -- [24]
						4363, -- [25]
						4363, -- [26]
						4363, -- [27]
						4363, -- [28]
						4363, -- [29]
						4363, -- [30]
						4363, -- [31]
					},
					["Health"] = {
						4363, -- [1]
						4363, -- [2]
						4363, -- [3]
						4363, -- [4]
						4363, -- [5]
						4363, -- [6]
						4363, -- [7]
						4326, -- [8]
						4146, -- [9]
						3806, -- [10]
						3467, -- [11]
						3123, -- [12]
						3123, -- [13]
						2625, -- [14]
						2588, -- [15]
						2234, -- [16]
						2068, -- [17]
						2068, -- [18]
						2068, -- [19]
						2068, -- [20]
						1731, -- [21]
						1683, -- [22]
						1330, -- [23]
						984, -- [24]
						951, -- [25]
						951, -- [26]
						490, -- [27]
						149, -- [28]
						149, -- [29]
						149, -- [30]
						0, -- [31]
					},
					["KilledBy"] = "子弹舍普琴科",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"MISC", -- [31]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "斩杀",
			["LastFightIn"] = 10,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 747,
			["TimeLast"] = {
				["EnergyGain"] = 5081.511,
				["DeathCount"] = 5084.511,
				["DOT_Time"] = 5089.511,
				["ActiveTime"] = 5089.511,
				["TimeDamage"] = 5089.511,
				["OVERALL"] = 5089.511,
				["DamageTaken"] = 5084.511,
				["Damage"] = 5089.511,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4363, -- [1]
				4363, -- [2]
				4363, -- [3]
				4363, -- [4]
				4363, -- [5]
				4363, -- [6]
				4363, -- [7]
				4363, -- [8]
				4363, -- [9]
				4363, -- [10]
				4363, -- [11]
				4363, -- [12]
				4363, -- [13]
				4363, -- [14]
				4363, -- [15]
				4363, -- [16]
				4363, -- [17]
				4363, -- [18]
				4363, -- [19]
				4363, -- [20]
				4363, -- [21]
				4363, -- [22]
				4363, -- [23]
				4363, -- [24]
				4363, -- [25]
				4363, -- [26]
				4363, -- [27]
				4363, -- [28]
				4363, -- [29]
				4363, -- [30]
				4363, -- [31]
				4363, -- [32]
				4363, -- [33]
				4363, -- [34]
				4363, -- [35]
				4363, -- [36]
				4363, -- [37]
				4363, -- [38]
				4363, -- [39]
				4363, -- [40]
				4363, -- [41]
				4363, -- [42]
				4363, -- [43]
				4363, -- [44]
				4363, -- [45]
				4363, -- [46]
				4363, -- [47]
				4363, -- [48]
				4363, -- [49]
				4363, -- [50]
			},
			["NextEventNum"] = 2,
			["LastDamageTime"] = 5089.911,
			["LastEvents"] = {
				"西部信托-老马布兰契 割裂 (伤害/跳) 美女婉君-老马布兰契 Tick -77 (Physical)", -- [1]
				"西部信托-老马布兰契 肉搏 村里老中医-黑龙费尔默 Crit -155 (Physical)", -- [2]
				"西部信托-老马布兰契 肉搏 村里老中医-黑龙费尔默 Hit -194 (Physical)", -- [3]
				"西部信托-老马布兰契 伏击 紫衣战天下 Hit -744 (Physical)", -- [4]
				"西部信托-老马布兰契 肉搏 紫衣战天下 Crit -315 (Physical)", -- [5]
				"西部信托-老马布兰契 肉搏 紫衣战天下 Crit -146 (Physical)", -- [6]
				"西部信托-老马布兰契 背刺 紫衣战天下 Crit -1252 (Physical)", -- [7]
				"西部信托-老马布兰契 肉搏 紫衣战天下 Hit -158 (Physical)", -- [8]
				"西部信托-老马布兰契 背刺 李老三 Crit -849 (Physical)", -- [9]
				"西部信托-老马布兰契 肉搏 李老三 Crit -247 (Physical)", -- [10]
				"西部信托-老马布兰契 肉搏 李老三 Crit -108 (Physical)", -- [11]
				"村里老中医-黑龙费尔默 精灵之火 西部信托-老马布兰契 Resist (Nature)", -- [12]
				"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -207 (Physical)", -- [13]
				"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Hit -127 (Physical)", -- [14]
				"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Miss (1)", -- [15]
				"村里老中医-黑龙费尔默 精灵之火 西部信托-老马布兰契 Resist (Nature)", -- [16]
				"美女婉君-老马布兰契 出血 西部信托-老马布兰契 Hit -128 (Physical)", -- [17]
				"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -215 (Physical)", -- [18]
				"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Hit -133 (Physical)", -- [19]
				"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Hit -55 (Physical)", -- [20]
				"子弹舍普琴科 冲锋击昏 西部信托-老马布兰契 Immune (Physical)", -- [21]
				"牧老-火妖鲁西弗隆 暗言术：痛 西部信托-老马布兰契 Resist (Shadow)", -- [22]
				"延陵斩蛟-黑龙费尔默 断筋 西部信托-老马布兰契 Dodge (Physical)", -- [23]
				"西部信托-老马布兰契 凿击 美女婉君-老马布兰契 Hit -53 (Physical)", -- [24]
				"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -197 (Physical)", -- [25]
				"目空一切-逐风者 烈焰震击 西部信托-老马布兰契 Hit -235 (78 被抵抗) (Fire)", -- [26]
				"子弹舍普琴科 撕裂 西部信托-老马布兰契 Dodge (Physical)", -- [27]
				"村里老中医-黑龙费尔默 月火术 西部信托-老马布兰契 Hit -229 (Arcane)", -- [28]
				"延陵斩蛟-黑龙费尔默 撕裂 (伤害/跳) 西部信托-老马布兰契 Tick -28 (Physical)", -- [29]
				"延陵斩蛟-黑龙费尔默 盾牌猛击 西部信托-老马布兰契 Hit -423 (Physical)", -- [30]
				"西部信托-老马布兰契 肉搏 美女婉君-老马布兰契 Miss (1)", -- [31]
				"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Dodge (1)", -- [32]
				"子弹舍普琴科 压制 西部信托-老马布兰契 Crit -714 (Physical)", -- [33]
				"西部信托-老马布兰契 肉搏 美女婉君-老马布兰契 Hit -54 (Physical)", -- [34]
				"西部信托-老马布兰契 背刺 美女婉君-老马布兰契 Hit -480 (Physical)", -- [35]
				"延陵斩蛟-黑龙费尔默 压制 西部信托-老马布兰契 Hit -238 (Physical)", -- [36]
				"子弹舍普琴科 肉搏 西部信托-老马布兰契 Crit -769 (Physical)", -- [37]
				"西部信托-老马布兰契 肉搏 美女婉君-老马布兰契 Miss (1)", -- [38]
				"目空一切-逐风者 烈焰震击 (伤害/跳) 西部信托-老马布兰契 Tick -44 (44 被抵抗) (Fire)", -- [39]
				"西部信托-老马布兰契 割裂 (伤害/跳) 美女婉君-老马布兰契 Tick -77 (Physical)", -- [40]
				"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Dodge (1)", -- [41]
				"子弹舍普琴科 断筋 西部信托-老马布兰契 Hit -41 (Physical)", -- [42]
				"美女婉君-老马布兰契 肉搏 西部信托-老马布兰契 Dodge (1)", -- [43]
				"村里老中医-黑龙费尔默 月火术 (伤害/跳) 西部信托-老马布兰契 Tick -101 (Arcane)", -- [44]
				"延陵斩蛟-黑龙费尔默 肉搏 西部信托-老马布兰契 Hit -218 (Physical)", -- [45]
				"延陵斩蛟-黑龙费尔默 撕裂 (伤害/跳) 西部信托-老马布兰契 Tick -28 (Physical)", -- [46]
				"延陵斩蛟-黑龙费尔默 斩杀 西部信托-老马布兰契 Hit -747 (Physical)", -- [47]
				"西部信托-老马布兰契死亡。", -- [48]
				"西部信托-老马布兰契 割裂 (伤害/跳) 美女婉君-老马布兰契 Tick -76 (Physical)", -- [49]
				"西部信托-老马布兰契 割裂 (伤害/跳) 美女婉君-老马布兰契 Tick -77 (Physical)", -- [50]
			},
			["Name"] = "西部信托-老马布兰契",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				5089.911, -- [1]
				4994.639, -- [2]
				4995.839, -- [3]
				5026.224, -- [4]
				5026.258, -- [5]
				5027.058, -- [6]
				5027.241, -- [7]
				5028.058, -- [8]
				5033.241, -- [9]
				5033.275000000001, -- [10]
				5034.091, -- [11]
				5076.344, -- [12]
				5076.677, -- [13]
				5076.927, -- [14]
				5077.627, -- [15]
				5077.844, -- [16]
				5077.894, -- [17]
				5078.577, -- [18]
				5078.728, -- [19]
				5079.027, -- [20]
				5079.577, -- [21]
				5079.711, -- [22]
				5080.027, -- [23]
				5080.327, -- [24]
				5080.494, -- [25]
				5080.761, -- [26]
				5081.061, -- [27]
				5081.244, -- [28]
				5081.544, -- [29]
				5081.544, -- [30]
				5081.894, -- [31]
				5082.394, -- [32]
				5082.561, -- [33]
				5082.694, -- [34]
				5082.944, -- [35]
				5083.061, -- [36]
				5083.377, -- [37]
				5083.711, -- [38]
				5083.761, -- [39]
				5083.911, -- [40]
				5083.961, -- [41]
				5084.061, -- [42]
				5084.061, -- [43]
				5084.261, -- [44]
				5084.311, -- [45]
				5084.528, -- [46]
				5084.561, -- [47]
				5084.561, -- [48]
				5085.911, -- [49]
				5087.894, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["美女婉君-老马布兰契"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 4877,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 12,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Fire"] = 279,
						["Physical"] = 2347,
						["Melee"] = 1921,
						["Arcane"] = 330,
					},
					["DOT_Time"] = 12,
					["Damage"] = 894,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
						["Fire"] = 122,
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 54,
						["Physical"] = 840,
					},
					["PartialAbsorb"] = {
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["烈焰震击 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["烈焰震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精灵之火"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 307,
								},
								["背刺"] = {
									["count"] = 480,
								},
								["凿击"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 54,
								},
							},
							["amount"] = 894,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 41,
								},
								["压制"] = {
									["count"] = 714,
								},
								["肉搏"] = {
									["count"] = 769,
								},
							},
							["amount"] = 1524,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 229,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 101,
								},
							},
							["amount"] = 330,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 238,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 56,
								},
								["盾牌猛击"] = {
									["count"] = 423,
								},
								["斩杀"] = {
									["count"] = 747,
								},
								["肉搏"] = {
									["count"] = 837,
								},
							},
							["amount"] = 2301,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["烈焰震击"] = {
									["count"] = 235,
								},
								["烈焰震击 (伤害/跳)"] = {
									["count"] = 44,
								},
							},
							["amount"] = 279,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 128,
								},
								["肉搏"] = {
									["count"] = 315,
								},
							},
							["amount"] = 443,
						},
					},
					["EnergyGainedFrom"] = {
						["西部信托-老马布兰契"] = {
							["Details"] = {
								["无情打击效果"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["PartialResist"] = {
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["烈焰震击 (伤害/跳)"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 44,
							["amount"] = 1,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["烈焰震击"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 78,
									["min"] = 78,
									["count"] = 1,
									["amount"] = 78,
								},
							},
							["count"] = 78,
							["amount"] = 1,
						},
						["精灵之火"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 25,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["背刺"] = {
									["count"] = 0.25,
								},
								["凿击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 9.52,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
						["无情打击效果"] = {
							["Details"] = {
								["西部信托-老马布兰契"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["ActiveTime"] = 9.52,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 77,
									["min"] = 76,
									["count"] = 4,
									["amount"] = 307,
								},
							},
							["count"] = 4,
							["amount"] = 307,
						},
						["背刺"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 480,
									["min"] = 480,
									["count"] = 1,
									["amount"] = 480,
								},
							},
							["count"] = 1,
							["amount"] = 480,
						},
						["凿击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
							},
							["count"] = 1,
							["amount"] = 53,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 54,
									["min"] = 54,
									["count"] = 1,
									["amount"] = 54,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 54,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 9.52,
					["TimeDamaging"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["背刺"] = {
									["count"] = 0.25,
								},
								["凿击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 9.52,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["美女婉君-老马布兰契"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["TimeSpent"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.43,
								},
								["肉搏"] = {
									["count"] = 6.48,
								},
							},
							["amount"] = 6.910000000000001,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["割裂"] = {
									["count"] = 0.21,
								},
								["背刺"] = {
									["count"] = 1.5,
								},
								["致残毒药"] = {
									["count"] = 0.53,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.41,
								},
							},
							["amount"] = 7.15,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 4.78,
								},
							},
							["amount"] = 5.11,
						},
						["李老三"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.85,
								},
							},
							["amount"] = 2.35,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.18,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.65,
								},
							},
							["amount"] = 3.33,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["背刺"] = {
									["count"] = 0.25,
								},
								["凿击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 9.52,
						},
					},
					["DamageTaken"] = 11653,
					["ElementDoneAbsorb"] = {
						["Melee"] = 347,
						["Physical"] = 429,
					},
					["EnergyGain"] = 75,
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["烈焰震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["雷霆之怒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["烈焰震击 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精灵之火"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 34.37000000000001,
					["ElementTaken"] = {
						["Physical"] = 3651,
						["Melee"] = 2972,
						["Arcane"] = 2404,
						["Fire"] = 1726,
						["Nature"] = 900,
					},
					["DOT_Time"] = 12,
					["Damage"] = 11415,
					["EnergyGained"] = {
						["无情打击效果"] = {
							["Details"] = {
								["西部信托-老马布兰契"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
					},
					["ElementTakenResist"] = {
						["Fire"] = 122,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 12,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 3,
								},
							},
							["amount"] = 19,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 18,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
					},
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["烈焰震击"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 78,
									["min"] = 78,
									["count"] = 1,
									["amount"] = 78,
								},
							},
							["count"] = 78,
							["amount"] = 1,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["雷霆之怒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["烈焰震击 (伤害/跳)"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 44,
							["amount"] = 1,
						},
						["暗言术：痛"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精灵之火"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 18,
						},
					},
					["ElementDone"] = {
						["Melee"] = 4032,
						["Physical"] = 7383,
					},
					["WhoDamaged"] = {
						["目空一切-逐风者"] = {
							["Details"] = {
								["烈焰震击"] = {
									["count"] = 235,
								},
								["烈焰震击 (伤害/跳)"] = {
									["count"] = 44,
								},
							},
							["amount"] = 279,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 714,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["拦截昏迷"] = {
									["count"] = 48,
								},
								["斩杀"] = {
									["count"] = 773,
								},
								["肉搏"] = {
									["count"] = 1115,
								},
							},
							["amount"] = 2724,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 229,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 101,
								},
							},
							["amount"] = 330,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 56,
								},
								["压制"] = {
									["count"] = 238,
								},
								["雷霆之怒"] = {
									["count"] = 900,
								},
								["盾牌猛击"] = {
									["count"] = 762,
								},
								["断筋"] = {
									["count"] = 111,
								},
								["斩杀"] = {
									["count"] = 747,
								},
								["肉搏"] = {
									["count"] = 1542,
								},
							},
							["amount"] = 4356,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 128,
								},
								["肉搏"] = {
									["count"] = 315,
								},
							},
							["amount"] = 443,
						},
						["广坤叔来啦-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 2074,
								},
								["冲击波"] = {
									["count"] = 654,
								},
								["火焰冲击"] = {
									["count"] = 793,
								},
							},
							["amount"] = 3521,
						},
					},
					["DamagedWho"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 117,
								},
								["背刺"] = {
									["count"] = 807,
								},
								["肉搏"] = {
									["count"] = 1193,
								},
							},
							["amount"] = 2117,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 2269,
								},
								["肉搏"] = {
									["count"] = 525,
								},
							},
							["amount"] = 2794,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 505,
								},
								["肉搏"] = {
									["count"] = 1286,
								},
							},
							["amount"] = 1791,
						},
						["李老三"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 849,
								},
								["肉搏"] = {
									["count"] = 355,
								},
							},
							["amount"] = 1204,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1252,
								},
								["伏击"] = {
									["count"] = 744,
								},
								["肉搏"] = {
									["count"] = 619,
								},
							},
							["amount"] = 2615,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 307,
								},
								["背刺"] = {
									["count"] = 480,
								},
								["凿击"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 54,
								},
							},
							["amount"] = 894,
						},
					},
					["TimeDamage"] = 34.37000000000001,
					["TimeDamaging"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.43,
								},
								["肉搏"] = {
									["count"] = 6.48,
								},
							},
							["amount"] = 6.910000000000001,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["割裂"] = {
									["count"] = 0.21,
								},
								["背刺"] = {
									["count"] = 1.5,
								},
								["致残毒药"] = {
									["count"] = 0.53,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.41,
								},
							},
							["amount"] = 7.15,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 4.78,
								},
							},
							["amount"] = 5.11,
						},
						["李老三"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.85,
								},
							},
							["amount"] = 2.35,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 0.18,
								},
								["伏击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.65,
								},
							},
							["amount"] = 3.33,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["割裂 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["背刺"] = {
									["count"] = 0.25,
								},
								["凿击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 9.52,
						},
					},
					["EnergyGainedFrom"] = {
						["西部信托-老马布兰契"] = {
							["Details"] = {
								["无情打击效果"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
					},
					["Attacks"] = {
						["致残毒药"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1252,
									["min"] = 807,
									["count"] = 5,
									["amount"] = 5177,
								},
								["Hit"] = {
									["max"] = 505,
									["min"] = 480,
									["count"] = 2,
									["amount"] = 985,
								},
							},
							["count"] = 7,
							["amount"] = 6162,
						},
						["凿击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
							},
							["count"] = 1,
							["amount"] = 53,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 77,
									["min"] = 76,
									["count"] = 4,
									["amount"] = 307,
								},
							},
							["count"] = 4,
							["amount"] = 307,
						},
						["割裂"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 117,
									["min"] = 117,
									["count"] = 1,
									["amount"] = 117,
								},
							},
							["count"] = 1,
							["amount"] = 117,
						},
						["伏击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 744,
									["min"] = 744,
									["count"] = 1,
									["amount"] = 744,
								},
							},
							["count"] = 1,
							["amount"] = 744,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 194,
									["min"] = 54,
									["count"] = 6,
									["amount"] = 747,
								},
								["Absorb"] = {
									["max"] = 429,
									["min"] = 47,
									["count"] = 4,
									["amount"] = 776,
								},
								["Crit"] = {
									["max"] = 392,
									["min"] = 103,
									["count"] = 11,
									["amount"] = 2509,
								},
								["Miss"] = {
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 27,
							["amount"] = 4032,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 16,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 11,
								},
								["Miss"] = {
									["count"] = 6,
								},
							},
							["amount"] = 27,
						},
						["Nature"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 4819.512,
			["LastActive"] = 5089.511,
		},
		["俪桑卓"] = {
			["GUID"] = "Player-5458-0315F273",
			["LastEventHealth"] = {
				220, -- [1]
				115, -- [2]
				2924, -- [3]
				2924, -- [4]
				2924, -- [5]
				2924, -- [6]
				2950, -- [7]
				2851, -- [8]
				2851, -- [9]
				2851, -- [10]
				2851, -- [11]
				2601, -- [12]
				1761, -- [13]
				1504, -- [14]
				1240, -- [15]
				681, -- [16]
				681, -- [17]
				681, -- [18]
				681, -- [19]
				483, -- [20]
				219, -- [21]
				0, -- [22]
				2950, -- [23]
				2392, -- [24]
				2392, -- [25]
				2392, -- [26]
				1599, -- [27]
				1599, -- [28]
				1599, -- [29]
				910, -- [30]
				910, -- [31]
				910, -- [32]
				896, -- [33]
				741, -- [34]
				741, -- [35]
				741, -- [36]
				428, -- [37]
				0, -- [38]
				2950, -- [39]
				2950, -- [40]
				2608, -- [41]
				2529, -- [42]
				1516, -- [43]
				1516, -- [44]
				1516, -- [45]
				1411, -- [46]
				1411, -- [47]
				950, -- [48]
				324, -- [49]
				220, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"MISC", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"MISC", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["DamageTaken"] = {
					13564, -- [1]
				},
				["Absorbs"] = {
					430, -- [1]
				},
				["HealingTaken"] = {
					430, -- [1]
				},
				["DeathCount"] = {
					2, -- [1]
				},
				["TimeDamage"] = {
					25.01, -- [1]
				},
				["ActiveTime"] = {
					26.51, -- [1]
				},
				["ManaGain"] = {
					265, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["Damage"] = {
					10268, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "俪桑卓",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
					},
					["Messages"] = {
						"俪桑卓 点燃 (伤害/跳) 目空一切-逐风者 Absorb -136 (136 被吸收) (Fire)", -- [1]
						"李老三 暗言术：痛 (伤害/跳) 俪桑卓 Tick -250 (Shadow)", -- [2]
						"李老三 心灵震爆 俪桑卓 Hit -840 (Shadow)", -- [3]
						"李老三 精神鞭笞 (伤害/跳) 俪桑卓 Tick -257 (Shadow)", -- [4]
						"李老三 暗言术：痛 (伤害/跳) 俪桑卓 Tick -264 (Shadow)", -- [5]
						"目空一切-逐风者 地震术 俪桑卓 Hit -559 (Nature)", -- [6]
						"俪桑卓 魔爆术 目空一切-逐风者 Hit -337 (Arcane)", -- [7]
						"俪桑卓 魔爆术 村里老中医-黑龙费尔默 Hit -324 (Arcane)", -- [8]
						"俪桑卓 魔爆术 牧老-火妖鲁西弗隆 Hit -329 (Arcane)", -- [9]
						"目空一切-逐风者 闪电之盾 俪桑卓 Hit -198 (Nature)", -- [10]
						"李老三 暗言术：痛 (伤害/跳) 俪桑卓 Tick -264 (Shadow)", -- [11]
						"美女婉君-老马布兰契 伏击 俪桑卓 Crit -1187 (Physical)", -- [12]
						"俪桑卓死亡。", -- [13]
					},
					["DeathAt"] = 5114.513,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["MessageTimes"] = {
						-13.66700000000037, -- [1]
						-6.600999999999658, -- [2]
						-5.083999999999833, -- [3]
						-4.083999999999833, -- [4]
						-3.600999999999658, -- [5]
						-2.583999999999833, -- [6]
						-1.833999999999833, -- [7]
						-1.833999999999833, -- [8]
						-1.833999999999833, -- [9]
						-1.817000000000007, -- [10]
						-0.5839999999998327, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["HealthMax"] = {
						2950, -- [1]
						2950, -- [2]
						2950, -- [3]
						2950, -- [4]
						2950, -- [5]
						2950, -- [6]
						2950, -- [7]
						2950, -- [8]
						2950, -- [9]
						2950, -- [10]
						2950, -- [11]
						2950, -- [12]
						2950, -- [13]
					},
					["Health"] = {
						2851, -- [1]
						2851, -- [2]
						2601, -- [3]
						1761, -- [4]
						1504, -- [5]
						1240, -- [6]
						681, -- [7]
						681, -- [8]
						681, -- [9]
						681, -- [10]
						483, -- [11]
						219, -- [12]
						0, -- [13]
					},
					["KilledBy"] = "美女婉君-老马布兰契",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"MISC", -- [13]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
					},
					["Messages"] = {
						"俪桑卓 火焰冲击 村里老中医-黑龙费尔默 Crit -1120 (Fire)", -- [1]
						"目空一切-逐风者 肉搏 俪桑卓 Hit -392 (Physical)", -- [2]
						"目空一切-逐风者 风暴打击 俪桑卓 Hit -401 (Physical)", -- [3]
						"俪桑卓 点燃 (伤害/跳) 村里老中医-黑龙费尔默 Tick -224 (Fire)", -- [4]
						"俪桑卓 冰霜新星 目空一切-逐风者 Hit -86 (Frost)", -- [5]
						"目空一切-逐风者 地震术 俪桑卓 Hit -689 (Nature)", -- [6]
						"俪桑卓 点燃 (伤害/跳) 村里老中医-黑龙费尔默 Tick -224 (Fire)", -- [7]
						"丷光头强丷 肉搏 俪桑卓 Absorb -430 (1)", -- [8]
						"丷光头强丷 脑部损伤 俪桑卓 Crit -14 (430 被吸收) (Physical)", -- [9]
						"丷光头强丷 肉搏 俪桑卓 Hit -155 (Physical)", -- [10]
						"丷光头强丷 肉搏 俪桑卓 Hit -91 (Physical)", -- [11]
						"丷光头强丷 冰霜冲击 俪桑卓 Hit -46 (Frost)", -- [12]
						"丷光头强丷 速效毒药 VI 俪桑卓 Hit -176 (Nature)", -- [13]
						"丷光头强丷 刺骨 俪桑卓 Hit -657 (Physical)", -- [14]
						"俪桑卓死亡。", -- [15]
					},
					["DeathAt"] = 4832.513,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
					},
					["MessageTimes"] = {
						-7.417000000000371, -- [1]
						-5.484000000000378, -- [2]
						-5.484000000000378, -- [3]
						-5.384000000000015, -- [4]
						-4.050000000000182, -- [5]
						-3.983000000000175, -- [6]
						-3.384000000000015, -- [7]
						-1.317000000000007, -- [8]
						-1.317000000000007, -- [9]
						-0.2669999999998254, -- [10]
						-0.1500000000005457, -- [11]
						-0.1500000000005457, -- [12]
						-0.1500000000005457, -- [13]
						-0.03300000000035652, -- [14]
						0, -- [15]
					},
					["HealthMax"] = {
						2950, -- [1]
						2950, -- [2]
						2950, -- [3]
						2950, -- [4]
						2950, -- [5]
						2950, -- [6]
						2950, -- [7]
						2950, -- [8]
						2950, -- [9]
						2950, -- [10]
						2950, -- [11]
						2950, -- [12]
						2950, -- [13]
						2950, -- [14]
						2950, -- [15]
					},
					["Health"] = {
						2392, -- [1]
						2392, -- [2]
						2392, -- [3]
						1599, -- [4]
						1599, -- [5]
						1599, -- [6]
						910, -- [7]
						910, -- [8]
						910, -- [9]
						896, -- [10]
						741, -- [11]
						741, -- [12]
						741, -- [13]
						428, -- [14]
						0, -- [15]
					},
					["KilledBy"] = "丷光头强丷",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"MISC", -- [15]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "伏击",
			["LastFightIn"] = 10,
			["type"] = "Ungrouped",
			["LastHealTime"] = 4829.796,
			["LastEventHealthMax"] = {
				2950, -- [1]
				2950, -- [2]
				2950, -- [3]
				2950, -- [4]
				2950, -- [5]
				2950, -- [6]
				2950, -- [7]
				2950, -- [8]
				2950, -- [9]
				2950, -- [10]
				2950, -- [11]
				2950, -- [12]
				2950, -- [13]
				2950, -- [14]
				2950, -- [15]
				2950, -- [16]
				2950, -- [17]
				2950, -- [18]
				2950, -- [19]
				2950, -- [20]
				2950, -- [21]
				2950, -- [22]
				2950, -- [23]
				2950, -- [24]
				2950, -- [25]
				2950, -- [26]
				2950, -- [27]
				2950, -- [28]
				2950, -- [29]
				2950, -- [30]
				2950, -- [31]
				2950, -- [32]
				2950, -- [33]
				2950, -- [34]
				2950, -- [35]
				2950, -- [36]
				2950, -- [37]
				2950, -- [38]
				2950, -- [39]
				2950, -- [40]
				2950, -- [41]
				2950, -- [42]
				2950, -- [43]
				2950, -- [44]
				2950, -- [45]
				2950, -- [46]
				2950, -- [47]
				2950, -- [48]
				2950, -- [49]
				2950, -- [50]
			},
			["LastDamageTaken"] = 1187,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 4829.513,
				["OVERALL"] = 5112.513,
				["DamageTaken"] = 5112.513,
				["Absorbs"] = 4829.513,
				["HealingTaken"] = 4829.513,
				["DeathCount"] = 5112.513,
				["TimeDamage"] = 5110.513,
				["ActiveTime"] = 5110.513,
				["ManaGain"] = 5027.508,
				["DOT_Time"] = 5098.512,
				["Damage"] = 5110.513,
			},
			["NextEventNum"] = 23,
			["LastDamageTime"] = 5111.229,
			["LastEvents"] = {
				"子弹舍普琴科 重伤 (伤害/跳) 俪桑卓 Tick -105 (Physical)", -- [1]
				"子弹舍普琴科 重伤 (伤害/跳) 俪桑卓 Tick -105 (Physical)", -- [2]
				"俪桑卓 冰霜新星 子弹舍普琴科 Hit -99 (Frost)", -- [3]
				"俪桑卓 火球术 子弹舍普琴科 Crit -1712 (Fire)", -- [4]
				"俪桑卓 火焰冲击 李老三 Hit -762 (Fire)", -- [5]
				"俪桑卓 魔爆术 李老三 Hit -330 (Arcane)", -- [6]
				"俪桑卓 火球术 根基图腾 Hit -1217 (Fire)", -- [7]
				"俪桑卓 点燃 (伤害/跳) 目空一切-逐风者 Absorb -136 (136 被吸收) (Fire)", -- [8]
				"俪桑卓 冰霜新星 美女婉君-老马布兰契 Hit -96 (Frost)", -- [9]
				"俪桑卓 点燃 (伤害/跳) 目空一切-逐风者 Absorb -136 (136 被吸收) (Fire)", -- [10]
				"李老三 暗言术：痛 (伤害/跳) 俪桑卓 Tick -250 (Shadow)", -- [11]
				"李老三 心灵震爆 俪桑卓 Hit -840 (Shadow)", -- [12]
				"李老三 精神鞭笞 (伤害/跳) 俪桑卓 Tick -257 (Shadow)", -- [13]
				"李老三 暗言术：痛 (伤害/跳) 俪桑卓 Tick -264 (Shadow)", -- [14]
				"目空一切-逐风者 地震术 俪桑卓 Hit -559 (Nature)", -- [15]
				"俪桑卓 魔爆术 目空一切-逐风者 Hit -337 (Arcane)", -- [16]
				"俪桑卓 魔爆术 村里老中医-黑龙费尔默 Hit -324 (Arcane)", -- [17]
				"俪桑卓 魔爆术 牧老-火妖鲁西弗隆 Hit -329 (Arcane)", -- [18]
				"目空一切-逐风者 闪电之盾 俪桑卓 Hit -198 (Nature)", -- [19]
				"李老三 暗言术：痛 (伤害/跳) 俪桑卓 Tick -264 (Shadow)", -- [20]
				"美女婉君-老马布兰契 伏击 俪桑卓 Crit -1187 (Physical)", -- [21]
				"俪桑卓死亡。", -- [22]
				"Environment Falling 俪桑卓 Hit -296 (Physical)", -- [23]
				"俪桑卓 火焰冲击 村里老中医-黑龙费尔默 Crit -1120 (Fire)", -- [24]
				"目空一切-逐风者 肉搏 俪桑卓 Hit -392 (Physical)", -- [25]
				"目空一切-逐风者 风暴打击 俪桑卓 Hit -401 (Physical)", -- [26]
				"俪桑卓 点燃 (伤害/跳) 村里老中医-黑龙费尔默 Tick -224 (Fire)", -- [27]
				"俪桑卓 冰霜新星 目空一切-逐风者 Hit -86 (Frost)", -- [28]
				"目空一切-逐风者 地震术 俪桑卓 Hit -689 (Nature)", -- [29]
				"俪桑卓 点燃 (伤害/跳) 村里老中医-黑龙费尔默 Tick -224 (Fire)", -- [30]
				"丷光头强丷 肉搏 俪桑卓 Absorb -430 (1)", -- [31]
				"丷光头强丷 脑部损伤 俪桑卓 Crit -14 (430 被吸收) (Physical)", -- [32]
				"丷光头强丷 肉搏 俪桑卓 Hit -155 (Physical)", -- [33]
				"丷光头强丷 肉搏 俪桑卓 Hit -91 (Physical)", -- [34]
				"丷光头强丷 冰霜冲击 俪桑卓 Hit -46 (Frost)", -- [35]
				"丷光头强丷 速效毒药 VI 俪桑卓 Hit -176 (Nature)", -- [36]
				"丷光头强丷 刺骨 俪桑卓 Hit -657 (Physical)", -- [37]
				"俪桑卓死亡。", -- [38]
				"Environment Falling 俪桑卓 Hit -271 (Physical)", -- [39]
				"子弹舍普琴科 肉搏 俪桑卓 Hit -342 (Physical)", -- [40]
				"子弹舍普琴科 断筋 俪桑卓 Crit -79 (Physical)", -- [41]
				"子弹舍普琴科 旋风斩 俪桑卓 Crit -1013 (Physical)", -- [42]
				"俪桑卓 冰霜新星 子弹舍普琴科 Hit -100 (Frost)", -- [43]
				"俪桑卓 冰霜新星 牧老-火妖鲁西弗隆 Hit -91 (Frost)", -- [44]
				"子弹舍普琴科 重伤 (伤害/跳) 俪桑卓 Tick -105 (Physical)", -- [45]
				"俪桑卓 火焰冲击 子弹舍普琴科 Hit -897 (Fire)", -- [46]
				"子弹舍普琴科 肉搏 俪桑卓 Hit -461 (Physical)", -- [47]
				"子弹舍普琴科 致死打击 俪桑卓 Hit -626 (Physical)", -- [48]
				"子弹舍普琴科 重伤 (伤害/跳) 俪桑卓 Tick -104 (Physical)", -- [49]
				"俪桑卓 灼烧 子弹舍普琴科 Crit -917 (Fire)", -- [50]
			},
			["Name"] = "俪桑卓",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				4942.936, -- [1]
				4945.936, -- [2]
				5023.474, -- [3]
				5028.441, -- [4]
				5032.825, -- [5]
				5034.341, -- [6]
				5094.661, -- [7]
				5097.378, -- [8]
				5098.062, -- [9]
				5099.396, -- [10]
				5106.462, -- [11]
				5107.979, -- [12]
				5108.979, -- [13]
				5109.462, -- [14]
				5110.479, -- [15]
				5111.229, -- [16]
				5111.229, -- [17]
				5111.229, -- [18]
				5111.246, -- [19]
				5112.479, -- [20]
				5113.063, -- [21]
				5113.063, -- [22]
				4704.839, -- [23]
				4823.696, -- [24]
				4825.629, -- [25]
				4825.629, -- [26]
				4825.729, -- [27]
				4827.063, -- [28]
				4827.13, -- [29]
				4827.729, -- [30]
				4829.796, -- [31]
				4829.796, -- [32]
				4830.846000000001, -- [33]
				4830.963, -- [34]
				4830.963, -- [35]
				4830.963, -- [36]
				4831.08, -- [37]
				4831.113, -- [38]
				4891.650000000001, -- [39]
				4931.552, -- [40]
				4931.902, -- [41]
				4933.902, -- [42]
				4934.686, -- [43]
				4934.686, -- [44]
				4936.936, -- [45]
				4938.052, -- [46]
				4938.319, -- [47]
				4938.952, -- [48]
				4939.936, -- [49]
				4941.069, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["目空一切-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3819,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 1875,
						["Physical"] = 1187,
						["Nature"] = 757,
					},
					["DOT_Time"] = 6,
					["Damage"] = 2575,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Fire"] = 272,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 1489,
						["Frost"] = 96,
						["Arcane"] = 990,
					},
					["PartialAbsorb"] = {
						["伏击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 329,
								},
							},
							["amount"] = 329,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1217,
								},
							},
							["amount"] = 1217,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 324,
								},
							},
							["amount"] = 324,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 96,
								},
							},
							["amount"] = 96,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 272,
								},
								["魔爆术"] = {
									["count"] = 337,
								},
							},
							["amount"] = 609,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["李老三"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 840,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 778,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 257,
								},
							},
							["amount"] = 1875,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1187,
								},
							},
							["amount"] = 1187,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 198,
								},
								["地震术"] = {
									["count"] = 559,
								},
							},
							["amount"] = 757,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["伏击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 0.68,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 2.83,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.33,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6.51,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 136,
									["min"] = 136,
									["count"] = 2,
									["amount"] = 272,
								},
							},
							["count"] = 2,
							["amount"] = 272,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 337,
									["min"] = 324,
									["count"] = 3,
									["amount"] = 990,
								},
							},
							["count"] = 3,
							["amount"] = 990,
						},
						["火球术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1217,
									["min"] = 1217,
									["count"] = 1,
									["amount"] = 1217,
								},
							},
							["count"] = 1,
							["amount"] = 1217,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 96,
									["min"] = 96,
									["count"] = 1,
									["amount"] = 96,
								},
							},
							["count"] = 1,
							["amount"] = 96,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 6.51,
					["TimeDamaging"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 0.68,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 2.83,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.33,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["俪桑卓"] = {
							["Details"] = {
								["法力护盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DOTs"] = {
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["村里老中医-黑龙费尔默"] = {
									["count"] = 6,
								},
								["目空一切-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
					},
					["DeathCount"] = 2,
					["ElementTakenAbsorb"] = {
						["Physical"] = 430,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 10,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 10,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 16,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["DamageTaken"] = 13564,
					["ElementDoneAbsorb"] = {
						["Fire"] = 272,
						["Frost"] = 202,
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["伏击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["脑部损伤"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
					},
					["ManaGained"] = {
						["元素大师"] = {
							["Details"] = {
								["俪桑卓"] = {
									["count"] = 265,
								},
							},
							["amount"] = 265,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["伏击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["脑部损伤"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 430,
									["min"] = 430,
									["count"] = 1,
									["amount"] = 430,
								},
							},
							["count"] = 1,
							["amount"] = 430,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 26.51,
					["WhoHealed"] = {
						["俪桑卓"] = {
							["Details"] = {
								["法力护盾"] = {
									["count"] = 430,
								},
							},
							["amount"] = 430,
						},
					},
					["ElementTaken"] = {
						["Shadow"] = 3235,
						["Melee"] = 3265,
						["Frost"] = 46,
						["Physical"] = 5003,
						["Nature"] = 2015,
					},
					["DOT_Time"] = 12,
					["Damage"] = 10268,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 8,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 10,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 10,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeHeal"] = 1.5,
					["HealedWho"] = {
						["俪桑卓"] = {
							["Details"] = {
								["法力护盾"] = {
									["count"] = 430,
								},
							},
							["amount"] = 430,
						},
					},
					["Heals"] = {
						["法力护盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 430,
									["min"] = 430,
									["count"] = 1,
									["amount"] = 430,
								},
							},
							["count"] = 1,
							["amount"] = 430,
						},
					},
					["TimeDamaging"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 0.68,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 1.5,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 2.17,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.67,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["李老三"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 2.83,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.33,
								},
							},
							["amount"] = 5.66,
						},
					},
					["Absorbs"] = 430,
					["ManaGainedFrom"] = {
						["俪桑卓"] = {
							["Details"] = {
								["元素大师"] = {
									["count"] = 265,
								},
							},
							["amount"] = 265,
						},
					},
					["TimeSpent"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 0.68,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 1.5,
								},
								["火球术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 2.17,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.67,
						},
						["李老三"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["俪桑卓"] = {
							["Details"] = {
								["法力护盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 2.83,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.33,
								},
							},
							["amount"] = 5.66,
						},
					},
					["Attacks"] = {
						["火球术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1712,
									["min"] = 1712,
									["count"] = 1,
									["amount"] = 1712,
								},
								["Hit"] = {
									["max"] = 1217,
									["min"] = 1217,
									["count"] = 1,
									["amount"] = 1217,
								},
							},
							["count"] = 2,
							["amount"] = 2929,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 102,
									["min"] = 81,
									["count"] = 8,
									["amount"] = 743,
								},
								["Absorb"] = {
									["max"] = 105,
									["min"] = 97,
									["count"] = 2,
									["amount"] = 202,
								},
							},
							["count"] = 10,
							["amount"] = 945,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 136,
									["min"] = 136,
									["count"] = 2,
									["amount"] = 272,
								},
								["Tick"] = {
									["max"] = 224,
									["min"] = 224,
									["count"] = 2,
									["amount"] = 448,
								},
							},
							["count"] = 4,
							["amount"] = 720,
						},
						["灼烧"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 917,
									["min"] = 917,
									["count"] = 1,
									["amount"] = 917,
								},
							},
							["count"] = 1,
							["amount"] = 917,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 337,
									["min"] = 324,
									["count"] = 6,
									["amount"] = 1978,
								},
							},
							["count"] = 6,
							["amount"] = 1978,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1120,
									["min"] = 1120,
									["count"] = 1,
									["amount"] = 1120,
								},
								["Hit"] = {
									["max"] = 897,
									["min"] = 762,
									["count"] = 2,
									["amount"] = 1659,
								},
							},
							["count"] = 3,
							["amount"] = 2779,
						},
					},
					["HealingTaken"] = 430,
					["DamagedWho"] = {
						["子弹舍普琴科"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 917,
								},
								["火球术"] = {
									["count"] = 1712,
								},
								["火焰冲击"] = {
									["count"] = 897,
								},
								["冰霜新星"] = {
									["count"] = 304,
								},
							},
							["amount"] = 3830,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 102,
								},
							},
							["amount"] = 102,
						},
						["紫衣战天下"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 97,
								},
							},
							["amount"] = 97,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 329,
								},
								["冰霜新星"] = {
									["count"] = 91,
								},
							},
							["amount"] = 420,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 328,
								},
							},
							["amount"] = 328,
						},
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 96,
								},
							},
							["amount"] = 96,
						},
						["村里老中医-黑龙费尔默"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 448,
								},
								["魔爆术"] = {
									["count"] = 324,
								},
								["火焰冲击"] = {
									["count"] = 1120,
								},
								["冰霜新星"] = {
									["count"] = 88,
								},
							},
							["amount"] = 1980,
						},
						["根基图腾"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1217,
								},
							},
							["amount"] = 1217,
						},
						["李老三"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 330,
								},
								["火焰冲击"] = {
									["count"] = 762,
								},
							},
							["amount"] = 1092,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 667,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 272,
								},
								["冰霜新星"] = {
									["count"] = 167,
								},
							},
							["amount"] = 1106,
						},
					},
					["TimeDamage"] = 25.01,
					["WhoDamaged"] = {
						["美女婉君-老马布兰契"] = {
							["Details"] = {
								["伏击"] = {
									["count"] = 1187,
								},
							},
							["amount"] = 1187,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 366,
								},
							},
							["amount"] = 366,
						},
						["丷光头强丷"] = {
							["Details"] = {
								["冰霜冲击"] = {
									["count"] = 46,
								},
								["脑部损伤"] = {
									["count"] = 14,
								},
								["速效毒药 VI"] = {
									["count"] = 176,
								},
								["刺骨"] = {
									["count"] = 657,
								},
								["肉搏"] = {
									["count"] = 676,
								},
							},
							["amount"] = 1569,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 567,
								},
							},
							["amount"] = 567,
						},
						["李老三"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 840,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1479,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 293,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 257,
								},
							},
							["amount"] = 2869,
						},
						["延陵斩蛟-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 40,
								},
								["肉搏"] = {
									["count"] = 419,
								},
							},
							["amount"] = 459,
						},
						["子弹舍普琴科"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 626,
								},
								["旋风斩"] = {
									["count"] = 1013,
								},
								["断筋"] = {
									["count"] = 79,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 419,
								},
								["肉搏"] = {
									["count"] = 803,
								},
							},
							["amount"] = 2940,
						},
						["目空一切-逐风者"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 1248,
								},
								["闪电之盾"] = {
									["count"] = 591,
								},
								["风暴打击"] = {
									["count"] = 401,
								},
								["肉搏"] = {
									["count"] = 1367,
								},
							},
							["amount"] = 3607,
						},
					},
					["ManaGain"] = 265,
					["ElementDone"] = {
						["Frost"] = 945,
						["Fire"] = 7345,
						["Arcane"] = 1978,
					},
					["Absorbed"] = {
						["法力护盾"] = {
							["Details"] = {
								["俪桑卓"] = {
									["max"] = 430,
									["min"] = 430,
									["count"] = 1,
									["amount"] = 430,
								},
							},
							["count"] = 1,
							["amount"] = 430,
						},
					},
				},
			},
			["UnitLockout"] = 4666.52,
			["LastActive"] = 5112.513,
		},
	},
	["FightNum"] = 11,
	["CombatTimes"] = {
		{
			4571.514, -- [1]
			4601.516000000001, -- [2]
			"20:58:31", -- [3]
			"20:59:00", -- [4]
			"李老三", -- [5]
		}, -- [1]
		{
			4602.516000000001, -- [1]
			4616.517, -- [2]
			"20:59:02", -- [3]
			"20:59:15", -- [4]
			"丷光头强丷", -- [5]
		}, -- [2]
		{
			4619.517, -- [1]
			4645.518, -- [2]
			"20:59:18", -- [3]
			"20:59:44", -- [4]
			"子弹舍普琴科", -- [5]
		}, -- [3]
		{
			4652.519, -- [1]
			4684.521, -- [2]
			"20:59:51", -- [3]
			"21:00:23", -- [4]
			"牧老-火妖鲁西弗隆", -- [5]
		}, -- [4]
		{
			4684.521, -- [1]
			4695.521, -- [2]
			"21:00:24", -- [3]
			"21:00:34", -- [4]
			"广坤叔来啦-火妖鲁西弗隆", -- [5]
		}, -- [5]
		{
			4730.507000000001, -- [1]
			4768.509, -- [2]
			"21:01:10", -- [3]
			"21:01:47", -- [4]
			"Environment", -- [5]
		}, -- [6]
		{
			4790.51, -- [1]
			4880.516000000001, -- [2]
			"21:02:10", -- [3]
			"21:03:39", -- [4]
			"延陵斩蛟-黑龙费尔默", -- [5]
		}, -- [7]
		{
			4921.518, -- [1]
			4963.521, -- [2]
			"21:04:20", -- [3]
			"21:05:02", -- [4]
			"李老三", -- [5]
		}, -- [8]
		{
			4991.522, -- [1]
			5005.523, -- [2]
			"21:05:31", -- [3]
			"21:05:44", -- [4]
			"村里老中医-黑龙费尔默", -- [5]
		}, -- [9]
		{
			5021.507000000001, -- [1]
			5043.509, -- [2]
			"21:06:01", -- [3]
			"21:06:22", -- [4]
			"子弹舍普琴科", -- [5]
		}, -- [10]
		{
			5075.51, -- [1]
			5115.513, -- [2]
			"21:06:55", -- [3]
			"21:07:34", -- [4]
			"村里老中医-黑龙费尔默", -- [5]
		}, -- [11]
	},
	["FoughtWho"] = {
	},
}
