
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["黎龍-逐风者"] = {
			["GUID"] = "Player-5451-0312D8D9",
			["LastEventHealth"] = {
				2863, -- [1]
				2863, -- [2]
				2863, -- [3]
				2863, -- [4]
				2863, -- [5]
				2863, -- [6]
				2863, -- [7]
				2863, -- [8]
				2863, -- [9]
				2863, -- [10]
				2863, -- [11]
				2863, -- [12]
				2863, -- [13]
				2863, -- [14]
				2863, -- [15]
				2863, -- [16]
				2863, -- [17]
				2863, -- [18]
				2863, -- [19]
				2863, -- [20]
				2863, -- [21]
				2863, -- [22]
				2863, -- [23]
				2863, -- [24]
				2863, -- [25]
				2863, -- [26]
				2863, -- [27]
				2467, -- [28]
			},
			["LastAttackedBy"] = "猎蝶兽兽-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					124, -- [1]
				},
				["Overhealing"] = {
					88, -- [1]
				},
				["ActiveTime"] = {
					17.97, -- [1]
				},
				["TimeDamage"] = {
					17.97, -- [1]
				},
				["DamageTaken"] = {
					691, -- [1]
				},
				["Damage"] = {
					4376, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "自动射击",
			["LastFightIn"] = 6,
			["type"] = "Grouped",
			["LastDamageTaken"] = 295,
			["TimeLast"] = {
				["EnergyGain"] = 17782.566,
				["Overhealing"] = 17910.557,
				["ActiveTime"] = 17911.557,
				["TimeDamage"] = 17911.557,
				["OVERALL"] = 17917.558,
				["DamageTaken"] = 17917.558,
				["Damage"] = 17911.557,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2863, -- [1]
				2863, -- [2]
				2863, -- [3]
				2863, -- [4]
				2863, -- [5]
				2863, -- [6]
				2863, -- [7]
				2863, -- [8]
				2863, -- [9]
				2863, -- [10]
				2863, -- [11]
				2863, -- [12]
				2863, -- [13]
				2863, -- [14]
				2863, -- [15]
				2863, -- [16]
				2863, -- [17]
				2863, -- [18]
				2863, -- [19]
				2863, -- [20]
				2863, -- [21]
				2863, -- [22]
				2863, -- [23]
				2863, -- [24]
				2863, -- [25]
				2863, -- [26]
				2863, -- [27]
				2863, -- [28]
			},
			["NextEventNum"] = 29,
			["LastDamageTime"] = 17912.175,
			["LastEvents"] = {
				"黎龍-逐风者 肉搏 索德斯吶 Hit -190 (Physical)", -- [1]
				"黎龍-逐风者 肉搏 索德斯吶 Hit -61 (Physical)", -- [2]
				"黎龍-逐风者 出血 索德斯吶 Hit -191 (Physical)", -- [3]
				"黎龍-逐风者 速效毒药 VI 索德斯吶 Hit -142 (Nature)", -- [4]
				"黎龍-逐风者 肉搏 索德斯吶 Hit -62 (Physical)", -- [5]
				"黎龍-逐风者 肉搏 索德斯吶 Crit -392 (Physical)", -- [6]
				"黎龍-逐风者 肉搏 逐风者卡巴-逐风者 Crit -410 (Physical)", -- [7]
				"黎龍-逐风者 速效毒药 VI 逐风者卡巴-逐风者 Hit -121 (Nature)", -- [8]
				"黎龍-逐风者 肉搏 逐风者卡巴-逐风者 Hit -72 (Physical)", -- [9]
				"黎龍-逐风者 出血 逐风者卡巴-逐风者 Crit -525 (Physical)", -- [10]
				"黎龍-逐风者 肉搏 逐风者卡巴-逐风者 Hit -66 (Physical)", -- [11]
				"黎龍-逐风者 凿击 逐风者卡巴-逐风者 Crit -159 (Physical)", -- [12]
				"黎龍-逐风者 肉搏 逐风者卡巴-逐风者 Hit -183 (Physical)", -- [13]
				"黎龍-逐风者 肉搏 逐风者卡巴-逐风者 Hit -79 (Physical)", -- [14]
				"黎龍-逐风者 出血 逐风者卡巴-逐风者 Crit -416 (Physical)", -- [15]
				"黎龍-逐风者 出血 逐风者卡巴-逐风者 Hit -188 (Physical)", -- [16]
				"黎龍-逐风者 偷袭 依卤-黑龙费尔默 Resist (Physical)", -- [17]
				"黎龍-逐风者 肉搏 依卤-黑龙费尔默 Hit -181 (Physical)", -- [18]
				"黎龍-逐风者 出血 依卤-黑龙费尔默 Hit -165 (Physical)", -- [19]
				"黎龍-逐风者 肉搏 依卤-黑龙费尔默 Crit -110 (Physical)", -- [20]
				"黎龍-逐风者 凿击 依卤-黑龙费尔默 Crit -126 (Physical)", -- [21]
				"黎龍-逐风者 神圣力量 黎龍-逐风者 Hit +88 (88 过量治疗)", -- [22]
				"黎龍-逐风者 出血 豹 Hit -157 (Physical)", -- [23]
				"黎龍-逐风者 肉搏 豹 Hit -160 (Physical)", -- [24]
				"黎龍-逐风者 速效毒药 VI 豹 Hit -112 (Nature)", -- [25]
				"黎龍-逐风者 肉搏 豹 Crit -108 (Physical)", -- [26]
				"猎蝶兽兽-黑龙费尔默 多重射击 黎龍-逐风者 Hit -396 (Physical)", -- [27]
				"猎蝶兽兽-黑龙费尔默 自动射击 黎龍-逐风者 Hit -295 (Physical)", -- [28]
			},
			["Name"] = "黎龍-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
			},
			["LastEventTimes"] = {
				17611.205, -- [1]
				17612.071, -- [2]
				17612.138, -- [3]
				17613.588, -- [4]
				17613.855, -- [5]
				17613.971, -- [6]
				17775.115, -- [7]
				17775.115, -- [8]
				17776.015, -- [9]
				17776.065, -- [10]
				17777.832, -- [11]
				17777.932, -- [12]
				17781.632, -- [13]
				17782.549, -- [14]
				17782.732, -- [15]
				17783.739, -- [16]
				17907.641, -- [17]
				17908.524, -- [18]
				17908.641, -- [19]
				17909.441, -- [20]
				17909.974, -- [21]
				17911.274, -- [22]
				17911.274, -- [23]
				17911.841, -- [24]
				17911.841, -- [25]
				17912.175, -- [26]
				17917.975, -- [27]
				17918.358, -- [28]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 88,
									["min"] = 88,
									["count"] = 1,
									["amount"] = 88,
								},
							},
							["count"] = 1,
							["amount"] = 88,
						},
					},
					["TimeSpent"] = {
						["索德斯吶"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 1.45,
								},
								["出血"] = {
									["count"] = 0.07,
								},
								["肉搏"] = {
									["count"] = 2.76,
								},
							},
							["amount"] = 4.28,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["凿击"] = {
									["count"] = 0.53,
								},
								["出血"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 1.68,
								},
							},
							["amount"] = 3.83,
						},
						["豹"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 1.3,
								},
								["肉搏"] = {
									["count"] = 0.8999999999999999,
								},
							},
							["amount"] = 2.2,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 0.1,
								},
								["出血"] = {
									["count"] = 1.24,
								},
								["肉搏"] = {
									["count"] = 6.32,
								},
							},
							["amount"] = 7.659999999999999,
						},
					},
					["DamageTaken"] = 691,
					["EnergyGain"] = 124,
					["Overhealing"] = 88,
					["ActiveTime"] = 17.97,
					["ElementTaken"] = {
						["Physical"] = 691,
					},
					["Damage"] = 4376,
					["EnergyGained"] = {
						["恢复能量"] = {
							["Details"] = {
								["黎龍-逐风者"] = {
									["count"] = 74,
								},
							},
							["amount"] = 74,
						},
						["无情打击效果"] = {
							["Details"] = {
								["黎龍-逐风者"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ElementDone"] = {
						["Physical"] = 1927,
						["Melee"] = 2074,
						["Nature"] = 375,
					},
					["WhoDamaged"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 396,
								},
								["自动射击"] = {
									["count"] = 295,
								},
							},
							["amount"] = 691,
						},
					},
					["DamagedWho"] = {
						["索德斯吶"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 142,
								},
								["出血"] = {
									["count"] = 191,
								},
								["肉搏"] = {
									["count"] = 705,
								},
							},
							["amount"] = 1038,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 126,
								},
								["出血"] = {
									["count"] = 165,
								},
								["肉搏"] = {
									["count"] = 291,
								},
							},
							["amount"] = 582,
						},
						["豹"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 112,
								},
								["出血"] = {
									["count"] = 157,
								},
								["肉搏"] = {
									["count"] = 268,
								},
							},
							["amount"] = 537,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 159,
								},
								["速效毒药 VI"] = {
									["count"] = 121,
								},
								["出血"] = {
									["count"] = 1129,
								},
								["肉搏"] = {
									["count"] = 810,
								},
							},
							["amount"] = 2219,
						},
					},
					["TimeDamage"] = 17.97,
					["TimeDamaging"] = {
						["索德斯吶"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 1.45,
								},
								["出血"] = {
									["count"] = 0.07,
								},
								["肉搏"] = {
									["count"] = 2.76,
								},
							},
							["amount"] = 4.28,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["偷袭"] = {
									["count"] = 1.5,
								},
								["凿击"] = {
									["count"] = 0.53,
								},
								["出血"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 1.68,
								},
							},
							["amount"] = 3.83,
						},
						["豹"] = {
							["Details"] = {
								["出血"] = {
									["count"] = 1.3,
								},
								["肉搏"] = {
									["count"] = 0.8999999999999999,
								},
							},
							["amount"] = 2.2,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 0.1,
								},
								["出血"] = {
									["count"] = 1.24,
								},
								["肉搏"] = {
									["count"] = 6.32,
								},
							},
							["amount"] = 7.659999999999999,
						},
					},
					["EnergyGainedFrom"] = {
						["黎龍-逐风者"] = {
							["Details"] = {
								["恢复能量"] = {
									["count"] = 74,
								},
								["无情打击效果"] = {
									["count"] = 50,
								},
							},
							["amount"] = 124,
						},
					},
					["Attacks"] = {
						["凿击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 159,
									["min"] = 126,
									["count"] = 2,
									["amount"] = 285,
								},
							},
							["count"] = 2,
							["amount"] = 285,
						},
						["偷袭"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 142,
									["min"] = 112,
									["count"] = 3,
									["amount"] = 375,
								},
							},
							["count"] = 3,
							["amount"] = 375,
						},
						["出血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 525,
									["min"] = 416,
									["count"] = 2,
									["amount"] = 941,
								},
								["Hit"] = {
									["max"] = 191,
									["min"] = 157,
									["count"] = 4,
									["amount"] = 701,
								},
							},
							["count"] = 6,
							["amount"] = 1642,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 410,
									["min"] = 108,
									["count"] = 4,
									["amount"] = 1020,
								},
								["Hit"] = {
									["max"] = 190,
									["min"] = 61,
									["count"] = 9,
									["amount"] = 1054,
								},
							},
							["count"] = 13,
							["amount"] = 2074,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 13,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
				},
			},
			["UnitLockout"] = 17610.555,
			["LastActive"] = 17917.558,
		},
		["特变电工"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
					},
					["Messages"] = {
						"特变电工 肉搏 依卤-黑龙费尔默 Crit -946 (Physical)", -- [1]
						"特变电工 断筋 依卤-黑龙费尔默 Hit -43 (Physical)", -- [2]
						"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -87 (Nature)", -- [3]
						"豹 爪击 特变电工 Hit -30 (Physical)", -- [4]
						"豹 肉搏 特变电工 Hit -54 (Physical)", -- [5]
						"特变电工 致死打击 依卤-黑龙费尔默 Hit -576 (Physical)", -- [6]
						"特变电工 重伤 (伤害/跳) 依卤-黑龙费尔默 Tick -132 (Physical)", -- [7]
						"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -88 (Nature)", -- [8]
						"特变电工 斩杀 依卤-黑龙费尔默 Hit -547 (Physical)", -- [9]
						"特变电工 肉搏 依卤-黑龙费尔默 Crit -859 (Physical)", -- [10]
						"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -88 (Nature)", -- [11]
						"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -87 (Nature)", -- [12]
						"灵魂摆渡人-逐风者 冰霜新星 特变电工 Hit -91 (Frost)", -- [13]
						"灵魂摆渡人-逐风者 冰锥术 特变电工 Hit -553 (Frost)", -- [14]
						"末日坠落-逐风者 肉搏 特变电工 Hit -138 (Physical)", -- [15]
						"末日坠落-逐风者 斩杀 特变电工 Hit -412 (Physical)", -- [16]
						"特变电工死亡。", -- [17]
					},
					["DeathAt"] = 17924.558,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
					},
					["MessageTimes"] = {
						-14.5, -- [1]
						-14.43400000000111, -- [2]
						-13.28399999999965, -- [3]
						-13.0669999999991, -- [4]
						-13, -- [5]
						-12.75, -- [6]
						-11.46700000000055, -- [7]
						-10.3169999999991, -- [8]
						-9.900000000001455, -- [9]
						-8.983000000000175, -- [10]
						-7.316999999999098, -- [11]
						-4.315999999998894, -- [12]
						-2.200000000000728, -- [13]
						-0.5829999999987194, -- [14]
						-0.4660000000003493, -- [15]
						-0.01599999999962165, -- [16]
						0, -- [17]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
					},
					["Health"] = {
						1617, -- [1]
						1617, -- [2]
						1617, -- [3]
						1530, -- [4]
						1500, -- [5]
						1446, -- [6]
						1446, -- [7]
						1446, -- [8]
						1358, -- [9]
						1358, -- [10]
						1358, -- [11]
						1270, -- [12]
						1183, -- [13]
						1092, -- [14]
						539, -- [15]
						401, -- [16]
						0, -- [17]
					},
					["KilledBy"] = "末日坠落-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"MISC", -- [17]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						false, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						false, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						true, -- [47]
						true, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -77 (Shadow)", -- [1]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -180 (Shadow)", -- [2]
						"索德斯吶 死亡缠绕 特变电工 Hit -602 (Shadow)", -- [3]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -77 (Shadow)", -- [4]
						"依卤-黑龙费尔默 多重射击 特变电工 Hit -270 (Physical)", -- [5]
						"依卤-黑龙费尔默 自动射击 特变电工 Hit -179 (Physical)", -- [6]
						"逐风者卡巴-逐风者 献祭 特变电工 Hit -325 (Fire)", -- [7]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -76 (Shadow)", -- [8]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -179 (Shadow)", -- [9]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [10]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -77 (Shadow)", -- [11]
						"逐风者卡巴-逐风者 献祭 (伤害/跳) 特变电工 Tick -133 (Fire)", -- [12]
						"依卤-黑龙费尔默 自动射击 特变电工 Crit -434 (Physical)", -- [13]
						"依卤-黑龙费尔默 奥术射击 特变电工 Hit -207 (Arcane)", -- [14]
						"豹 肉搏 特变电工 Parry (1)", -- [15]
						"豹 爪击 特变电工 Hit -28 (Physical)", -- [16]
						"特变电工 治疗药水 特变电工 Hit +1613", -- [17]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [18]
						"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -87 (Nature)", -- [19]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -180 (Shadow)", -- [20]
						"特变电工 旋风斩 豹 Hit -332 (Physical)", -- [21]
						"特变电工 旋风斩 诺哈芬 Hit -352 (Physical)", -- [22]
						"特变电工 旋风斩 索德斯吶 Crit -972 (Physical)", -- [23]
						"索德斯吶 腐蚀术 (伤害/跳) 特变电工 Tick -158 (Shadow)", -- [24]
						"豹 肉搏 特变电工 Hit -45 (Physical)", -- [25]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -77 (Shadow)", -- [26]
						"豹 爪击 特变电工 Parry (Physical)", -- [27]
						"依卤-黑龙费尔默 自动射击 特变电工 Hit -185 (Physical)", -- [28]
						"索德斯吶 献祭 特变电工 Hit -295 (Fire)", -- [29]
						"逐风者卡巴-逐风者 献祭 (伤害/跳) 特变电工 Tick -133 (Fire)", -- [30]
						"特变电工 致死打击 索德斯吶 Dodge (Physical)", -- [31]
						"特变电工 肉搏 索德斯吶 Hit -507 (Physical)", -- [32]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [33]
						"豹 肉搏 特变电工 Miss (1)", -- [34]
						"豹 爪击 特变电工 Hit -25 (Physical)", -- [35]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -124 (Shadow)", -- [36]
						"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -88 (Nature)", -- [37]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -180 (Shadow)", -- [38]
						"依卤-黑龙费尔默 自动射击 特变电工 Hit -171 (Physical)", -- [39]
						"豹 肉搏 特变电工 Hit -52 (Physical)", -- [40]
						"索德斯吶 腐蚀术 (伤害/跳) 特变电工 Tick -158 (Shadow)", -- [41]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [42]
						"豹 爪击 特变电工 Hit -28 (Physical)", -- [43]
						"索德斯吶 献祭 (伤害/跳) 特变电工 Tick -114 (Fire)", -- [44]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -124 (Shadow)", -- [45]
						"逐风者卡巴-逐风者 献祭 (伤害/跳) 特变电工 Tick -134 (Fire)", -- [46]
						"豹 肉搏 特变电工 Hit -45 (Physical)", -- [47]
						"瞬狱影杀阵-逐风者 痛苦诅咒 特变电工 Resist (Fire)", -- [48]
						"瞬狱影杀阵-逐风者 灼烧 特变电工 Crit -765 (Fire)", -- [49]
						"特变电工死亡。", -- [50]
					},
					["DeathAt"] = 17785.566,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-13.66699999999764, -- [1]
						-11.16699999999764, -- [2]
						-10.93400000000111, -- [3]
						-10.6339999999982, -- [4]
						-9.934000000001106, -- [5]
						-9.700000000000728, -- [6]
						-9.633999999998196, -- [7]
						-8.633999999998196, -- [8]
						-8.166999999997643, -- [9]
						-7.450000000000728, -- [10]
						-6.649999999997817, -- [11]
						-6.633999999998196, -- [12]
						-6.61699999999837, -- [13]
						-6.61699999999837, -- [14]
						-6.200000000000728, -- [15]
						-6.200000000000728, -- [16]
						-5.799999999999272, -- [17]
						-5.450000000000728, -- [18]
						-5.399999999997817, -- [19]
						-5.132999999997992, -- [20]
						-5.082999999998719, -- [21]
						-5.082999999998719, -- [22]
						-5.082999999998719, -- [23]
						-4.934000000001106, -- [24]
						-4.799999999999272, -- [25]
						-4.649999999997817, -- [26]
						-4.599999999998545, -- [27]
						-4.483000000000175, -- [28]
						-3.75, -- [29]
						-3.632999999997992, -- [30]
						-3.582999999998719, -- [31]
						-3.516999999999825, -- [32]
						-3.450000000000728, -- [33]
						-3.36699999999837, -- [34]
						-2.983000000000175, -- [35]
						-2.649999999997817, -- [36]
						-2.399999999997817, -- [37]
						-2.166999999997643, -- [38]
						-2.032999999999447, -- [39]
						-1.983000000000175, -- [40]
						-1.933000000000902, -- [41]
						-1.450000000000728, -- [42]
						-1.382999999997992, -- [43]
						-0.7330000000001746, -- [44]
						-0.6499999999978172, -- [45]
						-0.6329999999979918, -- [46]
						-0.5499999999992724, -- [47]
						-0.03299999999944703, -- [48]
						-0.03299999999944703, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
						4969, -- [40]
						4969, -- [41]
						4969, -- [42]
						4969, -- [43]
						4969, -- [44]
						4969, -- [45]
						4969, -- [46]
						4969, -- [47]
						4969, -- [48]
						4969, -- [49]
						4969, -- [50]
					},
					["Health"] = {
						4321, -- [1]
						4244, -- [2]
						4064, -- [3]
						3462, -- [4]
						3385, -- [5]
						3115, -- [6]
						2936, -- [7]
						2611, -- [8]
						2535, -- [9]
						2356, -- [10]
						2290, -- [11]
						2290, -- [12]
						2290, -- [13]
						2290, -- [14]
						1439, -- [15]
						1439, -- [16]
						1411, -- [17]
						3024, -- [18]
						2958, -- [19]
						2871, -- [20]
						2691, -- [21]
						2691, -- [22]
						2691, -- [23]
						2691, -- [24]
						2533, -- [25]
						2488, -- [26]
						2411, -- [27]
						2411, -- [28]
						2226, -- [29]
						1931, -- [30]
						1798, -- [31]
						1798, -- [32]
						1798, -- [33]
						1732, -- [34]
						1732, -- [35]
						1707, -- [36]
						1583, -- [37]
						1495, -- [38]
						1315, -- [39]
						1144, -- [40]
						1092, -- [41]
						934, -- [42]
						868, -- [43]
						840, -- [44]
						726, -- [45]
						726, -- [46]
						468, -- [47]
						423, -- [48]
						423, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "瞬狱影杀阵-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"HEAL", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						false, -- [32]
						false, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						false, -- [39]
						false, -- [40]
						true, -- [41]
						false, -- [42]
						false, -- [43]
						true, -- [44]
						true, -- [45]
					},
					["Messages"] = {
						"特变电工 致死打击 依卤-黑龙费尔默 Hit -395 (Physical)", -- [1]
						"豹 肉搏 特变电工 Hit -49 (Physical)", -- [2]
						"依卤-黑龙费尔默 奥术射击 特变电工 Hit -208 (Arcane)", -- [3]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [4]
						"特变电工 拦截昏迷 依卤-黑龙费尔默 Hit -41 (Physical)", -- [5]
						"豹 肉搏 特变电工 Hit -48 (Physical)", -- [6]
						"豹 爪击 特变电工 Hit -28 (Physical)", -- [7]
						"特变电工 断筋 依卤-黑龙费尔默 Hit -31 (Physical)", -- [8]
						"特变电工 肉搏 依卤-黑龙费尔默 Hit -306 (Physical)", -- [9]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [10]
						"豹 肉搏 特变电工 Hit -47 (Physical)", -- [11]
						"索德斯吶 腐蚀术 (伤害/跳) 特变电工 Tick -129 (Shadow)", -- [12]
						"瞬狱影杀阵-逐风者 炎爆术 特变电工 Resist (Fire)", -- [13]
						"豹 爪击 特变电工 Crit -43 (Physical)", -- [14]
						"特变电工 嘲讽 依卤-黑龙费尔默 Immune (Physical)", -- [15]
						"豹 肉搏 特变电工 Hit -43 (Physical)", -- [16]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -54 (Shadow)", -- [17]
						"豹 肉搏 特变电工 Hit -41 (Physical)", -- [18]
						"特变电工 肉搏 依卤-黑龙费尔默 Parry (1)", -- [19]
						"特变电工 致死打击 依卤-黑龙费尔默 Hit -434 (Physical)", -- [20]
						"索德斯吶 腐蚀术 (伤害/跳) 特变电工 Tick -129 (Shadow)", -- [21]
						"瞬狱影杀阵-逐风者 灼烧 特变电工 Hit -512 (Fire)", -- [22]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -54 (Shadow)", -- [23]
						"豹 肉搏 特变电工 Hit -37 (Physical)", -- [24]
						"瞬狱影杀阵-逐风者 灼烧 特变电工 Crit -761 (Fire)", -- [25]
						"索德斯吶 生命虹吸 (伤害/跳) 特变电工 Tick -49 (Shadow)", -- [26]
						"豹 肉搏 特变电工 Hit -49 (Physical)", -- [27]
						"索德斯吶 献祭 特变电工 Hit -313 (Fire)", -- [28]
						"豹 爪击 特变电工 Miss (Physical)", -- [29]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -121 (Shadow)", -- [30]
						"索德斯吶 腐蚀术 (伤害/跳) 特变电工 Tick -157 (Shadow)", -- [31]
						"特变电工 旋风斩 豹 Hit -361 (Physical)", -- [32]
						"特变电工 旋风斩 依卤-黑龙费尔默 Hit -396 (Physical)", -- [33]
						"瞬狱影杀阵-逐风者 灼烧 特变电工 Hit -703 (Fire)", -- [34]
						"瞬狱影杀阵-逐风者 点燃 (伤害/跳) 特变电工 Tick -166 (Fire)", -- [35]
						"依卤-黑龙费尔默 反击 特变电工 Miss (Physical)", -- [36]
						"依卤-黑龙费尔默 肉搏 特变电工 Hit -178 (Physical)", -- [37]
						"豹 肉搏 特变电工 Hit -42 (Physical)", -- [38]
						"特变电工 肉搏 依卤-黑龙费尔默 Hit -367 (Physical)", -- [39]
						"特变电工 锤击昏迷效果 依卤-黑龙费尔默 Resist (Physical)", -- [40]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -111 (Shadow)", -- [41]
						"特变电工 昏迷 依卤-黑龙费尔默 Resist (Physical)", -- [42]
						"特变电工 斩杀 依卤-黑龙费尔默 Hit -692 (Physical)", -- [43]
						"瞬狱影杀阵-逐风者 灼烧 特变电工 Hit -645 (Fire)", -- [44]
						"特变电工死亡。", -- [45]
					},
					["DeathAt"] = 17724.563,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
					},
					["MessageTimes"] = {
						-13.89600000000064, -- [1]
						-13.69599999999991, -- [2]
						-11.21299999999974, -- [3]
						-10.09600000000137, -- [4]
						-10.09600000000137, -- [5]
						-9.445999999999913, -- [6]
						-9.445999999999913, -- [7]
						-8.929000000000087, -- [8]
						-8.579000000001543, -- [9]
						-8.113000000001193, -- [10]
						-8.046000000002095, -- [11]
						-7.596000000001368, -- [12]
						-7.212999999999738, -- [13]
						-7.013000000002648, -- [14]
						-6.796000000002096, -- [15]
						-6.61200000000099, -- [16]
						-6.096000000001368, -- [17]
						-5.22899999999936, -- [18]
						-4.77900000000227, -- [19]
						-4.61200000000099, -- [20]
						-4.595000000001164, -- [21]
						-4.579000000001543, -- [22]
						-4.11200000000099, -- [23]
						-3.829000000001543, -- [24]
						-3.062000000001717, -- [25]
						-2.711999999999534, -- [26]
						-2.429000000000087, -- [27]
						-2.36200000000099, -- [28]
						-2.129000000000815, -- [29]
						-2.096000000001368, -- [30]
						-1.596000000001368, -- [31]
						-1.579000000001543, -- [32]
						-1.579000000001543, -- [33]
						-1.545000000001892, -- [34]
						-1.02900000000227, -- [35]
						-1.02900000000227, -- [36]
						-1.02900000000227, -- [37]
						-1.02900000000227, -- [38]
						-0.9619999999995343, -- [39]
						-0.9619999999995343, -- [40]
						-0.09600000000136788, -- [41]
						-0.04500000000189175, -- [42]
						-0.04500000000189175, -- [43]
						-0.04500000000189175, -- [44]
						0, -- [45]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
						4969, -- [40]
						4969, -- [41]
						4969, -- [42]
						4969, -- [43]
						4969, -- [44]
						4969, -- [45]
					},
					["Health"] = {
						4920, -- [1]
						4920, -- [2]
						4969, -- [3]
						4424, -- [4]
						4424, -- [5]
						4358, -- [6]
						4358, -- [7]
						4282, -- [8]
						4282, -- [9]
						4282, -- [10]
						4216, -- [11]
						4169, -- [12]
						4040, -- [13]
						4040, -- [14]
						3997, -- [15]
						3997, -- [16]
						3954, -- [17]
						3900, -- [18]
						3859, -- [19]
						3859, -- [20]
						3859, -- [21]
						3730, -- [22]
						3218, -- [23]
						3164, -- [24]
						3127, -- [25]
						2366, -- [26]
						2317, -- [27]
						2268, -- [28]
						1955, -- [29]
						1955, -- [30]
						1834, -- [31]
						1677, -- [32]
						1677, -- [33]
						1677, -- [34]
						974, -- [35]
						974, -- [36]
						974, -- [37]
						808, -- [38]
						588, -- [39]
						588, -- [40]
						588, -- [41]
						477, -- [42]
						477, -- [43]
						477, -- [44]
						0, -- [45]
					},
					["KilledBy"] = "瞬狱影杀阵-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"MISC", -- [45]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
					},
					["Messages"] = {
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -76 (Shadow)", -- [1]
						"特变电工 重伤 (伤害/跳) 瞬狱影杀阵-逐风者 Absorb -85 (85 被吸收) (Physical)", -- [2]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -180 (Shadow)", -- [3]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -63 (Shadow)", -- [4]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -102 (Shadow)", -- [5]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -147 (Shadow)", -- [6]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -102 (Shadow)", -- [7]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -147 (Shadow)", -- [8]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -102 (Shadow)", -- [9]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -102 (Shadow)", -- [10]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -147 (Shadow)", -- [11]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -141 (Shadow)", -- [12]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -147 (Shadow)", -- [13]
						"特变电工死亡。", -- [14]
					},
					["DeathAt"] = 17647.557,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
					},
					["MessageTimes"] = {
						-13.5010000000002, -- [1]
						-13.0010000000002, -- [2]
						-12.0010000000002, -- [3]
						-11.5010000000002, -- [4]
						-9.501000000000204, -- [5]
						-8.984000000000378, -- [6]
						-7.501000000000204, -- [7]
						-6.001000000000204, -- [8]
						-5.501000000000204, -- [9]
						-3.516999999999825, -- [10]
						-2.984000000000378, -- [11]
						-1.501000000000204, -- [12]
						0, -- [13]
						0, -- [14]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
					},
					["Health"] = {
						714, -- [1]
						638, -- [2]
						638, -- [3]
						458, -- [4]
						443, -- [5]
						341, -- [6]
						242, -- [7]
						349, -- [8]
						202, -- [9]
						308, -- [10]
						206, -- [11]
						267, -- [12]
						126, -- [13]
						0, -- [14]
					},
					["KilledBy"] = "逐风者卡巴-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"MISC", -- [14]
					},
				}, -- [4]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						false, -- [28]
						false, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						false, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						false, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						true, -- [47]
						true, -- [48]
						true, -- [49]
					},
					["Messages"] = {
						"不会假死-逐风者 摔绊 特变电工 Hit -14 (Physical)", -- [1]
						"不会假死-逐风者 肉搏 特变电工 Hit -196 (Physical)", -- [2]
						"拉克西里 肉搏 特变电工 Hit -52 (Physical)", -- [3]
						"克鲁霍姆 肉搏 特变电工 Hit -63 (Physical)", -- [4]
						"拉克西里 爪击 特变电工 Dodge (Physical)", -- [5]
						"特变电工 肉搏 不会假死-逐风者 Hit -338 (Physical)", -- [6]
						"逐风者卡巴-逐风者 献祭 特变电工 Crit -651 (Fire)", -- [7]
						"特变电工 致死打击 不会假死-逐风者 Hit -517 (Physical)", -- [8]
						"克鲁霍姆 肉搏 特变电工 Hit -74 (Physical)", -- [9]
						"依卤-黑龙费尔默 多重射击 特变电工 Hit -261 (Physical)", -- [10]
						"克鲁霍姆 肉搏 特变电工 Hit -77 (Physical)", -- [11]
						"依卤-黑龙费尔默 自动射击 特变电工 Hit -192 (Physical)", -- [12]
						"逐风者卡巴-逐风者 献祭 (伤害/跳) 特变电工 Tick -134 (Fire)", -- [13]
						"猎蝶兽兽-黑龙费尔默 多重射击 特变电工 Hit -301 (Physical)", -- [14]
						"依卤-黑龙费尔默 奥术射击 特变电工 Hit -156 (47 被抵抗) (Arcane)", -- [15]
						"特变电工 拦截昏迷 逐风者卡巴-逐风者 Hit -72 (Physical)", -- [16]
						"克鲁霍姆 肉搏 特变电工 Hit -57 (Physical)", -- [17]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -180 (Shadow)", -- [18]
						"依卤-黑龙费尔默 自动射击 特变电工 Hit -188 (Physical)", -- [19]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -76 (Shadow)", -- [20]
						"特变电工 肉搏 逐风者卡巴-逐风者 Hit -610 (Physical)", -- [21]
						"逐风者卡巴-逐风者 献祭 (伤害/跳) 特变电工 Tick -134 (Fire)", -- [22]
						"特变电工 致死打击 逐风者卡巴-逐风者 Hit -716 (Physical)", -- [23]
						"克鲁霍姆 肉搏 特变电工 Hit -64 (Physical)", -- [24]
						"依卤-黑龙费尔默 自动射击 特变电工 Hit -193 (Physical)", -- [25]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -76 (Shadow)", -- [26]
						"特变电工 旋风斩 克鲁霍姆 Dodge (Physical)", -- [27]
						"特变电工 旋风斩 豹 Crit -784 (Physical)", -- [28]
						"特变电工 旋风斩 逐风者卡巴-逐风者 Hit -550 (Physical)", -- [29]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -180 (Shadow)", -- [30]
						"豹 肉搏 特变电工 Hit -55 (Physical)", -- [31]
						"豹 爪击 特变电工 Hit -29 (Physical)", -- [32]
						"克鲁霍姆 肉搏 特变电工 Hit -67 (Physical)", -- [33]
						"逐风者卡巴-逐风者 献祭 (伤害/跳) 特变电工 Tick -133 (Fire)", -- [34]
						"特变电工 肉搏 逐风者卡巴-逐风者 Hit -614 (Physical)", -- [35]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -76 (Shadow)", -- [36]
						"豹 肉搏 特变电工 Hit -50 (Physical)", -- [37]
						"依卤-黑龙费尔默 自动射击 特变电工 Hit -192 (Physical)", -- [38]
						"豹 爪击 特变电工 Hit -23 (Physical)", -- [39]
						"特变电工 重伤 (伤害/跳) 豹 Tick -118 (Physical)", -- [40]
						"克鲁霍姆 肉搏 特变电工 Hit -58 (Physical)", -- [41]
						"豹 肉搏 特变电工 Dodge (1)", -- [42]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -180 (Shadow)", -- [43]
						"逐风者卡巴-逐风者 恐惧术 特变电工 Immune (Shadow)", -- [44]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 特变电工 Tick -77 (Shadow)", -- [45]
						"依卤-黑龙费尔默 奥术射击 特变电工 Hit -207 (Arcane)", -- [46]
						"豹 爪击 特变电工 Hit -24 (Physical)", -- [47]
						"猎蝶兽兽-黑龙费尔默 自动射击 特变电工 Crit -507 (Physical)", -- [48]
						"特变电工死亡。", -- [49]
					},
					["DeathAt"] = 17551.568,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
					},
					["MessageTimes"] = {
						-13.96399999999994, -- [1]
						-13.84800000000178, -- [2]
						-13.59800000000178, -- [3]
						-13.59800000000178, -- [4]
						-12.78099999999904, -- [5]
						-12.09800000000178, -- [6]
						-11.96399999999994, -- [7]
						-11.88100000000122, -- [8]
						-11.59700000000157, -- [9]
						-9.33100000000195, -- [10]
						-9.229999999999563, -- [11]
						-9.114000000001397, -- [12]
						-8.963999999999942, -- [13]
						-8.880000000001019, -- [14]
						-7.681000000000495, -- [15]
						-7.230999999999767, -- [16]
						-7.213999999999942, -- [17]
						-6.880000000001019, -- [18]
						-6.746999999999389, -- [19]
						-6.380000000001019, -- [20]
						-6.229999999999563, -- [21]
						-5.963999999999942, -- [22]
						-5.897000000000844, -- [23]
						-5.197000000000116, -- [24]
						-4.430000000000291, -- [25]
						-4.380000000001019, -- [26]
						-4.380000000001019, -- [27]
						-4.380000000001019, -- [28]
						-4.380000000001019, -- [29]
						-3.880000000001019, -- [30]
						-3.779999999998836, -- [31]
						-3.479999999999563, -- [32]
						-3.197000000000116, -- [33]
						-2.979999999999563, -- [34]
						-2.413000000000466, -- [35]
						-2.380000000001019, -- [36]
						-2.380000000001019, -- [37]
						-1.962999999999738, -- [38]
						-1.847000000001572, -- [39]
						-1.363000000001193, -- [40]
						-1.197000000000116, -- [41]
						-0.9629999999997381, -- [42]
						-0.8800000000010186, -- [43]
						-0.4799999999995634, -- [44]
						-0.3800000000010186, -- [45]
						-0.2799999999988359, -- [46]
						-0.2129999999997381, -- [47]
						-0.02999999999883585, -- [48]
						0, -- [49]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
						4969, -- [40]
						4969, -- [41]
						4969, -- [42]
						4969, -- [43]
						4969, -- [44]
						4969, -- [45]
						4969, -- [46]
						4969, -- [47]
						4969, -- [48]
						4969, -- [49]
					},
					["Health"] = {
						4689, -- [1]
						4675, -- [2]
						4479, -- [3]
						4479, -- [4]
						4364, -- [5]
						4364, -- [6]
						4364, -- [7]
						3713, -- [8]
						3713, -- [9]
						3639, -- [10]
						3378, -- [11]
						3378, -- [12]
						3109, -- [13]
						2975, -- [14]
						2674, -- [15]
						2518, -- [16]
						2518, -- [17]
						2461, -- [18]
						2281, -- [19]
						2093, -- [20]
						2017, -- [21]
						2017, -- [22]
						1883, -- [23]
						1883, -- [24]
						1819, -- [25]
						1626, -- [26]
						1626, -- [27]
						1626, -- [28]
						1626, -- [29]
						1550, -- [30]
						1370, -- [31]
						1315, -- [32]
						1286, -- [33]
						1219, -- [34]
						1086, -- [35]
						1086, -- [36]
						1010, -- [37]
						960, -- [38]
						768, -- [39]
						745, -- [40]
						745, -- [41]
						687, -- [42]
						687, -- [43]
						507, -- [44]
						507, -- [45]
						430, -- [46]
						223, -- [47]
						199, -- [48]
						0, -- [49]
					},
					["KilledBy"] = "猎蝶兽兽-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"MISC", -- [49]
					},
				}, -- [5]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
					},
					["Messages"] = {
						"不会假死-逐风者 毒蛇钉刺 (伤害/跳) 特变电工 Tick -113 (Nature)", -- [1]
						"特变电工 重伤 (伤害/跳) 索德斯吶 Tick -83 (Physical)", -- [2]
						"不会假死-逐风者 奥术射击 特变电工 Hit -218 (Arcane)", -- [3]
						"特变电工 拦截昏迷 索德斯吶 Hit -56 (Physical)", -- [4]
						"拉克西里 肉搏 特变电工 Hit -64 (Physical)", -- [5]
						"特变电工 肉搏 索德斯吶 Hit -387 (Physical)", -- [6]
						"不会假死-逐风者 毒蛇钉刺 (伤害/跳) 特变电工 Tick -113 (Nature)", -- [7]
						"特变电工 致死打击 索德斯吶 Hit -545 (Physical)", -- [8]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -85 (Shadow)", -- [9]
						"特变电工 重伤 (伤害/跳) 索德斯吶 Tick -84 (Physical)", -- [10]
						"拉克西里 爪击 特变电工 Hit -45 (Physical)", -- [11]
						"拉克西里 肉搏 特变电工 Miss (1)", -- [12]
						"特变电工 旋风斩 拉克西里 Hit -299 (Physical)", -- [13]
						"特变电工 旋风斩 索德斯吶 Crit -957 (Physical)", -- [14]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -86 (Shadow)", -- [15]
						"拉克西里 撕咬 特变电工 Hit -84 (Physical)", -- [16]
						"拉克西里 肉搏 特变电工 Hit -57 (Physical)", -- [17]
						"不会假死-逐风者 毒蛇钉刺 (伤害/跳) 特变电工 Tick -113 (Nature)", -- [18]
						"索德斯吶 恐惧术 特变电工 Immune (Shadow)", -- [19]
						"特变电工 肉搏 索德斯吶 Hit -417 (Physical)", -- [20]
						"特变电工 战士的决心 特变电工 Hit +95", -- [21]
						"拉克西里 爪击 特变电工 Hit -47 (Physical)", -- [22]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -86 (Shadow)", -- [23]
						"拉克西里 肉搏 特变电工 Hit -59 (Physical)", -- [24]
						"特变电工 斩杀 索德斯吶 Hit -794 (Physical)", -- [25]
						"拉克西里 爪击 特变电工 Hit -43 (Physical)", -- [26]
						"拉克西里 肉搏 特变电工 Hit -56 (Physical)", -- [27]
						"不会假死-逐风者 自动射击 特变电工 Hit -228 (Physical)", -- [28]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -86 (Shadow)", -- [29]
						"拉克西里 肉搏 特变电工 Hit -64 (Physical)", -- [30]
						"不会假死-逐风者 自动射击 特变电工 Crit -542 (Physical)", -- [31]
						"拉克西里 爪击 特变电工 Hit -42 (Physical)", -- [32]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -158 (Shadow)", -- [33]
						"不会假死-逐风者 驱散射击 特变电工 Hit -117 (Physical)", -- [34]
						"不会假死-逐风者 毒蛇钉刺 (伤害/跳) 特变电工 Tick -114 (Nature)", -- [35]
						"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -158 (Shadow)", -- [36]
						"拉克西里 肉搏 特变电工 Miss (1)", -- [37]
						"不会假死-逐风者 多重射击 特变电工 Crit -961 (Physical)", -- [38]
						"不会假死-逐风者 自动射击 特变电工 Hit -251 (Physical)", -- [39]
						"特变电工死亡。", -- [40]
					},
					["DeathAt"] = 17493.564,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
					},
					["MessageTimes"] = {
						-14.75, -- [1]
						-14.23400000000038, -- [2]
						-13.08400000000256, -- [3]
						-12.70000000000073, -- [4]
						-12.45000000000073, -- [5]
						-11.78399999999965, -- [6]
						-11.76699999999983, -- [7]
						-11.68400000000111, -- [8]
						-11.43400000000111, -- [9]
						-11.23400000000038, -- [10]
						-10.8169999999991, -- [11]
						-10.43400000000111, -- [12]
						-10.18400000000111, -- [13]
						-10.18400000000111, -- [14]
						-9.433000000000902, -- [15]
						-9.217000000000553, -- [16]
						-8.933000000000902, -- [17]
						-8.75, -- [18]
						-8.66700000000128, -- [19]
						-8.016999999999825, -- [20]
						-8, -- [21]
						-7.583000000002357, -- [22]
						-7.433000000000902, -- [23]
						-7.433000000000902, -- [24]
						-7.167000000001281, -- [25]
						-5.983000000000175, -- [26]
						-5.916000000001077, -- [27]
						-5.566999999999098, -- [28]
						-5.433000000000902, -- [29]
						-4.400000000001455, -- [30]
						-4.38300000000163, -- [31]
						-4.363000000001193, -- [32]
						-3.433000000000902, -- [33]
						-3, -- [34]
						-2.816000000002532, -- [35]
						-1.433000000000902, -- [36]
						-0.6160000000018044, -- [37]
						-0.2160000000003493, -- [38]
						0, -- [39]
						0, -- [40]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
						4969, -- [40]
					},
					["Health"] = {
						3770, -- [1]
						3657, -- [2]
						3657, -- [3]
						3439, -- [4]
						3439, -- [5]
						3375, -- [6]
						3375, -- [7]
						3262, -- [8]
						3262, -- [9]
						3177, -- [10]
						3177, -- [11]
						3132, -- [12]
						3132, -- [13]
						3132, -- [14]
						3132, -- [15]
						3046, -- [16]
						2962, -- [17]
						2905, -- [18]
						2792, -- [19]
						2792, -- [20]
						2792, -- [21]
						2887, -- [22]
						2840, -- [23]
						2754, -- [24]
						2695, -- [25]
						2695, -- [26]
						2652, -- [27]
						2596, -- [28]
						2368, -- [29]
						2282, -- [30]
						2282, -- [31]
						1676, -- [32]
						1634, -- [33]
						1476, -- [34]
						1359, -- [35]
						1245, -- [36]
						1087, -- [37]
						1087, -- [38]
						126, -- [39]
						0, -- [40]
					},
					["KilledBy"] = "不会假死-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"HEAL", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"MISC", -- [40]
					},
				}, -- [6]
			},
			["TimeLast"] = {
				["TimeHeal"] = 17882.556,
				["HealingTaken"] = 17882.556,
				["OVERALL"] = 17922.558,
				["DamageTaken"] = 17922.558,
				["Interrupts"] = 17845.553,
				["DeathCount"] = 17922.558,
				["RageGain"] = 17915.558,
				["HOT_Time"] = 17882.556,
				["TimeDamage"] = 17913.558,
				["Healing"] = 17882.556,
				["ActiveTime"] = 17913.558,
				["DOT_Time"] = 17911.557,
				["Damage"] = 17913.558,
			},
			["LastEventType"] = {
				"HEAL", -- [1]
				"HEAL", -- [2]
				"HEAL", -- [3]
				"HEAL", -- [4]
				"HEAL", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"HEAL", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					16, -- [1]
				},
				["Healing"] = {
					5484, -- [1]
				},
				["DamageTaken"] = {
					38333, -- [1]
				},
				["DeathCount"] = {
					6, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["RageGain"] = {
					269, -- [1]
				},
				["HOT_Time"] = {
					24, -- [1]
				},
				["ActiveTime"] = {
					127.29, -- [1]
				},
				["HealingTaken"] = {
					5484, -- [1]
				},
				["TimeDamage"] = {
					111.29, -- [1]
				},
				["DOT_Time"] = {
					45, -- [1]
				},
				["Damage"] = {
					34938, -- [1]
				},
			},
			["LastHealTime"] = 17882.789,
			["LastDamageTaken"] = 412,
			["level"] = 60,
			["LastDamageAbility"] = "斩杀",
			["LastFightIn"] = 6,
			["GUID"] = "Player-5458-02F6D2A3",
			["type"] = "Self",
			["LastEventHealth"] = {
				1521, -- [1]
				1819, -- [2]
				2069, -- [3]
				2367, -- [4]
				2617, -- [5]
				3253, -- [6]
				2728, -- [7]
				2573, -- [8]
				2485, -- [9]
				1825, -- [10]
				1825, -- [11]
				1617, -- [12]
				1617, -- [13]
				1617, -- [14]
				1530, -- [15]
				1500, -- [16]
				1446, -- [17]
				1446, -- [18]
				1446, -- [19]
				1358, -- [20]
				1358, -- [21]
				1358, -- [22]
				1270, -- [23]
				1183, -- [24]
				1092, -- [25]
				539, -- [26]
				401, -- [27]
				0, -- [28]
				2453, -- [29]
				2453, -- [30]
				2276, -- [31]
				2276, -- [32]
				2276, -- [33]
				2119, -- [34]
				1942, -- [35]
				1250, -- [36]
				1250, -- [37]
				1073, -- [38]
				1073, -- [39]
				988, -- [40]
				812, -- [41]
				775, -- [42]
				752, -- [43]
				723, -- [44]
				723, -- [45]
				723, -- [46]
				723, -- [47]
				723, -- [48]
				973, -- [49]
				1271, -- [50]
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4969, -- [1]
				4969, -- [2]
				4969, -- [3]
				4969, -- [4]
				4969, -- [5]
				4969, -- [6]
				4969, -- [7]
				4969, -- [8]
				4969, -- [9]
				4969, -- [10]
				4969, -- [11]
				4969, -- [12]
				4969, -- [13]
				4969, -- [14]
				4969, -- [15]
				4969, -- [16]
				4969, -- [17]
				4969, -- [18]
				4969, -- [19]
				4969, -- [20]
				4969, -- [21]
				4969, -- [22]
				4969, -- [23]
				4969, -- [24]
				4969, -- [25]
				4969, -- [26]
				4969, -- [27]
				4969, -- [28]
				4969, -- [29]
				4969, -- [30]
				4969, -- [31]
				4969, -- [32]
				4969, -- [33]
				4969, -- [34]
				4969, -- [35]
				4969, -- [36]
				4969, -- [37]
				4969, -- [38]
				4969, -- [39]
				4969, -- [40]
				4969, -- [41]
				4969, -- [42]
				4969, -- [43]
				4969, -- [44]
				4969, -- [45]
				4969, -- [46]
				4969, -- [47]
				4969, -- [48]
				4969, -- [49]
				4969, -- [50]
			},
			["NextEventNum"] = 29,
			["LastDamageTime"] = 17914.358,
			["LastEvents"] = {
				"特变电工 急救 特变电工 Tick +250", -- [1]
				"特变电工 急救 特变电工 Tick +250", -- [2]
				"特变电工 急救 特变电工 Tick +250", -- [3]
				"特变电工 急救 特变电工 Tick +250", -- [4]
				"特变电工 急救 特变电工 Tick +250", -- [5]
				"依卤-黑龙费尔默 奥术射击 特变电工 Hit -188 (Arcane)", -- [6]
				"依卤-黑龙费尔默 自动射击 特变电工 Hit -155 (Physical)", -- [7]
				"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -88 (Nature)", -- [8]
				"依卤-黑龙费尔默 多重射击 特变电工 Crit -660 (Physical)", -- [9]
				"特变电工 拦截昏迷 依卤-黑龙费尔默 Hit -52 (Physical)", -- [10]
				"依卤-黑龙费尔默 奥术射击 特变电工 Hit -208 (Arcane)", -- [11]
				"特变电工 肉搏 依卤-黑龙费尔默 Crit -946 (Physical)", -- [12]
				"特变电工 断筋 依卤-黑龙费尔默 Hit -43 (Physical)", -- [13]
				"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -87 (Nature)", -- [14]
				"豹 爪击 特变电工 Hit -30 (Physical)", -- [15]
				"豹 肉搏 特变电工 Hit -54 (Physical)", -- [16]
				"特变电工 致死打击 依卤-黑龙费尔默 Hit -576 (Physical)", -- [17]
				"特变电工 重伤 (伤害/跳) 依卤-黑龙费尔默 Tick -132 (Physical)", -- [18]
				"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -88 (Nature)", -- [19]
				"特变电工 斩杀 依卤-黑龙费尔默 Hit -547 (Physical)", -- [20]
				"特变电工 肉搏 依卤-黑龙费尔默 Crit -859 (Physical)", -- [21]
				"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -88 (Nature)", -- [22]
				"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -87 (Nature)", -- [23]
				"灵魂摆渡人-逐风者 冰霜新星 特变电工 Hit -91 (Frost)", -- [24]
				"灵魂摆渡人-逐风者 冰锥术 特变电工 Hit -553 (Frost)", -- [25]
				"末日坠落-逐风者 肉搏 特变电工 Hit -138 (Physical)", -- [26]
				"末日坠落-逐风者 斩杀 特变电工 Hit -412 (Physical)", -- [27]
				"特变电工死亡。", -- [28]
				"特变电工 致死打击 索德斯吶 Hit -512 (Physical)", -- [29]
				"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -177 (Shadow)", -- [30]
				"特变电工 肉搏 索德斯吶 Hit -369 (Physical)", -- [31]
				"特变电工 斩杀 索德斯吶 Hit -514 (Physical)", -- [32]
				"索德斯吶 腐蚀术 (伤害/跳) 特变电工 Tick -157 (Shadow)", -- [33]
				"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -177 (Shadow)", -- [34]
				"断水流-黑龙费尔默 旋风斩 特变电工 Crit -692 (Physical)", -- [35]
				"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -177 (Shadow)", -- [36]
				"特变电工 断筋 断水流-黑龙费尔默 Hit -37 (Physical)", -- [37]
				"特变电工 肉搏 断水流-黑龙费尔默 Crit -852 (Physical)", -- [38]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -85 (Physical)", -- [39]
				"索德斯吶 痛苦诅咒 (伤害/跳) 特变电工 Tick -176 (Shadow)", -- [40]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -86 (Physical)", -- [41]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -70 (Physical)", -- [42]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -78 (Physical)", -- [43]
				"特变电工 冲锋击昏 末日坠落-逐风者 Resist (Physical)", -- [44]
				"特变电工 致死打击 末日坠落-逐风者 Crit -688 (Physical)", -- [45]
				"特变电工 肉搏 末日坠落-逐风者 Hit -211 (Physical)", -- [46]
				"特变电工 斩杀 末日坠落-逐风者 Hit -288 (Physical)", -- [47]
				"特变电工 急救 特变电工 Tick +250", -- [48]
				"特变电工 急救 特变电工 Tick +250", -- [49]
				"特变电工 急救 特变电工 Tick +250", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["Name"] = "特变电工",
			["LastEventTimes"] = {
				17878.789, -- [1]
				17879.789, -- [2]
				17880.789, -- [3]
				17881.789, -- [4]
				17882.789, -- [5]
				17897.508, -- [6]
				17906.208, -- [7]
				17907.024, -- [8]
				17907.124, -- [9]
				17907.524, -- [10]
				17907.79, -- [11]
				17908.841, -- [12]
				17908.907, -- [13]
				17910.057, -- [14]
				17910.274, -- [15]
				17910.341, -- [16]
				17910.591, -- [17]
				17911.874, -- [18]
				17913.024, -- [19]
				17913.441, -- [20]
				17914.358, -- [21]
				17916.024, -- [22]
				17919.025, -- [23]
				17921.141, -- [24]
				17922.758, -- [25]
				17922.875, -- [26]
				17923.325, -- [27]
				17923.341, -- [28]
				17851.404, -- [29]
				17852.221, -- [30]
				17852.887, -- [31]
				17853.07, -- [32]
				17853.721, -- [33]
				17854.221, -- [34]
				17854.321, -- [35]
				17856.221, -- [36]
				17856.221, -- [37]
				17856.704, -- [38]
				17857.354, -- [39]
				17858.221, -- [40]
				17860.354, -- [41]
				17863.354, -- [42]
				17866.338, -- [43]
				17867.488, -- [44]
				17868.822, -- [45]
				17869.005, -- [46]
				17870.355, -- [47]
				17875.789, -- [48]
				17876.808, -- [49]
				17877.789, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Yjw-黑龙费尔默"] = {
									["count"] = 3,
								},
								["末日坠落-逐风者"] = {
									["count"] = 12,
								},
								["索德斯吶"] = {
									["count"] = 12,
								},
								["依卤-黑龙费尔默"] = {
									["count"] = 3,
								},
								["豹"] = {
									["count"] = 3,
								},
								["瞬狱影杀阵-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 45,
						},
					},
					["TimeSpent"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 4.5,
								},
								["急救"] = {
									["count"] = 8.5,
								},
								["治疗药水"] = {
									["count"] = 3,
								},
							},
							["amount"] = 16,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 5.8,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.23,
								},
								["肉搏"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 10.28,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.33,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 4.33,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.22,
								},
								["断筋"] = {
									["count"] = 2.08,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.28,
								},
							},
							["amount"] = 7.08,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.85,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.28,
								},
								["昏迷"] = {
									["count"] = 0.92,
								},
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 1.24,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 5.23,
								},
							},
							["amount"] = 19.02,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.8,
								},
								["肉搏"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 3.78,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.45,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.95,
						},
						["索德斯吶"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.28,
								},
								["拳击"] = {
									["count"] = 2.1,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.53,
								},
								["拦截昏迷"] = {
									["count"] = 5.3,
								},
								["断筋"] = {
									["count"] = 4.52,
								},
								["斩杀"] = {
									["count"] = 2.53,
								},
								["肉搏"] = {
									["count"] = 13.65,
								},
							},
							["amount"] = 35.91,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.34,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.35,
								},
								["肉搏"] = {
									["count"] = 1.68,
								},
							},
							["amount"] = 11.7,
						},
						["Yjw-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.87,
								},
							},
							["amount"] = 7.640000000000001,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 4.05,
						},
						["拉克西里"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 1.05,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 308,
								},
								["急救"] = {
									["count"] = 2000,
								},
								["治疗药水"] = {
									["count"] = 3176,
								},
							},
							["amount"] = 5484,
						},
					},
					["ElementTakenResist"] = {
						["Fire"] = 67,
						["Arcane"] = 47,
					},
					["DeathCount"] = 6,
					["HOT_Time"] = 24,
					["ElementTaken"] = {
						["Frost"] = 1287,
						["Melee"] = 2603,
						["Arcane"] = 1979,
						["Physical"] = 10377,
						["Fire"] = 6830,
						["Shadow"] = 14191,
						["Nature"] = 1066,
					},
					["DOT_Time"] = 45,
					["Damage"] = 34938,
					["TimeHeal"] = 16,
					["ElementDone"] = {
						["Physical"] = 18924,
						["Melee"] = 15800,
						["Fire"] = 214,
					},
					["DamagedWho"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 342,
								},
								["断筋"] = {
									["count"] = 113,
								},
								["旋风斩"] = {
									["count"] = 429,
								},
								["肉搏"] = {
									["count"] = 936,
								},
							},
							["amount"] = 1820,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 716,
								},
								["拦截昏迷"] = {
									["count"] = 72,
								},
								["旋风斩"] = {
									["count"] = 550,
								},
								["肉搏"] = {
									["count"] = 1224,
								},
							},
							["amount"] = 2562,
						},
						["索德斯吶"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1573,
								},
								["拳击"] = {
									["count"] = 82,
								},
								["拦截昏迷"] = {
									["count"] = 210,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 344,
								},
								["旋风斩"] = {
									["count"] = 1929,
								},
								["断筋"] = {
									["count"] = 152,
								},
								["斩杀"] = {
									["count"] = 1986,
								},
								["肉搏"] = {
									["count"] = 6313,
								},
							},
							["amount"] = 12589,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1405,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 132,
								},
								["旋风斩"] = {
									["count"] = 396,
								},
								["拦截昏迷"] = {
									["count"] = 93,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["斩杀"] = {
									["count"] = 1239,
								},
								["肉搏"] = {
									["count"] = 2814,
								},
							},
							["amount"] = 6153,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 64,
								},
								["肉搏"] = {
									["count"] = 1147,
								},
							},
							["amount"] = 1211,
						},
						["诺哈芬"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 352,
								},
							},
							["amount"] = 352,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 30,
								},
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["斩杀"] = {
									["count"] = 431,
								},
								["肉搏"] = {
									["count"] = 664,
								},
							},
							["amount"] = 1167,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 517,
								},
								["断筋"] = {
									["count"] = 30,
								},
								["斩杀"] = {
									["count"] = 503,
								},
								["肉搏"] = {
									["count"] = 963,
								},
							},
							["amount"] = 2013,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 688,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 304,
								},
								["断筋"] = {
									["count"] = 45,
								},
								["斩杀"] = {
									["count"] = 288,
								},
								["肉搏"] = {
									["count"] = 437,
								},
							},
							["amount"] = 1762,
						},
						["Yjw-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1098,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 76,
								},
								["斩杀"] = {
									["count"] = 688,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["铁皮手雷"] = {
									["count"] = 214,
								},
								["肉搏"] = {
									["count"] = 1302,
								},
							},
							["amount"] = 3415,
						},
						["豹"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 118,
								},
								["旋风斩"] = {
									["count"] = 1477,
								},
							},
							["amount"] = 1595,
						},
						["拉克西里"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 299,
								},
							},
							["amount"] = 299,
						},
					},
					["WhoDamaged"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 460,
								},
							},
							["amount"] = 460,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 100,
								},
								["灼烧"] = {
									["count"] = 3386,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 166,
								},
								["魔爆术"] = {
									["count"] = 357,
								},
								["冰锥术"] = {
									["count"] = 454,
								},
							},
							["amount"] = 4463,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 598,
								},
								["献祭"] = {
									["count"] = 976,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2006,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2567,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 801,
								},
							},
							["amount"] = 6948,
						},
						["索德斯吶"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1987,
								},
								["献祭"] = {
									["count"] = 829,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4284,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 99,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 49,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2601,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 672,
								},
							},
							["amount"] = 10521,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 613,
								},
								["奥术射击"] = {
									["count"] = 1174,
								},
								["自动射击"] = {
									["count"] = 1889,
								},
								["多重射击"] = {
									["count"] = 1191,
								},
								["肉搏"] = {
									["count"] = 178,
								},
							},
							["amount"] = 5045,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 453,
								},
								["奥术射击"] = {
									["count"] = 218,
								},
								["摔绊"] = {
									["count"] = 14,
								},
								["多重射击"] = {
									["count"] = 961,
								},
								["自动射击"] = {
									["count"] = 1021,
								},
								["驱散射击"] = {
									["count"] = 117,
								},
								["肉搏"] = {
									["count"] = 196,
								},
							},
							["amount"] = 2980,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 553,
								},
								["冰霜新星"] = {
									["count"] = 91,
								},
							},
							["amount"] = 644,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 692,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 319,
								},
								["拦截昏迷"] = {
									["count"] = 46,
								},
								["断筋"] = {
									["count"] = 29,
								},
								["肉搏"] = {
									["count"] = 573,
								},
							},
							["amount"] = 1659,
						},
						["Yjw-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 89,
								},
								["奥术飞弹"] = {
									["count"] = 230,
								},
							},
							["amount"] = 319,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2359,
								},
							},
							["amount"] = 2359,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 412,
								},
								["肉搏"] = {
									["count"] = 138,
								},
							},
							["amount"] = 550,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 301,
								},
								["自动射击"] = {
									["count"] = 507,
								},
							},
							["amount"] = 808,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 258,
								},
								["肉搏"] = {
									["count"] = 706,
								},
							},
							["amount"] = 964,
						},
						["拉克西里"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 84,
								},
								["爪击"] = {
									["count"] = 177,
								},
								["肉搏"] = {
									["count"] = 352,
								},
							},
							["amount"] = 613,
						},
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 4.5,
								},
								["急救"] = {
									["count"] = 8.5,
								},
								["治疗药水"] = {
									["count"] = 3,
								},
							},
							["amount"] = 16,
						},
					},
					["PartialResist"] = {
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["献祭"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 67,
									["min"] = 67,
									["count"] = 1,
									["amount"] = 67,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 67,
							["amount"] = 5,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["奥术射击"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 47,
									["min"] = 47,
									["count"] = 1,
									["amount"] = 47,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 47,
							["amount"] = 7,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 32,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 32,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 63,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 63,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["反击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["痛苦诅咒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["恐惧术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 38,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 38,
						},
					},
					["PartialAbsorb"] = {
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 32,
									["amount"] = 0,
								},
							},
							["count"] = 32,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 63,
									["amount"] = 0,
								},
							},
							["count"] = 63,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["反击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["痛苦诅咒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["恐惧术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 38,
									["amount"] = 0,
								},
							},
							["count"] = 38,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 127.29,
					["InterruptData"] = {
						["索德斯吶"] = {
							["Details"] = {
								["恐惧术 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["Heals"] = {
						["战士的决心"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 111,
									["min"] = 95,
									["count"] = 3,
									["amount"] = 308,
								},
							},
							["count"] = 3,
							["amount"] = 308,
						},
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 8,
									["amount"] = 2000,
								},
							},
							["count"] = 8,
							["amount"] = 2000,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1613,
									["min"] = 1563,
									["count"] = 2,
									["amount"] = 3176,
								},
							},
							["count"] = 2,
							["amount"] = 3176,
						},
					},
					["Interrupts"] = 1,
					["ElementDoneAbsorb"] = {
						["Physical"] = 170,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 5,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 33,
								},
							},
							["amount"] = 38,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 37,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 53,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 13,
								},
							},
							["amount"] = 25,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 97,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 103,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
					},
					["Healing"] = 5484,
					["DamageTaken"] = 38333,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 80,
								},
								["冲锋"] = {
									["count"] = 189,
								},
							},
							["amount"] = 269,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1098,
									["min"] = 688,
									["count"] = 2,
									["amount"] = 1786,
								},
								["Hit"] = {
									["max"] = 716,
									["min"] = 395,
									["count"] = 8,
									["amount"] = 4211,
								},
							},
							["count"] = 11,
							["amount"] = 5997,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 85,
									["min"] = 85,
									["count"] = 2,
									["amount"] = 170,
								},
								["Tick"] = {
									["max"] = 132,
									["min"] = 76,
									["count"] = 13,
									["amount"] = 1146,
								},
							},
							["count"] = 15,
							["amount"] = 1316,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 41,
									["min"] = 41,
									["count"] = 2,
									["amount"] = 82,
								},
							},
							["count"] = 2,
							["amount"] = 82,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 214,
									["min"] = 214,
									["count"] = 1,
									["amount"] = 214,
								},
							},
							["count"] = 1,
							["amount"] = 214,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 72,
									["min"] = 41,
									["count"] = 8,
									["amount"] = 417,
								},
							},
							["count"] = 8,
							["amount"] = 417,
						},
						["昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["嘲讽"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 972,
									["min"] = 784,
									["count"] = 3,
									["amount"] = 2713,
								},
								["Hit"] = {
									["max"] = 550,
									["min"] = 299,
									["count"] = 7,
									["amount"] = 2719,
								},
							},
							["count"] = 11,
							["amount"] = 5432,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 77,
									["min"] = 45,
									["count"] = 2,
									["amount"] = 122,
								},
								["Hit"] = {
									["max"] = 43,
									["min"] = 27,
									["count"] = 12,
									["amount"] = 423,
								},
							},
							["count"] = 15,
							["amount"] = 545,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 794,
									["min"] = 288,
									["count"] = 9,
									["amount"] = 5135,
								},
							},
							["count"] = 9,
							["amount"] = 5135,
						},
						["肉搏"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 947,
									["min"] = 664,
									["count"] = 8,
									["amount"] = 6904,
								},
								["Hit"] = {
									["max"] = 614,
									["min"] = 211,
									["count"] = 23,
									["amount"] = 8896,
								},
							},
							["count"] = 32,
							["amount"] = 15800,
						},
					},
					["RageGain"] = 269,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 189,
								},
							},
							["amount"] = 189,
						},
					},
					["TimeDamage"] = 111.29,
					["TimeDamaging"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 5.8,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.23,
								},
								["肉搏"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 10.28,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.33,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 4.33,
						},
						["索德斯吶"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3.28,
								},
								["拳击"] = {
									["count"] = 2.1,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.53,
								},
								["拦截昏迷"] = {
									["count"] = 5.3,
								},
								["断筋"] = {
									["count"] = 4.52,
								},
								["斩杀"] = {
									["count"] = 2.53,
								},
								["肉搏"] = {
									["count"] = 13.65,
								},
							},
							["amount"] = 35.91,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.85,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.28,
								},
								["昏迷"] = {
									["count"] = 0.92,
								},
								["嘲讽"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 1.24,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 5.23,
								},
							},
							["amount"] = 19.02,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.8,
								},
								["肉搏"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 3.78,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.45,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.95,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.22,
								},
								["断筋"] = {
									["count"] = 2.08,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.28,
								},
							},
							["amount"] = 7.08,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.34,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.35,
								},
								["肉搏"] = {
									["count"] = 1.68,
								},
							},
							["amount"] = 11.7,
						},
						["Yjw-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.2,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.87,
								},
							},
							["amount"] = 7.640000000000001,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 4.05,
						},
						["拉克西里"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 1.05,
						},
					},
					["HealingTaken"] = 5484,
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 308,
								},
								["急救"] = {
									["count"] = 2000,
								},
								["治疗药水"] = {
									["count"] = 3176,
								},
							},
							["amount"] = 5484,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 46,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 13,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 76,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 23,
								},
							},
							["amount"] = 32,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 17423.559,
			["LastActive"] = 17922.558,
		},
		["野猪 <流星云-逐风者>"] = {
			["GUID"] = "Pet-0-5427-489-10341-16117-010134445D",
			["LastEventHealth"] = {
				2983, -- [1]
				2983, -- [2]
				3174, -- [3]
				3174, -- [4]
				3174, -- [5]
				3174, -- [6]
				3174, -- [7]
				3174, -- [8]
				3174, -- [9]
				3174, -- [10]
				3174, -- [11]
				2948, -- [12]
				3174, -- [13]
				3174, -- [14]
				3174, -- [15]
			},
			["LastAttackedBy"] = "末日坠落-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
			},
			["TimeWindows"] = {
				["Damage"] = {
					754, -- [1]
				},
				["TimeDamage"] = {
					10.52, -- [1]
				},
				["DamageTaken"] = {
					835, -- [1]
				},
				["ActiveTime"] = {
					10.52, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "野猪",
			["level"] = 1,
			["LastDamageAbility"] = "雷霆一击",
			["LastFightIn"] = 6,
			["type"] = "Pet",
			["ownerName"] = "流星云-逐风者",
			["LastEventHealthMax"] = {
				3174, -- [1]
				3174, -- [2]
				3174, -- [3]
				3174, -- [4]
				3174, -- [5]
				3174, -- [6]
				3174, -- [7]
				3174, -- [8]
				3174, -- [9]
				3174, -- [10]
				3174, -- [11]
				3174, -- [12]
				3174, -- [13]
				3174, -- [14]
				3174, -- [15]
			},
			["LastDamageTaken"] = 54,
			["TimeLast"] = {
				["ActiveTime"] = 17908.557,
				["TimeDamage"] = 17908.557,
				["OVERALL"] = 17908.557,
				["DamageTaken"] = 17864.555,
				["Damage"] = 17908.557,
			},
			["NextEventNum"] = 16,
			["LastDamageTime"] = 17909.041,
			["LastEvents"] = {
				"拉克西里 肉搏 野猪 <流星云-逐风者> Hit -55 (Physical)", -- [1]
				"克鲁霍姆 肉搏 野猪 <流星云-逐风者> Hit -64 (Physical)", -- [2]
				"野猪 <流星云-逐风者> 肉搏 末日坠落-逐风者 Hit -44 (Physical)", -- [3]
				"野猪 <流星云-逐风者> 撕咬 末日坠落-逐风者 Hit -38 (Physical)", -- [4]
				"野猪 <流星云-逐风者> 肉搏 索德斯吶 Hit -92 (Physical)", -- [5]
				"野猪 <流星云-逐风者> 撕咬 索德斯吶 Hit -69 (Physical)", -- [6]
				"野猪 <流星云-逐风者> 肉搏 索德斯吶 Crit -180 (Physical)", -- [7]
				"野猪 <流星云-逐风者> 肉搏 索德斯吶 Hit -88 (Physical)", -- [8]
				"野猪 <流星云-逐风者> 肉搏 索德斯吶 Hit -92 (Physical)", -- [9]
				"野猪 <流星云-逐风者> 肉搏 索德斯吶 Hit -79 (Physical)", -- [10]
				"依卤-黑龙费尔默 多重射击 野猪 <流星云-逐风者> Hit -226 (Physical)", -- [11]
				"断水流-黑龙费尔默 肉搏 野猪 <流星云-逐风者> Crit -436 (Physical)", -- [12]
				"末日坠落-逐风者 雷霆一击 野猪 <流星云-逐风者> Hit -54 (Physical)", -- [13]
				"野猪 <流星云-逐风者> 肉搏 依卤-黑龙费尔默 Hit -72 (Physical)", -- [14]
				"野猪 <流星云-逐风者> 撕咬 依卤-黑龙费尔默 Miss (Physical)", -- [15]
			},
			["Name"] = "野猪",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
			},
			["LastEventTimes"] = {
				17527.932, -- [1]
				17527.932, -- [2]
				17644.423, -- [3]
				17644.44, -- [4]
				17764.981, -- [5]
				17764.981, -- [6]
				17766.982, -- [7]
				17768.982, -- [8]
				17770.982, -- [9]
				17772.982, -- [10]
				17774.032, -- [11]
				17777.249, -- [12]
				17864.588, -- [13]
				17909.041, -- [14]
				17909.041, -- [15]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["DamagedWho"] = {
						["索德斯吶"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 69,
								},
								["肉搏"] = {
									["count"] = 531,
								},
							},
							["amount"] = 600,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 72,
								},
							},
							["amount"] = 72,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 38,
								},
								["肉搏"] = {
									["count"] = 44,
								},
							},
							["amount"] = 82,
						},
					},
					["ElementDone"] = {
						["Melee"] = 647,
						["Physical"] = 107,
					},
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 69,
									["min"] = 38,
									["count"] = 2,
									["amount"] = 107,
								},
							},
							["count"] = 3,
							["amount"] = 107,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 180,
									["min"] = 180,
									["count"] = 1,
									["amount"] = 180,
								},
								["Hit"] = {
									["max"] = 92,
									["min"] = 44,
									["count"] = 6,
									["amount"] = 467,
								},
							},
							["count"] = 7,
							["amount"] = 647,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 835,
					["TimeSpent"] = {
						["索德斯吶"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
					},
					["PartialResist"] = {
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["TimeDamaging"] = {
						["索德斯吶"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 7.5,
								},
							},
							["amount"] = 7.5,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
					},
					["PartialAbsorb"] = {
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 10.52,
					["WhoDamaged"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 64,
								},
							},
							["amount"] = 64,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 54,
								},
							},
							["amount"] = 54,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 436,
								},
							},
							["amount"] = 436,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 226,
								},
							},
							["amount"] = 226,
						},
						["拉克西里"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 55,
								},
							},
							["amount"] = 55,
						},
					},
					["ElementTaken"] = {
						["Melee"] = 555,
						["Physical"] = 280,
					},
					["TimeDamage"] = 10.52,
					["Damage"] = 754,
				},
			},
			["UnitLockout"] = 17527.566,
			["LastActive"] = 17908.557,
		},
		["观自在-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02ECD045",
			["LastEventHealth"] = {
				3570, -- [1]
				3570, -- [2]
				3570, -- [3]
				3570, -- [4]
				3570, -- [5]
				3570, -- [6]
				3570, -- [7]
				3570, -- [8]
				3570, -- [9]
				3570, -- [10]
				3570, -- [11]
				3570, -- [12]
				3570, -- [13]
				3570, -- [14]
				3467, -- [15]
				3419, -- [16]
				3419, -- [17]
				3419, -- [18]
				3419, -- [19]
				3333, -- [20]
				3263, -- [21]
				3098, -- [22]
				3113, -- [23]
				3113, -- [24]
				3113, -- [25]
				3113, -- [26]
			},
			["LastAttackedBy"] = "拉克西里",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"MISC", -- [16]
				"MISC", -- [17]
				"MISC", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					16.05, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["Dispels"] = {
					1, -- [1]
				},
				["DamageTaken"] = {
					2086, -- [1]
				},
				["Absorbs"] = {
					1645, -- [1]
				},
				["HealingTaken"] = {
					1645, -- [1]
				},
				["TimeDamage"] = {
					1.5, -- [1]
				},
				["ActiveTime"] = {
					17.55, -- [1]
				},
				["Damage"] = {
					177, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "观自在-火妖鲁西弗隆",
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 7,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				3570, -- [1]
				3570, -- [2]
				3570, -- [3]
				3570, -- [4]
				3570, -- [5]
				3570, -- [6]
				3570, -- [7]
				3570, -- [8]
				3570, -- [9]
				3570, -- [10]
				3570, -- [11]
				3570, -- [12]
				3570, -- [13]
				3570, -- [14]
				3570, -- [15]
				3570, -- [16]
				3570, -- [17]
				3570, -- [18]
				3570, -- [19]
				3570, -- [20]
				3570, -- [21]
				3570, -- [22]
				3570, -- [23]
				3570, -- [24]
				3570, -- [25]
				3570, -- [26]
			},
			["LastHealTime"] = 17944.66,
			["LastDamageTaken"] = 65,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 17944.56,
				["Dispelled"] = 17905.557,
				["Dispels"] = 17905.557,
				["OVERALL"] = 17944.56,
				["DamageTaken"] = 17944.56,
				["Absorbs"] = 17944.56,
				["HealingTaken"] = 17944.56,
				["TimeDamage"] = 17903.557,
				["ActiveTime"] = 17944.56,
				["Damage"] = 17903.557,
			},
			["NextEventNum"] = 27,
			["LastDamageTime"] = 17903.89,
			["LastEvents"] = {
				"Environment Falling 观自在-火妖鲁西弗隆 Hit -88 (Physical)", -- [1]
				"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 观自在-火妖鲁西弗隆 Absorb -74 (74 被吸收) (Nature)", -- [2]
				"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 观自在-火妖鲁西弗隆 Absorb -74 (74 被吸收) (Nature)", -- [3]
				"风蛇 闪电吐息 观自在-火妖鲁西弗隆 Absorb -52 (52 被吸收) (Nature)", -- [4]
				"Environment Falling 观自在-火妖鲁西弗隆 Hit -31 (Physical)", -- [5]
				"不会假死-逐风者 奥术射击 观自在-火妖鲁西弗隆 Absorb -199 (199 被吸收) (Arcane)", -- [6]
				"不会假死-逐风者 自动射击 观自在-火妖鲁西弗隆 Absorb -333 (333 被吸收) (Physical)", -- [7]
				"拉克西里 肉搏 观自在-火妖鲁西弗隆 Absorb -71 (71 被吸收) (1)", -- [8]
				"拉克西里 爪击 观自在-火妖鲁西弗隆 Absorb -48 (48 被吸收) (Physical)", -- [9]
				"索德斯吶 痛苦诅咒 (伤害/跳) 观自在-火妖鲁西弗隆 Absorb -49 (49 被吸收) (Shadow)", -- [10]
				"观自在-火妖鲁西弗隆 冰霜新星 断水流-黑龙费尔默 Hit -92 (Frost)", -- [11]
				"观自在-火妖鲁西弗隆 冰霜新星 拉克西里 Hit -85 (Frost)", -- [12]
				"索德斯吶 肉搏 观自在-火妖鲁西弗隆 Absorb -137 (1)", -- [13]
				"索德斯吶 献祭 观自在-火妖鲁西弗隆 Hit -103 (137 被吸收) (Fire)", -- [14]
				"索德斯吶 痛苦诅咒 (伤害/跳) 观自在-火妖鲁西弗隆 Tick -48 (Shadow)", -- [15]
				"诺哈芬 dispels 观自在-火妖鲁西弗隆 诺格弗格药剂 (吞噬魔法)", -- [16]
				"观自在-火妖鲁西弗隆 dispels 观自在-火妖鲁西弗隆 痛苦诅咒 (解除次级诅咒)", -- [17]
				"观自在-火妖鲁西弗隆 dispels 观自在-火妖鲁西弗隆 痛苦诅咒 (解除次级诅咒)", -- [18]
				"索德斯吶 献祭 (伤害/跳) 观自在-火妖鲁西弗隆 Tick -86 (Fire)", -- [19]
				"索德斯吶 献祭 (伤害/跳) 观自在-火妖鲁西弗隆 Tick -85 (Fire)", -- [20]
				"依卤-黑龙费尔默 自动射击 观自在-火妖鲁西弗隆 Absorb -239 (239 被吸收) (Physical)", -- [21]
				"拉克西里 肉搏 观自在-火妖鲁西弗隆 Absorb -67 (67 被吸收) (1)", -- [22]
				"拉克西里 爪击 观自在-火妖鲁西弗隆 Absorb -105 (105 被吸收) (Physical)", -- [23]
				"拉克西里 肉搏 观自在-火妖鲁西弗隆 Absorb -70 (70 被吸收) (1)", -- [24]
				"拉克西里 爪击 观自在-火妖鲁西弗隆 Absorb -62 (62 被吸收) (Physical)", -- [25]
				"拉克西里 肉搏 观自在-火妖鲁西弗隆 Absorb -65 (65 被吸收) (1)", -- [26]
			},
			["Name"] = "观自在-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
			},
			["LastEventTimes"] = {
				17557.801, -- [1]
				17614.421, -- [2]
				17617.422, -- [3]
				17617.722, -- [4]
				17668.509, -- [5]
				17900.307, -- [6]
				17902.424, -- [7]
				17902.573, -- [8]
				17903.374, -- [9]
				17903.857, -- [10]
				17903.89, -- [11]
				17903.89, -- [12]
				17905.257, -- [13]
				17905.257, -- [14]
				17905.857, -- [15]
				17906.208, -- [16]
				17906.39, -- [17]
				17906.39, -- [18]
				17908.274, -- [19]
				17911.274, -- [20]
				17912.074, -- [21]
				17940.593, -- [22]
				17941.409, -- [23]
				17942.626, -- [24]
				17943.026, -- [25]
				17944.66, -- [26]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["观自在-火妖鲁西弗隆"] = {
									["max"] = 105,
									["min"] = 62,
									["count"] = 5,
									["amount"] = 369,
								},
							},
							["count"] = 5,
							["amount"] = 369,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 369,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 369,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 202,
						["Physical"] = 167,
					},
					["ElementTaken"] = {
						["Melee"] = 202,
						["Physical"] = 167,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 5.42,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["爪击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 105,
									["min"] = 62,
									["count"] = 2,
									["amount"] = 167,
								},
							},
							["count"] = 2,
							["amount"] = 167,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 70,
									["min"] = 65,
									["count"] = 3,
									["amount"] = 202,
								},
							},
							["count"] = 3,
							["amount"] = 202,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["拉克西里"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 167,
								},
								["肉搏"] = {
									["count"] = 202,
								},
							},
							["amount"] = 369,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 5.42,
								},
							},
							["amount"] = 5.42,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 369,
								},
							},
							["amount"] = 369,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 5.42,
								},
							},
							["amount"] = 5.42,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 105,
									["min"] = 62,
									["count"] = 5,
									["amount"] = 369,
								},
							},
							["count"] = 5,
							["amount"] = 369,
						},
					},
					["WhoHealed"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 369,
								},
							},
							["amount"] = 369,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 5.42,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 369,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 14.55,
								},
								["法力护盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 16.05,
						},
					},
					["Dispelled"] = 2,
					["TimeSpent"] = {
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 14.55,
								},
								["法力护盾"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 16.05,
						},
					},
					["DamageTaken"] = 2086,
					["PartialResist"] = {
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["DispelledWho"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["献祭"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 137,
									["min"] = 137,
									["count"] = 1,
									["amount"] = 137,
								},
							},
							["count"] = 1,
							["amount"] = 137,
						},
						["闪电吐息"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 52,
									["min"] = 52,
									["count"] = 1,
									["amount"] = 52,
								},
							},
							["count"] = 1,
							["amount"] = 52,
						},
						["自动射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 333,
									["min"] = 239,
									["count"] = 2,
									["amount"] = 572,
								},
							},
							["count"] = 2,
							["amount"] = 572,
						},
						["爪击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 105,
									["min"] = 48,
									["count"] = 3,
									["amount"] = 215,
								},
							},
							["count"] = 3,
							["amount"] = 215,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 74,
									["min"] = 74,
									["count"] = 2,
									["amount"] = 148,
								},
							},
							["count"] = 2,
							["amount"] = 148,
						},
						["奥术射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 199,
									["min"] = 199,
									["count"] = 1,
									["amount"] = 199,
								},
							},
							["count"] = 1,
							["amount"] = 199,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 49,
									["min"] = 49,
									["count"] = 1,
									["amount"] = 49,
								},
							},
							["count"] = 2,
							["amount"] = 49,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 71,
									["min"] = 65,
									["count"] = 4,
									["amount"] = 273,
								},
							},
							["count"] = 5,
							["amount"] = 273,
						},
					},
					["ActiveTime"] = 17.55,
					["ElementDone"] = {
						["Frost"] = 177,
					},
					["ElementTaken"] = {
						["Physical"] = 906,
						["Melee"] = 410,
						["Arcane"] = 199,
						["Fire"] = 274,
						["Shadow"] = 97,
						["Nature"] = 200,
					},
					["WhoDispelled"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["诺哈芬"] = {
							["Details"] = {
								["诺格弗格药剂 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Damage"] = 177,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 333,
									["min"] = 48,
									["count"] = 14,
									["amount"] = 1406,
								},
							},
							["count"] = 14,
							["amount"] = 1406,
						},
						["法力护盾"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 239,
									["min"] = 239,
									["count"] = 1,
									["amount"] = 239,
								},
							},
							["count"] = 1,
							["amount"] = 239,
						},
					},
					["TimeHeal"] = 16.05,
					["Dispels"] = 1,
					["WhoHealed"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1406,
								},
								["法力护盾"] = {
									["count"] = 239,
								},
							},
							["amount"] = 1645,
						},
					},
					["TimeDamaging"] = {
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Absorbs"] = 1645,
					["ElementTakenAbsorb"] = {
						["Physical"] = 787,
						["Melee"] = 273,
						["Arcane"] = 199,
						["Fire"] = 137,
						["Shadow"] = 49,
						["Nature"] = 200,
					},
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 92,
									["min"] = 85,
									["count"] = 2,
									["amount"] = 177,
								},
							},
							["count"] = 2,
							["amount"] = 177,
						},
					},
					["HealingTaken"] = 1645,
					["DamagedWho"] = {
						["拉克西里"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 85,
								},
							},
							["amount"] = 85,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 92,
								},
							},
							["amount"] = 92,
						},
					},
					["TimeDamage"] = 1.5,
					["WhoDamaged"] = {
						["索德斯吶"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 171,
								},
								["肉搏"] = {
									["count"] = 137,
								},
								["献祭"] = {
									["count"] = 103,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 97,
								},
							},
							["amount"] = 508,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 148,
								},
							},
							["amount"] = 148,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 119,
								},
							},
							["amount"] = 119,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 333,
								},
								["奥术射击"] = {
									["count"] = 199,
								},
							},
							["amount"] = 532,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 239,
								},
							},
							["amount"] = 239,
						},
						["风蛇"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 52,
								},
							},
							["amount"] = 52,
						},
						["拉克西里"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 215,
								},
								["肉搏"] = {
									["count"] = 273,
								},
							},
							["amount"] = 488,
						},
					},
					["HealedWho"] = {
						["观自在-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1406,
								},
								["法力护盾"] = {
									["count"] = 239,
								},
							},
							["amount"] = 1645,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["观自在-火妖鲁西弗隆"] = {
									["max"] = 333,
									["min"] = 48,
									["count"] = 14,
									["amount"] = 1406,
								},
							},
							["count"] = 14,
							["amount"] = 1406,
						},
						["法力护盾"] = {
							["Details"] = {
								["观自在-火妖鲁西弗隆"] = {
									["max"] = 239,
									["min"] = 239,
									["count"] = 1,
									["amount"] = 239,
								},
							},
							["count"] = 1,
							["amount"] = 239,
						},
					},
				},
			},
			["UnitLockout"] = 17557.568,
			["LastActive"] = 17944.56,
		},
		["水煮电线杆"] = {
			["GUID"] = "Player-5458-02F4E49D",
			["LastEventHealth"] = {
				2530, -- [1]
				2530, -- [2]
				2264, -- [3]
				2271, -- [4]
				2156, -- [5]
				2156, -- [6]
				2041, -- [7]
				2044, -- [8]
				1929, -- [9]
				2018, -- [10]
				2018, -- [11]
				2022, -- [12]
				2025, -- [13]
				1941, -- [14]
				1941, -- [15]
				1941, -- [16]
				1853, -- [17]
				1856, -- [18]
				2530, -- [19]
				2530, -- [20]
				2530, -- [21]
				2530, -- [22]
				2530, -- [23]
				2530, -- [24]
				2530, -- [25]
				2460, -- [26]
				2460, -- [27]
				2435, -- [28]
				816, -- [29]
				260, -- [30]
				142, -- [31]
				114, -- [32]
				2530, -- [33]
				2530, -- [34]
				2530, -- [35]
				2530, -- [36]
				2530, -- [37]
				2530, -- [38]
				2530, -- [39]
				2530, -- [40]
				2530, -- [41]
				2530, -- [42]
				2530, -- [43]
				2530, -- [44]
				2530, -- [45]
				2530, -- [46]
				2530, -- [47]
				2530, -- [48]
				2530, -- [49]
				2530, -- [50]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"MISC", -- [3]
				"DAMAGE", -- [4]
				"MISC", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"MISC", -- [11]
				"MISC", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					16.87, -- [1]
				},
				["Dispelled"] = {
					3, -- [1]
				},
				["DamageTaken"] = {
					6960, -- [1]
				},
				["Absorbs"] = {
					3066, -- [1]
				},
				["HealingTaken"] = {
					3066, -- [1]
				},
				["TimeDamage"] = {
					40.03, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["ManaGain"] = {
					2653, -- [1]
				},
				["ActiveTime"] = {
					56.9, -- [1]
				},
				["Damage"] = {
					20412, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 6,
			["type"] = "Grouped",
			["LastDamageTaken"] = 348,
			["LastHealTime"] = 17904.907,
			["TimeLast"] = {
				["TimeHeal"] = 17904.557,
				["Dispelled"] = 17775.565,
				["OVERALL"] = 17931.559,
				["DamageTaken"] = 17931.559,
				["Absorbs"] = 17904.557,
				["HealingTaken"] = 17904.557,
				["ActiveTime"] = 17907.557,
				["Interrupts"] = 17752.564,
				["ManaGain"] = 17485.563,
				["TimeDamage"] = 17907.557,
				["Damage"] = 17907.557,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2530, -- [1]
				2530, -- [2]
				2530, -- [3]
				2530, -- [4]
				2530, -- [5]
				2530, -- [6]
				2530, -- [7]
				2530, -- [8]
				2530, -- [9]
				2530, -- [10]
				2530, -- [11]
				2530, -- [12]
				2530, -- [13]
				2530, -- [14]
				2530, -- [15]
				2530, -- [16]
				2530, -- [17]
				2530, -- [18]
				2530, -- [19]
				2530, -- [20]
				2530, -- [21]
				2530, -- [22]
				2530, -- [23]
				2530, -- [24]
				2530, -- [25]
				2530, -- [26]
				2530, -- [27]
				2530, -- [28]
				2530, -- [29]
				2530, -- [30]
				2530, -- [31]
				2530, -- [32]
				2530, -- [33]
				2530, -- [34]
				2530, -- [35]
				2530, -- [36]
				2530, -- [37]
				2530, -- [38]
				2530, -- [39]
				2530, -- [40]
				2530, -- [41]
				2530, -- [42]
				2530, -- [43]
				2530, -- [44]
				2530, -- [45]
				2530, -- [46]
				2530, -- [47]
				2530, -- [48]
				2530, -- [49]
				2530, -- [50]
			},
			["NextEventNum"] = 34,
			["LastDamageTime"] = 17907.74,
			["LastEvents"] = {
				"瞬狱影杀阵-逐风者 肉搏 水煮电线杆 Absorb -861 (1)", -- [1]
				"瞬狱影杀阵-逐风者 炎爆术 水煮电线杆 Hit -266 (861 被吸收) (Fire)", -- [2]
				"水煮电线杆 interrupts 瞬狱影杀阵-逐风者 灼烧 (法术反制)", -- [3]
				"瞬狱影杀阵-逐风者 炎爆术 (伤害/跳) 水煮电线杆 Tick -118 (Fire)", -- [4]
				"瞬狱影杀阵-逐风者 interrupts 水煮电线杆 寒冰箭 (法术反制)", -- [5]
				"瞬狱影杀阵-逐风者 炎爆术 (伤害/跳) 水煮电线杆 Tick -118 (Fire)", -- [6]
				"水煮电线杆 射击 瞬狱影杀阵-逐风者 Hit -103 (Frost)", -- [7]
				"瞬狱影杀阵-逐风者 炎爆术 (伤害/跳) 水煮电线杆 Tick -119 (Fire)", -- [8]
				"瞬狱影杀阵-逐风者 炎爆术 (伤害/跳) 水煮电线杆 Absorb -118 (118 被吸收) (Fire)", -- [9]
				"水煮电线杆 寒冰箭 索德斯吶 Hit -778 (Frost)", -- [10]
				"克鲁霍姆 interrupts 水煮电线杆 寒冰箭 (法术封锁)", -- [11]
				"克鲁霍姆 dispels 水煮电线杆 奥术智慧 (吞噬魔法)", -- [12]
				"克鲁霍姆 肉搏 水煮电线杆 Hit -87 (Physical)", -- [13]
				"水煮电线杆 奥术飞弹 索德斯吶 Hit -270 (Arcane)", -- [14]
				"克鲁霍姆 肉搏 水煮电线杆 Hit -88 (Physical)", -- [15]
				"水煮电线杆 冰冻 克鲁霍姆 Resist (Frost)", -- [16]
				"水煮电线杆 奥术飞弹 索德斯吶 Hit -269 (Arcane)", -- [17]
				"克鲁霍姆 肉搏 水煮电线杆 Absorb -78 (78 被吸收) (1)", -- [18]
				"水煮电线杆 寒冰箭 末日坠落-逐风者 Hit -794 (Frost)", -- [19]
				"断水流-黑龙费尔默 断筋 水煮电线杆 Absorb -83 (83 被吸收) (Physical)", -- [20]
				"断水流-黑龙费尔默 肉搏 水煮电线杆 Absorb -360 (360 被吸收) (1)", -- [21]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 水煮电线杆 Absorb -73 (73 被吸收) (Physical)", -- [22]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 水煮电线杆 Absorb -28 (28 被吸收) (Physical)", -- [23]
				"水煮电线杆 冰霜新星 索德斯吶 Hit -91 (Frost)", -- [24]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 水煮电线杆 Tick -73 (Physical)", -- [25]
				"水煮电线杆 冰锥术 索德斯吶 Crit -1098 (Frost)", -- [26]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 水煮电线杆 Tick -28 (Physical)", -- [27]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 水煮电线杆 Tick -72 (Physical)", -- [28]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 水煮电线杆 Tick -28 (Physical)", -- [29]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 水煮电线杆 Tick -72 (Physical)", -- [30]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 水煮电线杆 Tick -28 (Physical)", -- [31]
				"断水流-黑龙费尔默 拦截昏迷 水煮电线杆 Hit -51 (Physical)", -- [32]
				"Environment Falling 水煮电线杆 Hit -348 (Physical)", -- [33]
				"水煮电线杆 魔爆术 克鲁霍姆 Hit -151 (150 被抵抗) (Arcane)", -- [34]
				"水煮电线杆 魔爆术 逐风者卡巴-逐风者 Hit -312 (Arcane)", -- [35]
				"水煮电线杆 火焰冲击 逐风者卡巴-逐风者 Crit -898 (Fire)", -- [36]
				"水煮电线杆 魔爆术 风蛇 Hit -303 (Arcane)", -- [37]
				"水煮电线杆 魔爆术 克鲁霍姆 Hit -147 (147 被抵抗) (Arcane)", -- [38]
				"水煮电线杆 魔爆术 逐风者卡巴-逐风者 Hit -311 (Arcane)", -- [39]
				"水煮电线杆 魔爆术 风蛇 Hit -297 (Arcane)", -- [40]
				"水煮电线杆 魔爆术 克鲁霍姆 Hit -226 (75 被抵抗) (Arcane)", -- [41]
				"水煮电线杆 魔爆术 瞬狱影杀阵-逐风者 Hit -300 (Arcane)", -- [42]
				"瞬狱影杀阵-逐风者 魔爆术 水煮电线杆 Absorb -315 (315 被吸收) (Arcane)", -- [43]
				"水煮电线杆 魔爆术 瞬狱影杀阵-逐风者 Hit -295 (Arcane)", -- [44]
				"水煮电线杆 魔爆术 克鲁霍姆 Crit -338 (75 被抵抗) (Arcane)", -- [45]
				"水煮电线杆 冰锥术 克鲁霍姆 Hit -567 (Frost)", -- [46]
				"水煮电线杆 冰锥术 逐风者卡巴-逐风者 Hit -546 (Frost)", -- [47]
				"水煮电线杆 火焰冲击 逐风者卡巴-逐风者 Crit -905 (Fire)", -- [48]
				"水煮电线杆 寒冰箭 末日坠落-逐风者 Hit -805 (Frost)", -- [49]
				"水煮电线杆 寒冰箭 末日坠落-逐风者 Hit -803 (Frost)", -- [50]
			},
			["Name"] = "水煮电线杆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				true, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				17752.63, -- [1]
				17752.63, -- [2]
				17752.797, -- [3]
				17755.631, -- [4]
				17757.314, -- [5]
				17758.614, -- [6]
				17760.364, -- [7]
				17761.614, -- [8]
				17764.615, -- [9]
				17774.232, -- [10]
				17774.599, -- [11]
				17776.332, -- [12]
				17778.332, -- [13]
				17780.266, -- [14]
				17780.832, -- [15]
				17780.832, -- [16]
				17781.266, -- [17]
				17783.333, -- [18]
				17870.055, -- [19]
				17900.408, -- [20]
				17900.775, -- [21]
				17903.424, -- [22]
				17904.907, -- [23]
				17906.24, -- [24]
				17906.424, -- [25]
				17907.74, -- [26]
				17907.89, -- [27]
				17909.424, -- [28]
				17910.891, -- [29]
				17912.424, -- [30]
				17913.891, -- [31]
				17914.341, -- [32]
				17931.809, -- [33]
				17620.425, -- [34]
				17620.425, -- [35]
				17621.922, -- [36]
				17623.422, -- [37]
				17623.422, -- [38]
				17623.422, -- [39]
				17624.939, -- [40]
				17624.939, -- [41]
				17624.939, -- [42]
				17626.189, -- [43]
				17626.422, -- [44]
				17627.939, -- [45]
				17629.772, -- [46]
				17629.772, -- [47]
				17631.289, -- [48]
				17643.507, -- [49]
				17646.007, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["InterruptData"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["灼烧 (法术反制)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeHealing"] = {
						["水煮电线杆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 15.37,
								},
								["防护火焰结界"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 16.87,
						},
					},
					["Dispelled"] = 3,
					["Interrupts"] = 1,
					["ElementDoneResist"] = {
						["Arcane"] = 743,
					},
					["TimeSpent"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰冻"] = {
									["count"] = 0.57,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.57,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.48,
								},
								["射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.98,
						},
						["诺哈芬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 0.05,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.55,
						},
						["水煮电线杆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 15.37,
								},
								["防护火焰结界"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 16.87,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["索德斯吶"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["奥术飞弹"] = {
									["count"] = 1.93,
								},
							},
							["amount"] = 6.43,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["风蛇"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 4.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
					},
					["HealedWho"] = {
						["水煮电线杆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 2948,
								},
								["防护火焰结界"] = {
									["count"] = 118,
								},
							},
							["amount"] = 3066,
						},
					},
					["ManaGainedFrom"] = {
						["水煮电线杆"] = {
							["Details"] = {
								["恢复法力"] = {
									["count"] = 1474,
								},
								["补充法力"] = {
									["count"] = 1179,
								},
							},
							["amount"] = 2653,
						},
					},
					["Absorbs"] = 3066,
					["ManaGained"] = {
						["恢复法力"] = {
							["Details"] = {
								["水煮电线杆"] = {
									["count"] = 1474,
								},
							},
							["amount"] = 1474,
						},
						["补充法力"] = {
							["Details"] = {
								["水煮电线杆"] = {
									["count"] = 1179,
								},
							},
							["amount"] = 1179,
						},
					},
					["ElementTakenAbsorb"] = {
						["Physical"] = 1038,
						["Melee"] = 656,
						["Arcane"] = 322,
						["Fire"] = 979,
						["Shadow"] = 71,
					},
					["ActiveTime"] = 56.9,
					["TimeHeal"] = 16.87,
					["ElementTaken"] = {
						["Physical"] = 3251,
						["Melee"] = 1993,
						["Arcane"] = 665,
						["Fire"] = 739,
						["Shadow"] = 312,
					},
					["WhoDispelled"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["诺哈芬"] = {
							["Details"] = {
								["寒冰护体 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Damage"] = 20412,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 16,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 861,
									["min"] = 7,
									["count"] = 12,
									["amount"] = 2948,
								},
							},
							["count"] = 12,
							["amount"] = 2948,
						},
						["防护火焰结界"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 118,
									["min"] = 118,
									["count"] = 1,
									["amount"] = 118,
								},
							},
							["count"] = 1,
							["amount"] = 118,
						},
					},
					["PartialAbsorb"] = {
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 4,
							["amount"] = 28,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 73,
									["min"] = 73,
									["count"] = 1,
									["amount"] = 73,
								},
							},
							["count"] = 4,
							["amount"] = 73,
						},
						["炎爆术"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 861,
									["min"] = 861,
									["count"] = 1,
									["amount"] = 861,
								},
							},
							["count"] = 1,
							["amount"] = 861,
						},
						["自动射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 723,
									["min"] = 723,
									["count"] = 1,
									["amount"] = 723,
								},
							},
							["count"] = 1,
							["amount"] = 723,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 118,
									["min"] = 118,
									["count"] = 1,
									["amount"] = 118,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 118,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 7,
									["min"] = 7,
									["count"] = 1,
									["amount"] = 7,
								},
							},
							["count"] = 1,
							["amount"] = 7,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 71,
									["min"] = 71,
									["count"] = 1,
									["amount"] = 71,
								},
							},
							["count"] = 2,
							["amount"] = 71,
						},
						["魔爆术"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 315,
									["min"] = 315,
									["count"] = 1,
									["amount"] = 315,
								},
							},
							["count"] = 1,
							["amount"] = 315,
						},
						["断筋"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
						["驱散射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 131,
									["min"] = 131,
									["count"] = 1,
									["amount"] = 131,
								},
							},
							["count"] = 1,
							["amount"] = 131,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 360,
									["min"] = 78,
									["count"] = 3,
									["amount"] = 656,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 656,
						},
					},
					["PartialResist"] = {
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["炎爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["炎爆术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
					},
					["WhoDamaged"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 253,
								},
							},
							["amount"] = 253,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 315,
								},
								["炎爆术 (伤害/跳)"] = {
									["count"] = 473,
								},
								["炎爆术"] = {
									["count"] = 266,
								},
								["肉搏"] = {
									["count"] = 861,
								},
							},
							["amount"] = 1915,
						},
						["诺哈芬"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 131,
								},
								["多重射击"] = {
									["count"] = 1169,
								},
							},
							["amount"] = 1300,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 290,
								},
								["拦截昏迷"] = {
									["count"] = 51,
								},
								["断筋"] = {
									["count"] = 83,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 112,
								},
								["肉搏"] = {
									["count"] = 360,
								},
							},
							["amount"] = 896,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 723,
								},
								["奥术射击"] = {
									["count"] = 350,
								},
								["肉搏"] = {
									["count"] = 7,
								},
							},
							["amount"] = 1080,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 610,
								},
							},
							["amount"] = 610,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 82,
								},
								["肉搏"] = {
									["count"] = 432,
								},
							},
							["amount"] = 514,
						},
						["索德斯吶"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 171,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 141,
								},
							},
							["amount"] = 312,
						},
					},
					["DamageTaken"] = 6960,
					["WhoHealed"] = {
						["水煮电线杆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 2948,
								},
								["防护火焰结界"] = {
									["count"] = 118,
								},
							},
							["amount"] = 3066,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 20,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 18,
						},
					},
					["Attacks"] = {
						["射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 103,
									["min"] = 103,
									["count"] = 1,
									["amount"] = 103,
								},
							},
							["count"] = 1,
							["amount"] = 103,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 270,
									["min"] = 269,
									["count"] = 2,
									["amount"] = 539,
								},
							},
							["count"] = 2,
							["amount"] = 539,
						},
						["冰冻"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 95,
									["min"] = 91,
									["count"] = 3,
									["amount"] = 277,
								},
							},
							["count"] = 3,
							["amount"] = 277,
						},
						["魔爆术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 463,
									["min"] = 111,
									["count"] = 4,
									["amount"] = 1367,
								},
								["Hit"] = {
									["max"] = 313,
									["min"] = 147,
									["count"] = 12,
									["amount"] = 3187,
								},
							},
							["count"] = 16,
							["amount"] = 4554,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 805,
									["min"] = 778,
									["count"] = 4,
									["amount"] = 3180,
								},
							},
							["count"] = 4,
							["amount"] = 3180,
						},
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1157,
									["min"] = 1098,
									["count"] = 4,
									["amount"] = 4482,
								},
								["Hit"] = {
									["max"] = 577,
									["min"] = 543,
									["count"] = 7,
									["amount"] = 3917,
								},
							},
							["count"] = 11,
							["amount"] = 8399,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 955,
									["min"] = 898,
									["count"] = 3,
									["amount"] = 2758,
								},
								["Hit"] = {
									["max"] = 602,
									["min"] = 602,
									["count"] = 1,
									["amount"] = 602,
								},
							},
							["count"] = 4,
							["amount"] = 3360,
						},
					},
					["HealingTaken"] = 3066,
					["DamagedWho"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 862,
								},
								["冰锥术"] = {
									["count"] = 1724,
								},
							},
							["amount"] = 2586,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 595,
								},
								["射击"] = {
									["count"] = 103,
								},
							},
							["amount"] = 698,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 623,
								},
								["火焰冲击"] = {
									["count"] = 1803,
								},
								["冰锥术"] = {
									["count"] = 2243,
								},
							},
							["amount"] = 4669,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 463,
								},
								["火焰冲击"] = {
									["count"] = 602,
								},
							},
							["amount"] = 1065,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 91,
								},
								["冰锥术"] = {
									["count"] = 555,
								},
							},
							["amount"] = 646,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 95,
								},
								["魔爆术"] = {
									["count"] = 620,
								},
								["寒冰箭"] = {
									["count"] = 2402,
								},
								["火焰冲击"] = {
									["count"] = 955,
								},
								["冰锥术"] = {
									["count"] = 1676,
								},
							},
							["amount"] = 5748,
						},
						["索德斯吶"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1098,
								},
								["寒冰箭"] = {
									["count"] = 778,
								},
								["冰霜新星"] = {
									["count"] = 91,
								},
								["奥术飞弹"] = {
									["count"] = 539,
								},
							},
							["amount"] = 2506,
						},
						["风蛇"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1055,
								},
								["冰锥术"] = {
									["count"] = 1103,
								},
							},
							["amount"] = 2158,
						},
						["诺哈芬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 336,
								},
							},
							["amount"] = 336,
						},
					},
					["TimeDamage"] = 40.03,
					["TimeDamaging"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰冻"] = {
									["count"] = 0.57,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.57,
						},
						["索德斯吶"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["奥术飞弹"] = {
									["count"] = 1.93,
								},
							},
							["amount"] = 6.43,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.48,
								},
								["射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.98,
						},
						["风蛇"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 4.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 4.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["诺哈芬"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 0.05,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.55,
						},
					},
					["ManaGain"] = 2653,
					["ElementDone"] = {
						["Fire"] = 3360,
						["Frost"] = 11959,
						["Arcane"] = 5093,
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["水煮电线杆"] = {
									["max"] = 861,
									["min"] = 7,
									["count"] = 12,
									["amount"] = 2948,
								},
							},
							["count"] = 12,
							["amount"] = 2948,
						},
						["防护火焰结界"] = {
							["Details"] = {
								["水煮电线杆"] = {
									["max"] = 118,
									["min"] = 118,
									["count"] = 1,
									["amount"] = 118,
								},
							},
							["count"] = 1,
							["amount"] = 118,
						},
					},
				},
			},
			["UnitLockout"] = 17548.567,
			["LastActive"] = 17931.559,
		},
		["丿丿-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-031871B0",
			["LastEventHealth"] = {
				3377, -- [1]
				3377, -- [2]
				3377, -- [3]
				3377, -- [4]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
			},
			["TimeWindows"] = {
				["Damage"] = {
					830, -- [1]
				},
				["TimeDamage"] = {
					5.48, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["ActiveTime"] = {
					5.48, -- [1]
				},
			},
			["enClass"] = "PRIEST",
			["unit"] = true,
			["level"] = 60,
			["LastFightIn"] = 6,
			["type"] = "Grouped",
			["TimeLast"] = {
				["ActiveTime"] = 17807.567,
				["TimeDamage"] = 17807.567,
				["OVERALL"] = 17807.567,
				["DOT_Time"] = 17807.567,
				["Damage"] = 17807.567,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3377, -- [1]
				3377, -- [2]
				3377, -- [3]
				3377, -- [4]
			},
			["NextEventNum"] = 5,
			["LastDamageTime"] = 17807.867,
			["LastEvents"] = {
				"丿丿-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 不会假死-逐风者 Tick -204 (Shadow)", -- [1]
				"丿丿-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灵魂摆渡人-逐风者 Absorb -211 (211 被吸收) (Shadow)", -- [2]
				"丿丿-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 不会假死-逐风者 Tick -204 (Shadow)", -- [3]
				"丿丿-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灵魂摆渡人-逐风者 Absorb -211 (211 被吸收) (Shadow)", -- [4]
			},
			["Name"] = "丿丿-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
			},
			["LastEventTimes"] = {
				17802.868, -- [1]
				17804.868, -- [2]
				17805.851, -- [3]
				17807.867, -- [4]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["不会假死-逐风者"] = {
									["count"] = 6,
								},
								["灵魂摆渡人-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
					},
					["TimeSpent"] = {
						["不会假死-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2.48,
								},
							},
							["amount"] = 2.48,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 422,
					},
					["Attacks"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 211,
									["min"] = 211,
									["count"] = 2,
									["amount"] = 422,
								},
								["Tick"] = {
									["max"] = 204,
									["min"] = 204,
									["count"] = 2,
									["amount"] = 408,
								},
							},
							["count"] = 4,
							["amount"] = 830,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 830,
					},
					["DamagedWho"] = {
						["不会假死-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 422,
								},
							},
							["amount"] = 422,
						},
					},
					["ActiveTime"] = 5.48,
					["TimeDamaging"] = {
						["不会假死-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2.48,
								},
							},
							["amount"] = 2.48,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeDamage"] = 5.48,
					["DOT_Time"] = 12,
					["Damage"] = 830,
				},
			},
			["UnitLockout"] = 17802.568,
			["LastActive"] = 17807.567,
		},
		["壹侎捌-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-03106DA3",
			["LastEventHealth"] = {
				2180, -- [1]
				2175, -- [2]
				2154, -- [3]
				2154, -- [4]
				2133, -- [5]
				2133, -- [6]
				2112, -- [7]
				2106, -- [8]
				2085, -- [9]
				2820, -- [10]
				2820, -- [11]
			},
			["LastAttackedBy"] = "灵魂摆渡人-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
			},
			["TimeWindows"] = {
				["Absorbs"] = {
					83, -- [1]
				},
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["ActiveTime"] = {
					7.5, -- [1]
				},
				["HealingTaken"] = {
					83, -- [1]
				},
				["TimeDamage"] = {
					6, -- [1]
				},
				["DamageTaken"] = {
					209, -- [1]
				},
				["Damage"] = {
					1923, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 6,
			["type"] = "Grouped",
			["LastHealTime"] = 17921.141,
			["LastEventHealthMax"] = {
				2820, -- [1]
				2820, -- [2]
				2820, -- [3]
				2820, -- [4]
				2820, -- [5]
				2820, -- [6]
				2820, -- [7]
				2820, -- [8]
				2820, -- [9]
				2820, -- [10]
				2820, -- [11]
			},
			["LastDamageTaken"] = 83,
			["Owner"] = false,
			["TimeLast"] = {
				["Absorbs"] = 17920.558,
				["TimeHeal"] = 17920.558,
				["HealingTaken"] = 17920.558,
				["ActiveTime"] = 17921.558,
				["TimeDamage"] = 17921.558,
				["OVERALL"] = 17921.558,
				["DamageTaken"] = 17920.558,
				["Damage"] = 17921.558,
			},
			["NextEventNum"] = 12,
			["LastDamageTime"] = 17921.592,
			["LastEvents"] = {
				"末日坠落-逐风者 撕裂 (伤害/跳) 壹侎捌-火妖鲁西弗隆 Tick -21 (Physical)", -- [1]
				"末日坠落-逐风者 撕裂 (伤害/跳) 壹侎捌-火妖鲁西弗隆 Tick -21 (Physical)", -- [2]
				"壹侎捌-火妖鲁西弗隆 寒冰箭 末日坠落-逐风者 Hit -611 (Frost)", -- [3]
				"末日坠落-逐风者 撕裂 (伤害/跳) 壹侎捌-火妖鲁西弗隆 Tick -21 (Physical)", -- [4]
				"壹侎捌-火妖鲁西弗隆 寒冰箭 末日坠落-逐风者 Hit -612 (Frost)", -- [5]
				"末日坠落-逐风者 撕裂 (伤害/跳) 壹侎捌-火妖鲁西弗隆 Tick -21 (Physical)", -- [6]
				"末日坠落-逐风者 撕裂 (伤害/跳) 壹侎捌-火妖鲁西弗隆 Tick -21 (Physical)", -- [7]
				"末日坠落-逐风者 撕裂 (伤害/跳) 壹侎捌-火妖鲁西弗隆 Tick -21 (Physical)", -- [8]
				"壹侎捌-火妖鲁西弗隆 寒冰箭 末日坠落-逐风者 Hit -616 (Frost)", -- [9]
				"灵魂摆渡人-逐风者 冰霜新星 壹侎捌-火妖鲁西弗隆 Absorb -83 (83 被吸收) (Frost)", -- [10]
				"壹侎捌-火妖鲁西弗隆 冰霜新星 灵魂摆渡人-逐风者 Absorb -84 (84 被吸收) (Frost)", -- [11]
			},
			["Name"] = "壹侎捌-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
			},
			["LastEventTimes"] = {
				17855.504, -- [1]
				17858.504, -- [2]
				17860.421, -- [3]
				17861.488, -- [4]
				17863.122, -- [5]
				17864.504, -- [6]
				17867.488, -- [7]
				17870.488, -- [8]
				17870.722, -- [9]
				17921.141, -- [10]
				17921.592, -- [11]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["壹侎捌-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["TimeSpent"] = {
						["末日坠落-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["壹侎捌-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 209,
					["ElementDoneAbsorb"] = {
						["Frost"] = 84,
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 7.5,
					["ElementTaken"] = {
						["Frost"] = 83,
						["Physical"] = 126,
					},
					["Damage"] = 1923,
					["ElementTakenAbsorb"] = {
						["Frost"] = 83,
					},
					["TimeHeal"] = 1.5,
					["WhoHealed"] = {
						["壹侎捌-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 83,
								},
							},
							["amount"] = 83,
						},
					},
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
					["HealedWho"] = {
						["壹侎捌-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 83,
								},
							},
							["amount"] = 83,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
					},
					["TimeDamaging"] = {
						["末日坠落-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Absorbs"] = 83,
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 84,
									["min"] = 84,
									["count"] = 1,
									["amount"] = 84,
								},
							},
							["count"] = 1,
							["amount"] = 84,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 616,
									["min"] = 611,
									["count"] = 3,
									["amount"] = 1839,
								},
							},
							["count"] = 3,
							["amount"] = 1839,
						},
					},
					["HealingTaken"] = 83,
					["DamagedWho"] = {
						["末日坠落-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1839,
								},
							},
							["amount"] = 1839,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 84,
								},
							},
							["amount"] = 84,
						},
					},
					["TimeDamage"] = 6,
					["WhoDamaged"] = {
						["末日坠落-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 126,
								},
							},
							["amount"] = 126,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 83,
								},
							},
							["amount"] = 83,
						},
					},
					["ElementDone"] = {
						["Frost"] = 1923,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["壹侎捌-火妖鲁西弗隆"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
							},
							["count"] = 1,
							["amount"] = 83,
						},
					},
				},
			},
			["UnitLockout"] = 17854.554,
			["LastActive"] = 17921.558,
		},
		["流星云-逐风者"] = {
			["GUID"] = "Player-5451-02F4B4ED",
			["LastEventHealth"] = {
				2642, -- [1]
				2642, -- [2]
				2642, -- [3]
				2642, -- [4]
				3605, -- [5]
				3605, -- [6]
				3605, -- [7]
				3605, -- [8]
				3605, -- [9]
				3605, -- [10]
				3605, -- [11]
				3605, -- [12]
				3605, -- [13]
				3605, -- [14]
				3605, -- [15]
				3605, -- [16]
				3605, -- [17]
				3335, -- [18]
				3335, -- [19]
				3335, -- [20]
				3335, -- [21]
				3335, -- [22]
				3335, -- [23]
				3335, -- [24]
				3335, -- [25]
				3458, -- [26]
				3458, -- [27]
				3458, -- [28]
				3458, -- [29]
				3290, -- [30]
				3261, -- [31]
				3097, -- [32]
				3097, -- [33]
				3097, -- [34]
				3097, -- [35]
				3605, -- [36]
				2960, -- [37]
				2894, -- [38]
				2710, -- [39]
				2514, -- [40]
				2235, -- [41]
				2642, -- [42]
				2642, -- [43]
				2642, -- [44]
				2642, -- [45]
				2642, -- [46]
				2642, -- [47]
				2642, -- [48]
				2642, -- [49]
				2642, -- [50]
			},
			["LastAttackedBy"] = "末日坠落-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					30.47, -- [1]
				},
				["ActiveTime"] = {
					30.47, -- [1]
				},
				["DamageTaken"] = {
					2408, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DOT_Time"] = {
					15, -- [1]
				},
				["Damage"] = {
					8925, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "盾牌猛击",
			["LastFightIn"] = 6,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				3605, -- [1]
				3605, -- [2]
				3605, -- [3]
				3605, -- [4]
				3605, -- [5]
				3605, -- [6]
				3605, -- [7]
				3605, -- [8]
				3605, -- [9]
				3605, -- [10]
				3605, -- [11]
				3605, -- [12]
				3605, -- [13]
				3605, -- [14]
				3605, -- [15]
				3605, -- [16]
				3605, -- [17]
				3605, -- [18]
				3605, -- [19]
				3605, -- [20]
				3605, -- [21]
				3605, -- [22]
				3605, -- [23]
				3605, -- [24]
				3605, -- [25]
				3605, -- [26]
				3605, -- [27]
				3605, -- [28]
				3605, -- [29]
				3605, -- [30]
				3605, -- [31]
				3605, -- [32]
				3605, -- [33]
				3605, -- [34]
				3605, -- [35]
				3605, -- [36]
				3605, -- [37]
				3605, -- [38]
				3605, -- [39]
				3605, -- [40]
				3605, -- [41]
				3605, -- [42]
				3605, -- [43]
				3605, -- [44]
				3605, -- [45]
				3605, -- [46]
				3605, -- [47]
				3605, -- [48]
				3605, -- [49]
				3605, -- [50]
			},
			["LastDamageTaken"] = 279,
			["TimeLast"] = {
				["Healing"] = 17527.566,
				["DamageTaken"] = 17867.555,
				["ActiveTime"] = 17922.558,
				["TimeDamage"] = 17922.558,
				["OVERALL"] = 17922.558,
				["DOT_Time"] = 17920.558,
				["Damage"] = 17922.558,
			},
			["Owner"] = false,
			["Pet"] = {
				"野猪 <流星云-逐风者>", -- [1]
			},
			["NextEventNum"] = 5,
			["LastDamageTime"] = 17922.925,
			["LastEvents"] = {
				"流星云-逐风者 自动射击 灵魂摆渡人-逐风者 Absorb -331 (331 被吸收) (Physical)", -- [1]
				"流星云-逐风者 暗影箭 灵魂摆渡人-逐风者 Absorb -17 (17 被吸收) (Shadow)", -- [2]
				"流星云-逐风者 肉搏 灵魂摆渡人-逐风者 Absorb -319 (1)", -- [3]
				"流星云-逐风者 多重射击 灵魂摆渡人-逐风者 Crit -739 (319 被吸收) (Physical)", -- [4]
				"流星云-逐风者 毒蛇钉刺 (伤害/跳) 不会假死-逐风者 Tick -101 (Nature)", -- [5]
				"流星云-逐风者 多重射击 不会假死-逐风者 Hit -397 (Physical)", -- [6]
				"流星云-逐风者 暗影箭 不会假死-逐风者 Hit -14 (Shadow)", -- [7]
				"流星云-逐风者 多重射击 风蛇 Crit -825 (Physical)", -- [8]
				"流星云-逐风者 多重射击 猎蝶兽兽-黑龙费尔默 Hit -386 (Physical)", -- [9]
				"流星云-逐风者 暗影箭 猎蝶兽兽-黑龙费尔默 Hit -19 (Shadow)", -- [10]
				"流星云-逐风者 自动射击 不会假死-逐风者 Hit -278 (Physical)", -- [11]
				"流星云-逐风者 奥术射击 不会假死-逐风者 Hit -198 (Arcane)", -- [12]
				"流星云-逐风者 毒蛇钉刺 (伤害/跳) 不会假死-逐风者 Tick -101 (Nature)", -- [13]
				"流星云-逐风者 驱散射击 末日坠落-逐风者 Hit -95 (Physical)", -- [14]
				"流星云-逐风者 暗影箭 末日坠落-逐风者 Miss (Shadow)", -- [15]
				"Environment Falling 流星云-逐风者 Hit -316 (Physical)", -- [16]
				"Environment Falling 流星云-逐风者 Hit -351 (Physical)", -- [17]
				"流星云-逐风者 暗影箭 瞬狱影杀阵-逐风者 Crit -28 (Shadow)", -- [18]
				"流星云-逐风者 自动射击 瞬狱影杀阵-逐风者 Hit -323 (Physical)", -- [19]
				"流星云-逐风者 多重射击 瞬狱影杀阵-逐风者 Hit -452 (Physical)", -- [20]
				"流星云-逐风者 奥术射击 逐风者卡巴-逐风者 Hit -198 (Arcane)", -- [21]
				"流星云-逐风者 自动射击 逐风者卡巴-逐风者 Hit -336 (Physical)", -- [22]
				"流星云-逐风者 驱散射击 末日坠落-逐风者 Hit -92 (Physical)", -- [23]
				"流星云-逐风者 自动射击 末日坠落-逐风者 Hit -185 (Physical)", -- [24]
				"流星云-逐风者 毒蛇钉刺 (伤害/跳) 末日坠落-逐风者 Tick -101 (Nature)", -- [25]
				"流星云-逐风者 多重射击 索德斯吶 Hit -496 (Physical)", -- [26]
				"流星云-逐风者 多重射击 诺哈芬 Hit -400 (Physical)", -- [27]
				"流星云-逐风者 自动射击 索德斯吶 Hit -357 (Physical)", -- [28]
				"末日坠落-逐风者 肉搏 流星云-逐风者 Hit -168 (Physical)", -- [29]
				"末日坠落-逐风者 断筋 流星云-逐风者 Hit -29 (Physical)", -- [30]
				"末日坠落-逐风者 肉搏 流星云-逐风者 Hit -164 (Physical)", -- [31]
				"流星云-逐风者 驱散射击 末日坠落-逐风者 Hit -92 (Physical)", -- [32]
				"断水流-黑龙费尔默 冲锋击昏 流星云-逐风者 Resist (Physical)", -- [33]
				"断水流-黑龙费尔默 断筋 流星云-逐风者 Dodge (Physical)", -- [34]
				"断水流-黑龙费尔默 肉搏 流星云-逐风者 Hit -319 (Physical)", -- [35]
				"Environment Falling 流星云-逐风者 Hit -336 (Physical)", -- [36]
				"末日坠落-逐风者 雷霆一击 流星云-逐风者 Hit -66 (Physical)", -- [37]
				"末日坠落-逐风者 肉搏 流星云-逐风者 Hit -184 (Physical)", -- [38]
				"末日坠落-逐风者 肉搏 流星云-逐风者 Hit -196 (Physical)", -- [39]
				"末日坠落-逐风者 盾牌猛击 流星云-逐风者 Hit -279 (Physical)", -- [40]
				"末日坠落-逐风者 肉搏 流星云-逐风者 Miss (1)", -- [41]
				"流星云-逐风者 自动射击 依卤-黑龙费尔默 Hit -292 (Physical)", -- [42]
				"流星云-逐风者 多重射击 豹 Hit -348 (Physical)", -- [43]
				"流星云-逐风者 多重射击 依卤-黑龙费尔默 Hit -410 (Physical)", -- [44]
				"流星云-逐风者 奥术射击 依卤-黑龙费尔默 Hit -198 (Arcane)", -- [45]
				"流星云-逐风者 自动射击 依卤-黑龙费尔默 Hit -281 (Physical)", -- [46]
				"流星云-逐风者 暗影箭 依卤-黑龙费尔默 Crit -28 (Shadow)", -- [47]
				"流星云-逐风者 强化震荡射击 灵魂摆渡人-逐风者 Resist (Physical)", -- [48]
				"流星云-逐风者 暗影箭 灵魂摆渡人-逐风者 Absorb -17 (17 被吸收) (Shadow)", -- [49]
				"流星云-逐风者 毒蛇钉刺 (伤害/跳) 灵魂摆渡人-逐风者 Absorb -83 (83 被吸收) (Nature)", -- [50]
			},
			["Name"] = "流星云-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				17921.025, -- [1]
				17921.041, -- [2]
				17922.925, -- [3]
				17922.925, -- [4]
				17435.16, -- [5]
				17435.61, -- [6]
				17435.676, -- [7]
				17435.676, -- [8]
				17435.727, -- [9]
				17435.743, -- [10]
				17435.76, -- [11]
				17438.077, -- [12]
				17438.143, -- [13]
				17441.677, -- [14]
				17441.677, -- [15]
				17498.281, -- [16]
				17559.018, -- [17]
				17625.579, -- [18]
				17626.022, -- [19]
				17627.772, -- [20]
				17630.656, -- [21]
				17632.539, -- [22]
				17637.006, -- [23]
				17641.44, -- [24]
				17643.99, -- [25]
				17766.315, -- [26]
				17766.448, -- [27]
				17766.465, -- [28]
				17769.031, -- [29]
				17771.382, -- [30]
				17771.748, -- [31]
				17772.432, -- [32]
				17772.834, -- [33]
				17773.582, -- [34]
				17773.832, -- [35]
				17810.017, -- [36]
				17864.588, -- [37]
				17864.704, -- [38]
				17867.905, -- [39]
				17868.305, -- [40]
				17870.622, -- [41]
				17909.424, -- [42]
				17910.757, -- [43]
				17910.824, -- [44]
				17911.624, -- [45]
				17912.257, -- [46]
				17912.274, -- [47]
				17920.342, -- [48]
				17920.358, -- [49]
				17920.741, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["末日坠落-逐风者"] = {
									["count"] = 3,
								},
								["灵魂摆渡人-逐风者"] = {
									["count"] = 3,
								},
								["不会假死-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 15,
						},
					},
					["TimeSpent"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.44,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.44,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.99,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["暗影箭"] = {
									["count"] = 0.07,
								},
								["震荡射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.25,
								},
								["多重射击"] = {
									["count"] = 0.45,
								},
							},
							["amount"] = 6.760000000000001,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.02,
								},
								["自动射击"] = {
									["count"] = 2.13,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
								["奥术射击"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 3.02,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.05,
								},
								["暗影箭"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 0.07,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.38,
								},
								["暗影箭"] = {
									["count"] = 0.04,
								},
								["强化震荡射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.7,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 7.5,
						},
						["索德斯吶"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 1.52,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.33,
								},
							},
							["amount"] = 1.33,
						},
						["诺哈芬"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 0.13,
						},
					},
					["DamageTaken"] = 2408,
					["ElementDoneAbsorb"] = {
						["Shadow"] = 34,
						["Physical"] = 650,
						["Nature"] = 83,
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["盾牌猛击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 30.47,
					["ElementTaken"] = {
						["Melee"] = 1031,
						["Physical"] = 1377,
					},
					["DOT_Time"] = 15,
					["Damage"] = 8925,
					["Healing"] = 0,
					["ElementDone"] = {
						["Shadow"] = 141,
						["Melee"] = 319,
						["Arcane"] = 594,
						["Physical"] = 7384,
						["Nature"] = 487,
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 18,
								},
							},
							["amount"] = 22,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["TimeDamage"] = 30.47,
					["TimeDamaging"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.44,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.44,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.99,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["暗影箭"] = {
									["count"] = 0.07,
								},
								["震荡射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.25,
								},
								["多重射击"] = {
									["count"] = 0.45,
								},
							},
							["amount"] = 6.760000000000001,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.02,
								},
								["自动射击"] = {
									["count"] = 2.13,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
								["奥术射击"] = {
									["count"] = 0.8,
								},
							},
							["amount"] = 3.02,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.05,
								},
								["暗影箭"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 0.07,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.38,
								},
								["暗影箭"] = {
									["count"] = 0.04,
								},
								["强化震荡射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.7,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 7.5,
						},
						["索德斯吶"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 1.52,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.33,
								},
							},
							["amount"] = 1.33,
						},
						["诺哈芬"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 0.13,
						},
					},
					["WhoDamaged"] = {
						["末日坠落-逐风者"] = {
							["Details"] = {
								["盾牌猛击"] = {
									["count"] = 279,
								},
								["断筋"] = {
									["count"] = 29,
								},
								["雷霆一击"] = {
									["count"] = 66,
								},
								["肉搏"] = {
									["count"] = 712,
								},
							},
							["amount"] = 1086,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 319,
								},
							},
							["amount"] = 319,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1003,
								},
							},
							["amount"] = 1003,
						},
					},
					["DamagedWho"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 323,
								},
								["暗影箭"] = {
									["count"] = 28,
								},
								["多重射击"] = {
									["count"] = 452,
								},
							},
							["amount"] = 803,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 336,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 534,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 303,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
								["暗影箭"] = {
									["count"] = 32,
								},
								["自动射击"] = {
									["count"] = 547,
								},
								["多重射击"] = {
									["count"] = 397,
								},
							},
							["amount"] = 1477,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 28,
								},
								["自动射击"] = {
									["count"] = 573,
								},
								["多重射击"] = {
									["count"] = 410,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 1209,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 83,
								},
								["暗影箭"] = {
									["count"] = 34,
								},
								["自动射击"] = {
									["count"] = 331,
								},
								["多重射击"] = {
									["count"] = 739,
								},
								["肉搏"] = {
									["count"] = 319,
								},
							},
							["amount"] = 1506,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 386,
								},
								["暗影箭"] = {
									["count"] = 19,
								},
							},
							["amount"] = 405,
						},
						["索德斯吶"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 496,
								},
								["自动射击"] = {
									["count"] = 357,
								},
							},
							["amount"] = 853,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["自动射击"] = {
									["count"] = 185,
								},
								["驱散射击"] = {
									["count"] = 279,
								},
							},
							["amount"] = 565,
						},
						["诺哈芬"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 400,
								},
							},
							["amount"] = 400,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 348,
								},
							},
							["amount"] = 348,
						},
						["风蛇"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 825,
								},
							},
							["amount"] = 825,
						},
					},
					["Attacks"] = {
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 331,
									["min"] = 331,
									["count"] = 1,
									["amount"] = 331,
								},
								["Hit"] = {
									["max"] = 357,
									["min"] = 185,
									["count"] = 8,
									["amount"] = 2321,
								},
							},
							["count"] = 9,
							["amount"] = 2652,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 83,
									["min"] = 83,
									["count"] = 1,
									["amount"] = 83,
								},
								["Tick"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 4,
									["amount"] = 404,
								},
							},
							["count"] = 5,
							["amount"] = 487,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 198,
									["min"] = 198,
									["count"] = 3,
									["amount"] = 594,
								},
							},
							["count"] = 3,
							["amount"] = 594,
						},
						["暗影箭"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 17,
									["min"] = 17,
									["count"] = 2,
									["amount"] = 34,
								},
								["Crit"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 2,
									["amount"] = 56,
								},
								["Hit"] = {
									["max"] = 19,
									["min"] = 14,
									["count"] = 3,
									["amount"] = 51,
								},
							},
							["count"] = 8,
							["amount"] = 141,
						},
						["强化震荡射击"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 825,
									["min"] = 739,
									["count"] = 2,
									["amount"] = 1564,
								},
								["Hit"] = {
									["max"] = 496,
									["min"] = 348,
									["count"] = 7,
									["amount"] = 2889,
								},
							},
							["count"] = 9,
							["amount"] = 4453,
						},
						["震荡射击"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 95,
									["min"] = 92,
									["count"] = 3,
									["amount"] = 279,
								},
							},
							["count"] = 3,
							["amount"] = 279,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 319,
									["min"] = 319,
									["count"] = 1,
									["amount"] = 319,
								},
							},
							["count"] = 1,
							["amount"] = 319,
						},
					},
				},
			},
			["UnitLockout"] = 17558.568,
			["LastActive"] = 17922.558,
		},
		["冲进去出不来-黑龙费尔默"] = {
			["GUID"] = "Player-5450-0307D1F4",
			["TimeLast"] = {
				["TimeHeal"] = 17768.565,
				["DeathCount"] = 17769.565,
				["OVERALL"] = 17904.557,
				["DamageTaken"] = 17904.557,
				["HealingTaken"] = 17768.565,
				["Healing"] = 17768.565,
				["RageGain"] = 17901.557,
				["HOT_Time"] = 17768.565,
				["TimeDamage"] = 17904.557,
				["Interrupts"] = 17851.554,
				["ActiveTime"] = 17904.557,
				["DOT_Time"] = 17844.553,
				["Damage"] = 17902.557,
			},
			["LastAttackedBy"] = "不会假死-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"MISC", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"MISC", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					12, -- [1]
				},
				["Healing"] = {
					388, -- [1]
				},
				["DamageTaken"] = {
					17277, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["HealingTaken"] = {
					388, -- [1]
				},
				["RageGain"] = {
					127, -- [1]
				},
				["HOT_Time"] = {
					24, -- [1]
				},
				["TimeDamage"] = {
					63.6, -- [1]
				},
				["Interrupts"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					75.60000000000001, -- [1]
				},
				["DOT_Time"] = {
					42, -- [1]
				},
				["Damage"] = {
					14332, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						false, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						false, -- [42]
					},
					["Messages"] = {
						"冲进去出不来-黑龙费尔默 肉搏 瞬狱影杀阵-逐风者 Hit -344 (Physical)", -- [1]
						"冲进去出不来-黑龙费尔默 断筋 瞬狱影杀阵-逐风者 Hit -38 (Physical)", -- [2]
						"冲进去出不来-黑龙费尔默 拦截昏迷 瞬狱影杀阵-逐风者 Immune (Physical)", -- [3]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -65 (Shadow)", -- [4]
						"瞬狱影杀阵-逐风者 冰霜新星 冲进去出不来-黑龙费尔默 Hit -101 (Frost)", -- [5]
						"依卤-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Hit -197 (Physical)", -- [6]
						"依卤-黑龙费尔默 多重射击 冲进去出不来-黑龙费尔默 Hit -261 (Physical)", -- [7]
						"冲进去出不来-黑龙费尔默 肉搏 瞬狱影杀阵-逐风者 Crit -758 (Physical)", -- [8]
						"冲进去出不来-黑龙费尔默 断筋 瞬狱影杀阵-逐风者 Hit -38 (Physical)", -- [9]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -65 (Shadow)", -- [10]
						"瞬狱影杀阵-逐风者 冰锥术 冲进去出不来-黑龙费尔默 Hit -468 (Frost)", -- [11]
						"索德斯吶 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -157 (Shadow)", -- [12]
						"索德斯吶 献祭 冲进去出不来-黑龙费尔默 Hit -295 (Fire)", -- [13]
						"豹 肉搏 冲进去出不来-黑龙费尔默 Hit -48 (Physical)", -- [14]
						"豹 爪击 冲进去出不来-黑龙费尔默 Dodge (Physical)", -- [15]
						"冲进去出不来-黑龙费尔默 旋风斩 豹 Dodge (Physical)", -- [16]
						"冲进去出不来-黑龙费尔默 旋风斩 瞬狱影杀阵-逐风者 Hit -347 (Physical)", -- [17]
						"瞬狱影杀阵-逐风者 火焰冲击 冲进去出不来-黑龙费尔默 Hit -746 (Fire)", -- [18]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -66 (Shadow)", -- [19]
						"豹 肉搏 冲进去出不来-黑龙费尔默 Hit -46 (Physical)", -- [20]
						"豹 爪击 冲进去出不来-黑龙费尔默 Hit -32 (Physical)", -- [21]
						"依卤-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Hit -193 (Physical)", -- [22]
						"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 瞬狱影杀阵-逐风者 Tick -70 (Physical)", -- [23]
						"依卤-黑龙费尔默 毒蛇钉刺 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -87 (Nature)", -- [24]
						"冲进去出不来-黑龙费尔默 肉搏 瞬狱影杀阵-逐风者 Hit -388 (Physical)", -- [25]
						"瞬狱影杀阵-逐风者 魔爆术 冲进去出不来-黑龙费尔默 Hit -441 (Arcane)", -- [26]
						"豹 肉搏 冲进去出不来-黑龙费尔默 Crit -124 (Physical)", -- [27]
						"索德斯吶 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -188 (Shadow)", -- [28]
						"索德斯吶 献祭 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -137 (Fire)", -- [29]
						"豹 爪击 冲进去出不来-黑龙费尔默 Hit -35 (Physical)", -- [30]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -79 (Shadow)", -- [31]
						"逐风者卡巴-逐风者 痛苦诅咒 冲进去出不来-黑龙费尔默 Resist (Shadow)", -- [32]
						"豹 肉搏 冲进去出不来-黑龙费尔默 Hit -54 (Physical)", -- [33]
						"冲进去出不来-黑龙费尔默 致死打击 瞬狱影杀阵-逐风者 Crit -1337 (Physical)", -- [34]
						"瞬狱影杀阵-逐风者 魔爆术 冲进去出不来-黑龙费尔默 Hit -429 (Arcane)", -- [35]
						"依卤-黑龙费尔默 奥术射击 冲进去出不来-黑龙费尔默 Hit -249 (Arcane)", -- [36]
						"依卤-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Hit -213 (Physical)", -- [37]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +49", -- [38]
						"豹 爪击 冲进去出不来-黑龙费尔默 Hit -33 (Physical)", -- [39]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -145 (Shadow)", -- [40]
						"冲进去出不来-黑龙费尔默死亡。", -- [41]
						"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 瞬狱影杀阵-逐风者 Tick -110 (Physical)", -- [42]
					},
					["DeathAt"] = 17771.565,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageTimes"] = {
						-10.40099999999802, -- [1]
						-10.40099999999802, -- [2]
						-8.434000000001106, -- [3]
						-8.016999999999825, -- [4]
						-7.167000000001281, -- [5]
						-6.86699999999837, -- [6]
						-6.816999999999098, -- [7]
						-6.600999999998749, -- [8]
						-6.533999999999651, -- [9]
						-6.001000000000204, -- [10]
						-5.633999999998196, -- [11]
						-5.5, -- [12]
						-5.484000000000378, -- [13]
						-5.400000000001455, -- [14]
						-5.383999999998196, -- [15]
						-4.364999999997963, -- [16]
						-4.364999999997963, -- [17]
						-4.099999999998545, -- [18]
						-4, -- [19]
						-3.979999999999563, -- [20]
						-3.766999999999825, -- [21]
						-3.566999999999098, -- [22]
						-3.566999999999098, -- [23]
						-2.950000000000728, -- [24]
						-2.782999999999447, -- [25]
						-2.633999999998196, -- [26]
						-2.582999999998719, -- [27]
						-2.5, -- [28]
						-2.483000000000175, -- [29]
						-2.150000000001455, -- [30]
						-2.016999999999825, -- [31]
						-1.533999999999651, -- [32]
						-1.049999999999272, -- [33]
						-1.049999999999272, -- [34]
						-1.049999999999272, -- [35]
						-1.049999999999272, -- [36]
						-1.049999999999272, -- [37]
						-0.5829999999987194, -- [38]
						-0.532999999999447, -- [39]
						0, -- [40]
						0, -- [41]
						1.867000000002008, -- [42]
					},
					["HealthMax"] = {
						4869, -- [1]
						4869, -- [2]
						4869, -- [3]
						4869, -- [4]
						4869, -- [5]
						4869, -- [6]
						4869, -- [7]
						4869, -- [8]
						4869, -- [9]
						4869, -- [10]
						4869, -- [11]
						4869, -- [12]
						4869, -- [13]
						4869, -- [14]
						4869, -- [15]
						4869, -- [16]
						4869, -- [17]
						4869, -- [18]
						4869, -- [19]
						4869, -- [20]
						4869, -- [21]
						4869, -- [22]
						4869, -- [23]
						4869, -- [24]
						4869, -- [25]
						4869, -- [26]
						4869, -- [27]
						4869, -- [28]
						4869, -- [29]
						4869, -- [30]
						4869, -- [31]
						4869, -- [32]
						4869, -- [33]
						4869, -- [34]
						4869, -- [35]
						4869, -- [36]
						4869, -- [37]
						4869, -- [38]
						4869, -- [39]
						4869, -- [40]
						4869, -- [41]
						4869, -- [42]
					},
					["Health"] = {
						4786, -- [1]
						4786, -- [2]
						4786, -- [3]
						4786, -- [4]
						4721, -- [5]
						4620, -- [6]
						4620, -- [7]
						4162, -- [8]
						4162, -- [9]
						4162, -- [10]
						4097, -- [11]
						4097, -- [12]
						4097, -- [13]
						3177, -- [14]
						3177, -- [15]
						3129, -- [16]
						3129, -- [17]
						3129, -- [18]
						3129, -- [19]
						3129, -- [20]
						2271, -- [21]
						2271, -- [22]
						2271, -- [23]
						2046, -- [24]
						2046, -- [25]
						2046, -- [26]
						2046, -- [27]
						1394, -- [28]
						1394, -- [29]
						1069, -- [30]
						1069, -- [31]
						955, -- [32]
						955, -- [33]
						955, -- [34]
						955, -- [35]
						955, -- [36]
						955, -- [37]
						10, -- [38]
						59, -- [39]
						26, -- [40]
						0, -- [41]
						1, -- [42]
					},
					["KilledBy"] = "索德斯吶",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"HEAL", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"MISC", -- [41]
						"DAMAGE", -- [42]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
						false, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
					},
					["Messages"] = {
						"冲进去出不来-黑龙费尔默 肉搏 不会假死-逐风者 Crit -590 (Physical)", -- [1]
						"冲进去出不来-黑龙费尔默 断筋 不会假死-逐风者 Hit -31 (Physical)", -- [2]
						"拉克西里 肉搏 冲进去出不来-黑龙费尔默 Crit -119 (Physical)", -- [3]
						"拉克西里 爪击 冲进去出不来-黑龙费尔默 Parry (Physical)", -- [4]
						"拉克西里 肉搏 冲进去出不来-黑龙费尔默 Hit -55 (Physical)", -- [5]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +48", -- [6]
						"冲进去出不来-黑龙费尔默 肉搏 不会假死-逐风者 Hit -389 (Physical)", -- [7]
						"不会假死-逐风者 驱散射击 冲进去出不来-黑龙费尔默 Hit -100 (Physical)", -- [8]
						"依卤-黑龙费尔默 多重射击 冲进去出不来-黑龙费尔默 Hit -231 (Physical)", -- [9]
						"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 不会假死-逐风者 Tick -70 (Physical)", -- [10]
						"猎蝶兽兽-黑龙费尔默 多重射击 冲进去出不来-黑龙费尔默 Crit -670 (Physical)", -- [11]
						"拉克西里 肉搏 冲进去出不来-黑龙费尔默 Hit -52 (Physical)", -- [12]
						"冲进去出不来-黑龙费尔默 斩杀 不会假死-逐风者 Hit -883 (Physical)", -- [13]
						"猎蝶兽兽-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Crit -492 (Physical)", -- [14]
						"猎蝶兽兽-黑龙费尔默 奥术射击 冲进去出不来-黑龙费尔默 Hit -188 (Arcane)", -- [15]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +49", -- [16]
						"猎蝶兽兽-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Crit -496 (Physical)", -- [17]
						"风蛇 闪电吐息 冲进去出不来-黑龙费尔默 Hit -110 (Nature)", -- [18]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +48", -- [19]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -60 (Shadow)", -- [20]
						"猎蝶兽兽-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Hit -193 (Physical)", -- [21]
						"Yjw-黑龙费尔默 奥术飞弹 冲进去出不来-黑龙费尔默 Hit -230 (Arcane)", -- [22]
						"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -101 (Nature)", -- [23]
						"Yjw-黑龙费尔默 奥术飞弹 冲进去出不来-黑龙费尔默 Hit -230 (Arcane)", -- [24]
						"冲进去出不来-黑龙费尔默 拦截昏迷 索德斯吶 Hit -64 (Physical)", -- [25]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +49", -- [26]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -66 (Shadow)", -- [27]
						"Yjw-黑龙费尔默 奥术飞弹 冲进去出不来-黑龙费尔默 Hit -230 (Arcane)", -- [28]
						"猎蝶兽兽-黑龙费尔默 奥术射击 冲进去出不来-黑龙费尔默 Hit -207 (Arcane)", -- [29]
						"猎蝶兽兽-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Hit -229 (Physical)", -- [30]
						"风蛇 肉搏 冲进去出不来-黑龙费尔默 Hit -76 (Physical)", -- [31]
						"索德斯吶 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -157 (Shadow)", -- [32]
						"Yjw-黑龙费尔默 奥术飞弹 冲进去出不来-黑龙费尔默 Hit -253 (Arcane)", -- [33]
						"冲进去出不来-黑龙费尔默 肉搏 索德斯吶 Hit -421 (Physical)", -- [34]
						"冲进去出不来-黑龙费尔默 断筋 索德斯吶 Hit -47 (Physical)", -- [35]
						"风蛇 闪电吐息 冲进去出不来-黑龙费尔默 Hit -120 (Nature)", -- [36]
						"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -111 (Nature)", -- [37]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +48", -- [38]
						"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -66 (Shadow)", -- [39]
						"索德斯吶 生命虹吸 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -55 (Shadow)", -- [40]
						"Yjw-黑龙费尔默 奥术飞弹 冲进去出不来-黑龙费尔默 Hit -253 (Arcane)", -- [41]
						"冲进去出不来-黑龙费尔默死亡。", -- [42]
					},
					["DeathAt"] = 17552.568,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageTimes"] = {
						-12.39199999999983, -- [1]
						-12.39199999999983, -- [2]
						-12.25900000000183, -- [3]
						-11.32500000000073, -- [4]
						-10.74200000000201, -- [5]
						-10.24200000000201, -- [6]
						-10.14099999999962, -- [7]
						-9.724999999998545, -- [8]
						-9.657999999999447, -- [9]
						-9.407999999999447, -- [10]
						-9.084999999999127, -- [11]
						-9.075000000000728, -- [12]
						-8.825000000000728, -- [13]
						-8.791000000001077, -- [14]
						-8.20799999999872, -- [15]
						-6.775000000001455, -- [16]
						-6.474000000001979, -- [17]
						-4.841000000000349, -- [18]
						-4.474999999998545, -- [19]
						-4.074000000000524, -- [20]
						-3.890999999999622, -- [21]
						-3.75800000000163, -- [22]
						-3.474000000001979, -- [23]
						-2.907999999999447, -- [24]
						-2.825000000000728, -- [25]
						-2.474000000001979, -- [26]
						-2.091000000000349, -- [27]
						-2.074000000000524, -- [28]
						-2.024000000001252, -- [29]
						-2.024000000001252, -- [30]
						-1.907999999999447, -- [31]
						-1.591000000000349, -- [32]
						-1.440999999998894, -- [33]
						-1.25800000000163, -- [34]
						-1.25800000000163, -- [35]
						-0.7740000000012515, -- [36]
						-0.4740000000019791, -- [37]
						-0.4740000000019791, -- [38]
						-0.09100000000034925, -- [39]
						-0.07400000000052387, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["HealthMax"] = {
						4869, -- [1]
						4869, -- [2]
						4869, -- [3]
						4869, -- [4]
						4869, -- [5]
						4869, -- [6]
						4869, -- [7]
						4869, -- [8]
						4869, -- [9]
						4869, -- [10]
						4869, -- [11]
						4869, -- [12]
						4869, -- [13]
						4869, -- [14]
						4869, -- [15]
						4869, -- [16]
						4869, -- [17]
						4869, -- [18]
						4869, -- [19]
						4869, -- [20]
						4869, -- [21]
						4869, -- [22]
						4869, -- [23]
						4869, -- [24]
						4869, -- [25]
						4869, -- [26]
						4869, -- [27]
						4869, -- [28]
						4869, -- [29]
						4869, -- [30]
						4869, -- [31]
						4869, -- [32]
						4869, -- [33]
						4869, -- [34]
						4869, -- [35]
						4869, -- [36]
						4869, -- [37]
						4869, -- [38]
						4869, -- [39]
						4869, -- [40]
						4869, -- [41]
						4869, -- [42]
					},
					["Health"] = {
						4869, -- [1]
						4869, -- [2]
						4869, -- [3]
						4750, -- [4]
						4750, -- [5]
						4695, -- [6]
						4695, -- [7]
						4743, -- [8]
						4643, -- [9]
						4412, -- [10]
						4412, -- [11]
						3742, -- [12]
						3690, -- [13]
						3690, -- [14]
						3198, -- [15]
						3010, -- [16]
						3059, -- [17]
						2563, -- [18]
						2453, -- [19]
						2501, -- [20]
						2441, -- [21]
						2441, -- [22]
						2018, -- [23]
						1917, -- [24]
						1687, -- [25]
						1687, -- [26]
						1736, -- [27]
						1736, -- [28]
						1440, -- [29]
						1440, -- [30]
						1004, -- [31]
						928, -- [32]
						771, -- [33]
						518, -- [34]
						518, -- [35]
						518, -- [36]
						398, -- [37]
						398, -- [38]
						335, -- [39]
						335, -- [40]
						335, -- [41]
						0, -- [42]
					},
					["KilledBy"] = "Yjw-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"HEAL", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"HEAL", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"HEAL", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"HEAL", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"HEAL", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"MISC", -- [42]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						false, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
						false, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
					},
					["Messages"] = {
						"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 逐风者卡巴-逐风者 Tick -77 (Physical)", -- [1]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -180 (Shadow)", -- [2]
						"冲进去出不来-黑龙费尔默 肉搏 逐风者卡巴-逐风者 Hit -408 (Physical)", -- [3]
						"冲进去出不来-黑龙费尔默 断筋 逐风者卡巴-逐风者 Hit -38 (Physical)", -- [4]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -77 (Shadow)", -- [5]
						"末日坠落-逐风者 破胆怒吼 冲进去出不来-黑龙费尔默 Immune (Physical)", -- [6]
						"克鲁霍姆 肉搏 冲进去出不来-黑龙费尔默 Hit -67 (Physical)", -- [7]
						"冲进去出不来-黑龙费尔默 拳击 逐风者卡巴-逐风者 Hit -42 (Physical)", -- [8]
						"冲进去出不来-黑龙费尔默 interrupts 逐风者卡巴-逐风者 献祭 (拳击)", -- [9]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -77 (Shadow)", -- [10]
						"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 逐风者卡巴-逐风者 Tick -78 (Physical)", -- [11]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -180 (Shadow)", -- [12]
						"克鲁霍姆 肉搏 冲进去出不来-黑龙费尔默 Dodge (1)", -- [13]
						"末日坠落-逐风者 肉搏 冲进去出不来-黑龙费尔默 Hit -199 (Physical)", -- [14]
						"冲进去出不来-黑龙费尔默 斩杀 逐风者卡巴-逐风者 Hit -723 (Physical)", -- [15]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -77 (Shadow)", -- [16]
						"冲进去出不来-黑龙费尔默 肉搏 末日坠落-逐风者 Hit -197 (Physical)", -- [17]
						"冲进去出不来-黑龙费尔默 断筋 末日坠落-逐风者 Crit -45 (Physical)", -- [18]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -180 (Shadow)", -- [19]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -76 (Shadow)", -- [20]
						"不会假死-逐风者 多重射击 冲进去出不来-黑龙费尔默 Crit -970 (Physical)", -- [21]
						"不会假死-逐风者 自动射击 冲进去出不来-黑龙费尔默 Crit -505 (Physical)", -- [22]
						"不会假死-逐风者 自动射击 冲进去出不来-黑龙费尔默 Hit -240 (Physical)", -- [23]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -125 (Shadow)", -- [24]
						"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 末日坠落-逐风者 Tick -70 (Physical)", -- [25]
						"末日坠落-逐风者 雷霆一击 冲进去出不来-黑龙费尔默 Hit -65 (Physical)", -- [26]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +49", -- [27]
						"冲进去出不来-黑龙费尔默 肉搏 末日坠落-逐风者 Hit -236 (Physical)", -- [28]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -179 (Shadow)", -- [29]
						"冲进去出不来-黑龙费尔默 斩杀 末日坠落-逐风者 Hit -511 (Physical)", -- [30]
						"不会假死-逐风者 自动射击 冲进去出不来-黑龙费尔默 Crit -545 (Physical)", -- [31]
						"不会假死-逐风者 奥术射击 冲进去出不来-黑龙费尔默 Hit -218 (Arcane)", -- [32]
						"逐风者卡巴-逐风者 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -125 (Shadow)", -- [33]
						"冲进去出不来-黑龙费尔默 断筋 末日坠落-逐风者 Dodge (Physical)", -- [34]
						"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 末日坠落-逐风者 Tick -70 (Physical)", -- [35]
						"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +48", -- [36]
						"逐风者卡巴-逐风者 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -180 (Shadow)", -- [37]
						"冲进去出不来-黑龙费尔默死亡。", -- [38]
					},
					["DeathAt"] = 17487.563,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
					},
					["MessageTimes"] = {
						-12.35000000000218, -- [1]
						-12.01700000000346, -- [2]
						-11.73400000000038, -- [3]
						-11.73400000000038, -- [4]
						-11.5, -- [5]
						-11.16200000000026, -- [6]
						-10.78400000000329, -- [7]
						-10.21700000000055, -- [8]
						-10.21700000000055, -- [9]
						-9.5, -- [10]
						-9.350000000002183, -- [11]
						-9, -- [12]
						-8.75, -- [13]
						-8.700000000000728, -- [14]
						-8.033000000003085, -- [15]
						-7.5, -- [16]
						-6.833000000002357, -- [17]
						-6.517000000003463, -- [18]
						-6.01600000000326, -- [19]
						-5.5, -- [20]
						-5.083000000002357, -- [21]
						-5.05000000000291, -- [22]
						-3.63300000000163, -- [23]
						-3.5, -- [24]
						-3.483000000000175, -- [25]
						-3.233000000000175, -- [26]
						-3.033000000003085, -- [27]
						-3.033000000003085, -- [28]
						-3.01600000000326, -- [29]
						-2.55000000000291, -- [30]
						-2.316000000002532, -- [31]
						-1.75, -- [32]
						-1.5, -- [33]
						-0.783000000003085, -- [34]
						-0.4830000000001746, -- [35]
						-0.3000000000029104, -- [36]
						0, -- [37]
						0, -- [38]
					},
					["HealthMax"] = {
						4869, -- [1]
						4869, -- [2]
						4869, -- [3]
						4869, -- [4]
						4869, -- [5]
						4869, -- [6]
						4869, -- [7]
						4869, -- [8]
						4869, -- [9]
						4869, -- [10]
						4869, -- [11]
						4869, -- [12]
						4869, -- [13]
						4869, -- [14]
						4869, -- [15]
						4869, -- [16]
						4869, -- [17]
						4869, -- [18]
						4869, -- [19]
						4869, -- [20]
						4869, -- [21]
						4869, -- [22]
						4869, -- [23]
						4869, -- [24]
						4869, -- [25]
						4869, -- [26]
						4869, -- [27]
						4869, -- [28]
						4869, -- [29]
						4869, -- [30]
						4869, -- [31]
						4869, -- [32]
						4869, -- [33]
						4869, -- [34]
						4869, -- [35]
						4869, -- [36]
						4869, -- [37]
						4869, -- [38]
					},
					["Health"] = {
						4137, -- [1]
						4137, -- [2]
						3957, -- [3]
						3957, -- [4]
						3957, -- [5]
						3880, -- [6]
						3880, -- [7]
						3813, -- [8]
						3813, -- [9]
						3813, -- [10]
						3736, -- [11]
						3736, -- [12]
						3556, -- [13]
						3556, -- [14]
						3357, -- [15]
						3357, -- [16]
						3280, -- [17]
						3280, -- [18]
						3280, -- [19]
						3100, -- [20]
						3024, -- [21]
						3024, -- [22]
						1549, -- [23]
						1309, -- [24]
						1184, -- [25]
						1184, -- [26]
						1119, -- [27]
						1119, -- [28]
						1168, -- [29]
						989, -- [30]
						989, -- [31]
						444, -- [32]
						444, -- [33]
						101, -- [34]
						101, -- [35]
						101, -- [36]
						149, -- [37]
						0, -- [38]
					},
					["KilledBy"] = "逐风者卡巴-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"HEAL", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"HEAL", -- [36]
						"DAMAGE", -- [37]
						"MISC", -- [38]
					},
				}, -- [3]
			},
			["level"] = 60,
			["LastDamageAbility"] = "驱散射击",
			["LastFightIn"] = 6,
			["type"] = "Grouped",
			["LastHealTime"] = 17769.382,
			["LastDamageTaken"] = 115,
			["LastEventHealth"] = {
				4211, -- [1]
				4211, -- [2]
				4211, -- [3]
				4211, -- [4]
				3847, -- [5]
				3498, -- [6]
				3498, -- [7]
				3498, -- [8]
				3498, -- [9]
				3663, -- [10]
				3663, -- [11]
				3663, -- [12]
				3663, -- [13]
				3487, -- [14]
				3487, -- [15]
				3487, -- [16]
				3487, -- [17]
				2046, -- [18]
				1394, -- [19]
				1394, -- [20]
				1069, -- [21]
				1069, -- [22]
				955, -- [23]
				955, -- [24]
				955, -- [25]
				955, -- [26]
				955, -- [27]
				955, -- [28]
				10, -- [29]
				59, -- [30]
				26, -- [31]
				0, -- [32]
				1, -- [33]
				4869, -- [34]
				4869, -- [35]
				4869, -- [36]
				4869, -- [37]
				4869, -- [38]
				4869, -- [39]
				4869, -- [40]
				4869, -- [41]
				4869, -- [42]
				4532, -- [43]
				4532, -- [44]
				4244, -- [45]
				4244, -- [46]
				4244, -- [47]
				4211, -- [48]
				4211, -- [49]
				4211, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4869, -- [1]
				4869, -- [2]
				4869, -- [3]
				4869, -- [4]
				4869, -- [5]
				4869, -- [6]
				4869, -- [7]
				4869, -- [8]
				4869, -- [9]
				4869, -- [10]
				4869, -- [11]
				4869, -- [12]
				4869, -- [13]
				4869, -- [14]
				4869, -- [15]
				4869, -- [16]
				4869, -- [17]
				4869, -- [18]
				4869, -- [19]
				4869, -- [20]
				4869, -- [21]
				4869, -- [22]
				4869, -- [23]
				4869, -- [24]
				4869, -- [25]
				4869, -- [26]
				4869, -- [27]
				4869, -- [28]
				4869, -- [29]
				4869, -- [30]
				4869, -- [31]
				4869, -- [32]
				4869, -- [33]
				4869, -- [34]
				4869, -- [35]
				4869, -- [36]
				4869, -- [37]
				4869, -- [38]
				4869, -- [39]
				4869, -- [40]
				4869, -- [41]
				4869, -- [42]
				4869, -- [43]
				4869, -- [44]
				4869, -- [45]
				4869, -- [46]
				4869, -- [47]
				4869, -- [48]
				4869, -- [49]
				4869, -- [50]
			},
			["NextEventNum"] = 18,
			["LastDamageTime"] = 17904.624,
			["LastEvents"] = {
				"冲进去出不来-黑龙费尔默 肉搏 索德斯吶 Hit -532 (Physical)", -- [1]
				"冲进去出不来-黑龙费尔默 拳击 索德斯吶 Hit -54 (Physical)", -- [2]
				"冲进去出不来-黑龙费尔默 interrupts 索德斯吶 吸取生命 (拳击)", -- [3]
				"断水流-黑龙费尔默 肉搏 冲进去出不来-黑龙费尔默 Hit -364 (Physical)", -- [4]
				"断水流-黑龙费尔默 旋风斩 冲进去出不来-黑龙费尔默 Hit -349 (Physical)", -- [5]
				"冲进去出不来-黑龙费尔默 肉搏 断水流-黑龙费尔默 Crit -717 (Physical)", -- [6]
				"冲进去出不来-黑龙费尔默 昏迷 断水流-黑龙费尔默 Resist (Physical)", -- [7]
				"冲进去出不来-黑龙费尔默 断筋 断水流-黑龙费尔默 Hit -38 (Physical)", -- [8]
				"冲进去出不来-黑龙费尔默 致死打击 断水流-黑龙费尔默 Hit -482 (Physical)", -- [9]
				"冲进去出不来-黑龙费尔默 肉搏 末日坠落-逐风者 Hit -279 (Physical)", -- [10]
				"冲进去出不来-黑龙费尔默 断筋 末日坠落-逐风者 Crit -59 (Physical)", -- [11]
				"冲进去出不来-黑龙费尔默 撕裂 末日坠落-逐风者 Dodge (Physical)", -- [12]
				"冲进去出不来-黑龙费尔默 斩杀 末日坠落-逐风者 Miss (Physical)", -- [13]
				"冲进去出不来-黑龙费尔默 肉搏 不会假死-逐风者 Hit -359 (Physical)", -- [14]
				"冲进去出不来-黑龙费尔默 断筋 不会假死-逐风者 Crit -73 (Physical)", -- [15]
				"冲进去出不来-黑龙费尔默 撕裂 不会假死-逐风者 Parry (Physical)", -- [16]
				"不会假死-逐风者 驱散射击 冲进去出不来-黑龙费尔默 Hit -115 (Physical)", -- [17]
				"豹 肉搏 冲进去出不来-黑龙费尔默 Crit -124 (Physical)", -- [18]
				"索德斯吶 腐蚀术 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -188 (Shadow)", -- [19]
				"索德斯吶 献祭 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -137 (Fire)", -- [20]
				"豹 爪击 冲进去出不来-黑龙费尔默 Hit -35 (Physical)", -- [21]
				"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -79 (Shadow)", -- [22]
				"逐风者卡巴-逐风者 痛苦诅咒 冲进去出不来-黑龙费尔默 Resist (Shadow)", -- [23]
				"豹 肉搏 冲进去出不来-黑龙费尔默 Hit -54 (Physical)", -- [24]
				"冲进去出不来-黑龙费尔默 致死打击 瞬狱影杀阵-逐风者 Crit -1337 (Physical)", -- [25]
				"瞬狱影杀阵-逐风者 魔爆术 冲进去出不来-黑龙费尔默 Hit -429 (Arcane)", -- [26]
				"依卤-黑龙费尔默 奥术射击 冲进去出不来-黑龙费尔默 Hit -249 (Arcane)", -- [27]
				"依卤-黑龙费尔默 自动射击 冲进去出不来-黑龙费尔默 Hit -213 (Physical)", -- [28]
				"冲进去出不来-黑龙费尔默 血之狂热 冲进去出不来-黑龙费尔默 Tick +49", -- [29]
				"豹 爪击 冲进去出不来-黑龙费尔默 Hit -33 (Physical)", -- [30]
				"索德斯吶 痛苦诅咒 (伤害/跳) 冲进去出不来-黑龙费尔默 Tick -145 (Shadow)", -- [31]
				"冲进去出不来-黑龙费尔默死亡。", -- [32]
				"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 瞬狱影杀阵-逐风者 Tick -110 (Physical)", -- [33]
				"Environment Falling 冲进去出不来-黑龙费尔默 Hit -256 (Physical)", -- [34]
				"冲进去出不来-黑龙费尔默 肉搏 断水流-黑龙费尔默 Hit -353 (Physical)", -- [35]
				"冲进去出不来-黑龙费尔默 断筋 断水流-黑龙费尔默 Crit -76 (Physical)", -- [36]
				"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 断水流-黑龙费尔默 Tick -119 (Physical)", -- [37]
				"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 断水流-黑龙费尔默 Tick -119 (Physical)", -- [38]
				"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 断水流-黑龙费尔默 Tick -130 (Physical)", -- [39]
				"冲进去出不来-黑龙费尔默 拦截昏迷 断水流-黑龙费尔默 Hit -52 (Physical)", -- [40]
				"冲进去出不来-黑龙费尔默 肉搏 断水流-黑龙费尔默 Hit -390 (Physical)", -- [41]
				"冲进去出不来-黑龙费尔默 断筋 断水流-黑龙费尔默 Hit -38 (Physical)", -- [42]
				"冲进去出不来-黑龙费尔默 重伤 (伤害/跳) 断水流-黑龙费尔默 Tick -131 (Physical)", -- [43]
				"断水流-黑龙费尔默 肉搏 冲进去出不来-黑龙费尔默 Hit -288 (Physical)", -- [44]
				"冲进去出不来-黑龙费尔默 断筋 断水流-黑龙费尔默 Hit -38 (Physical)", -- [45]
				"冲进去出不来-黑龙费尔默 锤击昏迷效果 断水流-黑龙费尔默 Resist (Physical)", -- [46]
				"断水流-黑龙费尔默 断筋 冲进去出不来-黑龙费尔默 Hit -33 (Physical)", -- [47]
				"冲进去出不来-黑龙费尔默 肉搏 索德斯吶 Hit -458 (Physical)", -- [48]
				"冲进去出不来-黑龙费尔默 断筋 索德斯吶 Hit -48 (Physical)", -- [49]
				"冲进去出不来-黑龙费尔默 断筋 索德斯吶 Hit -49 (Physical)", -- [50]
			},
			["Name"] = "冲进去出不来-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				17851.054, -- [1]
				17851.654, -- [2]
				17851.654, -- [3]
				17853.937, -- [4]
				17854.321, -- [5]
				17855.137, -- [6]
				17855.137, -- [7]
				17855.137, -- [8]
				17856.637, -- [9]
				17867.688, -- [10]
				17867.688, -- [11]
				17869.188, -- [12]
				17870.705, -- [13]
				17903.14, -- [14]
				17903.14, -- [15]
				17904.624, -- [16]
				17904.99, -- [17]
				17767.382, -- [18]
				17767.465, -- [19]
				17767.482, -- [20]
				17767.815, -- [21]
				17767.948, -- [22]
				17768.431, -- [23]
				17768.915, -- [24]
				17768.915, -- [25]
				17768.915, -- [26]
				17768.915, -- [27]
				17768.915, -- [28]
				17769.382, -- [29]
				17769.432, -- [30]
				17769.965, -- [31]
				17769.965, -- [32]
				17771.832, -- [33]
				17809.067, -- [34]
				17833.069, -- [35]
				17833.069, -- [36]
				17836.103, -- [37]
				17839.103, -- [38]
				17842.103, -- [39]
				17842.436, -- [40]
				17843.453, -- [41]
				17843.553, -- [42]
				17845.103, -- [43]
				17845.453, -- [44]
				17846.037, -- [45]
				17846.053, -- [46]
				17846.237, -- [47]
				17847.253, -- [48]
				17847.537, -- [49]
				17850.153, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["瞬狱影杀阵-逐风者"] = {
									["count"] = 6,
								},
								["逐风者卡巴-逐风者"] = {
									["count"] = 6,
								},
								["不会假死-逐风者"] = {
									["count"] = 3,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 12,
								},
								["末日坠落-逐风者"] = {
									["count"] = 6,
								},
								["灵魂摆渡人-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 39,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 21,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 30,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 13,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 23,
								},
							},
							["amount"] = 24,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
					},
					["DamageTaken"] = 17277,
					["RageGainedFrom"] = {
						["冲进去出不来-黑龙费尔默"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 26,
								},
								["怒不可遏"] = {
									["count"] = 11,
								},
								["冲锋"] = {
									["count"] = 90,
								},
							},
							["amount"] = 127,
						},
					},
					["DeathCount"] = 3,
					["HOT_Time"] = 24,
					["ElementTaken"] = {
						["Physical"] = 7956,
						["Melee"] = 1492,
						["Arcane"] = 2928,
						["Frost"] = 569,
						["Fire"] = 1178,
						["Shadow"] = 2625,
						["Nature"] = 529,
					},
					["DOT_Time"] = 42,
					["Damage"] = 14332,
					["TimeHeal"] = 12,
					["ElementDone"] = {
						["Melee"] = 7449,
						["Physical"] = 6883,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 18,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Resist"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 12,
								},
								["Hit"] = {
									["count"] = 21,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 3,
								},
							},
							["amount"] = 48,
						},
					},
					["WhoDamaged"] = {
						["克鲁霍姆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 67,
								},
							},
							["amount"] = 67,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 870,
								},
								["火焰冲击"] = {
									["count"] = 746,
								},
								["冰锥术"] = {
									["count"] = 468,
								},
								["冰霜新星"] = {
									["count"] = 101,
								},
							},
							["amount"] = 2185,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 899,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 557,
								},
							},
							["amount"] = 1456,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 215,
								},
								["自动射击"] = {
									["count"] = 1290,
								},
								["多重射击"] = {
									["count"] = 1321,
								},
								["奥术射击"] = {
									["count"] = 218,
								},
							},
							["amount"] = 3044,
						},
						["依卤-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 87,
								},
								["自动射击"] = {
									["count"] = 603,
								},
								["多重射击"] = {
									["count"] = 492,
								},
								["奥术射击"] = {
									["count"] = 249,
								},
							},
							["amount"] = 1431,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 33,
								},
								["旋风斩"] = {
									["count"] = 349,
								},
								["肉搏"] = {
									["count"] = 652,
								},
							},
							["amount"] = 1034,
						},
						["风蛇"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 76,
								},
								["闪电吐息"] = {
									["count"] = 230,
								},
							},
							["amount"] = 306,
						},
						["Yjw-黑龙费尔默"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 1196,
								},
							},
							["amount"] = 1196,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 212,
								},
								["自动射击"] = {
									["count"] = 1410,
								},
								["多重射击"] = {
									["count"] = 670,
								},
								["奥术射击"] = {
									["count"] = 395,
								},
							},
							["amount"] = 2687,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1408,
								},
							},
							["amount"] = 1408,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 65,
								},
								["肉搏"] = {
									["count"] = 199,
								},
							},
							["amount"] = 264,
						},
						["索德斯吶"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 55,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 612,
								},
								["献祭"] = {
									["count"] = 295,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 502,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 137,
								},
							},
							["amount"] = 1601,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 100,
								},
								["肉搏"] = {
									["count"] = 272,
								},
							},
							["amount"] = 372,
						},
						["拉克西里"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 226,
								},
							},
							["amount"] = 226,
						},
					},
					["TimeHealing"] = {
						["冲进去出不来-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["PartialResist"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
					},
					["PartialAbsorb"] = {
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
					},
					["Interrupts"] = 2,
					["InterruptData"] = {
						["索德斯吶"] = {
							["Details"] = {
								["吸取生命 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["献祭 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 49,
									["min"] = 48,
									["count"] = 8,
									["amount"] = 388,
								},
							},
							["count"] = 8,
							["amount"] = 388,
						},
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 140,
					},
					["HealedWho"] = {
						["冲进去出不来-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 388,
								},
							},
							["amount"] = 388,
						},
					},
					["HealingTaken"] = 388,
					["Healing"] = 388,
					["WhoHealed"] = {
						["冲进去出不来-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 388,
								},
							},
							["amount"] = 388,
						},
					},
					["TimeSpent"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.3,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.15,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.62,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.32,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.37,
								},
							},
							["amount"] = 5.810000000000001,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["撕裂"] = {
									["count"] = 1.48,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.73,
								},
								["斩杀"] = {
									["count"] = 0.58,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 7.289999999999999,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["锤击昏迷效果"] = {
									["count"] = 0.02,
								},
								["拦截昏迷"] = {
									["count"] = 0.33,
								},
								["断筋"] = {
									["count"] = 1.03,
								},
								["肉搏"] = {
									["count"] = 4.02,
								},
							},
							["amount"] = 12.9,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.27,
								},
								["斩杀"] = {
									["count"] = 0.45,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.22,
						},
						["冲进去出不来-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.8,
								},
								["撕裂"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.82,
								},
								["斩杀"] = {
									["count"] = 1.98,
								},
								["肉搏"] = {
									["count"] = 3.15,
								},
							},
							["amount"] = 10.25,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["索德斯吶"] = {
							["Details"] = {
								["拳击"] = {
									["count"] = 0.6,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.78,
								},
								["肉搏"] = {
									["count"] = 3.6,
								},
							},
							["amount"] = 7.48,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1337,
									["min"] = 1337,
									["count"] = 1,
									["amount"] = 1337,
								},
								["Hit"] = {
									["max"] = 482,
									["min"] = 482,
									["count"] = 1,
									["amount"] = 482,
								},
							},
							["count"] = 2,
							["amount"] = 1819,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 70,
									["min"] = 70,
									["count"] = 2,
									["amount"] = 140,
								},
								["Tick"] = {
									["max"] = 131,
									["min"] = 70,
									["count"] = 11,
									["amount"] = 1044,
								},
							},
							["count"] = 13,
							["amount"] = 1184,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 54,
									["min"] = 42,
									["count"] = 2,
									["amount"] = 96,
								},
							},
							["count"] = 2,
							["amount"] = 96,
						},
						["撕裂"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 64,
									["min"] = 52,
									["count"] = 2,
									["amount"] = 116,
								},
							},
							["count"] = 3,
							["amount"] = 116,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 347,
									["min"] = 347,
									["count"] = 1,
									["amount"] = 347,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 347,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 76,
									["min"] = 45,
									["count"] = 4,
									["amount"] = 253,
								},
								["Hit"] = {
									["max"] = 49,
									["min"] = 31,
									["count"] = 11,
									["amount"] = 434,
								},
							},
							["count"] = 16,
							["amount"] = 687,
						},
						["斩杀"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 883,
									["min"] = 489,
									["count"] = 4,
									["amount"] = 2606,
								},
							},
							["count"] = 5,
							["amount"] = 2606,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 758,
									["min"] = 590,
									["count"] = 3,
									["amount"] = 2065,
								},
								["Hit"] = {
									["max"] = 532,
									["min"] = 197,
									["count"] = 15,
									["amount"] = 5384,
								},
							},
							["count"] = 18,
							["amount"] = 7449,
						},
					},
					["RageGain"] = 127,
					["ActiveTime"] = 75.60000000000001,
					["TimeDamage"] = 63.6,
					["TimeDamaging"] = {
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.3,
								},
								["断筋"] = {
									["count"] = 0.07,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.78,
								},
							},
							["amount"] = 9.15,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.62,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.32,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.37,
								},
							},
							["amount"] = 5.810000000000001,
						},
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["锤击昏迷效果"] = {
									["count"] = 0.02,
								},
								["拦截昏迷"] = {
									["count"] = 0.33,
								},
								["断筋"] = {
									["count"] = 1.03,
								},
								["肉搏"] = {
									["count"] = 4.02,
								},
							},
							["amount"] = 12.9,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.27,
								},
								["斩杀"] = {
									["count"] = 0.45,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.22,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.8,
								},
								["撕裂"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.82,
								},
								["斩杀"] = {
									["count"] = 1.98,
								},
								["肉搏"] = {
									["count"] = 3.15,
								},
							},
							["amount"] = 10.25,
						},
						["索德斯吶"] = {
							["Details"] = {
								["拳击"] = {
									["count"] = 0.6,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.78,
								},
								["肉搏"] = {
									["count"] = 3.6,
								},
							},
							["amount"] = 7.48,
						},
						["豹"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["撕裂"] = {
									["count"] = 1.48,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.73,
								},
								["斩杀"] = {
									["count"] = 0.58,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 7.289999999999999,
						},
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["冲进去出不来-黑龙费尔默"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
						["怒不可遏"] = {
							["Details"] = {
								["冲进去出不来-黑龙费尔默"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
						["冲锋"] = {
							["Details"] = {
								["冲进去出不来-黑龙费尔默"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
					},
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["冲进去出不来-黑龙费尔默"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["DamagedWho"] = {
						["灵魂摆渡人-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 140,
								},
							},
							["amount"] = 140,
						},
						["瞬狱影杀阵-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1337,
								},
								["旋风斩"] = {
									["count"] = 347,
								},
								["断筋"] = {
									["count"] = 76,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 180,
								},
								["肉搏"] = {
									["count"] = 1490,
								},
							},
							["amount"] = 3430,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
								["断筋"] = {
									["count"] = 31,
								},
								["斩杀"] = {
									["count"] = 489,
								},
								["肉搏"] = {
									["count"] = 630,
								},
							},
							["amount"] = 1178,
						},
						["逐风者卡巴-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 155,
								},
								["拳击"] = {
									["count"] = 42,
								},
								["断筋"] = {
									["count"] = 38,
								},
								["斩杀"] = {
									["count"] = 723,
								},
								["肉搏"] = {
									["count"] = 408,
								},
							},
							["amount"] = 1366,
						},
						["不会假死-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 70,
								},
								["断筋"] = {
									["count"] = 104,
								},
								["斩杀"] = {
									["count"] = 883,
								},
								["肉搏"] = {
									["count"] = 1338,
								},
							},
							["amount"] = 2395,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 482,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 499,
								},
								["断筋"] = {
									["count"] = 190,
								},
								["拦截昏迷"] = {
									["count"] = 52,
								},
								["肉搏"] = {
									["count"] = 1460,
								},
							},
							["amount"] = 2683,
						},
						["索德斯吶"] = {
							["Details"] = {
								["拳击"] = {
									["count"] = 54,
								},
								["拦截昏迷"] = {
									["count"] = 64,
								},
								["断筋"] = {
									["count"] = 144,
								},
								["肉搏"] = {
									["count"] = 1411,
								},
							},
							["amount"] = 1673,
						},
						["末日坠落-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 140,
								},
								["断筋"] = {
									["count"] = 104,
								},
								["斩杀"] = {
									["count"] = 511,
								},
								["肉搏"] = {
									["count"] = 712,
								},
							},
							["amount"] = 1467,
						},
					},
				},
			},
			["UnitLockout"] = 17523.566,
			["LastActive"] = 17904.557,
		},
	},
	["FightNum"] = 8,
	["CombatTimes"] = {
		{
			17423.559, -- [1]
			17495.564, -- [2]
			"16:49:15", -- [3]
			"16:50:26", -- [4]
			"Environment", -- [5]
		}, -- [1]
		{
			17497.564, -- [1]
			17506.568, -- [2]
			"16:50:29", -- [3]
			"16:50:37", -- [4]
			"Environment", -- [5]
		}, -- [2]
		{
			17521.565, -- [1]
			17528.566, -- [2]
			"16:50:53", -- [3]
			"16:50:59", -- [4]
			"Environment", -- [5]
		}, -- [3]
		{
			17531.566, -- [1]
			17589.553, -- [2]
			"16:51:03", -- [3]
			"16:52:00", -- [4]
			"不会假死-逐风者", -- [5]
		}, -- [4]
		{
			17597.554, -- [1]
			17738.563, -- [2]
			"16:52:09", -- [3]
			"16:54:29", -- [4]
			"索德斯吶", -- [5]
		}, -- [5]
		{
			17743.563, -- [1]
			17749.564, -- [2]
			"16:54:35", -- [3]
			"16:54:40", -- [4]
			"灵魂摆渡人-逐风者", -- [5]
		}, -- [6]
		{
			17752.564, -- [1]
			17937.559, -- [2]
			"16:54:44", -- [3]
			"16:57:48", -- [4]
			"瞬狱影杀阵-逐风者", -- [5]
		}, -- [7]
		{
			17940.559, -- [1]
			17948.56, -- [2]
			"16:57:52", -- [3]
			"16:57:59", -- [4]
			"拉克西里", -- [5]
		}, -- [8]
	},
	["FoughtWho"] = {
	},
}
