
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
					},
					["Messages"] = {
						"老白鲨-逐风者 肉搏 特变电工 Dodge (1)", -- [1]
						"老白鲨-逐风者 致死打击 特变电工 Hit -282 (Physical)", -- [2]
						"老白鲨-逐风者 断筋 特变电工 Hit -26 (Physical)", -- [3]
						"老白鲨-逐风者 肉搏 特变电工 Hit -288 (Physical)", -- [4]
						"蓝色空间号-逐风者 心灵震爆 特变电工 Hit -604 (Shadow)", -- [5]
						"特变电工 缴械 老白鲨-逐风者 Immune (Physical)", -- [6]
						"特变电工 肉搏 老白鲨-逐风者 Absorb -550 (550 被吸收) (1)", -- [7]
						"蓝色空间号-逐风者 射击 特变电工 Hit -57 (Nature)", -- [8]
						"雲木彡-逐风者 肉搏 特变电工 Hit -280 (Physical)", -- [9]
						"老白鲨-逐风者 肉搏 特变电工 Hit -303 (Physical)", -- [10]
						"雲木彡-逐风者 断筋 特变电工 Hit -27 (Physical)", -- [11]
						"特变电工 雷霆一击 雲木彡-逐风者 Hit -53 (Physical)", -- [12]
						"特变电工 雷霆一击 老白鲨-逐风者 Absorb -60 (60 被吸收) (Physical)", -- [13]
						"蓝色空间号-逐风者 射击 特变电工 Crit -134 (Nature)", -- [14]
						"特变电工 重伤 (伤害/跳) 老白鲨-逐风者 Absorb -68 (68 被吸收) (Physical)", -- [15]
						"一路酱-逐风者 暗言术：痛 (伤害/跳) 特变电工 Tick -194 (Shadow)", -- [16]
						"老白鲨-逐风者 致死打击 特变电工 Hit -463 (Physical)", -- [17]
						"老戏骨-逐风者 冰霜震击 特变电工 Hit -507 (Frost)", -- [18]
						"特变电工 肉搏 老白鲨-逐风者 Absorb -439 (1)", -- [19]
						"特变电工 肉搏 老白鲨-逐风者 Crit -359 (439 被吸收) (Physical)", -- [20]
						"雲木彡-逐风者 肉搏 特变电工 Hit -237 (Physical)", -- [21]
						"老白鲨-逐风者 肉搏 特变电工 Hit -326 (Physical)", -- [22]
						"老白鲨-逐风者 斩杀 特变电工 Crit -935 (Physical)", -- [23]
						"特变电工死亡。", -- [24]
					},
					["DeathAt"] = 14071.21,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-12.26900000000023, -- [1]
						-12.08600000000115, -- [2]
						-8.635000000000218, -- [3]
						-8.46900000000096, -- [4]
						-7.352000000000771, -- [5]
						-6.319000000001324, -- [6]
						-6.319000000001324, -- [7]
						-4.885000000000218, -- [8]
						-4.68500000000131, -- [9]
						-4.652000000000044, -- [10]
						-4.485000000000582, -- [11]
						-4.218000000000757, -- [12]
						-4.218000000000757, -- [13]
						-3.417999999999665, -- [14]
						-3.30199999999968, -- [15]
						-2.568000000001121, -- [16]
						-1.952000000001135, -- [17]
						-1.667999999999665, -- [18]
						-1.518000000000029, -- [19]
						-1.518000000000029, -- [20]
						-0.5510000000012951, -- [21]
						-0.5180000000000291, -- [22]
						-0.01100000000042201, -- [23]
						0, -- [24]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
					},
					["Health"] = {
						3774, -- [1]
						3774, -- [2]
						3492, -- [3]
						3466, -- [4]
						3178, -- [5]
						2574, -- [6]
						2574, -- [7]
						2574, -- [8]
						2517, -- [9]
						2237, -- [10]
						1934, -- [11]
						1907, -- [12]
						1907, -- [13]
						1907, -- [14]
						1773, -- [15]
						1773, -- [16]
						1579, -- [17]
						1116, -- [18]
						609, -- [19]
						609, -- [20]
						609, -- [21]
						609, -- [22]
						46, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "老白鲨-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						false, -- [19]
						false, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
					},
					["Messages"] = {
						"特变电工 拦截昏迷 请叫我文哥 Hit -44 (Physical)", -- [1]
						"特变电工 肉搏 请叫我天哥-逐风者 Hit -467 (Physical)", -- [2]
						"特变电工 断筋 请叫我天哥-逐风者 Hit -35 (Physical)", -- [3]
						"特变电工 昏迷 请叫我天哥-逐风者 Immune (Physical)", -- [4]
						"特变电工 旋风斩 请叫我文哥 Hit -386 (Physical)", -- [5]
						"特变电工 旋风斩 请叫我天哥-逐风者 Crit -914 (Physical)", -- [6]
						"初代大魔王-逐风者 寒冰箭 特变电工 Hit -665 (Frost)", -- [7]
						"神经蛙-逐风者 肉搏 特变电工 Hit -331 (Physical)", -- [8]
						"特变电工 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -134 (Physical)", -- [9]
						"初代大魔王-逐风者 寒冰箭 特变电工 Hit -664 (Frost)", -- [10]
						"请叫我天哥-逐风者 多重射击 特变电工 Crit -699 (Physical)", -- [11]
						"特变电工 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -134 (Physical)", -- [12]
						"初代大魔王-逐风者 寒冰箭 特变电工 Hit -657 (Frost)", -- [13]
						"特变电工 肉搏 请叫我文哥 Hit -390 (Physical)", -- [14]
						"特变电工 致死打击 请叫我文哥 Hit -452 (Physical)", -- [15]
						"特变电工 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -133 (Physical)", -- [16]
						"初代大魔王-逐风者 冰霜新星 特变电工 Hit -90 (Frost)", -- [17]
						"特变电工 肉搏 初代大魔王-逐风者 Absorb -373 (1)", -- [18]
						"特变电工 肉搏 初代大魔王-逐风者 Hit -188 (373 被吸收) (Physical)", -- [19]
						"特变电工 拳击 初代大魔王-逐风者 Hit -53 (Physical)", -- [20]
						"神经蛙-逐风者 拦截昏迷 特变电工 Hit -40 (Physical)", -- [21]
						"特变电工 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -134 (Physical)", -- [22]
						"神经蛙-逐风者 肉搏 特变电工 Hit -331 (Physical)", -- [23]
						"特变电工死亡。", -- [24]
					},
					["DeathAt"] = 14014.206,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-14.61799999999857, -- [1]
						-13.68499999999949, -- [2]
						-13.68499999999949, -- [3]
						-12.13500000000022, -- [4]
						-12.13500000000022, -- [5]
						-12.13500000000022, -- [6]
						-11.15099999999984, -- [7]
						-10.70099999999911, -- [8]
						-9.100999999998749, -- [9]
						-8.234000000000378, -- [10]
						-7.450999999999112, -- [11]
						-6.100999999998749, -- [12]
						-5.766999999999825, -- [13]
						-5.283999999999651, -- [14]
						-5.050999999999476, -- [15]
						-3.100999999998749, -- [16]
						-1.066999999999098, -- [17]
						-0.966999999998734, -- [18]
						-0.966999999998734, -- [19]
						-0.8670000000001892, -- [20]
						-0.5499999999992724, -- [21]
						-0.1000000000003638, -- [22]
						-0.03399999999965075, -- [23]
						0, -- [24]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
					},
					["Health"] = {
						3323, -- [1]
						3323, -- [2]
						3323, -- [3]
						3323, -- [4]
						3323, -- [5]
						3323, -- [6]
						3323, -- [7]
						2658, -- [8]
						2327, -- [9]
						2327, -- [10]
						1663, -- [11]
						964, -- [12]
						964, -- [13]
						307, -- [14]
						307, -- [15]
						307, -- [16]
						307, -- [17]
						217, -- [18]
						217, -- [19]
						217, -- [20]
						217, -- [21]
						177, -- [22]
						177, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "神经蛙-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						false, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
					},
					["Messages"] = {
						"纳格兰放牛娃-逐风者 肉搏 特变电工 Hit -310 (Physical)", -- [1]
						"纳格兰放牛娃-逐风者 断筋 特变电工 Dodge (Physical)", -- [2]
						"特变电工 肉搏 纳格兰放牛娃-逐风者 Crit -497 (Physical)", -- [3]
						"纳格兰放牛娃-逐风者 压制 特变电工 Crit -646 (Physical)", -- [4]
						"纳格兰放牛娃-逐风者 雷霆一击 特变电工 Hit -72 (Physical)", -- [5]
						"纳格兰放牛娃-逐风者 肉搏 特变电工 Hit -85 (Physical)", -- [6]
						"特变电工 治疗药水 特变电工 Hit +1343", -- [7]
						"特变电工 断筋 纳格兰放牛娃-逐风者 Crit -71 (Physical)", -- [8]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 特变电工 Tick -113 (Physical)", -- [9]
						"纳格兰放牛娃-逐风者 肉搏 特变电工 Hit -84 (Physical)", -- [10]
						"特变电工 重伤 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -147 (Physical)", -- [11]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 特变电工 Tick -113 (Physical)", -- [12]
						"特变电工 肉搏 纳格兰放牛娃-逐风者 Hit -413 (Physical)", -- [13]
						"特变电工 战士的决心 特变电工 Hit +99", -- [14]
						"纳格兰放牛娃-逐风者 肉搏 特变电工 Hit -85 (Physical)", -- [15]
						"纳格兰放牛娃-逐风者 肉搏 特变电工 Hit -84 (Physical)", -- [16]
						"特变电工 重伤 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -147 (Physical)", -- [17]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 特变电工 Tick -113 (Physical)", -- [18]
						"特变电工 雷霆一击 纳格兰放牛娃-逐风者 Hit -76 (Physical)", -- [19]
						"特变电工 肉搏 纳格兰放牛娃-逐风者 Hit -448 (Physical)", -- [20]
						"纳格兰放牛娃-逐风者 肉搏 特变电工 Hit -85 (Physical)", -- [21]
						"纳格兰放牛娃-逐风者 断筋 特变电工 Hit -33 (Physical)", -- [22]
						"特变电工 重伤 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -147 (Physical)", -- [23]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 特变电工 Tick -114 (Physical)", -- [24]
						"老戏骨-逐风者 冰霜震击 特变电工 Hit -506 (Frost)", -- [25]
						"纳格兰放牛娃-逐风者 斩杀 特变电工 Hit -939 (Physical)", -- [26]
						"特变电工死亡。", -- [27]
					},
					["DeathAt"] = 13898.197,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["MessageTimes"] = {
						-14.41799999999967, -- [1]
						-14.28499999999985, -- [2]
						-12.78499999999985, -- [3]
						-12.76300000000083, -- [4]
						-10.61800000000039, -- [5]
						-10.61800000000039, -- [6]
						-10.55099999999948, -- [7]
						-9.96600000000035, -- [8]
						-9.734000000000378, -- [9]
						-8.118000000000393, -- [10]
						-6.934000000001106, -- [11]
						-6.734000000000378, -- [12]
						-6.367000000000189, -- [13]
						-6.351000000000568, -- [14]
						-6.101000000000568, -- [15]
						-4.084000000000742, -- [16]
						-3.934000000001106, -- [17]
						-3.734000000000378, -- [18]
						-2.467000000000553, -- [19]
						-2.184000000001106, -- [20]
						-2.067000000000917, -- [21]
						-1.533999999999651, -- [22]
						-0.934000000001106, -- [23]
						-0.75, -- [24]
						-0.217000000000553, -- [25]
						-0.03399999999965075, -- [26]
						0, -- [27]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
					},
					["Health"] = {
						1359, -- [1]
						1049, -- [2]
						1049, -- [3]
						1049, -- [4]
						403, -- [5]
						403, -- [6]
						246, -- [7]
						1589, -- [8]
						1589, -- [9]
						1476, -- [10]
						1392, -- [11]
						1392, -- [12]
						1279, -- [13]
						1279, -- [14]
						1378, -- [15]
						1293, -- [16]
						1209, -- [17]
						1209, -- [18]
						1096, -- [19]
						1096, -- [20]
						1096, -- [21]
						1011, -- [22]
						978, -- [23]
						978, -- [24]
						864, -- [25]
						358, -- [26]
						0, -- [27]
					},
					["KilledBy"] = "纳格兰放牛娃-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"HEAL", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"MISC", -- [27]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						false, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						false, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
					},
					["Messages"] = {
						"妖儿-逐风者 冰霜新星 特变电工 Hit -27 (Frost)", -- [1]
						"妖儿-逐风者 冰锥术 特变电工 Crit -1099 (Frost)", -- [2]
						"妖儿-逐风者 冰冻 特变电工 Resist (Frost)", -- [3]
						"特变电工 断筋 妖儿-逐风者 Hit -46 (Physical)", -- [4]
						"妖儿-逐风者 冲击波 特变电工 Hit -603 (Fire)", -- [5]
						"特变电工 肉搏 妖儿-逐风者 Hit -538 (Physical)", -- [6]
						"特变电工 致死打击 妖儿-逐风者 Hit -661 (Physical)", -- [7]
						"特变电工 断筋 老白鲨-逐风者 Parry (Physical)", -- [8]
						"神经蛙-逐风者 肉搏 特变电工 Hit -348 (Physical)", -- [9]
						"特变电工 肉搏 老白鲨-逐风者 Crit -788 (Physical)", -- [10]
						"柠檬-逐风者 心灵震爆 特变电工 Hit -902 (Shadow)", -- [11]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 特变电工 Tick -282 (Shadow)", -- [12]
						"特变电工 致死打击 老白鲨-逐风者 Hit -420 (Physical)", -- [13]
						"特变电工 锤击昏迷效果 老白鲨-逐风者 Immune (Physical)", -- [14]
						"柠檬-逐风者 精神鞭笞 (伤害/跳) 特变电工 Tick -282 (Shadow)", -- [15]
						"神经蛙-逐风者 致死打击 特变电工 Hit -424 (Physical)", -- [16]
						"柠檬-逐风者 精神鞭笞 (伤害/跳) 特变电工 Tick -283 (Shadow)", -- [17]
						"神经蛙-逐风者 肉搏 特变电工 Hit -351 (Physical)", -- [18]
						"特变电工 重伤 (伤害/跳) 老白鲨-逐风者 Tick -130 (Physical)", -- [19]
						"特变电工 旋风斩 神经蛙-逐风者 Crit -657 (Physical)", -- [20]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 特变电工 Tick -291 (Shadow)", -- [21]
						"特变电工 肉搏 神经蛙-逐风者 Hit -335 (Physical)", -- [22]
						"神经蛙-逐风者 斩杀 特变电工 Hit -1294 (Physical)", -- [23]
						"特变电工死亡。", -- [24]
					},
					["DeathAt"] = 13798.207,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
					},
					["MessageTimes"] = {
						-13.57099999999991, -- [1]
						-12.02200000000084, -- [2]
						-11.90400000000045, -- [3]
						-11.90400000000045, -- [4]
						-10.53700000000026, -- [5]
						-10.4369999999999, -- [6]
						-9.154000000000451, -- [7]
						-7.070000000001528, -- [8]
						-4.802999999999884, -- [9]
						-3.953000000001339, -- [10]
						-3.436999999999898, -- [11]
						-3.287000000000262, -- [12]
						-3.137000000000626, -- [13]
						-3.137000000000626, -- [14]
						-2.287000000000262, -- [15]
						-1.73700000000099, -- [16]
						-1.287000000000262, -- [17]
						-0.9870000000009895, -- [18]
						-0.9200000000000728, -- [19]
						-0.4030000000002474, -- [20]
						-0.2870000000002619, -- [21]
						-0.1530000000002474, -- [22]
						-0.02000000000043656, -- [23]
						0, -- [24]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
					},
					["Health"] = {
						4969, -- [1]
						4942, -- [2]
						3843, -- [3]
						3843, -- [4]
						3843, -- [5]
						3240, -- [6]
						3240, -- [7]
						3240, -- [8]
						3240, -- [9]
						2892, -- [10]
						2892, -- [11]
						1990, -- [12]
						1708, -- [13]
						1708, -- [14]
						1708, -- [15]
						1426, -- [16]
						1002, -- [17]
						719, -- [18]
						368, -- [19]
						368, -- [20]
						368, -- [21]
						77, -- [22]
						77, -- [23]
						0, -- [24]
					},
					["KilledBy"] = "神经蛙-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
					},
				}, -- [4]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
						false, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
					},
					["Messages"] = {
						"神经蛙-逐风者 断筋 特变电工 Hit -29 (Physical)", -- [1]
						"吹风吹姑娘-逐风者 冰霜新星 特变电工 Hit -79 (Frost)", -- [2]
						"神经蛙-逐风者 雷霆一击 特变电工 Hit -63 (Physical)", -- [3]
						"特变电工 断筋 吹风吹姑娘-逐风者 Absorb -78 (78 被吸收) (Physical)", -- [4]
						"特变电工 肉搏 吹风吹姑娘-逐风者 Absorb -391 (391 被吸收) (1)", -- [5]
						"神经蛙-逐风者 断筋 特变电工 Hit -30 (Physical)", -- [6]
						"神经蛙-逐风者 肉搏 特变电工 Hit -311 (Physical)", -- [7]
						"蒜头妹妹 圣光闪现 特变电工 Hit +439", -- [8]
						"吹风吹姑娘-逐风者 魔爆术 特变电工 Crit -470 (Arcane)", -- [9]
						"特变电工 致死打击 神经蛙-逐风者 Crit -973 (Physical)", -- [10]
						"吹风吹姑娘-逐风者 冰锥术 特变电工 Hit -620 (Frost)", -- [11]
						"吹风吹姑娘-逐风者 深冬之寒 特变电工 Resist (Frost)", -- [12]
						"神经蛙-逐风者 肉搏 特变电工 Dodge (1)", -- [13]
						"特变电工 肉搏 吹风吹姑娘-逐风者 Immune (1)", -- [14]
						"特变电工 断筋 吹风吹姑娘-逐风者 Immune (Physical)", -- [15]
						"吹风吹姑娘-逐风者 魔爆术 特变电工 Hit -311 (Arcane)", -- [16]
						"蒜头妹妹 圣光闪现 特变电工 Hit +452", -- [17]
						"特变电工 重伤 (伤害/跳) 神经蛙-逐风者 Tick -134 (Physical)", -- [18]
						"请叫我天哥-逐风者 多重射击 特变电工 Hit -324 (Physical)", -- [19]
						"特变电工 旋风斩 吹风吹姑娘-逐风者 Immune (Physical)", -- [20]
						"特变电工 旋风斩 神经蛙-逐风者 Hit -293 (Physical)", -- [21]
						"吹风吹姑娘-逐风者 魔爆术 特变电工 Hit -316 (Arcane)", -- [22]
						"神经蛙-逐风者 压制 特变电工 Crit -914 (Physical)", -- [23]
						"神经蛙-逐风者 肉搏 特变电工 Hit -463 (Physical)", -- [24]
						"特变电工 治疗药水 特变电工 Hit +1251", -- [25]
						"吹风吹姑娘-逐风者 魔爆术 特变电工 Hit -331 (Arcane)", -- [26]
						"特变电工 致死打击 吹风吹姑娘-逐风者 Dodge (Physical)", -- [27]
						"特变电工 重伤 (伤害/跳) 神经蛙-逐风者 Tick -134 (Physical)", -- [28]
						"雲木彡-逐风者 铁皮手雷 特变电工 Hit -146 (Fire)", -- [29]
						"雲木彡-逐风者 断筋 特变电工 Hit -29 (Physical)", -- [30]
						"吹风吹姑娘-逐风者 魔爆术 特变电工 Hit -322 (Arcane)", -- [31]
						"雲木彡-逐风者 肉搏 特变电工 Hit -310 (Physical)", -- [32]
						"神经蛙-逐风者 重伤 (伤害/跳) 特变电工 Tick -143 (Physical)", -- [33]
						"雲木彡-逐风者 断筋 特变电工 Miss (Physical)", -- [34]
						"神经蛙-逐风者 肉搏 特变电工 Hit -421 (Physical)", -- [35]
						"特变电工死亡。", -- [36]
					},
					["DeathAt"] = 13749.203,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
					},
					["MessageTimes"] = {
						-14.3760000000002, -- [1]
						-13.89300000000003, -- [2]
						-12.67599999999948, -- [3]
						-12.65899999999965, -- [4]
						-12.04299999999967, -- [5]
						-11.10900000000038, -- [6]
						-11.04299999999967, -- [7]
						-8.425999999999476, -- [8]
						-8.15899999999965, -- [9]
						-7.891999999999825, -- [10]
						-6.77599999999984, -- [11]
						-6.77599999999984, -- [12]
						-6.691999999999098, -- [13]
						-6.391999999999825, -- [14]
						-5.908999999999651, -- [15]
						-5.291999999999462, -- [16]
						-5.242000000000189, -- [17]
						-4.876000000000204, -- [18]
						-4.225999999998749, -- [19]
						-4.041999999999462, -- [20]
						-4.041999999999462, -- [21]
						-3.791999999999462, -- [22]
						-3.591999999998734, -- [23]
						-2.924999999999272, -- [24]
						-2.441999999999098, -- [25]
						-2.291999999999462, -- [26]
						-1.891999999999825, -- [27]
						-1.875, -- [28]
						-1.774999999999636, -- [29]
						-1.742000000000189, -- [30]
						-0.7749999999996362, -- [31]
						-0.6090000000003783, -- [32]
						-0.558999999999287, -- [33]
						-0.2420000000001892, -- [34]
						-0.0249999999996362, -- [35]
						0, -- [36]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
					},
					["Health"] = {
						3288, -- [1]
						3259, -- [2]
						3180, -- [3]
						3180, -- [4]
						3117, -- [5]
						3117, -- [6]
						3087, -- [7]
						2776, -- [8]
						3215, -- [9]
						2745, -- [10]
						2745, -- [11]
						2125, -- [12]
						2125, -- [13]
						2125, -- [14]
						2125, -- [15]
						2125, -- [16]
						1814, -- [17]
						2266, -- [18]
						2266, -- [19]
						1942, -- [20]
						1942, -- [21]
						1942, -- [22]
						1626, -- [23]
						712, -- [24]
						249, -- [25]
						1500, -- [26]
						1169, -- [27]
						1169, -- [28]
						1169, -- [29]
						1023, -- [30]
						994, -- [31]
						672, -- [32]
						362, -- [33]
						219, -- [34]
						219, -- [35]
						0, -- [36]
					},
					["KilledBy"] = "神经蛙-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"HEAL", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"HEAL", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"HEAL", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"MISC", -- [36]
					},
				}, -- [5]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						false, -- [32]
						false, -- [33]
						true, -- [34]
						true, -- [35]
					},
					["Messages"] = {
						"雲木彡-逐风者 撕裂 (伤害/跳) 特变电工 Tick -25 (Physical)", -- [1]
						"特变电工 肉搏 时间的小溪-逐风者 Hit -327 (Physical)", -- [2]
						"源堂法雷尔-逐风者 肉搏 特变电工 Hit -63 (Physical)", -- [3]
						"妖儿-逐风者 冰锥术 特变电工 Hit -450 (Frost)", -- [4]
						"源堂法雷尔-逐风者 肉搏 特变电工 Hit -64 (Physical)", -- [5]
						"雲木彡-逐风者 肉搏 特变电工 Crit -552 (Physical)", -- [6]
						"雲木彡-逐风者 断筋 特变电工 Hit -26 (Physical)", -- [7]
						"雲木彡-逐风者 撕裂 (伤害/跳) 特变电工 Tick -26 (Physical)", -- [8]
						"妖儿-逐风者 冲击波 特变电工 Crit -679 (Fire)", -- [9]
						"源堂法雷尔-逐风者 肉搏 特变电工 Crit -139 (Physical)", -- [10]
						"源堂法雷尔-逐风者 血袭 (伤害/跳) 特变电工 Tick -25 (Physical)", -- [11]
						"源堂法雷尔-逐风者 肉搏 特变电工 Crit -144 (Physical)", -- [12]
						"特变电工 破胆怒吼 源堂法雷尔-逐风者 Resist (Physical)", -- [13]
						"妖儿-逐风者 点燃 (伤害/跳) 特变电工 Tick -122 (Fire)", -- [14]
						"源堂法雷尔-逐风者 肉搏 特变电工 Crit -138 (Physical)", -- [15]
						"雲木彡-逐风者 重伤 (伤害/跳) 特变电工 Tick -66 (Physical)", -- [16]
						"源堂法雷尔-逐风者 肉搏 特变电工 Hit -69 (Physical)", -- [17]
						"雲木彡-逐风者 撕裂 (伤害/跳) 特变电工 Tick -26 (Physical)", -- [18]
						"妖儿-逐风者 点燃 (伤害/跳) 特变电工 Tick -123 (Fire)", -- [19]
						"源堂法雷尔-逐风者 血袭 (伤害/跳) 特变电工 Tick -25 (Physical)", -- [20]
						"源堂法雷尔-逐风者 肉搏 特变电工 Hit -224 (Physical)", -- [21]
						"源堂法雷尔-逐风者 月火术 特变电工 Hit -199 (Arcane)", -- [22]
						"特变电工 致死打击 源堂法雷尔-逐风者 Hit -544 (Physical)", -- [23]
						"柠檬-逐风者 地精工兵炸药 特变电工 Hit -461 (Fire)", -- [24]
						"雲木彡-逐风者 重伤 (伤害/跳) 特变电工 Tick -67 (Physical)", -- [25]
						"特变电工 肉搏 源堂法雷尔-逐风者 Hit -427 (Physical)", -- [26]
						"雲木彡-逐风者 撕裂 (伤害/跳) 特变电工 Tick -28 (Physical)", -- [27]
						"源堂法雷尔-逐风者 血袭 (伤害/跳) 特变电工 Tick -28 (Physical)", -- [28]
						"源堂法雷尔-逐风者 月火术 (伤害/跳) 特变电工 Tick -106 (Arcane)", -- [29]
						"雲木彡-逐风者 重伤 (伤害/跳) 特变电工 Tick -82 (Physical)", -- [30]
						"源堂法雷尔-逐风者 肉搏 特变电工 Dodge (1)", -- [31]
						"特变电工 旋风斩 时间的小溪-逐风者 Hit -437 (Physical)", -- [32]
						"特变电工 旋风斩 源堂法雷尔-逐风者 Hit -275 (Physical)", -- [33]
						"时间的小溪-逐风者 背刺 特变电工 Crit -765 (Physical)", -- [34]
						"特变电工死亡。", -- [35]
					},
					["DeathAt"] = 13581.208,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["MessageTimes"] = {
						-13.37700000000041, -- [1]
						-12.31000000000131, -- [2]
						-11.61000000000058, -- [3]
						-11.40999999999985, -- [4]
						-10.57700000000114, -- [5]
						-10.54399999999987, -- [6]
						-10.54399999999987, -- [7]
						-10.37700000000041, -- [8]
						-9.894000000000233, -- [9]
						-9.610000000000582, -- [10]
						-8.644000000000233, -- [11]
						-8.593000000000757, -- [12]
						-8.394000000000233, -- [13]
						-7.877000000000408, -- [14]
						-7.593000000000757, -- [15]
						-7.527000000000044, -- [16]
						-6.093000000000757, -- [17]
						-6.010000000000218, -- [18]
						-5.877000000000408, -- [19]
						-5.643000000000029, -- [20]
						-5.093000000000757, -- [21]
						-4.777000000000044, -- [22]
						-4.627000000000408, -- [23]
						-4.593000000000757, -- [24]
						-4.527000000000044, -- [25]
						-4.193000000001121, -- [26]
						-3.010000000000218, -- [27]
						-2.643000000000029, -- [28]
						-1.760000000000218, -- [29]
						-1.52599999999984, -- [30]
						-0.9600000000009459, -- [31]
						-0.8100000000013097, -- [32]
						-0.8100000000013097, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
					},
					["Health"] = {
						4653, -- [1]
						4628, -- [2]
						4628, -- [3]
						4565, -- [4]
						4115, -- [5]
						4051, -- [6]
						4051, -- [7]
						3473, -- [8]
						3447, -- [9]
						2768, -- [10]
						2629, -- [11]
						2604, -- [12]
						2460, -- [13]
						2460, -- [14]
						2338, -- [15]
						2200, -- [16]
						2134, -- [17]
						2065, -- [18]
						2039, -- [19]
						1916, -- [20]
						1891, -- [21]
						1667, -- [22]
						1468, -- [23]
						1468, -- [24]
						1007, -- [25]
						940, -- [26]
						940, -- [27]
						912, -- [28]
						884, -- [29]
						778, -- [30]
						696, -- [31]
						696, -- [32]
						696, -- [33]
						696, -- [34]
						0, -- [35]
					},
					["KilledBy"] = "时间的小溪-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"MISC", -- [35]
					},
				}, -- [6]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						false, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						false, -- [41]
						false, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						false, -- [47]
						true, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"神经蛙-逐风者 断筋 特变电工 Hit -27 (Physical)", -- [1]
						"雲木彡-逐风者 断筋 特变电工 Hit -30 (Physical)", -- [2]
						"时间的小溪-逐风者 肉搏 特变电工 Miss (1)", -- [3]
						"雲木彡-逐风者 肉搏 特变电工 Hit -312 (Physical)", -- [4]
						"时间的小溪-逐风者 肉搏 特变电工 Parry (1)", -- [5]
						"特变电工 肉搏 雲木彡-逐风者 Hit -291 (Physical)", -- [6]
						"雲木彡-逐风者 断筋 特变电工 Crit -74 (Physical)", -- [7]
						"特变电工 重伤 (伤害/跳) 雲木彡-逐风者 Tick -76 (Physical)", -- [8]
						"时间的小溪-逐风者 肉搏 特变电工 Hit -51 (Physical)", -- [9]
						"时间的小溪-逐风者 肉搏 特变电工 Crit -191 (Physical)", -- [10]
						"神经蛙-逐风者 肉搏 特变电工 Hit -296 (Physical)", -- [11]
						"特变电工 旋风斩 时间的小溪-逐风者 Dodge (Physical)", -- [12]
						"特变电工 横扫攻击 时间的小溪-逐风者 Hit -431 (Physical)", -- [13]
						"特变电工 旋风斩 神经蛙-逐风者 Crit -729 (Physical)", -- [14]
						"特变电工 旋风斩 雲木彡-逐风者 Hit -329 (Physical)", -- [15]
						"特变电工 横扫攻击 雲木彡-逐风者 Hit -393 (Physical)", -- [16]
						"雲木彡-逐风者 肉搏 特变电工 Hit -377 (Physical)", -- [17]
						"特变电工 肉搏 神经蛙-逐风者 Hit -317 (Physical)", -- [18]
						"雲木彡-逐风者 重伤 (伤害/跳) 特变电工 Tick -108 (Physical)", -- [19]
						"特变电工 重伤 (伤害/跳) 雲木彡-逐风者 Tick -75 (Physical)", -- [20]
						"时间的小溪-逐风者 肉搏 特变电工 Dodge (1)", -- [21]
						"雲木彡-逐风者 雷霆一击 特变电工 Hit -66 (Physical)", -- [22]
						"时间的小溪-逐风者 肉搏 特变电工 Hit -41 (Physical)", -- [23]
						"特变电工 致死打击 神经蛙-逐风者 Crit -1031 (Physical)", -- [24]
						"时间的小溪-逐风者 背刺 特变电工 Hit -343 (Physical)", -- [25]
						"雲木彡-逐风者 撕裂 (伤害/跳) 特变电工 Tick -36 (Physical)", -- [26]
						"时间的小溪-逐风者 肉搏 特变电工 Miss (1)", -- [27]
						"时间的小溪-逐风者 肉搏 特变电工 Miss (1)", -- [28]
						"雲木彡-逐风者 断筋 特变电工 Hit -34 (Physical)", -- [29]
						"雲木彡-逐风者 重伤 (伤害/跳) 特变电工 Tick -107 (Physical)", -- [30]
						"特变电工 重伤 (伤害/跳) 雲木彡-逐风者 Tick -76 (Physical)", -- [31]
						"雲木彡-逐风者 肉搏 特变电工 Hit -380 (Physical)", -- [32]
						"时间的小溪-逐风者 肉搏 特变电工 Crit -191 (Physical)", -- [33]
						"时间的小溪-逐风者 背刺 特变电工 Hit -321 (Physical)", -- [34]
						"特变电工 重伤 (伤害/跳) 神经蛙-逐风者 Tick -118 (Physical)", -- [35]
						"雲木彡-逐风者 断筋 特变电工 Dodge (Physical)", -- [36]
						"时间的小溪-逐风者 肉搏 特变电工 Crit -93 (Physical)", -- [37]
						"雲木彡-逐风者 撕裂 (伤害/跳) 特变电工 Tick -36 (Physical)", -- [38]
						"神经蛙-逐风者 断筋 特变电工 Hit -36 (Physical)", -- [39]
						"神经蛙-逐风者 肉搏 特变电工 Hit -349 (Physical)", -- [40]
						"特变电工 肉搏 雲木彡-逐风者 Hit -291 (Physical)", -- [41]
						"特变电工 横扫攻击 神经蛙-逐风者 Hit -381 (Physical)", -- [42]
						"雲木彡-逐风者 压制 特变电工 Hit -351 (Physical)", -- [43]
						"时间的小溪-逐风者 肉搏 特变电工 Hit -114 (Physical)", -- [44]
						"雲木彡-逐风者 重伤 (伤害/跳) 特变电工 Tick -107 (Physical)", -- [45]
						"时间的小溪-逐风者 肉搏 特变电工 Miss (1)", -- [46]
						"特变电工 重伤 (伤害/跳) 雲木彡-逐风者 Tick -76 (Physical)", -- [47]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 特变电工 Tick -274 (Shadow)", -- [48]
						"柠檬-逐风者 心灵震爆 特变电工 Hit -893 (Shadow)", -- [49]
						"特变电工死亡。", -- [50]
					},
					["DeathAt"] = 13458.199,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-11.27599999999984, -- [1]
						-11.14300000000003, -- [2]
						-10.92599999999948, -- [3]
						-10.82599999999911, -- [4]
						-10.82599999999911, -- [5]
						-10.4419999999991, -- [6]
						-9.442999999999302, -- [7]
						-9.308999999999287, -- [8]
						-9.141999999999825, -- [9]
						-9.02599999999984, -- [10]
						-8.49200000000019, -- [11]
						-7.391999999999825, -- [12]
						-7.391999999999825, -- [13]
						-7.391999999999825, -- [14]
						-7.391999999999825, -- [15]
						-7.361999999999171, -- [16]
						-7.02599999999984, -- [17]
						-6.492000000000189, -- [18]
						-6.408999999999651, -- [19]
						-6.308999999999287, -- [20]
						-6.208999999998923, -- [21]
						-5.825999999999112, -- [22]
						-5.80699999999888, -- [23]
						-5.475000000000364, -- [24]
						-4.574999999998909, -- [25]
						-4.558999999999287, -- [26]
						-4.408999999999651, -- [27]
						-4.009000000000015, -- [28]
						-3.941999999999098, -- [29]
						-3.408999999999651, -- [30]
						-3.308999999999287, -- [31]
						-3.225000000000364, -- [32]
						-2.609000000000378, -- [33]
						-2.541999999999462, -- [34]
						-2.458999999998923, -- [35]
						-2.441999999999098, -- [36]
						-2.208999999998923, -- [37]
						-1.558999999999287, -- [38]
						-1.475000000000364, -- [39]
						-1.458999999998923, -- [40]
						-1.358000000000175, -- [41]
						-1.341999999998734, -- [42]
						-0.9249999999992724, -- [43]
						-0.7919999999994616, -- [44]
						-0.4089999999996508, -- [45]
						-0.4089999999996508, -- [46]
						-0.3249999999989086, -- [47]
						-0.0249999999996362, -- [48]
						-0.0249999999996362, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
						4969, -- [40]
						4969, -- [41]
						4969, -- [42]
						4969, -- [43]
						4969, -- [44]
						4969, -- [45]
						4969, -- [46]
						4969, -- [47]
						4969, -- [48]
						4969, -- [49]
						4969, -- [50]
					},
					["Health"] = {
						4969, -- [1]
						4942, -- [2]
						4912, -- [3]
						4912, -- [4]
						4912, -- [5]
						4600, -- [6]
						4600, -- [7]
						4526, -- [8]
						4526, -- [9]
						4475, -- [10]
						4284, -- [11]
						3651, -- [12]
						3651, -- [13]
						3651, -- [14]
						3651, -- [15]
						3651, -- [16]
						3651, -- [17]
						3274, -- [18]
						3274, -- [19]
						3166, -- [20]
						3166, -- [21]
						3166, -- [22]
						3166, -- [23]
						3059, -- [24]
						3059, -- [25]
						2716, -- [26]
						2680, -- [27]
						2680, -- [28]
						2680, -- [29]
						2646, -- [30]
						2539, -- [31]
						2539, -- [32]
						2159, -- [33]
						1968, -- [34]
						1647, -- [35]
						1647, -- [36]
						1647, -- [37]
						1554, -- [38]
						1518, -- [39]
						1482, -- [40]
						1133, -- [41]
						1133, -- [42]
						1133, -- [43]
						782, -- [44]
						668, -- [45]
						668, -- [46]
						561, -- [47]
						561, -- [48]
						561, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "柠檬-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [7]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
					},
					["Messages"] = {
						"特变电工 拳击 一路酱-逐风者 Crit -87 (Physical)", -- [1]
						"特变电工 interrupts 一路酱-逐风者 快速治疗 (拳击)", -- [2]
						"特变电工 肉搏 一路酱-逐风者 Crit -1011 (Physical)", -- [3]
						"特变电工 致死打击 老戏骨-逐风者 Crit -861 (Physical)", -- [4]
						"老戏骨-逐风者 闪电之盾 特变电工 Hit -268 (Nature)", -- [5]
						"神经蛙-逐风者 肉搏 特变电工 Hit -404 (Physical)", -- [6]
						"雲木彡-逐风者 断筋 特变电工 Crit -89 (Physical)", -- [7]
						"神经蛙-逐风者 断筋 特变电工 Crit -77 (Physical)", -- [8]
						"雲木彡-逐风者 肉搏 特变电工 Crit -846 (Physical)", -- [9]
						"特变电工 肉搏 老戏骨-逐风者 Crit -807 (Physical)", -- [10]
						"特变电工 旋风斩 神经蛙-逐风者 Dodge (Physical)", -- [11]
						"特变电工 旋风斩 老戏骨-逐风者 Crit -785 (Physical)", -- [12]
						"特变电工 旋风斩 雲木彡-逐风者 Crit -614 (Physical)", -- [13]
						"神经蛙-逐风者 重伤 (伤害/跳) 特变电工 Tick -81 (Physical)", -- [14]
						"雲木彡-逐风者 重伤 (伤害/跳) 特变电工 Tick -105 (Physical)", -- [15]
						"雲木彡-逐风者 断筋 特变电工 Hit -33 (Physical)", -- [16]
						"特变电工 重伤 (伤害/跳) 老戏骨-逐风者 Tick -129 (Physical)", -- [17]
						"特变电工 重伤 (伤害/跳) 雲木彡-逐风者 Tick -129 (Physical)", -- [18]
						"特变电工 断筋 老戏骨-逐风者 Hit -33 (Physical)", -- [19]
						"老戏骨-逐风者 闪电之盾 特变电工 Hit -224 (Nature)", -- [20]
						"雲木彡-逐风者 肉搏 特变电工 Crit -600 (Physical)", -- [21]
						"特变电工 肉搏 老戏骨-逐风者 Hit -346 (Physical)", -- [22]
						"特变电工 斩杀 老戏骨-逐风者 Hit -821 (Physical)", -- [23]
						"雲木彡-逐风者 斩杀 特变电工 Hit -1063 (Physical)", -- [24]
						"特变电工死亡。", -- [25]
					},
					["DeathAt"] = 13381.21,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
					},
					["MessageTimes"] = {
						-14.15099999999984, -- [1]
						-14.15099999999984, -- [2]
						-13.46800000000076, -- [3]
						-6.516999999999825, -- [4]
						-6.467000000000553, -- [5]
						-5.984000000000378, -- [6]
						-5.65099999999984, -- [7]
						-5.65099999999984, -- [8]
						-5.334000000000742, -- [9]
						-5.315000000000509, -- [10]
						-5.016999999999825, -- [11]
						-5.016999999999825, -- [12]
						-5.016999999999825, -- [13]
						-2.634000000000015, -- [14]
						-2.334000000000742, -- [15]
						-2.200000000000728, -- [16]
						-1.984000000000378, -- [17]
						-1.984000000000378, -- [18]
						-1.800000000001091, -- [19]
						-1.781000000000859, -- [20]
						-1.550000000001091, -- [21]
						-1.516999999999825, -- [22]
						-0.2839999999996508, -- [23]
						-0.05000000000109139, -- [24]
						0, -- [25]
					},
					["HealthMax"] = {
						5669, -- [1]
						5669, -- [2]
						5669, -- [3]
						5669, -- [4]
						5669, -- [5]
						5669, -- [6]
						5669, -- [7]
						5669, -- [8]
						5669, -- [9]
						5669, -- [10]
						5669, -- [11]
						5669, -- [12]
						5669, -- [13]
						5669, -- [14]
						5669, -- [15]
						5669, -- [16]
						5669, -- [17]
						5669, -- [18]
						5669, -- [19]
						5669, -- [20]
						5669, -- [21]
						5669, -- [22]
						5669, -- [23]
						5669, -- [24]
						4969, -- [25]
					},
					["Health"] = {
						3457, -- [1]
						3457, -- [2]
						3457, -- [3]
						3505, -- [4]
						3505, -- [5]
						3237, -- [6]
						2833, -- [7]
						2833, -- [8]
						2667, -- [9]
						1821, -- [10]
						1821, -- [11]
						1821, -- [12]
						1821, -- [13]
						1821, -- [14]
						1740, -- [15]
						1635, -- [16]
						1602, -- [17]
						1602, -- [18]
						1602, -- [19]
						1602, -- [20]
						1378, -- [21]
						778, -- [22]
						778, -- [23]
						778, -- [24]
						0, -- [25]
					},
					["KilledBy"] = "雲木彡-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"MISC", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"MISC", -- [25]
					},
				}, -- [8]
			},
			["TimeLast"] = {
				["TimeHeal"] = 13890.197,
				["RageGain"] = 14056.209,
				["Interrupts"] = 13364.209,
				["OVERALL"] = 14077.21,
				["DamageTaken"] = 14069.21,
				["DeathCount"] = 14069.21,
				["Healing"] = 13890.197,
				["HealingTaken"] = 13890.197,
				["GTFOEvents"] = 13979.203,
				["TimeDamage"] = 14077.21,
				["ActiveTime"] = 14077.21,
				["GTFOEventDamage"] = 13979.203,
				["DOT_Time"] = 14077.21,
				["Damage"] = 14077.21,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"MISC", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"MISC", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					9, -- [1]
				},
				["ActiveTime"] = {
					302.6100000000001, -- [1]
				},
				["Healing"] = {
					5613, -- [1]
				},
				["DamageTaken"] = {
					62070, -- [1]
				},
				["Interrupts"] = {
					2, -- [1]
				},
				["DeathCount"] = {
					8, -- [1]
				},
				["HealingTaken"] = {
					7347, -- [1]
				},
				["GTFOEvents"] = {
					3, -- [1]
				},
				["TimeDamage"] = {
					293.6100000000001, -- [1]
				},
				["RageGain"] = {
					530, -- [1]
				},
				["GTFOEventDamage"] = {
					486, -- [1]
				},
				["DOT_Time"] = {
					147, -- [1]
				},
				["Damage"] = {
					87352, -- [1]
				},
			},
			["LastHealTime"] = 13890.58,
			["LastDamageTaken"] = 935,
			["level"] = 60,
			["LastDamageAbility"] = "斩杀",
			["LastFightIn"] = 11,
			["GUID"] = "Player-5458-02F6D2A3",
			["type"] = "Self",
			["LastEventHealth"] = {
				2574, -- [1]
				2517, -- [2]
				2237, -- [3]
				1934, -- [4]
				1907, -- [5]
				1907, -- [6]
				1907, -- [7]
				1773, -- [8]
				1773, -- [9]
				1579, -- [10]
				1116, -- [11]
				609, -- [12]
				609, -- [13]
				609, -- [14]
				609, -- [15]
				46, -- [16]
				0, -- [17]
				1, -- [18]
				1, -- [19]
				964, -- [20]
				307, -- [21]
				307, -- [22]
				307, -- [23]
				307, -- [24]
				217, -- [25]
				217, -- [26]
				217, -- [27]
				217, -- [28]
				177, -- [29]
				177, -- [30]
				0, -- [31]
				4969, -- [32]
				4969, -- [33]
				4969, -- [34]
				4944, -- [35]
				4944, -- [36]
				4944, -- [37]
				4352, -- [38]
				4015, -- [39]
				4015, -- [40]
				4015, -- [41]
				4015, -- [42]
				3797, -- [43]
				3774, -- [44]
				3774, -- [45]
				3492, -- [46]
				3466, -- [47]
				3178, -- [48]
				2574, -- [49]
				2574, -- [50]
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4969, -- [1]
				4969, -- [2]
				4969, -- [3]
				4969, -- [4]
				4969, -- [5]
				4969, -- [6]
				4969, -- [7]
				4969, -- [8]
				4969, -- [9]
				4969, -- [10]
				4969, -- [11]
				4969, -- [12]
				4969, -- [13]
				4969, -- [14]
				4969, -- [15]
				4969, -- [16]
				4969, -- [17]
				4969, -- [18]
				4969, -- [19]
				4969, -- [20]
				4969, -- [21]
				4969, -- [22]
				4969, -- [23]
				4969, -- [24]
				4969, -- [25]
				4969, -- [26]
				4969, -- [27]
				4969, -- [28]
				4969, -- [29]
				4969, -- [30]
				4969, -- [31]
				4969, -- [32]
				4969, -- [33]
				4969, -- [34]
				4969, -- [35]
				4969, -- [36]
				4969, -- [37]
				4969, -- [38]
				4969, -- [39]
				4969, -- [40]
				4969, -- [41]
				4969, -- [42]
				4969, -- [43]
				4969, -- [44]
				4969, -- [45]
				4969, -- [46]
				4969, -- [47]
				4969, -- [48]
				4969, -- [49]
				4969, -- [50]
			},
			["NextEventNum"] = 20,
			["LastDamageTime"] = 14077.377,
			["LastEvents"] = {
				"蓝色空间号-逐风者 射击 特变电工 Hit -57 (Nature)", -- [1]
				"雲木彡-逐风者 肉搏 特变电工 Hit -280 (Physical)", -- [2]
				"老白鲨-逐风者 肉搏 特变电工 Hit -303 (Physical)", -- [3]
				"雲木彡-逐风者 断筋 特变电工 Hit -27 (Physical)", -- [4]
				"特变电工 雷霆一击 雲木彡-逐风者 Hit -53 (Physical)", -- [5]
				"特变电工 雷霆一击 老白鲨-逐风者 Absorb -60 (60 被吸收) (Physical)", -- [6]
				"蓝色空间号-逐风者 射击 特变电工 Crit -134 (Nature)", -- [7]
				"特变电工 重伤 (伤害/跳) 老白鲨-逐风者 Absorb -68 (68 被吸收) (Physical)", -- [8]
				"一路酱-逐风者 暗言术：痛 (伤害/跳) 特变电工 Tick -194 (Shadow)", -- [9]
				"老白鲨-逐风者 致死打击 特变电工 Hit -463 (Physical)", -- [10]
				"老戏骨-逐风者 冰霜震击 特变电工 Hit -507 (Frost)", -- [11]
				"特变电工 肉搏 老白鲨-逐风者 Absorb -439 (1)", -- [12]
				"特变电工 肉搏 老白鲨-逐风者 Crit -359 (439 被吸收) (Physical)", -- [13]
				"雲木彡-逐风者 肉搏 特变电工 Hit -237 (Physical)", -- [14]
				"老白鲨-逐风者 肉搏 特变电工 Hit -326 (Physical)", -- [15]
				"老白鲨-逐风者 斩杀 特变电工 Crit -935 (Physical)", -- [16]
				"特变电工死亡。", -- [17]
				"特变电工 重伤 (伤害/跳) 老白鲨-逐风者 Tick -130 (Physical)", -- [18]
				"特变电工 重伤 (伤害/跳) 老白鲨-逐风者 Tick -130 (Physical)", -- [19]
				"初代大魔王-逐风者 寒冰箭 特变电工 Hit -657 (Frost)", -- [20]
				"特变电工 肉搏 请叫我文哥 Hit -390 (Physical)", -- [21]
				"特变电工 致死打击 请叫我文哥 Hit -452 (Physical)", -- [22]
				"特变电工 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -133 (Physical)", -- [23]
				"初代大魔王-逐风者 冰霜新星 特变电工 Hit -90 (Frost)", -- [24]
				"特变电工 肉搏 初代大魔王-逐风者 Absorb -373 (1)", -- [25]
				"特变电工 肉搏 初代大魔王-逐风者 Hit -188 (373 被吸收) (Physical)", -- [26]
				"特变电工 拳击 初代大魔王-逐风者 Hit -53 (Physical)", -- [27]
				"神经蛙-逐风者 拦截昏迷 特变电工 Hit -40 (Physical)", -- [28]
				"特变电工 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -134 (Physical)", -- [29]
				"神经蛙-逐风者 肉搏 特变电工 Hit -331 (Physical)", -- [30]
				"特变电工死亡。", -- [31]
				"特变电工 冲锋击昏 妖儿-逐风者 Immune (Physical)", -- [32]
				"特变电工 肉搏 妖儿-逐风者 Hit -396 (Physical)", -- [33]
				"妖儿-逐风者 冰霜新星 特变电工 Hit -25 (Frost)", -- [34]
				"妖儿-逐风者 冰冻 特变电工 Resist (Frost)", -- [35]
				"特变电工 断筋 妖儿-逐风者 Hit -37 (Physical)", -- [36]
				"妖儿-逐风者 冲击波 特变电工 Hit -592 (Fire)", -- [37]
				"特变电工 斩杀 妖儿-逐风者 Hit -701 (Physical)", -- [38]
				"特变电工 拦截昏迷 初代大魔王-逐风者 Hit -53 (Physical)", -- [39]
				"特变电工 肉搏 初代大魔王-逐风者 Hit -376 (Physical)", -- [40]
				"特变电工 斩杀 初代大魔王-逐风者 Crit -1162 (Physical)", -- [41]
				"老白鲨-逐风者 肉搏 特变电工 Hit -218 (Physical)", -- [42]
				"老白鲨-逐风者 断筋 特变电工 Hit -23 (Physical)", -- [43]
				"老白鲨-逐风者 肉搏 特变电工 Dodge (1)", -- [44]
				"老白鲨-逐风者 致死打击 特变电工 Hit -282 (Physical)", -- [45]
				"老白鲨-逐风者 断筋 特变电工 Hit -26 (Physical)", -- [46]
				"老白鲨-逐风者 肉搏 特变电工 Hit -288 (Physical)", -- [47]
				"蓝色空间号-逐风者 心灵震爆 特变电工 Hit -604 (Shadow)", -- [48]
				"特变电工 缴械 老白鲨-逐风者 Immune (Physical)", -- [49]
				"特变电工 肉搏 老白鲨-逐风者 Absorb -550 (550 被吸收) (1)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["Name"] = "特变电工",
			["LastEventTimes"] = {
				14064.976, -- [1]
				14065.176, -- [2]
				14065.209, -- [3]
				14065.376, -- [4]
				14065.643, -- [5]
				14065.643, -- [6]
				14066.443, -- [7]
				14066.559, -- [8]
				14067.293, -- [9]
				14067.909, -- [10]
				14068.193, -- [11]
				14068.343, -- [12]
				14068.343, -- [13]
				14069.31, -- [14]
				14069.343, -- [15]
				14069.85, -- [16]
				14069.861, -- [17]
				14074.377, -- [18]
				14077.377, -- [19]
				14006.589, -- [20]
				14007.072, -- [21]
				14007.305, -- [22]
				14009.255, -- [23]
				14011.289, -- [24]
				14011.389, -- [25]
				14011.389, -- [26]
				14011.489, -- [27]
				14011.806, -- [28]
				14012.256, -- [29]
				14012.322, -- [30]
				14012.356, -- [31]
				14041.224, -- [32]
				14041.724, -- [33]
				14041.775, -- [34]
				14041.791, -- [35]
				14041.791, -- [36]
				14044.808, -- [37]
				14045.558, -- [38]
				14047.225, -- [39]
				14048.742, -- [40]
				14051.694, -- [41]
				14053.792, -- [42]
				14054.075, -- [43]
				14057.592, -- [44]
				14057.775, -- [45]
				14061.226, -- [46]
				14061.392, -- [47]
				14062.509, -- [48]
				14063.542, -- [49]
				14063.542, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["老白鲨-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5521,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 21,
								},
							},
							["amount"] = 41,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 11,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 532,
						["Melee"] = 1652,
						["Physical"] = 1756,
						["Fire"] = 592,
						["Shadow"] = 798,
						["Nature"] = 191,
					},
					["DOT_Time"] = 9,
					["Damage"] = 4514,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 989,
						["Physical"] = 128,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 2120,
						["Physical"] = 2394,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 53,
								},
							},
							["amount"] = 53,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 328,
								},
								["雷霆一击"] = {
									["count"] = 60,
								},
								["肉搏"] = {
									["count"] = 1348,
								},
							},
							["amount"] = 1736,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["斩杀"] = {
									["count"] = 1162,
								},
								["肉搏"] = {
									["count"] = 376,
								},
							},
							["amount"] = 1591,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 37,
								},
								["斩杀"] = {
									["count"] = 701,
								},
								["肉搏"] = {
									["count"] = 396,
								},
							},
							["amount"] = 1134,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 604,
								},
								["射击"] = {
									["count"] = 191,
								},
							},
							["amount"] = 795,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冲击波"] = {
									["count"] = 592,
								},
								["冰霜新星"] = {
									["count"] = 25,
								},
							},
							["amount"] = 617,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 27,
								},
								["肉搏"] = {
									["count"] = 517,
								},
							},
							["amount"] = 544,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 194,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 507,
								},
							},
							["amount"] = 507,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 745,
								},
								["断筋"] = {
									["count"] = 49,
								},
								["斩杀"] = {
									["count"] = 935,
								},
								["肉搏"] = {
									["count"] = 1135,
								},
							},
							["amount"] = 2864,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.92,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.92,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.07,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.57,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 16.49,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 130,
									["min"] = 130,
									["count"] = 2,
									["amount"] = 260,
								},
								["Absorb"] = {
									["max"] = 68,
									["min"] = 68,
									["count"] = 1,
									["amount"] = 68,
								},
							},
							["count"] = 3,
							["amount"] = 328,
						},
						["雷霆一击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 60,
									["min"] = 60,
									["count"] = 1,
									["amount"] = 60,
								},
								["Hit"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
							},
							["count"] = 2,
							["amount"] = 113,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
							},
							["count"] = 1,
							["amount"] = 53,
						},
						["缴械"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 37,
									["min"] = 37,
									["count"] = 1,
									["amount"] = 37,
								},
							},
							["count"] = 1,
							["amount"] = 37,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1162,
									["min"] = 1162,
									["count"] = 1,
									["amount"] = 1162,
								},
								["Hit"] = {
									["max"] = 701,
									["min"] = 701,
									["count"] = 1,
									["amount"] = 701,
								},
							},
							["count"] = 2,
							["amount"] = 1863,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 550,
									["min"] = 439,
									["count"] = 2,
									["amount"] = 989,
								},
								["Crit"] = {
									["max"] = 359,
									["min"] = 359,
									["count"] = 1,
									["amount"] = 359,
								},
								["Hit"] = {
									["max"] = 396,
									["min"] = 376,
									["count"] = 2,
									["amount"] = 772,
								},
							},
							["count"] = 5,
							["amount"] = 2120,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 41,
					["TimeDamage"] = 16.49,
					["TimeDamaging"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.92,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.92,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.07,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 3.57,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["柠檬-逐风者"] = {
									["count"] = 12,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 9,
								},
								["老戏骨-逐风者"] = {
									["count"] = 6,
								},
								["一路酱-逐风者"] = {
									["count"] = 3,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 33,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 3,
								},
								["老白鲨-逐风者"] = {
									["count"] = 12,
								},
								["雲木彡-逐风者"] = {
									["count"] = 24,
								},
								["请叫我天哥-逐风者"] = {
									["count"] = 18,
								},
								["神经蛙-逐风者"] = {
									["count"] = 27,
								},
							},
							["amount"] = 147,
						},
					},
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 3,
								},
								["治疗药水"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 2.53,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2,
								},
								["肉搏"] = {
									["count"] = 16.28,
								},
							},
							["amount"] = 32.09,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.91,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.669999999999998,
								},
								["断筋"] = {
									["count"] = 1.7,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.8200000000000001,
								},
								["横扫攻击"] = {
									["count"] = 0.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 4.869999999999999,
								},
								["肉搏"] = {
									["count"] = 9.47,
								},
							},
							["amount"] = 32.96000000000001,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.13,
								},
								["压制"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 15.67,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.77,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["雷霆一击"] = {
									["count"] = 1.47,
								},
								["断筋"] = {
									["count"] = 3.87,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.63,
								},
							},
							["amount"] = 36.69,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.43,
								},
							},
							["amount"] = 3.43,
						},
						["请叫我文哥"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.23,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.82,
								},
							},
							["amount"] = 2.55,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.45,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.289999999999999,
								},
								["断筋"] = {
									["count"] = 2.37,
								},
								["昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.13,
								},
							},
							["amount"] = 18.24,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["拳击"] = {
									["count"] = 0.1,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 1.41,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["铁皮手雷"] = {
									["count"] = 2.05,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 5.04,
								},
							},
							["amount"] = 20.6,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.28,
								},
								["旋风斩"] = {
									["count"] = 2.65,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.22,
								},
								["斩杀"] = {
									["count"] = 3.72,
								},
								["肉搏"] = {
									["count"] = 5.37,
								},
							},
							["amount"] = 17.74,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.03,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.97,
								},
								["旋风斩"] = {
									["count"] = 0.18,
								},
								["断筋"] = {
									["count"] = 0.7,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.11,
								},
							},
							["amount"] = 11.99,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.19,
								},
								["断筋"] = {
									["count"] = 1.15,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 7.340000000000001,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.73,
								},
								["旋风斩"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 2.95,
								},
								["斩杀"] = {
									["count"] = 4.12,
								},
								["肉搏"] = {
									["count"] = 4.88,
								},
							},
							["amount"] = 19.18,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.9199999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.42,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 18.34,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.33,
								},
								["横扫攻击"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.05,
								},
								["缴械"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 7.1,
								},
							},
							["amount"] = 18.63,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.22,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.72,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.45,
								},
								["断筋"] = {
									["count"] = 1.93,
								},
								["斩杀"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 10.32,
								},
							},
							["amount"] = 23.86,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 0.83,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 5.66,
								},
								["肉搏"] = {
									["count"] = 7.54,
								},
							},
							["amount"] = 20.03,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.27,
								},
								["旋风斩"] = {
									["count"] = 0.73,
								},
								["昏迷"] = {
									["count"] = 0.42,
								},
								["断筋"] = {
									["count"] = 2.3,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.72,
								},
							},
							["amount"] = 9.94,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 191,
								},
								["治疗药水"] = {
									["count"] = 5422,
								},
							},
							["amount"] = 5613,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1734,
								},
							},
							["amount"] = 1734,
						},
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 2005,
						["Melee"] = 4942,
						["Fire"] = 193,
					},
					["DeathCount"] = 8,
					["GTFOEvents"] = 3,
					["ElementTaken"] = {
						["Shadow"] = 9072,
						["Melee"] = 13926,
						["Arcane"] = 4434,
						["Physical"] = 16837,
						["Fire"] = 5241,
						["Frost"] = 11002,
						["Nature"] = 1558,
					},
					["DOT_Time"] = 147,
					["Damage"] = 87352,
					["TimeHeal"] = 9,
					["ElementDone"] = {
						["Physical"] = 44546,
						["Melee"] = 42472,
						["Fire"] = 334,
					},
					["DamagedWho"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 536,
								},
								["断筋"] = {
									["count"] = 80,
								},
								["旋风斩"] = {
									["count"] = 1295,
								},
								["肉搏"] = {
									["count"] = 2720,
								},
							},
							["amount"] = 4631,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 404,
								},
								["拳击"] = {
									["count"] = 29,
								},
								["旋风斩"] = {
									["count"] = 670,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 304,
								},
								["断筋"] = {
									["count"] = 83,
								},
								["斩杀"] = {
									["count"] = 351,
								},
								["肉搏"] = {
									["count"] = 4129,
								},
							},
							["amount"] = 5970,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["拳击"] = {
									["count"] = 53,
								},
								["拦截昏迷"] = {
									["count"] = 102,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 246,
								},
								["铁皮手雷"] = {
									["count"] = 334,
								},
								["断筋"] = {
									["count"] = 114,
								},
								["斩杀"] = {
									["count"] = 1754,
								},
								["肉搏"] = {
									["count"] = 2549,
								},
							},
							["amount"] = 5152,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 625,
								},
								["断筋"] = {
									["count"] = 159,
								},
								["拦截昏迷"] = {
									["count"] = 108,
								},
								["肉搏"] = {
									["count"] = 1713,
								},
							},
							["amount"] = 2605,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1275,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 215,
								},
								["断筋"] = {
									["count"] = 171,
								},
								["旋风斩"] = {
									["count"] = 1730,
								},
								["拦截昏迷"] = {
									["count"] = 72,
								},
								["拳击"] = {
									["count"] = 29,
								},
								["斩杀"] = {
									["count"] = 1809,
								},
								["肉搏"] = {
									["count"] = 4608,
								},
							},
							["amount"] = 9909,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2764,
								},
								["压制"] = {
									["count"] = 256,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1044,
								},
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["旋风斩"] = {
									["count"] = 1679,
								},
								["横扫攻击"] = {
									["count"] = 381,
								},
								["断筋"] = {
									["count"] = 96,
								},
								["斩杀"] = {
									["count"] = 1429,
								},
								["肉搏"] = {
									["count"] = 4743,
								},
							},
							["amount"] = 12436,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 402,
								},
								["压制"] = {
									["count"] = 636,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 967,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 308,
								},
								["旋风斩"] = {
									["count"] = 317,
								},
								["雷霆一击"] = {
									["count"] = 76,
								},
								["断筋"] = {
									["count"] = 195,
								},
								["斩杀"] = {
									["count"] = 486,
								},
								["肉搏"] = {
									["count"] = 5105,
								},
							},
							["amount"] = 8492,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 467,
								},
								["断筋"] = {
									["count"] = 33,
								},
								["斩杀"] = {
									["count"] = 473,
								},
								["肉搏"] = {
									["count"] = 1540,
								},
							},
							["amount"] = 2513,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 544,
								},
								["旋风斩"] = {
									["count"] = 275,
								},
								["肉搏"] = {
									["count"] = 427,
								},
							},
							["amount"] = 1246,
						},
						["请叫我文哥"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 452,
								},
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["肉搏"] = {
									["count"] = 390,
								},
								["旋风斩"] = {
									["count"] = 386,
								},
							},
							["amount"] = 1272,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1345,
								},
								["旋风斩"] = {
									["count"] = 437,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 119,
								},
								["横扫攻击"] = {
									["count"] = 431,
								},
								["断筋"] = {
									["count"] = 109,
								},
								["斩杀"] = {
									["count"] = 1304,
								},
								["肉搏"] = {
									["count"] = 1521,
								},
							},
							["amount"] = 5266,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 842,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 458,
								},
								["雷霆一击"] = {
									["count"] = 60,
								},
								["斩杀"] = {
									["count"] = 374,
								},
								["肉搏"] = {
									["count"] = 3193,
								},
							},
							["amount"] = 4927,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 540,
								},
								["旋风斩"] = {
									["count"] = 1599,
								},
								["横扫攻击"] = {
									["count"] = 393,
								},
								["雷霆一击"] = {
									["count"] = 53,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 832,
								},
								["肉搏"] = {
									["count"] = 1611,
								},
							},
							["amount"] = 5028,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1726,
								},
								["压制"] = {
									["count"] = 920,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 803,
								},
								["断筋"] = {
									["count"] = 70,
								},
								["旋风斩"] = {
									["count"] = 914,
								},
								["肉搏"] = {
									["count"] = 2112,
								},
							},
							["amount"] = 6545,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 42,
								},
								["拳击"] = {
									["count"] = 87,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 82,
								},
								["旋风斩"] = {
									["count"] = 711,
								},
								["断筋"] = {
									["count"] = 68,
								},
								["斩杀"] = {
									["count"] = 589,
								},
								["肉搏"] = {
									["count"] = 3337,
								},
							},
							["amount"] = 4916,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 661,
								},
								["旋风斩"] = {
									["count"] = 760,
								},
								["断筋"] = {
									["count"] = 201,
								},
								["斩杀"] = {
									["count"] = 2048,
								},
								["肉搏"] = {
									["count"] = 2774,
								},
							},
							["amount"] = 6444,
						},
					},
					["WhoDamaged"] = {
						["一路酱-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 194,
								},
							},
							["amount"] = 194,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["地精工兵炸药"] = {
									["count"] = 461,
								},
								["心灵震爆"] = {
									["count"] = 1795,
								},
								["肉搏"] = {
									["count"] = 110,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 5051,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 775,
								},
							},
							["amount"] = 8192,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 286,
								},
								["冰霜新星"] = {
									["count"] = 360,
								},
								["寒冰箭"] = {
									["count"] = 2664,
								},
								["火焰冲击"] = {
									["count"] = 1864,
								},
								["冰锥术"] = {
									["count"] = 583,
								},
							},
							["amount"] = 5757,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 82,
								},
								["魔爆术"] = {
									["count"] = 319,
								},
								["冲击波"] = {
									["count"] = 1874,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 245,
								},
								["冰锥术"] = {
									["count"] = 2109,
								},
							},
							["amount"] = 4629,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 1367,
								},
								["冰霜震击"] = {
									["count"] = 3277,
								},
							},
							["amount"] = 4644,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 424,
								},
								["拦截昏迷"] = {
									["count"] = 40,
								},
								["压制"] = {
									["count"] = 1434,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 533,
								},
								["雷霆一击"] = {
									["count"] = 63,
								},
								["断筋"] = {
									["count"] = 317,
								},
								["斩杀"] = {
									["count"] = 1294,
								},
								["肉搏"] = {
									["count"] = 4526,
								},
							},
							["amount"] = 8631,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 72,
								},
								["压制"] = {
									["count"] = 646,
								},
								["旋风斩"] = {
									["count"] = 218,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 453,
								},
								["断筋"] = {
									["count"] = 33,
								},
								["斩杀"] = {
									["count"] = 939,
								},
								["肉搏"] = {
									["count"] = 733,
								},
							},
							["amount"] = 3094,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 745,
								},
								["断筋"] = {
									["count"] = 49,
								},
								["斩杀"] = {
									["count"] = 935,
								},
								["肉搏"] = {
									["count"] = 1135,
								},
							},
							["amount"] = 2864,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 106,
								},
								["血袭 (伤害/跳)"] = {
									["count"] = 78,
								},
								["月火术"] = {
									["count"] = 199,
								},
								["肉搏"] = {
									["count"] = 841,
								},
							},
							["amount"] = 1224,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1257,
								},
								["射击"] = {
									["count"] = 191,
								},
							},
							["amount"] = 1448,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["冰霜冲击"] = {
									["count"] = 94,
								},
								["背刺"] = {
									["count"] = 2220,
								},
								["脑部损伤"] = {
									["count"] = 150,
								},
								["铁皮手雷"] = {
									["count"] = 165,
								},
								["肉搏"] = {
									["count"] = 2043,
								},
							},
							["amount"] = 4672,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1486,
								},
							},
							["amount"] = 1486,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 146,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 177,
								},
								["压制"] = {
									["count"] = 351,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1034,
								},
								["雷霆一击"] = {
									["count"] = 66,
								},
								["断筋"] = {
									["count"] = 440,
								},
								["斩杀"] = {
									["count"] = 1063,
								},
								["肉搏"] = {
									["count"] = 4538,
								},
							},
							["amount"] = 7815,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3362,
								},
								["冰锥术"] = {
									["count"] = 1239,
								},
								["冰霜新星"] = {
									["count"] = 308,
								},
							},
							["amount"] = 4909,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 448,
								},
								["多重射击"] = {
									["count"] = 1340,
								},
								["驱散射击"] = {
									["count"] = 237,
								},
							},
							["amount"] = 2025,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 486,
								},
							},
							["amount"] = 486,
						},
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 3,
								},
								["治疗药水"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
					},
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["血袭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["深冬之寒"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肾击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 61,
									["min"] = 61,
									["count"] = 1,
									["amount"] = 61,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 61,
							["amount"] = 20,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 11,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 21,
						},
						["月火术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["脑部损伤"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 25,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 72,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 72,
						},
					},
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["血袭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["深冬之寒"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肾击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 11,
									["amount"] = 0,
								},
							},
							["count"] = 11,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 21,
									["amount"] = 0,
								},
							},
							["count"] = 21,
							["amount"] = 0,
						},
						["月火术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["脑部损伤"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 72,
									["amount"] = 0,
								},
							},
							["count"] = 72,
							["amount"] = 0,
						},
					},
					["Interrupts"] = 2,
					["DamageTaken"] = 62070,
					["InterruptData"] = {
						["老戏骨-逐风者"] = {
							["Details"] = {
								["次级治疗波 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["快速治疗 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 194,
								},
							},
							["amount"] = 194,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 336,
								},
							},
							["amount"] = 336,
						},
					},
					["Heals"] = {
						["战士的决心"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 99,
									["min"] = 92,
									["count"] = 2,
									["amount"] = 191,
								},
							},
							["count"] = 2,
							["amount"] = 191,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1632,
									["min"] = 1196,
									["count"] = 4,
									["amount"] = 5422,
								},
							},
							["count"] = 4,
							["amount"] = 5422,
						},
					},
					["HealingTaken"] = 7347,
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 191,
								},
								["治疗药水"] = {
									["count"] = 5422,
								},
							},
							["amount"] = 5613,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 24,
								},
							},
							["amount"] = 29,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 48,
								},
								["Dodge"] = {
									["count"] = 5,
								},
								["Miss"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 72,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 36,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 12,
								},
								["Tick"] = {
									["count"] = 30,
								},
							},
							["amount"] = 82,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 13,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 26,
								},
							},
							["amount"] = 41,
						},
						["Nature"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
					},
					["Healing"] = 5613,
					["GTFOEvent"] = {
						["低"] = {
							["Details"] = {
								["火焰新星"] = {
									["max"] = 486,
									["min"] = 486,
									["count"] = 1,
									["amount"] = 486,
								},
								["+暴风雪"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 486,
						},
					},
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 194,
								},
								["冲锋"] = {
									["count"] = 336,
								},
							},
							["amount"] = 530,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1345,
									["min"] = 861,
									["count"] = 5,
									["amount"] = 5387,
								},
								["Hit"] = {
									["max"] = 661,
									["min"] = 371,
									["count"] = 14,
									["amount"] = 6656,
								},
							},
							["count"] = 21,
							["amount"] = 12043,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 78,
									["min"] = 68,
									["count"] = 4,
									["amount"] = 291,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Tick"] = {
									["max"] = 147,
									["min"] = 75,
									["count"] = 43,
									["amount"] = 4779,
								},
							},
							["count"] = 49,
							["amount"] = 5070,
						},
						["拳击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 87,
									["min"] = 87,
									["count"] = 1,
									["amount"] = 87,
								},
								["Hit"] = {
									["max"] = 53,
									["min"] = 29,
									["count"] = 3,
									["amount"] = 111,
								},
							},
							["count"] = 4,
							["amount"] = 198,
						},
						["昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 437,
									["min"] = 264,
									["count"] = 11,
									["amount"] = 3744,
								},
								["Absorb"] = {
									["max"] = 879,
									["min"] = 416,
									["count"] = 2,
									["amount"] = 1295,
								},
								["Crit"] = {
									["max"] = 914,
									["min"] = 614,
									["count"] = 8,
									["amount"] = 5734,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 10773,
						},
						["锤击昏迷效果"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1162,
									["min"] = 1162,
									["count"] = 1,
									["amount"] = 1162,
								},
								["Hit"] = {
									["max"] = 821,
									["min"] = 351,
									["count"] = 17,
									["amount"] = 9455,
								},
							},
							["count"] = 20,
							["amount"] = 10617,
						},
						["雷霆一击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 60,
									["min"] = 60,
									["count"] = 1,
									["amount"] = 60,
								},
								["Hit"] = {
									["max"] = 76,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 129,
								},
							},
							["count"] = 3,
							["amount"] = 189,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 920,
									["min"] = 540,
									["count"] = 3,
									["amount"] = 2096,
								},
								["Hit"] = {
									["max"] = 256,
									["min"] = 256,
									["count"] = 1,
									["amount"] = 256,
								},
							},
							["count"] = 4,
							["amount"] = 2352,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 308,
									["min"] = 308,
									["count"] = 1,
									["amount"] = 308,
								},
							},
							["count"] = 1,
							["amount"] = 308,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 54,
									["min"] = 49,
									["count"] = 2,
									["amount"] = 103,
								},
								["Hit"] = {
									["max"] = 54,
									["min"] = 36,
									["count"] = 7,
									["amount"] = 309,
								},
							},
							["count"] = 10,
							["amount"] = 412,
						},
						["缴械"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["横扫攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 431,
									["min"] = 381,
									["count"] = 3,
									["amount"] = 1205,
								},
							},
							["count"] = 3,
							["amount"] = 1205,
						},
						["断筋"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 46,
									["min"] = 7,
									["count"] = 17,
									["amount"] = 549,
								},
								["Absorb"] = {
									["max"] = 78,
									["min"] = 35,
									["count"] = 4,
									["amount"] = 230,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 82,
									["min"] = 57,
									["count"] = 9,
									["amount"] = 600,
								},
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 37,
							["amount"] = 1379,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 193,
									["min"] = 193,
									["count"] = 1,
									["amount"] = 193,
								},
								["Hit"] = {
									["max"] = 141,
									["min"] = 141,
									["count"] = 1,
									["amount"] = 141,
								},
							},
							["count"] = 2,
							["amount"] = 334,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 550,
									["min"] = 26,
									["count"] = 14,
									["amount"] = 4968,
								},
								["Hit"] = {
									["max"] = 538,
									["min"] = 165,
									["count"] = 54,
									["amount"] = 18730,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1011,
									["min"] = 359,
									["count"] = 27,
									["amount"] = 18774,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 100,
							["amount"] = 42472,
						},
					},
					["RageGain"] = 530,
					["ActiveTime"] = 302.6100000000001,
					["TimeDamage"] = 293.6100000000001,
					["TimeDamaging"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.27,
								},
								["旋风斩"] = {
									["count"] = 0.73,
								},
								["昏迷"] = {
									["count"] = 0.42,
								},
								["断筋"] = {
									["count"] = 2.3,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.72,
								},
							},
							["amount"] = 9.94,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.22,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 2.72,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.45,
								},
								["断筋"] = {
									["count"] = 1.93,
								},
								["斩杀"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 10.32,
								},
							},
							["amount"] = 23.86,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["拳击"] = {
									["count"] = 0.1,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 1.41,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["铁皮手雷"] = {
									["count"] = 2.05,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 5.04,
								},
							},
							["amount"] = 20.6,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 0.83,
								},
								["拦截昏迷"] = {
									["count"] = 3,
								},
								["断筋"] = {
									["count"] = 5.66,
								},
								["肉搏"] = {
									["count"] = 7.54,
								},
							},
							["amount"] = 20.03,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 2.53,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 2,
								},
								["肉搏"] = {
									["count"] = 16.28,
								},
							},
							["amount"] = 32.09,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.91,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.669999999999998,
								},
								["断筋"] = {
									["count"] = 1.7,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.8200000000000001,
								},
								["横扫攻击"] = {
									["count"] = 0.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 4.869999999999999,
								},
								["肉搏"] = {
									["count"] = 9.47,
								},
							},
							["amount"] = 32.96000000000001,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.13,
								},
								["压制"] = {
									["count"] = 0.15,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 15.67,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.77,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["雷霆一击"] = {
									["count"] = 1.47,
								},
								["断筋"] = {
									["count"] = 3.87,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.63,
								},
							},
							["amount"] = 36.69,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.19,
								},
								["断筋"] = {
									["count"] = 1.15,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 7.340000000000001,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.43,
								},
							},
							["amount"] = 3.43,
						},
						["请叫我文哥"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.23,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.82,
								},
							},
							["amount"] = 2.55,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.73,
								},
								["旋风斩"] = {
									["count"] = 4.5,
								},
								["断筋"] = {
									["count"] = 2.95,
								},
								["斩杀"] = {
									["count"] = 4.12,
								},
								["肉搏"] = {
									["count"] = 4.88,
								},
							},
							["amount"] = 19.18,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.9199999999999999,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.42,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 18.34,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.33,
								},
								["横扫攻击"] = {
									["count"] = 0.03,
								},
								["断筋"] = {
									["count"] = 0.05,
								},
								["缴械"] = {
									["count"] = 0.12,
								},
								["肉搏"] = {
									["count"] = 7.1,
								},
							},
							["amount"] = 18.63,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.45,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.289999999999999,
								},
								["断筋"] = {
									["count"] = 2.37,
								},
								["昏迷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.13,
								},
							},
							["amount"] = 18.24,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.03,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.97,
								},
								["旋风斩"] = {
									["count"] = 0.18,
								},
								["断筋"] = {
									["count"] = 0.7,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 6.11,
								},
							},
							["amount"] = 11.99,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.28,
								},
								["旋风斩"] = {
									["count"] = 2.65,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.22,
								},
								["斩杀"] = {
									["count"] = 3.72,
								},
								["肉搏"] = {
									["count"] = 5.37,
								},
							},
							["amount"] = 17.74,
						},
					},
					["GTFOEventDamage"] = 486,
					["ElementTakenResist"] = {
						["Shadow"] = 61,
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 5,
								},
								["Absorb"] = {
									["count"] = 13,
								},
								["Immune"] = {
									["count"] = 12,
								},
								["Hit"] = {
									["count"] = 76,
								},
								["Dodge"] = {
									["count"] = 9,
								},
								["Tick"] = {
									["count"] = 43,
								},
								["Crit"] = {
									["count"] = 27,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 187,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 14,
								},
								["Hit"] = {
									["count"] = 54,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 27,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 100,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
				},
			},
			["UnitLockout"] = 12975.197,
			["LastActive"] = 14077.21,
		},
		["卡尔克里特 <破裤子残腿-逐风者>"] = {
			["GUID"] = "Pet-0-5428-529-19964-1860-020117127B",
			["LastEventHealth"] = {
				5059, -- [1]
				5059, -- [2]
				5059, -- [3]
				4992, -- [4]
				4971, -- [5]
				4767, -- [6]
				4597, -- [7]
				4597, -- [8]
				4212, -- [9]
				4140, -- [10]
				4121, -- [11]
				3833, -- [12]
				3802, -- [13]
				3521, -- [14]
				3479, -- [15]
				3479, -- [16]
				0, -- [17]
				3785, -- [18]
				3785, -- [19]
				3640, -- [20]
				3475, -- [21]
				3460, -- [22]
				3450, -- [23]
				3319, -- [24]
				3162, -- [25]
				3162, -- [26]
				2889, -- [27]
				2889, -- [28]
				2538, -- [29]
				2538, -- [30]
				2538, -- [31]
				2515, -- [32]
				2515, -- [33]
				1886, -- [34]
				1886, -- [35]
				1863, -- [36]
				1558, -- [37]
				1558, -- [38]
				1342, -- [39]
				1324, -- [40]
				1306, -- [41]
				1289, -- [42]
				3932, -- [43]
				3922, -- [44]
				3735, -- [45]
				3424, -- [46]
				3407, -- [47]
				3394, -- [48]
				3377, -- [49]
				3251, -- [50]
			},
			["LastAttackedBy"] = "老白鲨-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"MISC", -- [16]
				"MISC", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					12, -- [1]
				},
				["TimeDamage"] = {
					12, -- [1]
				},
				["DamageTaken"] = {
					1079, -- [1]
				},
				["Damage"] = {
					250, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "卡尔克里特",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
					},
					["Messages"] = {
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -204 (Shadow)", -- [1]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -170 (Shadow)", -- [2]
						"吹风吹姑娘-逐风者 魔爆术 卡尔克里特 <破裤子残腿-逐风者> Hit -300 (Arcane)", -- [3]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -85 (Shadow)", -- [4]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -72 (Shadow)", -- [5]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -19 (Shadow)", -- [6]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -288 (Shadow)", -- [7]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -31 (Shadow)", -- [8]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -281 (Shadow)", -- [9]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -42 (Shadow)", -- [10]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -39 (Shadow)", -- [11]
						"卡尔克里特 <破裤子残腿-逐风者>死亡。", -- [12]
						"卡尔克里特 <破裤子残腿-逐风者>死亡。", -- [13]
					},
					["DeathAt"] = 13121.208,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["MessageTimes"] = {
						-13.83400000000074, -- [1]
						-12.33400000000074, -- [2]
						-10.83400000000074, -- [3]
						-10.83400000000074, -- [4]
						-4.117000000000189, -- [5]
						-3.717000000000553, -- [6]
						-2.584000000000742, -- [7]
						-1.899999999999636, -- [8]
						-1.567000000000917, -- [9]
						-0.5, -- [10]
						-0.1170000000001892, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["HealthMax"] = {
						5059, -- [1]
						5059, -- [2]
						5059, -- [3]
						5059, -- [4]
						5059, -- [5]
						5059, -- [6]
						5059, -- [7]
						5059, -- [8]
						5059, -- [9]
						5059, -- [10]
						5059, -- [11]
						5059, -- [12]
						3932, -- [13]
					},
					["Health"] = {
						4971, -- [1]
						4767, -- [2]
						4597, -- [3]
						4597, -- [4]
						4212, -- [5]
						4140, -- [6]
						4121, -- [7]
						3833, -- [8]
						3802, -- [9]
						3521, -- [10]
						3479, -- [11]
						3479, -- [12]
						0, -- [13]
					},
					["KilledBy"] = "卡尔克里特 <破裤子残腿-逐风者>",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
						"MISC", -- [13]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
					},
					["Messages"] = {
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -204 (Shadow)", -- [1]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -170 (Shadow)", -- [2]
						"吹风吹姑娘-逐风者 魔爆术 卡尔克里特 <破裤子残腿-逐风者> Hit -300 (Arcane)", -- [3]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -85 (Shadow)", -- [4]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -72 (Shadow)", -- [5]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -19 (Shadow)", -- [6]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -288 (Shadow)", -- [7]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -31 (Shadow)", -- [8]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -281 (Shadow)", -- [9]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -42 (Shadow)", -- [10]
						"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -39 (Shadow)", -- [11]
						"卡尔克里特 <破裤子残腿-逐风者>死亡。", -- [12]
						"卡尔克里特 <破裤子残腿-逐风者>死亡。", -- [13]
					},
					["DeathAt"] = 13121.208,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["MessageTimes"] = {
						-13.83400000000074, -- [1]
						-12.33400000000074, -- [2]
						-10.83400000000074, -- [3]
						-10.83400000000074, -- [4]
						-4.117000000000189, -- [5]
						-3.717000000000553, -- [6]
						-2.584000000000742, -- [7]
						-1.899999999999636, -- [8]
						-1.567000000000917, -- [9]
						-0.5, -- [10]
						-0.1170000000001892, -- [11]
						0, -- [12]
						0, -- [13]
					},
					["HealthMax"] = {
						5059, -- [1]
						5059, -- [2]
						5059, -- [3]
						5059, -- [4]
						5059, -- [5]
						5059, -- [6]
						5059, -- [7]
						5059, -- [8]
						5059, -- [9]
						5059, -- [10]
						5059, -- [11]
						5059, -- [12]
						3932, -- [13]
					},
					["Health"] = {
						4971, -- [1]
						4767, -- [2]
						4597, -- [3]
						4597, -- [4]
						4212, -- [5]
						4140, -- [6]
						4121, -- [7]
						3833, -- [8]
						3802, -- [9]
						3521, -- [10]
						3479, -- [11]
						3479, -- [12]
						0, -- [13]
					},
					["KilledBy"] = "卡尔克里特 <破裤子残腿-逐风者>",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
						"MISC", -- [13]
					},
				}, -- [2]
			},
			["level"] = 1,
			["LastDamageAbility"] = "地精工兵炸药",
			["LastFightIn"] = 5,
			["LastDamageTaken"] = 475,
			["type"] = "Pet",
			["LastKilledAt"] = 13119.691,
			["ownerName"] = "破裤子残腿-逐风者",
			["LastKilledBy"] = "卡尔克里特 <破裤子残腿-逐风者>",
			["TimeLast"] = {
				["DeathCount"] = 13119.208,
				["ActiveTime"] = 13596.209,
				["TimeDamage"] = 13596.209,
				["OVERALL"] = 13596.209,
				["DamageTaken"] = 13593.209,
				["Damage"] = 13596.209,
			},
			["LastEventHealthMax"] = {
				5059, -- [1]
				5059, -- [2]
				5059, -- [3]
				5059, -- [4]
				5059, -- [5]
				5059, -- [6]
				5059, -- [7]
				5059, -- [8]
				5059, -- [9]
				5059, -- [10]
				5059, -- [11]
				5059, -- [12]
				5059, -- [13]
				5059, -- [14]
				5059, -- [15]
				5059, -- [16]
				3932, -- [17]
				3932, -- [18]
				3932, -- [19]
				3932, -- [20]
				3932, -- [21]
				3932, -- [22]
				3932, -- [23]
				3932, -- [24]
				3932, -- [25]
				3932, -- [26]
				3932, -- [27]
				3932, -- [28]
				3932, -- [29]
				3932, -- [30]
				3932, -- [31]
				3932, -- [32]
				3932, -- [33]
				3932, -- [34]
				3932, -- [35]
				3932, -- [36]
				3932, -- [37]
				3932, -- [38]
				3932, -- [39]
				3932, -- [40]
				3932, -- [41]
				3932, -- [42]
				3932, -- [43]
				3932, -- [44]
				3932, -- [45]
				3932, -- [46]
				3932, -- [47]
				3932, -- [48]
				3932, -- [49]
				3932, -- [50]
			},
			["NextEventNum"] = 1,
			["LastDamageTime"] = 13596.509,
			["LastEvents"] = {
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 时间的小溪-逐风者 Dodge (1)", -- [1]
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 时间的小溪-逐风者 Crit -92 (Physical)", -- [2]
				"吹风吹姑娘-逐风者 冰霜新星 卡尔克里特 <破裤子残腿-逐风者> Hit -67 (Frost)", -- [3]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -21 (Shadow)", -- [4]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -204 (Shadow)", -- [5]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -170 (Shadow)", -- [6]
				"吹风吹姑娘-逐风者 魔爆术 卡尔克里特 <破裤子残腿-逐风者> Hit -300 (Arcane)", -- [7]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -85 (Shadow)", -- [8]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -72 (Shadow)", -- [9]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -19 (Shadow)", -- [10]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -288 (Shadow)", -- [11]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -31 (Shadow)", -- [12]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -281 (Shadow)", -- [13]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -42 (Shadow)", -- [14]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -39 (Shadow)", -- [15]
				"卡尔克里特 <破裤子残腿-逐风者>死亡。", -- [16]
				"卡尔克里特 <破裤子残腿-逐风者>死亡。", -- [17]
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 老白鲨-逐风者 Hit -37 (Physical)", -- [18]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -145 (Shadow)", -- [19]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -165 (Shadow)", -- [20]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -15 (Shadow)", -- [21]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -10 (Shadow)", -- [22]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -131 (Shadow)", -- [23]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -157 (Shadow)", -- [24]
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 老白鲨-逐风者 Parry (1)", -- [25]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -273 (Shadow)", -- [26]
				"老白鲨-逐风者 旋风斩 卡尔克里特 <破裤子残腿-逐风者> Hit -237 (Physical)", -- [27]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -114 (Shadow)", -- [28]
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 老白鲨-逐风者 Hit -36 (Physical)", -- [29]
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 老白鲨-逐风者 Hit -28 (Physical)", -- [30]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -23 (Shadow)", -- [31]
				"老白鲨-逐风者 地精工兵炸药 卡尔克里特 <破裤子残腿-逐风者> Hit -475 (Fire)", -- [32]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -154 (Shadow)", -- [33]
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 老白鲨-逐风者 Hit -28 (Physical)", -- [34]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -23 (Shadow)", -- [35]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -305 (Shadow)", -- [36]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -216 (Shadow)", -- [37]
				"卡尔克里特 <破裤子残腿-逐风者> 肉搏 老白鲨-逐风者 Hit -29 (Physical)", -- [38]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -18 (Shadow)", -- [39]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -18 (Shadow)", -- [40]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -17 (Shadow)", -- [41]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -18 (Shadow)", -- [42]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -10 (Shadow)", -- [43]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -187 (Shadow)", -- [44]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -311 (Shadow)", -- [45]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -17 (Shadow)", -- [46]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -13 (Shadow)", -- [47]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -17 (Shadow)", -- [48]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -126 (Shadow)", -- [49]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -163 (Shadow)", -- [50]
			},
			["Name"] = "卡尔克里特",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				12996.199, -- [1]
				12998.199, -- [2]
				13102.256, -- [3]
				13102.273, -- [4]
				13105.857, -- [5]
				13107.357, -- [6]
				13108.857, -- [7]
				13108.857, -- [8]
				13115.574, -- [9]
				13115.974, -- [10]
				13117.107, -- [11]
				13117.791, -- [12]
				13118.124, -- [13]
				13119.191, -- [14]
				13119.574, -- [15]
				13119.691, -- [16]
				13119.691, -- [17]
				13581.958, -- [18]
				13582.058, -- [19]
				13582.225, -- [20]
				13586.308, -- [21]
				13586.892, -- [22]
				13587.325, -- [23]
				13588.392, -- [24]
				13588.492, -- [25]
				13589.609, -- [26]
				13589.892, -- [27]
				13589.909, -- [28]
				13590.492, -- [29]
				13592.492, -- [30]
				13592.642, -- [31]
				13593.542, -- [32]
				13593.542, -- [33]
				13594.509, -- [34]
				13595.642, -- [35]
				13596.159, -- [36]
				13596.442, -- [37]
				13596.509, -- [38]
				13599.476, -- [39]
				13602.459, -- [40]
				13605.46, -- [41]
				13608.46, -- [42]
				13786.506, -- [43]
				13786.806, -- [44]
				13788.756, -- [45]
				13791.773, -- [46]
				13794.257, -- [47]
				13794.773, -- [48]
				13795.673, -- [49]
				13795.773, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DamagedWho"] = {
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 92,
								},
							},
							["amount"] = 92,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 158,
								},
							},
							["amount"] = 158,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 37,
									["min"] = 28,
									["count"] = 5,
									["amount"] = 158,
								},
								["Crit"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 250,
						},
					},
					["TimeSpent"] = {
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["DamageTaken"] = 1079,
					["WhoDamaged"] = {
						["老白鲨-逐风者"] = {
							["Details"] = {
								["地精工兵炸药"] = {
									["count"] = 475,
								},
								["旋风斩"] = {
									["count"] = 237,
								},
							},
							["amount"] = 712,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 300,
								},
								["冰霜新星"] = {
									["count"] = 67,
								},
							},
							["amount"] = 367,
						},
					},
					["ElementDone"] = {
						["Melee"] = 250,
					},
					["DeathCount"] = 1,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 8,
						},
					},
					["TimeDamage"] = 12,
					["TimeDamaging"] = {
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 475,
						["Frost"] = 67,
						["Physical"] = 237,
						["Arcane"] = 300,
					},
					["ActiveTime"] = 12,
					["Damage"] = 250,
				},
			},
			["UnitLockout"] = 12995.199,
			["LastActive"] = 13596.209,
		},
		["小木午-逐风者"] = {
			["GUID"] = "Player-5451-02F13068",
			["TimeLast"] = {
				["TimeHeal"] = 14032.207,
				["OVERALL"] = 14086.211,
				["DamageTaken"] = 14032.207,
				["Absorbs"] = 14032.207,
				["HealingTaken"] = 14032.207,
				["ActiveTime"] = 14086.211,
				["DeathCount"] = 13573.207,
				["ManaGain"] = 12964.197,
				["TimeDamage"] = 14086.211,
				["Damage"] = 14086.211,
			},
			["LastAttackedBy"] = "雲木彡-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"MISC", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					9, -- [1]
				},
				["DamageTaken"] = {
					4622, -- [1]
				},
				["Absorbs"] = {
					1193, -- [1]
				},
				["HealingTaken"] = {
					1193, -- [1]
				},
				["TimeDamage"] = {
					30.89, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ManaGain"] = {
					330, -- [1]
				},
				["ActiveTime"] = {
					39.89, -- [1]
				},
				["Damage"] = {
					10588, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
					},
					["Messages"] = {
						"Environment Falling 小木午-逐风者 Hit -2199 (Physical)", -- [1]
						"妖儿-逐风者 火焰冲击 小木午-逐风者 Absorb -530 (530 被吸收) (Fire)", -- [2]
						"小木午-逐风者 冰霜新星 源堂法雷尔-逐风者 Hit -29 (Frost)", -- [3]
						"小木午-逐风者 冰霜新星 妖儿-逐风者 Hit -28 (Frost)", -- [4]
						"小木午-逐风者 冰霜新星 雲木彡-逐风者 Crit -52 (Frost)", -- [5]
						"小木午-逐风者 冰霜新星 柠檬-逐风者 Hit -27 (Frost)", -- [6]
						"小木午-逐风者 冰锥术 雲木彡-逐风者 Hit -542 (Frost)", -- [7]
						"雲木彡-逐风者 断筋 小木午-逐风者 Miss (Physical)", -- [8]
						"雲木彡-逐风者 肉搏 小木午-逐风者 Absorb -314 (1)", -- [9]
						"雲木彡-逐风者 肉搏 小木午-逐风者 Hit -129 (314 被吸收) (Physical)", -- [10]
						"雲木彡-逐风者 斩杀 小木午-逐风者 Hit -625 (Physical)", -- [11]
						"小木午-逐风者死亡。", -- [12]
					},
					["DeathAt"] = 13576.208,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["MessageTimes"] = {
						-4.899999999999636, -- [1]
						-3.266999999999825, -- [2]
						-3.217000000000553, -- [3]
						-3.217000000000553, -- [4]
						-3.217000000000553, -- [5]
						-3.217000000000553, -- [6]
						-1.716000000000349, -- [7]
						-1.515999999999622, -- [8]
						-1.515999999999622, -- [9]
						-1.515999999999622, -- [10]
						-0.01599999999962165, -- [11]
						0, -- [12]
					},
					["HealthMax"] = {
						3210, -- [1]
						3210, -- [2]
						3210, -- [3]
						3210, -- [4]
						3210, -- [5]
						3210, -- [6]
						3210, -- [7]
						3210, -- [8]
						3210, -- [9]
						3210, -- [10]
						3210, -- [11]
						3210, -- [12]
					},
					["Health"] = {
						2894, -- [1]
						713, -- [2]
						713, -- [3]
						713, -- [4]
						713, -- [5]
						713, -- [6]
						713, -- [7]
						713, -- [8]
						713, -- [9]
						713, -- [10]
						584, -- [11]
						0, -- [12]
					},
					["KilledBy"] = "雲木彡-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"MISC", -- [12]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "撕裂 (伤害/跳)",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastEventHealth"] = {
				2894, -- [1]
				713, -- [2]
				713, -- [3]
				713, -- [4]
				713, -- [5]
				713, -- [6]
				713, -- [7]
				713, -- [8]
				713, -- [9]
				713, -- [10]
				584, -- [11]
				0, -- [12]
				3210, -- [13]
				3210, -- [14]
				3210, -- [15]
				3210, -- [16]
				3210, -- [17]
				3210, -- [18]
				3210, -- [19]
				2823, -- [20]
				3210, -- [21]
				3210, -- [22]
				3210, -- [23]
				3210, -- [24]
				3210, -- [25]
				3210, -- [26]
				3210, -- [27]
				3210, -- [28]
				3210, -- [29]
				3210, -- [30]
				3210, -- [31]
				3210, -- [32]
				2321, -- [33]
				2517, -- [34]
				2517, -- [35]
				2517, -- [36]
				2517, -- [37]
				2517, -- [38]
				2517, -- [39]
				2517, -- [40]
				2517, -- [41]
				2517, -- [42]
				3210, -- [43]
			},
			["LastHealTime"] = 14032.224,
			["LastDamageTaken"] = 29,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3210, -- [1]
				3210, -- [2]
				3210, -- [3]
				3210, -- [4]
				3210, -- [5]
				3210, -- [6]
				3210, -- [7]
				3210, -- [8]
				3210, -- [9]
				3210, -- [10]
				3210, -- [11]
				3210, -- [12]
				3210, -- [13]
				3210, -- [14]
				3210, -- [15]
				3210, -- [16]
				3210, -- [17]
				3210, -- [18]
				3210, -- [19]
				3210, -- [20]
				3210, -- [21]
				3210, -- [22]
				3210, -- [23]
				3210, -- [24]
				3210, -- [25]
				3210, -- [26]
				3210, -- [27]
				3210, -- [28]
				3210, -- [29]
				3210, -- [30]
				3210, -- [31]
				3210, -- [32]
				3210, -- [33]
				3210, -- [34]
				3210, -- [35]
				3210, -- [36]
				3210, -- [37]
				3210, -- [38]
				3210, -- [39]
				3210, -- [40]
				3210, -- [41]
				3210, -- [42]
				3210, -- [43]
			},
			["NextEventNum"] = 44,
			["LastDamageTime"] = 14087.061,
			["LastEvents"] = {
				"Environment Falling 小木午-逐风者 Hit -2199 (Physical)", -- [1]
				"妖儿-逐风者 火焰冲击 小木午-逐风者 Absorb -530 (530 被吸收) (Fire)", -- [2]
				"小木午-逐风者 冰霜新星 源堂法雷尔-逐风者 Hit -29 (Frost)", -- [3]
				"小木午-逐风者 冰霜新星 妖儿-逐风者 Hit -28 (Frost)", -- [4]
				"小木午-逐风者 冰霜新星 雲木彡-逐风者 Crit -52 (Frost)", -- [5]
				"小木午-逐风者 冰霜新星 柠檬-逐风者 Hit -27 (Frost)", -- [6]
				"小木午-逐风者 冰锥术 雲木彡-逐风者 Hit -542 (Frost)", -- [7]
				"雲木彡-逐风者 断筋 小木午-逐风者 Miss (Physical)", -- [8]
				"雲木彡-逐风者 肉搏 小木午-逐风者 Absorb -314 (1)", -- [9]
				"雲木彡-逐风者 肉搏 小木午-逐风者 Hit -129 (314 被吸收) (Physical)", -- [10]
				"雲木彡-逐风者 斩杀 小木午-逐风者 Hit -625 (Physical)", -- [11]
				"小木午-逐风者死亡。", -- [12]
				"小木午-逐风者 冰霜新星 老白鲨-逐风者 Hit -26 (Frost)", -- [13]
				"小木午-逐风者 冰霜新星 一路酱-逐风者 Hit -24 (Frost)", -- [14]
				"小木午-逐风者 冰锥术 一路酱-逐风者 Hit -472 (Frost)", -- [15]
				"小木午-逐风者 火焰冲击 一路酱-逐风者 Hit -500 (Fire)", -- [16]
				"小木午-逐风者 寒冰箭 一路酱-逐风者 Hit -569 (Frost)", -- [17]
				"纳格兰放牛娃-逐风者 铁皮手雷 小木午-逐风者 Absorb -178 (178 被吸收) (Fire)", -- [18]
				"纳格兰放牛娃-逐风者 肉搏 小木午-逐风者 Hit -476 (Physical)", -- [19]
				"小木午-逐风者 火焰冲击 老白鲨-逐风者 Crit -937 (Fire)", -- [20]
				"老白鲨-逐风者 重伤 (伤害/跳) 小木午-逐风者 Absorb -71 (71 被吸收) (Physical)", -- [21]
				"老白鲨-逐风者 重伤 (伤害/跳) 小木午-逐风者 Absorb -71 (71 被吸收) (Physical)", -- [22]
				"小木午-逐风者 火焰冲击 老白鲨-逐风者 Hit -619 (Fire)", -- [23]
				"小木午-逐风者 寒冰箭 老白鲨-逐风者 Hit -713 (Frost)", -- [24]
				"老白鲨-逐风者 旋风斩 小木午-逐风者 Dodge (Physical)", -- [25]
				"小木午-逐风者 寒冰箭 老白鲨-逐风者 Hit -727 (Frost)", -- [26]
				"小木午-逐风者 奥术飞弹 老白鲨-逐风者 Crit -385 (Arcane)", -- [27]
				"小木午-逐风者 奥术飞弹 老白鲨-逐风者 Hit -256 (Arcane)", -- [28]
				"小木午-逐风者 奥术飞弹 老白鲨-逐风者 Hit -256 (Arcane)", -- [29]
				"小木午-逐风者 火焰冲击 老白鲨-逐风者 Hit -639 (Fire)", -- [30]
				"小木午-逐风者 魔爆术 神经蛙-逐风者 Hit -289 (Arcane)", -- [31]
				"小木午-逐风者 魔爆术 一路酱-逐风者 Hit -260 (Arcane)", -- [32]
				"雲木彡-逐风者 撕裂 (伤害/跳) 小木午-逐风者 Absorb -29 (29 被吸收) (Physical)", -- [33]
				"小木午-逐风者 寒冰箭 源堂法雷尔-逐风者 Crit -108 (Frost)", -- [34]
				"小木午-逐风者 冰霜新星 雲木彡-逐风者 Resist (Frost)", -- [35]
				"小木午-逐风者 冰霜新星 老白鲨-逐风者 Hit -31 (Frost)", -- [36]
				"小木午-逐风者 冰锥术 雲木彡-逐风者 Hit -599 (Frost)", -- [37]
				"小木午-逐风者 冰锥术 老白鲨-逐风者 Crit -1174 (Frost)", -- [38]
				"小木午-逐风者 火焰冲击 老白鲨-逐风者 Hit -302 (274 被抵抗) (Fire)", -- [39]
				"小木午-逐风者 奥术飞弹 雲木彡-逐风者 Hit -256 (Arcane)", -- [40]
				"小木午-逐风者 奥术飞弹 雲木彡-逐风者 Hit -256 (Arcane)", -- [41]
				"小木午-逐风者 奥术飞弹 雲木彡-逐风者 Hit -256 (Arcane)", -- [42]
				"小木午-逐风者 奥术飞弹 雲木彡-逐风者 Hit -256 (Arcane)", -- [43]
			},
			["Name"] = "小木午-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
			},
			["LastEventTimes"] = {
				13569.307, -- [1]
				13570.94, -- [2]
				13570.99, -- [3]
				13570.99, -- [4]
				13570.99, -- [5]
				13570.99, -- [6]
				13572.491, -- [7]
				13572.691, -- [8]
				13572.691, -- [9]
				13572.691, -- [10]
				13574.191, -- [11]
				13574.207, -- [12]
				13596.426, -- [13]
				13596.426, -- [14]
				13597.926, -- [15]
				13599.476, -- [16]
				13604.293, -- [17]
				13640.813, -- [18]
				13649.913, -- [19]
				13666.514, -- [20]
				13778.956, -- [21]
				13781.956, -- [22]
				13783.289, -- [23]
				13783.389, -- [24]
				13783.473, -- [25]
				13788.256, -- [26]
				13789.99, -- [27]
				13791.356, -- [28]
				13792.473, -- [29]
				13794.19, -- [30]
				13795.707, -- [31]
				13795.707, -- [32]
				14032.224, -- [33]
				14067.659, -- [34]
				14073.91, -- [35]
				14073.91, -- [36]
				14075.577, -- [37]
				14075.577, -- [38]
				14077.077, -- [39]
				14084.261, -- [40]
				14085.261, -- [41]
				14086.161, -- [42]
				14087.061, -- [43]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["小木午-逐风者"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 274,
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 0,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
						["Physical"] = 0,
					},
					["ElementTaken"] = {
						["Physical"] = 0,
					},
					["DOT_Time"] = 0,
					["Damage"] = 3238,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Frost"] = 1912,
						["Fire"] = 302,
						["Arcane"] = 1024,
					},
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 108,
								},
							},
							["amount"] = 108,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 1024,
								},
								["冰锥术"] = {
									["count"] = 599,
								},
							},
							["amount"] = 1623,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 302,
								},
								["冰锥术"] = {
									["count"] = 1174,
								},
								["冰霜新星"] = {
									["count"] = 31,
								},
							},
							["amount"] = 1507,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 4.3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.300000000000001,
						},
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["WhoHealed"] = {
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 10.3,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
							},
							["count"] = 2,
							["amount"] = 31,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 256,
									["min"] = 256,
									["count"] = 4,
									["amount"] = 1024,
								},
							},
							["count"] = 4,
							["amount"] = 1024,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 108,
									["min"] = 108,
									["count"] = 1,
									["amount"] = 108,
								},
							},
							["count"] = 1,
							["amount"] = 108,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 302,
									["min"] = 302,
									["count"] = 1,
									["amount"] = 302,
								},
							},
							["count"] = 1,
							["amount"] = 302,
						},
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1174,
									["min"] = 1174,
									["count"] = 1,
									["amount"] = 1174,
								},
								["Hit"] = {
									["max"] = 599,
									["min"] = 599,
									["count"] = 1,
									["amount"] = 599,
								},
							},
							["count"] = 2,
							["amount"] = 1773,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 10.3,
					["TimeDamaging"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 4.3,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.300000000000001,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementDoneResist"] = {
						["Fire"] = 274,
					},
					["TimeSpent"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 3.99,
								},
								["寒冰箭"] = {
									["count"] = 1.6,
								},
								["火焰冲击"] = {
									["count"] = 6,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.09,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 4.3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8.8,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 4622,
					["DeathCount"] = 1,
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 330,
								},
							},
							["amount"] = 330,
						},
					},
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 71,
									["min"] = 71,
									["count"] = 2,
									["amount"] = 142,
								},
							},
							["count"] = 2,
							["amount"] = 142,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
							},
							["count"] = 1,
							["amount"] = 29,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 178,
									["min"] = 178,
									["count"] = 1,
									["amount"] = 178,
								},
							},
							["count"] = 1,
							["amount"] = 178,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 314,
									["min"] = 314,
									["count"] = 1,
									["amount"] = 314,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 314,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 530,
									["min"] = 530,
									["count"] = 1,
									["amount"] = 530,
								},
							},
							["count"] = 1,
							["amount"] = 530,
						},
					},
					["ActiveTime"] = 39.89,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 16,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 2995,
						["Melee"] = 919,
						["Fire"] = 708,
					},
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 108,
								},
								["冰霜新星"] = {
									["count"] = 29,
								},
							},
							["amount"] = 137,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 28,
								},
							},
							["amount"] = 28,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 1024,
								},
								["冰锥术"] = {
									["count"] = 1141,
								},
								["冰霜新星"] = {
									["count"] = 52,
								},
							},
							["amount"] = 2217,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 24,
								},
								["魔爆术"] = {
									["count"] = 260,
								},
								["寒冰箭"] = {
									["count"] = 569,
								},
								["火焰冲击"] = {
									["count"] = 500,
								},
								["冰锥术"] = {
									["count"] = 472,
								},
							},
							["amount"] = 1825,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 289,
								},
							},
							["amount"] = 289,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 57,
								},
								["冰锥术"] = {
									["count"] = 1174,
								},
								["寒冰箭"] = {
									["count"] = 1440,
								},
								["奥术飞弹"] = {
									["count"] = 897,
								},
								["火焰冲击"] = {
									["count"] = 2497,
								},
							},
							["amount"] = 6065,
						},
					},
					["Damage"] = 10588,
					["ElementDone"] = {
						["Frost"] = 5121,
						["Fire"] = 2997,
						["Arcane"] = 2470,
					},
					["TimeHeal"] = 9,
					["HealedWho"] = {
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1193,
								},
							},
							["amount"] = 1193,
						},
					},
					["TimeDamaging"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 3.99,
								},
								["寒冰箭"] = {
									["count"] = 1.6,
								},
								["火焰冲击"] = {
									["count"] = 6,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.09,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 4.3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8.8,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Absorbs"] = 1193,
					["ElementTakenAbsorb"] = {
						["Fire"] = 708,
						["Melee"] = 314,
						["Physical"] = 171,
					},
					["WhoHealed"] = {
						["小木午-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1193,
								},
							},
							["amount"] = 1193,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 530,
									["min"] = 29,
									["count"] = 6,
									["amount"] = 1193,
								},
							},
							["count"] = 6,
							["amount"] = 1193,
						},
					},
					["Attacks"] = {
						["奥术飞弹"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 385,
									["min"] = 385,
									["count"] = 1,
									["amount"] = 385,
								},
								["Hit"] = {
									["max"] = 256,
									["min"] = 256,
									["count"] = 6,
									["amount"] = 1536,
								},
							},
							["count"] = 7,
							["amount"] = 1921,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 52,
									["min"] = 52,
									["count"] = 1,
									["amount"] = 52,
								},
								["Hit"] = {
									["max"] = 31,
									["min"] = 24,
									["count"] = 6,
									["amount"] = 165,
								},
							},
							["count"] = 8,
							["amount"] = 217,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 289,
									["min"] = 260,
									["count"] = 2,
									["amount"] = 549,
								},
							},
							["count"] = 2,
							["amount"] = 549,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 108,
									["min"] = 108,
									["count"] = 1,
									["amount"] = 108,
								},
								["Hit"] = {
									["max"] = 727,
									["min"] = 569,
									["count"] = 3,
									["amount"] = 2009,
								},
							},
							["count"] = 4,
							["amount"] = 2117,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 937,
									["min"] = 937,
									["count"] = 1,
									["amount"] = 937,
								},
								["Hit"] = {
									["max"] = 639,
									["min"] = 302,
									["count"] = 4,
									["amount"] = 2060,
								},
							},
							["count"] = 5,
							["amount"] = 2997,
						},
						["冰锥术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1174,
									["min"] = 1174,
									["count"] = 1,
									["amount"] = 1174,
								},
								["Hit"] = {
									["max"] = 599,
									["min"] = 472,
									["count"] = 3,
									["amount"] = 1613,
								},
							},
							["count"] = 4,
							["amount"] = 2787,
						},
					},
					["HealingTaken"] = 1193,
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 330,
								},
							},
							["amount"] = 330,
						},
					},
					["TimeDamage"] = 30.89,
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2199,
								},
							},
							["amount"] = 2199,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 29,
								},
								["斩杀"] = {
									["count"] = 625,
								},
								["肉搏"] = {
									["count"] = 443,
								},
							},
							["amount"] = 1097,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 142,
								},
							},
							["amount"] = 142,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 178,
								},
								["肉搏"] = {
									["count"] = 476,
								},
							},
							["amount"] = 654,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 530,
								},
							},
							["amount"] = 530,
						},
					},
					["ManaGain"] = 330,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 7,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["小木午-逐风者"] = {
									["max"] = 530,
									["min"] = 29,
									["count"] = 6,
									["amount"] = 1193,
								},
							},
							["count"] = 6,
							["amount"] = 1193,
						},
					},
				},
			},
			["UnitLockout"] = 14032.207,
			["LastActive"] = 14086.211,
		},
		["破裤子残腿-逐风者"] = {
			["GUID"] = "Player-5451-02FB6A2B",
			["TimeLast"] = {
				["TimeHeal"] = 13597.209,
				["DeathCount"] = 13443.198,
				["OVERALL"] = 14076.21,
				["DamageTaken"] = 13795.207,
				["Healing"] = 13597.209,
				["Absorbs"] = 13122.208,
				["HealingTaken"] = 13597.209,
				["FDamage"] = 13795.207,
				["ActiveTime"] = 14076.21,
				["TimeDamage"] = 14076.21,
				["ManaGain"] = 13442.201,
				["DOT_Time"] = 14076.21,
				["Damage"] = 14076.21,
			},
			["LastAttackedBy"] = "老白鲨-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					15.74, -- [1]
				},
				["Healing"] = {
					1463, -- [1]
				},
				["DamageTaken"] = {
					10888, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Absorbs"] = {
					341, -- [1]
				},
				["HealingTaken"] = {
					2220, -- [1]
				},
				["FDamage"] = {
					3898, -- [1]
				},
				["TimeDamage"] = {
					99.49999999999994, -- [1]
				},
				["ActiveTime"] = {
					115.2399999999999, -- [1]
				},
				["ManaGain"] = {
					2660, -- [1]
				},
				["DOT_Time"] = {
					327, -- [1]
				},
				["Damage"] = {
					18326, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
					},
					["Messages"] = {
						"破裤子残腿-逐风者 吸取生命 (伤害/跳) 柠檬-逐风者 Tick -103 (Shadow)", -- [1]
						"破裤子残腿-逐风者 献祭 (伤害/跳) 时间的小溪-逐风者 Tick -139 (Fire)", -- [2]
						"时间的小溪-逐风者 肉搏 破裤子残腿-逐风者 Miss (1)", -- [3]
						"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 时间的小溪-逐风者 Tick -165 (Shadow)", -- [4]
						"时间的小溪-逐风者 肉搏 破裤子残腿-逐风者 Hit -131 (Physical)", -- [5]
						"初代大魔王-逐风者 奥术飞弹 破裤子残腿-逐风者 Hit -237 (Arcane)", -- [6]
						"雲木彡-逐风者 撕裂 (伤害/跳) 破裤子残腿-逐风者 Tick -28 (Physical)", -- [7]
						"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 时间的小溪-逐风者 Tick -114 (Shadow)", -- [8]
						"初代大魔王-逐风者 奥术飞弹 破裤子残腿-逐风者 Hit -237 (Arcane)", -- [9]
						"雲木彡-逐风者 肉搏 破裤子残腿-逐风者 Hit -377 (Physical)", -- [10]
						"时间的小溪-逐风者 肉搏 破裤子残腿-逐风者 Hit -69 (Physical)", -- [11]
						"时间的小溪-逐风者 肉搏 破裤子残腿-逐风者 Miss (1)", -- [12]
						"破裤子残腿-逐风者 献祭 (伤害/跳) 时间的小溪-逐风者 Tick -139 (Fire)", -- [13]
						"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 时间的小溪-逐风者 Tick -114 (Shadow)", -- [14]
						"雲木彡-逐风者 断筋 破裤子残腿-逐风者 Hit -45 (Physical)", -- [15]
						"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 时间的小溪-逐风者 Tick -165 (Shadow)", -- [16]
						"时间的小溪-逐风者 肉搏 破裤子残腿-逐风者 Hit -59 (Physical)", -- [17]
						"时间的小溪-逐风者 肉搏 破裤子残腿-逐风者 Hit -129 (Physical)", -- [18]
						"雲木彡-逐风者 撕裂 (伤害/跳) 破裤子残腿-逐风者 Tick -28 (Physical)", -- [19]
						"神经蛙-逐风者 肉搏 破裤子残腿-逐风者 Hit -413 (Physical)", -- [20]
						"破裤子残腿-逐风者死亡。", -- [21]
						"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 时间的小溪-逐风者 Tick -157 (Shadow)", -- [22]
					},
					["DeathAt"] = 13445.198,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
					},
					["MessageTimes"] = {
						-4.984000000000378, -- [1]
						-4.583999999998923, -- [2]
						-4.066999999999098, -- [3]
						-4, -- [4]
						-3.967000000000553, -- [5]
						-3.933999999999287, -- [6]
						-3.617000000000189, -- [7]
						-3.488999999999578, -- [8]
						-2.933999999999287, -- [9]
						-2.367000000000189, -- [10]
						-2.266999999999825, -- [11]
						-2.166999999999462, -- [12]
						-1.583000000000538, -- [13]
						-1.5, -- [14]
						-1.483000000000175, -- [15]
						-1, -- [16]
						-0.467000000000553, -- [17]
						-0.3670000000001892, -- [18]
						-0.3169999999990978, -- [19]
						-0.01699999999982538, -- [20]
						0, -- [21]
						0.5169999999998254, -- [22]
					},
					["HealthMax"] = {
						5694, -- [1]
						5694, -- [2]
						5694, -- [3]
						5694, -- [4]
						5694, -- [5]
						5694, -- [6]
						5694, -- [7]
						5694, -- [8]
						5694, -- [9]
						5694, -- [10]
						5694, -- [11]
						5694, -- [12]
						5694, -- [13]
						5694, -- [14]
						5694, -- [15]
						5694, -- [16]
						5694, -- [17]
						5694, -- [18]
						5694, -- [19]
						5694, -- [20]
						4884, -- [21]
						4884, -- [22]
					},
					["Health"] = {
						1834, -- [1]
						1705, -- [2]
						1705, -- [3]
						1705, -- [4]
						1705, -- [5]
						1705, -- [6]
						1337, -- [7]
						1309, -- [8]
						1309, -- [9]
						1078, -- [10]
						1078, -- [11]
						1078, -- [12]
						632, -- [13]
						632, -- [14]
						632, -- [15]
						587, -- [16]
						593, -- [17]
						534, -- [18]
						534, -- [19]
						377, -- [20]
						0, -- [21]
						0, -- [22]
					},
					["KilledBy"] = "神经蛙-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"MISC", -- [21]
						"DAMAGE", -- [22]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "致死打击",
			["LastFightIn"] = 11,
			["LastHealTime"] = 13597.909,
			["type"] = "Grouped",
			["LastDamageTaken"] = 381,
			["LastEventHealth"] = {
				3695, -- [1]
				3695, -- [2]
				3695, -- [3]
				3695, -- [4]
				3695, -- [5]
				3654, -- [6]
				3654, -- [7]
				3654, -- [8]
				3654, -- [9]
				3654, -- [10]
				3654, -- [11]
				3654, -- [12]
				3623, -- [13]
				3623, -- [14]
				3582, -- [15]
				3582, -- [16]
				3582, -- [17]
				3582, -- [18]
				3288, -- [19]
				3288, -- [20]
				3288, -- [21]
				2907, -- [22]
				2907, -- [23]
				2907, -- [24]
				4884, -- [25]
				4884, -- [26]
				4884, -- [27]
				4884, -- [28]
				1839, -- [29]
				1839, -- [30]
				1797, -- [31]
				1797, -- [32]
				1755, -- [33]
				1755, -- [34]
				1755, -- [35]
				1755, -- [36]
				1714, -- [37]
				1714, -- [38]
				4884, -- [39]
				4884, -- [40]
				4884, -- [41]
				4859, -- [42]
				4859, -- [43]
				4859, -- [44]
				4422, -- [45]
				4422, -- [46]
				4422, -- [47]
				3695, -- [48]
				3695, -- [49]
				3695, -- [50]
			},
			["LastEventHealthMax"] = {
				4884, -- [1]
				4884, -- [2]
				4884, -- [3]
				4884, -- [4]
				4884, -- [5]
				4884, -- [6]
				4884, -- [7]
				4884, -- [8]
				4884, -- [9]
				4884, -- [10]
				4884, -- [11]
				4884, -- [12]
				4884, -- [13]
				4884, -- [14]
				4884, -- [15]
				4884, -- [16]
				4884, -- [17]
				4884, -- [18]
				4884, -- [19]
				4884, -- [20]
				4884, -- [21]
				4884, -- [22]
				4884, -- [23]
				4884, -- [24]
				4884, -- [25]
				4884, -- [26]
				4884, -- [27]
				4884, -- [28]
				4884, -- [29]
				4884, -- [30]
				4884, -- [31]
				4884, -- [32]
				4884, -- [33]
				4884, -- [34]
				4884, -- [35]
				4884, -- [36]
				4884, -- [37]
				4884, -- [38]
				4884, -- [39]
				4884, -- [40]
				4884, -- [41]
				4884, -- [42]
				4884, -- [43]
				4884, -- [44]
				4884, -- [45]
				4884, -- [46]
				4884, -- [47]
				4884, -- [48]
				4884, -- [49]
				4884, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"卡尔克里特 <破裤子残腿-逐风者>", -- [1]
			},
			["NextEventNum"] = 29,
			["LastDamageTime"] = 14077.21,
			["LastEvents"] = {
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 一路酱-逐风者 Tick -65 (Shadow)", -- [1]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -80 (Shadow)", -- [2]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 一路酱-逐风者 Tick -66 (Shadow)", -- [3]
				"老白鲨-逐风者 重伤 (伤害/跳) 破裤子残腿-逐风者 Tick -41 (Physical)", -- [4]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -17 (Shadow)", -- [5]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -187 (Shadow)", -- [6]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 一路酱-逐风者 Tick -153 (Shadow)", -- [7]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -80 (Shadow)", -- [8]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 一路酱-逐风者 Tick -65 (Shadow)", -- [9]
				"老白鲨-逐风者 断筋 破裤子残腿-逐风者 Hit -31 (Physical)", -- [10]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -13 (Shadow)", -- [11]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -129 (Shadow)", -- [12]
				"老白鲨-逐风者 重伤 (伤害/跳) 破裤子残腿-逐风者 Tick -41 (Physical)", -- [13]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -17 (Shadow)", -- [14]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -187 (Shadow)", -- [15]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 一路酱-逐风者 Tick -154 (Shadow)", -- [16]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 一路酱-逐风者 Tick -65 (Shadow)", -- [17]
				"老白鲨-逐风者 肉搏 破裤子残腿-逐风者 Hit -294 (Physical)", -- [18]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -126 (Shadow)", -- [19]
				"老白鲨-逐风者 致死打击 破裤子残腿-逐风者 Hit -381 (Physical)", -- [20]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -163 (Shadow)", -- [21]
				"破裤子残腿-逐风者 暗影箭 老白鲨-逐风者 Resist (Shadow)", -- [22]
				"破裤子残腿-逐风者 肉搏 老白鲨-逐风者 Absorb -84 (1)", -- [23]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -45 (84 被吸收) (Shadow)", -- [24]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 妖儿-逐风者 Tick -170 (Shadow)", -- [25]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 妖儿-逐风者 Tick -170 (Shadow)", -- [26]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -141 (43 被抵抗) (Shadow)", -- [27]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -187 (Shadow)", -- [28]
				"老白鲨-逐风者 重伤 (伤害/跳) 破裤子残腿-逐风者 Tick -42 (Physical)", -- [29]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -18 (Shadow)", -- [30]
				"老白鲨-逐风者 重伤 (伤害/跳) 破裤子残腿-逐风者 Tick -42 (Physical)", -- [31]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -18 (Shadow)", -- [32]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 一路酱-逐风者 Tick -153 (Shadow)", -- [33]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 一路酱-逐风者 Tick -66 (Shadow)", -- [34]
				"老白鲨-逐风者 重伤 (伤害/跳) 破裤子残腿-逐风者 Tick -41 (Physical)", -- [35]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -17 (Shadow)", -- [36]
				"老白鲨-逐风者 重伤 (伤害/跳) 破裤子残腿-逐风者 Tick -42 (Physical)", -- [37]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -18 (Shadow)", -- [38]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -187 (Shadow)", -- [39]
				"老白鲨-逐风者 断筋 破裤子残腿-逐风者 Hit -25 (Physical)", -- [40]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -10 (Shadow)", -- [41]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -80 (Shadow)", -- [42]
				"老白鲨-逐风者 肉搏 破裤子残腿-逐风者 Crit -437 (Physical)", -- [43]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -187 (Shadow)", -- [44]
				"破裤子残腿-逐风者 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -80 (Shadow)", -- [45]
				"老白鲨-逐风者 致死打击 破裤子残腿-逐风者 Crit -727 (Physical)", -- [46]
				"破裤子残腿-逐风者 灵魂链接 卡尔克里特 <破裤子残腿-逐风者> Split -311 (Shadow)", -- [47]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -187 (Shadow)", -- [48]
				"破裤子残腿-逐风者 腐蚀术 (伤害/跳) 一路酱-逐风者 Tick -153 (Shadow)", -- [49]
				"破裤子残腿-逐风者 暗影箭 老白鲨-逐风者 Hit -853 (Shadow)", -- [50]
			},
			["Name"] = "破裤子残腿-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				true, -- [43]
				false, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13789.54, -- [1]
				13790.523, -- [2]
				13791.54, -- [3]
				13791.773, -- [4]
				13791.773, -- [5]
				13792.007, -- [6]
				13792.023, -- [7]
				13792.523, -- [8]
				13793.54, -- [9]
				13794.257, -- [10]
				13794.257, -- [11]
				13794.523, -- [12]
				13794.773, -- [13]
				13794.773, -- [14]
				13795.023, -- [15]
				13795.023, -- [16]
				13795.54, -- [17]
				13795.673, -- [18]
				13795.673, -- [19]
				13795.757, -- [20]
				13795.773, -- [21]
				13796.324, -- [22]
				13796.524, -- [23]
				13796.524, -- [24]
				14042.091, -- [25]
				14045.074, -- [26]
				14074.21, -- [27]
				14077.21, -- [28]
				13599.476, -- [29]
				13599.476, -- [30]
				13602.459, -- [31]
				13602.459, -- [32]
				13603.91, -- [33]
				13604.393, -- [34]
				13605.46, -- [35]
				13605.46, -- [36]
				13608.46, -- [37]
				13608.46, -- [38]
				13786.023, -- [39]
				13786.49, -- [40]
				13786.506, -- [41]
				13786.523, -- [42]
				13786.79, -- [43]
				13786.806, -- [44]
				13788.523, -- [45]
				13788.756, -- [46]
				13788.756, -- [47]
				13789.006, -- [48]
				13789.023, -- [49]
				13789.456, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["老白鲨-逐风者"] = {
									["count"] = 6,
								},
								["妖儿-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 43,
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 12,
					["Damage"] = 668,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 668,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["老白鲨-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 328,
								},
							},
							["amount"] = 328,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 340,
								},
							},
							["amount"] = 340,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["老白鲨-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 187,
									["min"] = 141,
									["count"] = 4,
									["amount"] = 668,
								},
							},
							["count"] = 4,
							["amount"] = 668,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 6,
					["TimeDamaging"] = {
						["老白鲨-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["柠檬-逐风者"] = {
									["count"] = 3,
								},
								["老白鲨-逐风者"] = {
									["count"] = 21,
								},
								["吹风吹姑娘-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 30,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["柠檬-逐风者"] = {
									["count"] = 36,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 27,
								},
								["吹风吹姑娘-逐风者"] = {
									["count"] = 30,
								},
								["老白鲨-逐风者"] = {
									["count"] = 39,
								},
								["一路酱-逐风者"] = {
									["count"] = 15,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 6,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 18,
								},
							},
							["amount"] = 171,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["妖儿-逐风者"] = {
									["count"] = 6,
								},
								["柠檬-逐风者"] = {
									["count"] = 6,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 18,
								},
								["吹风吹姑娘-逐风者"] = {
									["count"] = 15,
								},
								["老白鲨-逐风者"] = {
									["count"] = 33,
								},
								["一路酱-逐风者"] = {
									["count"] = 12,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 6,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 102,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 6,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 6,
								},
								["老白鲨-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 43,
						["Fire"] = 83,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 22,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Tick"] = {
									["count"] = 10,
								},
							},
							["amount"] = 23,
						},
					},
					["HealedWho"] = {
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 845,
								},
								["牺牲"] = {
									["count"] = 341,
								},
								["死亡缠绕"] = {
									["count"] = 618,
								},
							},
							["amount"] = 1804,
						},
					},
					["ElementDoneAbsorb"] = {
						["Fire"] = 240,
						["Shadow"] = 1304,
					},
					["Absorbs"] = 341,
					["DeathCount"] = 1,
					["FDamagedWho"] = {
						["卡尔克里特 <破裤子残腿-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 3898,
								},
							},
							["amount"] = 3898,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 448,
						["Melee"] = 4180,
						["Arcane"] = 673,
						["Fire"] = 839,
						["Physical"] = 4748,
					},
					["DOT_Time"] = 327,
					["Damage"] = 18326,
					["TimeHeal"] = 15.74,
					["FAttacks"] = {
						["灵魂链接"] = {
							["Details"] = {
								["Split"] = {
									["max"] = 311,
									["min"] = 10,
									["count"] = 36,
									["amount"] = 3898,
								},
							},
							["count"] = 36,
							["amount"] = 3898,
						},
					},
					["ElementDone"] = {
						["Fire"] = 1916,
						["Melee"] = 427,
						["Shadow"] = 15983,
					},
					["DamagedWho"] = {
						["妖儿-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 340,
								},
							},
							["amount"] = 340,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1408,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 103,
								},
								["灼热之痛"] = {
									["count"] = 320,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 340,
								},
								["肉搏"] = {
									["count"] = 48,
								},
							},
							["amount"] = 2219,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 930,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 853,
								},
							},
							["amount"] = 1783,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 785,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 815,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 109,
								},
								["灼热之痛"] = {
									["count"] = 267,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 851,
								},
								["肉搏"] = {
									["count"] = 211,
								},
							},
							["amount"] = 3038,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1553,
								},
								["献祭"] = {
									["count"] = 275,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1384,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 736,
								},
								["肉搏"] = {
									["count"] = 168,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2203,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 460,
								},
							},
							["amount"] = 6779,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 613,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 327,
								},
							},
							["amount"] = 940,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 864,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 208,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 374,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 316,
								},
							},
							["amount"] = 1762,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 857,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 330,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 278,
								},
							},
							["amount"] = 1465,
						},
					},
					["WhoDamaged"] = {
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1330,
								},
								["肉搏"] = {
									["count"] = 1209,
								},
							},
							["amount"] = 2539,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 199,
								},
								["冰锥术"] = {
									["count"] = 398,
								},
								["火焰冲击"] = {
									["count"] = 478,
								},
								["冰霜新星"] = {
									["count"] = 50,
								},
							},
							["amount"] = 1125,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 45,
								},
								["肉搏"] = {
									["count"] = 377,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 56,
								},
							},
							["amount"] = 478,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 413,
								},
							},
							["amount"] = 413,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2573,
								},
								["地精工兵炸药"] = {
									["count"] = 361,
								},
								["旋风斩"] = {
									["count"] = 268,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 359,
								},
								["断筋"] = {
									["count"] = 81,
								},
								["拦截昏迷"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 2181,
								},
							},
							["amount"] = 5859,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 474,
								},
							},
							["amount"] = 474,
						},
					},
					["Absorbed"] = {
						["牺牲"] = {
							["Details"] = {
								["破裤子残腿-逐风者"] = {
									["max"] = 155,
									["min"] = 69,
									["count"] = 3,
									["amount"] = 341,
								},
							},
							["count"] = 3,
							["amount"] = 341,
						},
					},
					["TimeHealing"] = {
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 10.96,
								},
								["牺牲"] = {
									["count"] = 3.28,
								},
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 15.74,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 22,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 1110,
								},
							},
							["amount"] = 1110,
						},
						["生命分流"] = {
							["Details"] = {
								["破裤子残腿-逐风者"] = {
									["count"] = 1550,
								},
							},
							["amount"] = 1550,
						},
					},
					["FDamage"] = 3898,
					["ActiveTime"] = 115.2399999999999,
					["Heals"] = {
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 118,
									["min"] = 3,
									["count"] = 9,
									["amount"] = 845,
								},
							},
							["count"] = 9,
							["amount"] = 845,
						},
						["牺牲"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 155,
									["min"] = 69,
									["count"] = 3,
									["amount"] = 341,
								},
							},
							["count"] = 3,
							["amount"] = 341,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 618,
									["min"] = 618,
									["count"] = 1,
									["amount"] = 618,
								},
							},
							["count"] = 1,
							["amount"] = 618,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 341,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 12,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 91,
								},
								["Absorb"] = {
									["count"] = 10,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 108,
						},
					},
					["Healing"] = 1463,
					["WhoHealed"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 416,
								},
							},
							["amount"] = 416,
						},
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 845,
								},
								["牺牲"] = {
									["count"] = 341,
								},
								["死亡缠绕"] = {
									["count"] = 618,
								},
							},
							["amount"] = 1804,
						},
					},
					["TimeSpent"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
								["献祭"] = {
									["count"] = 0.3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.080000000000002,
								},
							},
							["amount"] = 10.26,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.96,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.91,
								},
							},
							["amount"] = 10.87,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 1.07,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.83,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 0.92,
								},
								["腐蚀术"] = {
									["count"] = 1.27,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.82,
								},
								["肉搏"] = {
									["count"] = 0.35,
								},
							},
							["amount"] = 15.76,
						},
						["卡尔克里特 <破裤子残腿-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 19.08,
								},
							},
							["amount"] = 19.08,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.49,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.12,
								},
							},
							["amount"] = 4.609999999999999,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.43,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.65,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 2.78,
								},
							},
							["amount"] = 5.66,
						},
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 10.96,
								},
								["牺牲"] = {
									["count"] = 3.28,
								},
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 15.74,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.59,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.9,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.08,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 9.64,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.1,
								},
								["献祭"] = {
									["count"] = 1.08,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.810000000000001,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.82,
								},
								["肉搏"] = {
									["count"] = 1.15,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 7.41,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.25,
								},
							},
							["amount"] = 20.62,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["吸取生命"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 275,
									["min"] = 275,
									["count"] = 1,
									["amount"] = 275,
								},
							},
							["count"] = 2,
							["amount"] = 275,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 118,
									["min"] = 3,
									["count"] = 10,
									["amount"] = 948,
								},
							},
							["count"] = 10,
							["amount"] = 948,
						},
						["腐蚀术"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 864,
									["min"] = 700,
									["count"] = 4,
									["amount"] = 3202,
								},
							},
							["count"] = 5,
							["amount"] = 3202,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 73,
									["min"] = 72,
									["count"] = 6,
									["amount"] = 436,
								},
								["Tick"] = {
									["max"] = 168,
									["min"] = 45,
									["count"] = 51,
									["amount"] = 5416,
								},
							},
							["count"] = 57,
							["amount"] = 5852,
						},
						["灼热之痛"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 320,
									["min"] = 267,
									["count"] = 2,
									["amount"] = 587,
								},
							},
							["count"] = 2,
							["amount"] = 587,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 108,
									["min"] = 48,
									["count"] = 5,
									["amount"] = 427,
								},
							},
							["count"] = 6,
							["amount"] = 427,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 171,
									["min"] = 170,
									["count"] = 4,
									["amount"] = 681,
								},
								["Tick"] = {
									["max"] = 243,
									["min"] = 141,
									["count"] = 30,
									["amount"] = 5300,
								},
							},
							["count"] = 34,
							["amount"] = 5981,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 158,
									["min"] = 45,
									["count"] = 8,
									["amount"] = 1054,
								},
							},
							["count"] = 8,
							["amount"] = 1054,
						},
					},
					["HealingTaken"] = 2220,
					["DamageTaken"] = 10888,
					["TimeDamage"] = 99.49999999999994,
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
								["献祭"] = {
									["count"] = 0.3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.080000000000002,
								},
							},
							["amount"] = 10.26,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.96,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.91,
								},
							},
							["amount"] = 10.87,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 1.07,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.83,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 0.92,
								},
								["腐蚀术"] = {
									["count"] = 1.27,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.82,
								},
								["肉搏"] = {
									["count"] = 0.35,
								},
							},
							["amount"] = 15.76,
						},
						["卡尔克里特 <破裤子残腿-逐风者>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 19.08,
								},
							},
							["amount"] = 19.08,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.49,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.12,
								},
							},
							["amount"] = 4.609999999999999,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 0.43,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.65,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 2.78,
								},
							},
							["amount"] = 5.66,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.59,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.9,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.08,
								},
								["肉搏"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 9.64,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.1,
								},
								["献祭"] = {
									["count"] = 1.08,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.810000000000001,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.82,
								},
								["肉搏"] = {
									["count"] = 1.15,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 7.41,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.25,
								},
							},
							["amount"] = 20.62,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 2660,
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 155,
									["min"] = 69,
									["count"] = 3,
									["amount"] = 341,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 341,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ManaGainedFrom"] = {
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 1550,
								},
							},
							["amount"] = 1550,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 1110,
								},
							},
							["amount"] = 1110,
						},
					},
				},
			},
			["UnitLockout"] = 14041.208,
			["LastActive"] = 14076.21,
		},
		["开心亿点点-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02F1AB2A",
			["LastEventHealth"] = {
				6421, -- [1]
				4259, -- [2]
				4462, -- [3]
				4462, -- [4]
				4466, -- [5]
				4466, -- [6]
				3743, -- [7]
				3743, -- [8]
				2944, -- [9]
				3147, -- [10]
				3150, -- [11]
				3150, -- [12]
				3356, -- [13]
				3360, -- [14]
				3363, -- [15]
				3363, -- [16]
				3369, -- [17]
				3373, -- [18]
				3373, -- [19]
				3379, -- [20]
				3382, -- [21]
				3536, -- [22]
				3536, -- [23]
				4013, -- [24]
				4013, -- [25]
				4013, -- [26]
				4013, -- [27]
				4013, -- [28]
				4013, -- [29]
				4013, -- [30]
				3717, -- [31]
				3717, -- [32]
				3185, -- [33]
				3188, -- [34]
				3188, -- [35]
				3188, -- [36]
				3188, -- [37]
				2893, -- [38]
				2893, -- [39]
				4176, -- [40]
				4179, -- [41]
				4179, -- [42]
				3892, -- [43]
				3892, -- [44]
				3892, -- [45]
				4013, -- [46]
				4013, -- [47]
				4563, -- [48]
				4563, -- [49]
				4563, -- [50]
			},
			["LastAttackedBy"] = "吹风吹姑娘-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"HEAL", -- [2]
				"MISC", -- [3]
				"MISC", -- [4]
				"MISC", -- [5]
				"MISC", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"HEAL", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"HEAL", -- [46]
				"HEAL", -- [47]
				"HEAL", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					10.43, -- [1]
				},
				["Dispelled"] = {
					4, -- [1]
				},
				["Healing"] = {
					1487, -- [1]
				},
				["DamageTaken"] = {
					9704, -- [1]
				},
				["Overhealing"] = {
					564, -- [1]
				},
				["EnergyGain"] = {
					120, -- [1]
				},
				["HealingTaken"] = {
					2747, -- [1]
				},
				["HOT_Time"] = {
					33, -- [1]
				},
				["TimeDamage"] = {
					60.29000000000001, -- [1]
				},
				["RageGain"] = {
					30, -- [1]
				},
				["ActiveTime"] = {
					70.72, -- [1]
				},
				["DOT_Time"] = {
					39, -- [1]
				},
				["Damage"] = {
					5840, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 9,
			["type"] = "Grouped",
			["LastHealTime"] = 13359.559,
			["LastDamageTaken"] = 287,
			["TimeLast"] = {
				["TimeHeal"] = 13359.209,
				["Dispelled"] = 13351.208,
				["Overhealing"] = 13926.199,
				["OVERALL"] = 13926.199,
				["DamageTaken"] = 13747.203,
				["Healing"] = 13359.209,
				["EnergyGain"] = 13663.197,
				["RageGain"] = 13744.203,
				["HOT_Time"] = 13926.199,
				["TimeDamage"] = 13747.203,
				["HealingTaken"] = 13359.209,
				["ActiveTime"] = 13747.203,
				["DOT_Time"] = 13747.203,
				["Damage"] = 13747.203,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				6453, -- [1]
				4563, -- [2]
				4563, -- [3]
				4563, -- [4]
				4563, -- [5]
				4563, -- [6]
				3743, -- [7]
				3743, -- [8]
				3743, -- [9]
				3743, -- [10]
				3743, -- [11]
				3743, -- [12]
				3743, -- [13]
				3743, -- [14]
				3743, -- [15]
				3743, -- [16]
				3743, -- [17]
				3743, -- [18]
				3743, -- [19]
				3743, -- [20]
				3743, -- [21]
				3743, -- [22]
				3743, -- [23]
				4013, -- [24]
				4013, -- [25]
				4013, -- [26]
				4013, -- [27]
				4013, -- [28]
				4013, -- [29]
				4013, -- [30]
				4013, -- [31]
				4013, -- [32]
				4013, -- [33]
				4013, -- [34]
				4013, -- [35]
				4013, -- [36]
				4013, -- [37]
				4013, -- [38]
				4013, -- [39]
				5793, -- [40]
				5793, -- [41]
				5793, -- [42]
				5793, -- [43]
				5793, -- [44]
				5793, -- [45]
				4013, -- [46]
				4013, -- [47]
				4563, -- [48]
				4563, -- [49]
				4563, -- [50]
			},
			["NextEventNum"] = 48,
			["LastDamageTime"] = 13747.603,
			["LastEvents"] = {
				"妖儿-逐风者 冲击波 开心亿点点-火妖鲁西弗隆 Hit -565 (Fire)", -- [1]
				"开心亿点点-火妖鲁西弗隆 回春术 开心亿点点-火妖鲁西弗隆 Tick +203", -- [2]
				"老戏骨-逐风者 dispels 开心亿点点-火妖鲁西弗隆 荆棘术 (净化术)", -- [3]
				"老戏骨-逐风者 dispels 开心亿点点-火妖鲁西弗隆 奥术光辉 (净化术)", -- [4]
				"老戏骨-逐风者 dispels 开心亿点点-火妖鲁西弗隆 野性印记 (净化术)", -- [5]
				"老戏骨-逐风者 dispels 开心亿点点-火妖鲁西弗隆 坚韧祷言 (净化术)", -- [6]
				"开心亿点点-火妖鲁西弗隆 回春术 开心亿点点-火妖鲁西弗隆 Tick +203 (203 过量治疗)", -- [7]
				"老戏骨-逐风者 地震术 开心亿点点-火妖鲁西弗隆 Crit -802 (Nature)", -- [8]
				"开心亿点点-火妖鲁西弗隆 回春术 开心亿点点-火妖鲁西弗隆 Tick +203", -- [9]
				"开心亿点点-火妖鲁西弗隆 纠缠根须 (伤害/跳) 雲木彡-逐风者 Tick -32 (Nature)", -- [10]
				"开心亿点点-火妖鲁西弗隆 月火术 柠檬-逐风者 Hit -231 (Arcane)", -- [11]
				"开心亿点点-火妖鲁西弗隆 回春术 开心亿点点-火妖鲁西弗隆 Tick +203", -- [12]
				"开心亿点点-火妖鲁西弗隆 月火术 柠檬-逐风者 Hit -209 (Arcane)", -- [13]
				"开心亿点点-火妖鲁西弗隆 月火术 一路酱-逐风者 Hit -182 (Arcane)", -- [14]
				"开心亿点点-火妖鲁西弗隆 肉搏 一路酱-逐风者 Absorb -84 (1)", -- [15]
				"开心亿点点-火妖鲁西弗隆 月火术 一路酱-逐风者 Hit -127 (84 被吸收) (Arcane)", -- [16]
				"开心亿点点-火妖鲁西弗隆 月火术 雲木彡-逐风者 Hit -199 (Arcane)", -- [17]
				"开心亿点点-火妖鲁西弗隆 月火术 (伤害/跳) 雲木彡-逐风者 Tick -90 (Arcane)", -- [18]
				"开心亿点点-火妖鲁西弗隆 纠缠根须 雲木彡-逐风者 Immune (Nature)", -- [19]
				"开心亿点点-火妖鲁西弗隆 月火术 (伤害/跳) 雲木彡-逐风者 Tick -89 (Arcane)", -- [20]
				"开心亿点点-火妖鲁西弗隆 月火术 (伤害/跳) 雲木彡-逐风者 Tick -90 (Arcane)", -- [21]
				"开心亿点点-火妖鲁西弗隆 毁灭 神经蛙-逐风者 Hit -489 (Physical)", -- [22]
				"开心亿点点-火妖鲁西弗隆 肉搏 神经蛙-逐风者 Crit -161 (Physical)", -- [23]
				"开心亿点点-火妖鲁西弗隆 肉搏 老白鲨-逐风者 Hit -83 (Physical)", -- [24]
				"开心亿点点-火妖鲁西弗隆 肉搏 老白鲨-逐风者 Hit -84 (Physical)", -- [25]
				"开心亿点点-火妖鲁西弗隆 肉搏 老白鲨-逐风者 Hit -84 (Physical)", -- [26]
				"开心亿点点-火妖鲁西弗隆 肉搏 神经蛙-逐风者 Hit -77 (Physical)", -- [27]
				"开心亿点点-火妖鲁西弗隆 扫击 神经蛙-逐风者 Hit -76 (Physical)", -- [28]
				"开心亿点点-火妖鲁西弗隆 肉搏 神经蛙-逐风者 Crit -154 (Physical)", -- [29]
				"吹风吹姑娘-逐风者 魔爆术 开心亿点点-火妖鲁西弗隆 Hit -300 (Arcane)", -- [30]
				"开心亿点点-火妖鲁西弗隆 肉搏 神经蛙-逐风者 Hit -80 (Physical)", -- [31]
				"吹风吹姑娘-逐风者 冰锥术 开心亿点点-火妖鲁西弗隆 Hit -532 (Frost)", -- [32]
				"开心亿点点-火妖鲁西弗隆 血袭 (伤害/跳) 神经蛙-逐风者 Tick -28 (Physical)", -- [33]
				"开心亿点点-火妖鲁西弗隆 撕扯 (伤害/跳) 神经蛙-逐风者 Tick -104 (Physical)", -- [34]
				"开心亿点点-火妖鲁西弗隆 扫击 (伤害/跳) 神经蛙-逐风者 Tick -43 (Physical)", -- [35]
				"雲木彡-逐风者 肉搏 开心亿点点-火妖鲁西弗隆 Hit -298 (Physical)", -- [36]
				"开心亿点点-火妖鲁西弗隆 荆棘术 雲木彡-逐风者 Hit -18 (Nature)", -- [37]
				"开心亿点点-火妖鲁西弗隆 血袭 (伤害/跳) 神经蛙-逐风者 Tick -27 (Physical)", -- [38]
				"开心亿点点-火妖鲁西弗隆 撕扯 (伤害/跳) 神经蛙-逐风者 Tick -104 (Physical)", -- [39]
				"开心亿点点-火妖鲁西弗隆 扫击 (伤害/跳) 神经蛙-逐风者 Tick -42 (Physical)", -- [40]
				"开心亿点点-火妖鲁西弗隆 撕扯 (伤害/跳) 神经蛙-逐风者 Tick -103 (Physical)", -- [41]
				"吹风吹姑娘-逐风者 魔爆术 开心亿点点-火妖鲁西弗隆 Hit -287 (Arcane)", -- [42]
				"开心亿点点-火妖鲁西弗隆 血袭 (伤害/跳) 神经蛙-逐风者 Tick -27 (Physical)", -- [43]
				"开心亿点点-火妖鲁西弗隆 肉搏 雲木彡-逐风者 Hit -143 (Physical)", -- [44]
				"开心亿点点-火妖鲁西弗隆 重击 雲木彡-逐风者 Resist (Physical)", -- [45]
				"开心亿点点-火妖鲁西弗隆 回春术 开心亿点点-火妖鲁西弗隆 Tick +204 (204 过量治疗)", -- [46]
				"开心亿点点-火妖鲁西弗隆 回春术 开心亿点点-火妖鲁西弗隆 Tick +204 (204 过量治疗)", -- [47]
				"开心亿点点-火妖鲁西弗隆 愈合 开心亿点点-火妖鲁西弗隆 Tick +157 (157 过量治疗)", -- [48]
				"开心亿点点-火妖鲁西弗隆 愈合 开心亿点点-火妖鲁西弗隆 Tick +157 (157 过量治疗)", -- [49]
				"妖儿-逐风者 冰霜新星 开心亿点点-火妖鲁西弗隆 Hit -25 (Frost)", -- [50]
			},
			["Name"] = "开心亿点点-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				13344.458, -- [1]
				13350.558, -- [2]
				13350.708, -- [3]
				13350.708, -- [4]
				13352.191, -- [5]
				13352.191, -- [6]
				13353.575, -- [7]
				13353.808, -- [8]
				13356.558, -- [9]
				13356.808, -- [10]
				13358.909, -- [11]
				13359.559, -- [12]
				13360.425, -- [13]
				13362.092, -- [14]
				13364.509, -- [15]
				13364.509, -- [16]
				13368.243, -- [17]
				13371.259, -- [18]
				13371.347, -- [19]
				13374.245, -- [20]
				13377.26, -- [21]
				13388.044, -- [22]
				13388.127, -- [23]
				13666.514, -- [24]
				13667.514, -- [25]
				13668.548, -- [26]
				13738.403, -- [27]
				13739.353, -- [28]
				13739.436, -- [29]
				13739.903, -- [30]
				13740.403, -- [31]
				13741.286, -- [32]
				13741.353, -- [33]
				13742.32, -- [34]
				13742.32, -- [35]
				13743.653, -- [36]
				13743.653, -- [37]
				13744.32, -- [38]
				13744.32, -- [39]
				13745.32, -- [40]
				13746.32, -- [41]
				13747.287, -- [42]
				13747.32, -- [43]
				13747.453, -- [44]
				13747.603, -- [45]
				13926.583, -- [46]
				13932.567, -- [47]
				13337.374, -- [48]
				13340.374, -- [49]
				13341.441, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["血袭 (伤害/跳)"] = {
							["Details"] = {
								["神经蛙-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["扫击 (伤害/跳)"] = {
							["Details"] = {
								["神经蛙-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["撕扯 (伤害/跳)"] = {
							["Details"] = {
								["神经蛙-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["雲木彡-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["时间的小溪-逐风者"] = {
									["count"] = 3,
								},
								["雲木彡-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 11,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 31,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 45,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoHealed"] = {
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 1016,
								},
								["愈合"] = {
									["count"] = 471,
								},
							},
							["amount"] = 1487,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1260,
								},
							},
							["amount"] = 1260,
						},
					},
					["RageGainedFrom"] = {
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["HOT_Time"] = 33,
					["ElementTaken"] = {
						["Physical"] = 3087,
						["Melee"] = 3813,
						["Arcane"] = 880,
						["Fire"] = 565,
						["Frost"] = 557,
						["Nature"] = 802,
					},
					["RageGained"] = {
						["激怒"] = {
							["Details"] = {
								["开心亿点点-火妖鲁西弗隆"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["Damage"] = 5840,
					["TimeHeal"] = 10.43,
					["ElementDone"] = {
						["Nature"] = 396,
						["Physical"] = 1378,
						["Melee"] = 1841,
						["Arcane"] = 2225,
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 19,
								},
							},
							["amount"] = 22,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 12,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 15,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 13,
						},
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 298,
								},
							},
							["amount"] = 298,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 880,
								},
								["冰锥术"] = {
									["count"] = 532,
								},
							},
							["amount"] = 1412,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["地震术"] = {
									["count"] = 802,
								},
							},
							["amount"] = 802,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 79,
								},
								["拦截昏迷"] = {
									["count"] = 37,
								},
								["肉搏"] = {
									["count"] = 552,
								},
							},
							["amount"] = 668,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 430,
								},
								["旋风斩"] = {
									["count"] = 407,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 533,
								},
								["断筋"] = {
									["count"] = 152,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1449,
								},
								["肉搏"] = {
									["count"] = 2963,
								},
							},
							["amount"] = 5934,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冲击波"] = {
									["count"] = 565,
								},
								["冰霜新星"] = {
									["count"] = 25,
								},
							},
							["amount"] = 590,
						},
					},
					["EnergyGainedFrom"] = {
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["TimeHealing"] = {
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 7.5,
								},
								["愈合"] = {
									["count"] = 2.93,
								},
							},
							["amount"] = 10.43,
						},
					},
					["OverHeals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 204,
									["min"] = 203,
									["count"] = 2,
									["amount"] = 407,
								},
							},
							["count"] = 2,
							["amount"] = 407,
						},
						["愈合"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 157,
									["min"] = 157,
									["count"] = 1,
									["amount"] = 157,
								},
							},
							["count"] = 1,
							["amount"] = 157,
						},
					},
					["PartialResist"] = {
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["弩射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
					},
					["PartialAbsorb"] = {
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["弩射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 70.72,
					["ElementDoneAbsorb"] = {
						["Arcane"] = 84,
					},
					["Dispelled"] = 4,
					["WhoDispelled"] = {
						["老戏骨-逐风者"] = {
							["Details"] = {
								["坚韧祷言 (净化术)"] = {
									["count"] = 1,
								},
								["荆棘术 (净化术)"] = {
									["count"] = 1,
								},
								["野性印记 (净化术)"] = {
									["count"] = 1,
								},
								["奥术光辉 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["Overhealing"] = 564,
					["Heals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 204,
									["min"] = 203,
									["count"] = 5,
									["amount"] = 1016,
								},
							},
							["count"] = 5,
							["amount"] = 1016,
						},
						["愈合"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 157,
									["min"] = 157,
									["count"] = 3,
									["amount"] = 471,
								},
							},
							["count"] = 3,
							["amount"] = 471,
						},
					},
					["HealedWho"] = {
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 1016,
								},
								["愈合"] = {
									["count"] = 471,
								},
							},
							["amount"] = 1487,
						},
					},
					["EnergyGained"] = {
						["激怒"] = {
							["Details"] = {
								["开心亿点点-火妖鲁西弗隆"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["EnergyGain"] = 120,
					["Healing"] = 1487,
					["TimeSpent"] = {
						["一路酱-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 2.33,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.83,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3.53,
								},
							},
							["amount"] = 3.53,
						},
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 7.5,
								},
								["愈合"] = {
									["count"] = 2.93,
								},
							},
							["amount"] = 10.43,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["扫击"] = {
									["count"] = 0.95,
								},
								["血袭 (伤害/跳)"] = {
									["count"] = 2.62,
								},
								["扫击 (伤害/跳)"] = {
									["count"] = 1,
								},
								["撕扯 (伤害/跳)"] = {
									["count"] = 1.97,
								},
								["荆棘术"] = {
									["count"] = 4.15,
								},
								["毁灭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.36,
								},
							},
							["amount"] = 16.55,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.4,
								},
								["荆棘术"] = {
									["count"] = 13.28,
								},
							},
							["amount"] = 18.18,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["重击"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
								["纠缠根须"] = {
									["count"] = 0.09,
								},
								["荆棘术"] = {
									["count"] = 1.33,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9.200000000000001,
						},
					},
					["DamageTaken"] = 9704,
					["Attacks"] = {
						["扫击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
							},
							["count"] = 1,
							["amount"] = 76,
						},
						["槌击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 335,
									["min"] = 335,
									["count"] = 1,
									["amount"] = 335,
								},
							},
							["count"] = 1,
							["amount"] = 335,
						},
						["重击"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 32,
									["min"] = 32,
									["count"] = 1,
									["amount"] = 32,
								},
							},
							["count"] = 1,
							["amount"] = 32,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 105,
									["min"] = 89,
									["count"] = 4,
									["amount"] = 374,
								},
							},
							["count"] = 4,
							["amount"] = 374,
						},
						["血袭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 27,
									["count"] = 3,
									["amount"] = 82,
								},
							},
							["count"] = 3,
							["amount"] = 82,
						},
						["撕扯 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 104,
									["min"] = 103,
									["count"] = 3,
									["amount"] = 311,
								},
							},
							["count"] = 3,
							["amount"] = 311,
						},
						["扫击 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 43,
									["min"] = 42,
									["count"] = 2,
									["amount"] = 85,
								},
							},
							["count"] = 2,
							["amount"] = 85,
						},
						["纠缠根须"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毁灭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 489,
									["min"] = 489,
									["count"] = 1,
									["amount"] = 489,
								},
							},
							["count"] = 1,
							["amount"] = 489,
						},
						["荆棘术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 20,
									["min"] = 18,
									["count"] = 19,
									["amount"] = 364,
								},
							},
							["count"] = 20,
							["amount"] = 364,
						},
						["月火术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 335,
									["min"] = 335,
									["count"] = 1,
									["amount"] = 335,
								},
								["Hit"] = {
									["max"] = 231,
									["min"] = 127,
									["count"] = 8,
									["amount"] = 1516,
								},
							},
							["count"] = 9,
							["amount"] = 1851,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 84,
									["min"] = 84,
									["count"] = 1,
									["amount"] = 84,
								},
								["Crit"] = {
									["max"] = 161,
									["min"] = 154,
									["count"] = 2,
									["amount"] = 315,
								},
								["Hit"] = {
									["max"] = 211,
									["min"] = 77,
									["count"] = 11,
									["amount"] = 1442,
								},
							},
							["count"] = 15,
							["amount"] = 1841,
						},
					},
					["RageGain"] = 30,
					["HOTs"] = {
						["回春术"] = {
							["Details"] = {
								["开心亿点点-火妖鲁西弗隆"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
						["愈合"] = {
							["Details"] = {
								["开心亿点点-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["TimeDamage"] = 60.29000000000001,
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 2.33,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.83,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3.53,
								},
							},
							["amount"] = 3.53,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["重击"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
								["纠缠根须"] = {
									["count"] = 0.09,
								},
								["荆棘术"] = {
									["count"] = 1.33,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9.200000000000001,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["扫击"] = {
									["count"] = 0.95,
								},
								["血袭 (伤害/跳)"] = {
									["count"] = 2.62,
								},
								["扫击 (伤害/跳)"] = {
									["count"] = 1,
								},
								["撕扯 (伤害/跳)"] = {
									["count"] = 1.97,
								},
								["荆棘术"] = {
									["count"] = 4.15,
								},
								["毁灭"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.36,
								},
							},
							["amount"] = 16.55,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.4,
								},
								["荆棘术"] = {
									["count"] = 13.28,
								},
							},
							["amount"] = 18.18,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["DOT_Time"] = 39,
					["HealingTaken"] = 2747,
					["DamagedWho"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 819,
								},
							},
							["amount"] = 819,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 524,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 105,
								},
							},
							["amount"] = 629,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 251,
								},
							},
							["amount"] = 251,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 143,
								},
								["荆棘术"] = {
									["count"] = 18,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 32,
								},
								["月火术"] = {
									["count"] = 199,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 269,
								},
							},
							["amount"] = 661,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["扫击"] = {
									["count"] = 76,
								},
								["血袭 (伤害/跳)"] = {
									["count"] = 82,
								},
								["扫击 (伤害/跳)"] = {
									["count"] = 85,
								},
								["撕扯 (伤害/跳)"] = {
									["count"] = 311,
								},
								["荆棘术"] = {
									["count"] = 93,
								},
								["毁灭"] = {
									["count"] = 489,
								},
								["肉搏"] = {
									["count"] = 797,
								},
							},
							["amount"] = 1933,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 335,
								},
								["肉搏"] = {
									["count"] = 566,
								},
								["荆棘术"] = {
									["count"] = 253,
								},
							},
							["amount"] = 1154,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 309,
								},
								["肉搏"] = {
									["count"] = 84,
								},
							},
							["amount"] = 393,
						},
					},
				},
			},
			["UnitLockout"] = 12999.199,
			["LastActive"] = 13932.2,
		},
		["罗拉娜的凝视-逐风者"] = {
			["GUID"] = "Player-5451-0315BA6C",
			["TimeLast"] = {
				["DOT_Time"] = 14085.211,
				["TimeDamage"] = 14086.211,
				["Healing"] = 13020.2,
				["ActiveTime"] = 14086.211,
				["OVERALL"] = 14086.211,
				["ManaGain"] = 13355.208,
				["DamageTaken"] = 13608.21,
				["Damage"] = 14086.211,
			},
			["LastAttackedBy"] = "蓝色空间号-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DOT_Time"] = {
					111, -- [1]
				},
				["TimeDamage"] = {
					94.13, -- [1]
				},
				["ActiveTime"] = {
					94.13, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["ManaGain"] = {
					1230, -- [1]
				},
				["DamageTaken"] = {
					6915, -- [1]
				},
				["Damage"] = {
					21251, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastEventHealth"] = {
				3658, -- [1]
				3658, -- [2]
				4375, -- [3]
				4375, -- [4]
				4375, -- [5]
				4375, -- [6]
				4375, -- [7]
				4375, -- [8]
				4375, -- [9]
				4375, -- [10]
				4375, -- [11]
				4375, -- [12]
				4375, -- [13]
				4375, -- [14]
				4375, -- [15]
				4375, -- [16]
				4375, -- [17]
				4375, -- [18]
				4375, -- [19]
				4375, -- [20]
				0, -- [21]
				4092, -- [22]
				3969, -- [23]
				3969, -- [24]
				3863, -- [25]
				3863, -- [26]
				2860, -- [27]
				2863, -- [28]
				2756, -- [29]
				1921, -- [30]
				1804, -- [31]
				668, -- [32]
				432, -- [33]
				2209, -- [34]
				2222, -- [35]
				2225, -- [36]
				2225, -- [37]
				2229, -- [38]
				2229, -- [39]
				2229, -- [40]
				2179, -- [41]
				2179, -- [42]
				2143, -- [43]
				1777, -- [44]
				1780, -- [45]
				1385, -- [46]
				3823, -- [47]
				3826, -- [48]
				3826, -- [49]
				3655, -- [50]
			},
			["LastEventHealthMax"] = {
				4375, -- [1]
				4375, -- [2]
				4375, -- [3]
				4375, -- [4]
				4375, -- [5]
				4375, -- [6]
				4375, -- [7]
				4375, -- [8]
				4375, -- [9]
				4375, -- [10]
				4375, -- [11]
				4375, -- [12]
				4375, -- [13]
				4375, -- [14]
				4375, -- [15]
				4375, -- [16]
				4375, -- [17]
				4375, -- [18]
				4375, -- [19]
				4375, -- [20]
				5145, -- [21]
				5145, -- [22]
				5145, -- [23]
				5145, -- [24]
				5145, -- [25]
				5145, -- [26]
				5145, -- [27]
				5145, -- [28]
				5145, -- [29]
				5145, -- [30]
				5145, -- [31]
				5145, -- [32]
				5145, -- [33]
				4375, -- [34]
				4375, -- [35]
				4375, -- [36]
				4375, -- [37]
				4375, -- [38]
				4375, -- [39]
				4375, -- [40]
				4375, -- [41]
				4375, -- [42]
				4375, -- [43]
				4375, -- [44]
				4375, -- [45]
				4375, -- [46]
				4375, -- [47]
				4375, -- [48]
				4375, -- [49]
				4375, -- [50]
			},
			["LastDamageTaken"] = 174,
			["Owner"] = false,
			["Pet"] = {
				"孤塔的监视者 <罗拉娜的凝视-逐风者>", -- [1]
			},
			["NextEventNum"] = 21,
			["LastDamageTime"] = 14086.694,
			["LastEvents"] = {
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 蓝色空间号-逐风者 Absorb -101 (101 被吸收) (Nature)", -- [1]
				"蓝色空间号-逐风者 暗言术：痛 (伤害/跳) 罗拉娜的凝视-逐风者 Tick -174 (Shadow)", -- [2]
				"蓝色空间号-逐风者 暗言术：痛 (伤害/跳) 罗拉娜的凝视-逐风者 Tick -174 (Shadow)", -- [3]
				"罗拉娜的凝视-逐风者 多重射击 妖儿-逐风者 Hit -362 (Physical)", -- [4]
				"罗拉娜的凝视-逐风者 自动射击 妖儿-逐风者 Hit -290 (Physical)", -- [5]
				"罗拉娜的凝视-逐风者 奥术射击 妖儿-逐风者 Hit -189 (Arcane)", -- [6]
				"罗拉娜的凝视-逐风者 多重射击 源堂法雷尔-逐风者 Hit -345 (Physical)", -- [7]
				"罗拉娜的凝视-逐风者 自动射击 源堂法雷尔-逐风者 Hit -253 (Physical)", -- [8]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -98 (Nature)", -- [9]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -98 (Nature)", -- [10]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -98 (Nature)", -- [11]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 老白鲨-逐风者 Tick -111 (Nature)", -- [12]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -111 (Nature)", -- [13]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -74 (24 被抵抗) (Nature)", -- [14]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 老白鲨-逐风者 Tick -111 (Nature)", -- [15]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -111 (Nature)", -- [16]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -98 (Nature)", -- [17]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -111 (Nature)", -- [18]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -111 (Nature)", -- [19]
				"罗拉娜的凝视-逐风者 奥术射击 雲木彡-逐风者 Hit -208 (Arcane)", -- [20]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 灬山河灬-逐风者 Tick -101 (Nature)", -- [21]
				"灬山河灬-逐风者 肉搏 罗拉娜的凝视-逐风者 Hit -123 (Physical)", -- [22]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -111 (Nature)", -- [23]
				"灬山河灬-逐风者 肉搏 罗拉娜的凝视-逐风者 Crit -106 (Physical)", -- [24]
				"灬山河灬-逐风者 背刺 罗拉娜的凝视-逐风者 Crit -764 (Physical)", -- [25]
				"柠檬-逐风者 暗言术：痛 (伤害/跳) 罗拉娜的凝视-逐风者 Tick -239 (Shadow)", -- [26]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 灬山河灬-逐风者 Tick -101 (Nature)", -- [27]
				"灬山河灬-逐风者 肉搏 罗拉娜的凝视-逐风者 Hit -107 (Physical)", -- [28]
				"灬山河灬-逐风者 背刺 罗拉娜的凝视-逐风者 Crit -835 (Physical)", -- [29]
				"灬山河灬-逐风者 肉搏 罗拉娜的凝视-逐风者 Crit -117 (Physical)", -- [30]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -101 (Nature)", -- [31]
				"柠檬-逐风者 暗言术：痛 (伤害/跳) 罗拉娜的凝视-逐风者 Tick -239 (Shadow)", -- [32]
				"柠檬-逐风者 暗言术：痛 (伤害/跳) 罗拉娜的凝视-逐风者 Tick -239 (Shadow)", -- [33]
				"罗拉娜的凝视-逐风者 多重射击 灬山河灬-逐风者 Crit -835 (Physical)", -- [34]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -101 (Nature)", -- [35]
				"罗拉娜的凝视-逐风者 自动射击 雲木彡-逐风者 Hit -154 (Physical)", -- [36]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 神经蛙-逐风者 Tick -101 (Nature)", -- [37]
				"罗拉娜的凝视-逐风者 多重射击 神经蛙-逐风者 Hit -264 (Physical)", -- [38]
				"罗拉娜的凝视-逐风者 多重射击 雲木彡-逐风者 Crit -660 (Physical)", -- [39]
				"雲木彡-逐风者 拦截昏迷 罗拉娜的凝视-逐风者 Hit -50 (Physical)", -- [40]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -111 (Nature)", -- [41]
				"雲木彡-逐风者 断筋 罗拉娜的凝视-逐风者 Hit -36 (Physical)", -- [42]
				"雲木彡-逐风者 肉搏 罗拉娜的凝视-逐风者 Hit -366 (Physical)", -- [43]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 神经蛙-逐风者 Tick -101 (Nature)", -- [44]
				"雲木彡-逐风者 旋风斩 罗拉娜的凝视-逐风者 Hit -395 (Physical)", -- [45]
				"罗拉娜的凝视-逐风者 毒蛇钉刺 (伤害/跳) 雲木彡-逐风者 Tick -111 (Nature)", -- [46]
				"罗拉娜的凝视-逐风者 自动射击 蓝色空间号-逐风者 Hit -254 (Physical)", -- [47]
				"罗拉娜的凝视-逐风者 震荡射击 蓝色空间号-逐风者 Miss (Arcane)", -- [48]
				"蓝色空间号-逐风者 暗言术：痛 (伤害/跳) 罗拉娜的凝视-逐风者 Tick -174 (Shadow)", -- [49]
				"罗拉娜的凝视-逐风者 自动射击 蓝色空间号-逐风者 Absorb -248 (248 被吸收) (Physical)", -- [50]
			},
			["Name"] = "罗拉娜的凝视-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13475.534, -- [1]
				13475.85, -- [2]
				13608.36, -- [3]
				14041.324, -- [4]
				14041.708, -- [5]
				14045.141, -- [6]
				14069.576, -- [7]
				14069.81, -- [8]
				14069.96, -- [9]
				14072.96, -- [10]
				14075.96, -- [11]
				14076.027, -- [12]
				14077.16, -- [13]
				14078.944, -- [14]
				14079.027, -- [15]
				14080.16, -- [16]
				14081.96, -- [17]
				14083.16, -- [18]
				14086.177, -- [19]
				14086.694, -- [20]
				13350.891, -- [21]
				13352.258, -- [22]
				13352.758, -- [23]
				13353.108, -- [24]
				13353.208, -- [25]
				13353.258, -- [26]
				13353.892, -- [27]
				13354.058, -- [28]
				13354.208, -- [29]
				13354.825, -- [30]
				13355.742, -- [31]
				13356.258, -- [32]
				13359.259, -- [33]
				13373.093, -- [34]
				13381.877, -- [35]
				13382.41, -- [36]
				13383.16, -- [37]
				13384.444, -- [38]
				13384.444, -- [39]
				13384.777, -- [40]
				13384.861, -- [41]
				13385.344, -- [42]
				13385.644, -- [43]
				13386.161, -- [44]
				13387.161, -- [45]
				13387.861, -- [46]
				13470.15, -- [47]
				13471.35, -- [48]
				13472.85, -- [49]
				13473.783, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["源堂法雷尔-逐风者"] = {
									["count"] = 15,
								},
								["雲木彡-逐风者"] = {
									["count"] = 12,
								},
								["老白鲨-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 33,
						},
					},
					["ElementDoneResist"] = {
						["Nature"] = 24,
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 33,
					["Damage"] = 2779,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 1250,
						["Nature"] = 1132,
						["Arcane"] = 397,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 466,
								},
								["自动射击"] = {
									["count"] = 253,
								},
								["多重射击"] = {
									["count"] = 345,
								},
							},
							["amount"] = 1064,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 444,
								},
								["奥术射击"] = {
									["count"] = 208,
								},
							},
							["amount"] = 652,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 222,
								},
							},
							["amount"] = 222,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 290,
								},
								["多重射击"] = {
									["count"] = 362,
								},
								["奥术射击"] = {
									["count"] = 189,
								},
							},
							["amount"] = 841,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6.15,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.88,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.96,
								},
								["奥术射击"] = {
									["count"] = 0.52,
								},
							},
							["amount"] = 5.48,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.15,
								},
							},
							["amount"] = 0.15,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 16.89,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 111,
									["min"] = 74,
									["count"] = 11,
									["amount"] = 1132,
								},
							},
							["count"] = 11,
							["amount"] = 1132,
						},
						["自动射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 290,
									["min"] = 253,
									["count"] = 2,
									["amount"] = 543,
								},
							},
							["count"] = 2,
							["amount"] = 543,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 362,
									["min"] = 345,
									["count"] = 2,
									["amount"] = 707,
								},
							},
							["count"] = 2,
							["amount"] = 707,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 208,
									["min"] = 189,
									["count"] = 2,
									["amount"] = 397,
								},
							},
							["count"] = 2,
							["amount"] = 397,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 16.89,
					["TimeDamaging"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6.15,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.88,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.96,
								},
								["奥术射击"] = {
									["count"] = 0.52,
								},
							},
							["amount"] = 5.48,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.15,
								},
							},
							["amount"] = 0.15,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["蓝色空间号-逐风者"] = {
									["count"] = 3,
								},
								["灬山河灬-逐风者"] = {
									["count"] = 18,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 6,
								},
								["老白鲨-逐风者"] = {
									["count"] = 6,
								},
								["雲木彡-逐风者"] = {
									["count"] = 36,
								},
								["神经蛙-逐风者"] = {
									["count"] = 6,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 21,
								},
								["源堂法雷尔-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 111,
						},
					},
					["ElementDoneResist"] = {
						["Nature"] = 24,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 12,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 6915,
					["ElementDoneAbsorb"] = {
						["Nature"] = 185,
						["Physical"] = 379,
					},
					["PartialResist"] = {
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 1230,
								},
							},
							["amount"] = 1230,
						},
					},
					["PartialAbsorb"] = {
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 94.13,
					["ElementTaken"] = {
						["Shadow"] = 1704,
						["Physical"] = 2722,
						["Melee"] = 2204,
						["Arcane"] = 285,
					},
					["DOT_Time"] = 111,
					["Damage"] = 21251,
					["Healing"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 36,
								},
							},
							["amount"] = 37,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 10,
								},
								["Hit"] = {
									["count"] = 31,
								},
							},
							["amount"] = 44,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
					},
					["DamagedWho"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 605,
								},
								["自动射击"] = {
									["count"] = 1203,
								},
								["多重射击"] = {
									["count"] = 2033,
								},
								["驱散射击"] = {
									["count"] = 328,
								},
							},
							["amount"] = 4169,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 374,
								},
								["自动射击"] = {
									["count"] = 977,
								},
							},
							["amount"] = 1351,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 266,
								},
								["瞄准射击"] = {
									["count"] = 674,
								},
								["驱散射击"] = {
									["count"] = 131,
								},
							},
							["amount"] = 1071,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 287,
								},
								["自动射击"] = {
									["count"] = 200,
								},
							},
							["amount"] = 487,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 202,
								},
								["奥术射击"] = {
									["count"] = 207,
								},
								["多重射击"] = {
									["count"] = 590,
								},
								["自动射击"] = {
									["count"] = 231,
								},
							},
							["amount"] = 1230,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 767,
								},
								["奥术射击"] = {
									["count"] = 395,
								},
								["驱散射击"] = {
									["count"] = 111,
								},
								["自动射击"] = {
									["count"] = 1525,
								},
								["瞄准射击"] = {
									["count"] = 568,
								},
								["多重射击"] = {
									["count"] = 1254,
								},
							},
							["amount"] = 4620,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["自动射击"] = {
									["count"] = 502,
								},
							},
							["amount"] = 603,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 202,
								},
								["自动射击"] = {
									["count"] = 904,
								},
								["多重射击"] = {
									["count"] = 341,
								},
								["瞄准射击"] = {
									["count"] = 669,
								},
							},
							["amount"] = 2116,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 222,
								},
								["自动射击"] = {
									["count"] = 223,
								},
							},
							["amount"] = 445,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1218,
								},
								["奥术射击"] = {
									["count"] = 208,
								},
								["多重射击"] = {
									["count"] = 660,
								},
								["自动射击"] = {
									["count"] = 336,
								},
								["瞄准射击"] = {
									["count"] = 486,
								},
								["肉搏"] = {
									["count"] = 84,
								},
							},
							["amount"] = 2992,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 466,
								},
								["自动射击"] = {
									["count"] = 253,
								},
								["多重射击"] = {
									["count"] = 345,
								},
							},
							["amount"] = 1064,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 290,
								},
								["多重射击"] = {
									["count"] = 362,
								},
								["奥术射击"] = {
									["count"] = 189,
								},
							},
							["amount"] = 841,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 262,
								},
							},
							["amount"] = 262,
						},
					},
					["Attacks"] = {
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 248,
									["min"] = 248,
									["count"] = 1,
									["amount"] = 248,
								},
								["Crit"] = {
									["max"] = 693,
									["min"] = 552,
									["count"] = 5,
									["amount"] = 3102,
								},
								["Hit"] = {
									["max"] = 290,
									["min"] = 154,
									["count"] = 15,
									["amount"] = 3560,
								},
							},
							["count"] = 21,
							["amount"] = 6910,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 674,
									["min"] = 486,
									["count"] = 4,
									["amount"] = 2397,
								},
							},
							["count"] = 4,
							["amount"] = 2397,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 1,
									["amount"] = 101,
								},
								["Tick"] = {
									["max"] = 111,
									["min"] = 17,
									["count"] = 36,
									["amount"] = 3682,
								},
							},
							["count"] = 37,
							["amount"] = 3783,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 208,
									["min"] = 188,
									["count"] = 5,
									["amount"] = 999,
								},
							},
							["count"] = 5,
							["amount"] = 999,
						},
						["震荡射击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["诱捕"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 840,
									["min"] = 660,
									["count"] = 4,
									["amount"] = 3048,
								},
								["Hit"] = {
									["max"] = 374,
									["min"] = 260,
									["count"] = 11,
									["amount"] = 3460,
								},
							},
							["count"] = 15,
							["amount"] = 6508,
						},
						["驱散射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 131,
									["min"] = 131,
									["count"] = 1,
									["amount"] = 131,
								},
								["Crit"] = {
									["max"] = 328,
									["min"] = 328,
									["count"] = 1,
									["amount"] = 328,
								},
								["Hit"] = {
									["max"] = 111,
									["min"] = 111,
									["count"] = 1,
									["amount"] = 111,
								},
							},
							["count"] = 3,
							["amount"] = 570,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 84,
									["min"] = 84,
									["count"] = 1,
									["amount"] = 84,
								},
							},
							["count"] = 1,
							["amount"] = 84,
						},
					},
					["ElementDone"] = {
						["Arcane"] = 999,
						["Physical"] = 16385,
						["Melee"] = 84,
						["Nature"] = 3783,
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 1230,
								},
							},
							["amount"] = 1230,
						},
					},
					["TimeDamage"] = 94.13,
					["WhoDamaged"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 522,
								},
							},
							["amount"] = 522,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 956,
								},
								["暗影守卫"] = {
									["count"] = 226,
								},
							},
							["amount"] = 1182,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 285,
								},
							},
							["amount"] = 285,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 395,
								},
								["拦截昏迷"] = {
									["count"] = 50,
								},
								["断筋"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 366,
								},
							},
							["amount"] = 847,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 40,
								},
								["拦截昏迷"] = {
									["count"] = 55,
								},
								["肉搏"] = {
									["count"] = 876,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 374,
								},
							},
							["amount"] = 1345,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 173,
								},
								["背刺"] = {
									["count"] = 1599,
								},
								["肉搏"] = {
									["count"] = 962,
								},
							},
							["amount"] = 2734,
						},
					},
					["ManaGain"] = 1230,
					["TimeDamaging"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.6,
								},
								["自动射击"] = {
									["count"] = 1.87,
								},
								["多重射击"] = {
									["count"] = 2.19,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.16,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.7,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["震荡射击"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 3.3,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.3,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.3,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 1.7,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.05,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["诱捕"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.98,
								},
								["多重射击"] = {
									["count"] = 2.65,
								},
							},
							["amount"] = 8.68,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 10.05,
								},
								["奥术射击"] = {
									["count"] = 3,
								},
								["驱散射击"] = {
									["count"] = 0.48,
								},
								["自动射击"] = {
									["count"] = 2.88,
								},
								["瞄准射击"] = {
									["count"] = 0.53,
								},
								["多重射击"] = {
									["count"] = 3.69,
								},
							},
							["amount"] = 20.63,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3,
								},
								["震荡射击"] = {
									["count"] = 1.2,
								},
							},
							["amount"] = 5.7,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.67,
								},
								["自动射击"] = {
									["count"] = 1.63,
								},
								["多重射击"] = {
									["count"] = 1.45,
								},
								["瞄准射击"] = {
									["count"] = 0.83,
								},
							},
							["amount"] = 6.58,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.15,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.65,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 13.98,
								},
								["奥术射击"] = {
									["count"] = 0.52,
								},
								["自动射击"] = {
									["count"] = 0.8500000000000001,
								},
								["瞄准射击"] = {
									["count"] = 0.62,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 17.47,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6.15,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.88,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.7,
								},
							},
							["amount"] = 0.7,
						},
					},
					["TimeSpent"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.6,
								},
								["自动射击"] = {
									["count"] = 1.87,
								},
								["多重射击"] = {
									["count"] = 2.19,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 13.16,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.7,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["震荡射击"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 3.3,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.3,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.3,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.2,
								},
							},
							["amount"] = 1.7,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.05,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["诱捕"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.98,
								},
								["多重射击"] = {
									["count"] = 2.65,
								},
							},
							["amount"] = 8.68,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 10.05,
								},
								["奥术射击"] = {
									["count"] = 3,
								},
								["驱散射击"] = {
									["count"] = 0.48,
								},
								["自动射击"] = {
									["count"] = 2.88,
								},
								["瞄准射击"] = {
									["count"] = 0.53,
								},
								["多重射击"] = {
									["count"] = 3.69,
								},
							},
							["amount"] = 20.63,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3,
								},
								["震荡射击"] = {
									["count"] = 1.2,
								},
							},
							["amount"] = 5.7,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 2.67,
								},
								["自动射击"] = {
									["count"] = 1.63,
								},
								["多重射击"] = {
									["count"] = 1.45,
								},
								["瞄准射击"] = {
									["count"] = 0.83,
								},
							},
							["amount"] = 6.58,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.15,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.65,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 13.98,
								},
								["奥术射击"] = {
									["count"] = 0.52,
								},
								["自动射击"] = {
									["count"] = 0.8500000000000001,
								},
								["瞄准射击"] = {
									["count"] = 0.62,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 17.47,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6.15,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.88,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.38,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.38,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.7,
								},
							},
							["amount"] = 0.7,
						},
					},
				},
			},
			["UnitLockout"] = 14041.208,
			["LastActive"] = 14086.211,
		},
		["蒜头妹妹"] = {
			["GUID"] = "Player-5458-02EB4E50",
			["LastEventHealth"] = {
				2029, -- [1]
				2029, -- [2]
				1736, -- [3]
				4121, -- [4]
				4094, -- [5]
				4094, -- [6]
				3057, -- [7]
				3057, -- [8]
				3057, -- [9]
				3057, -- [10]
				3057, -- [11]
				2301, -- [12]
				2301, -- [13]
				2301, -- [14]
				2301, -- [15]
				2301, -- [16]
				2301, -- [17]
				2301, -- [18]
				2301, -- [19]
				2150, -- [20]
				2150, -- [21]
				2150, -- [22]
				1999, -- [23]
				1999, -- [24]
				1999, -- [25]
				1999, -- [26]
				1999, -- [27]
				1999, -- [28]
				1999, -- [29]
				1999, -- [30]
				1999, -- [31]
				4121, -- [32]
				4121, -- [33]
				4121, -- [34]
				4121, -- [35]
				3832, -- [36]
				2771, -- [37]
				2771, -- [38]
				2771, -- [39]
				2771, -- [40]
				2771, -- [41]
				2771, -- [42]
				2480, -- [43]
				2480, -- [44]
				2480, -- [45]
				2187, -- [46]
				2187, -- [47]
				2187, -- [48]
				2029, -- [49]
				2029, -- [50]
			},
			["LastAttackedBy"] = "雲木彡-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"HEAL", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					30.52, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["Dispels"] = {
					2, -- [1]
				},
				["Healing"] = {
					9403, -- [1]
				},
				["DamageTaken"] = {
					19204, -- [1]
				},
				["HealingTaken"] = {
					4882, -- [1]
				},
				["HOT_Time"] = {
					9, -- [1]
				},
				["TimeDamage"] = {
					114.95, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					145.47, -- [1]
				},
				["DOT_Time"] = {
					288, -- [1]
				},
				["Damage"] = {
					25721, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						false, -- [23]
						false, -- [24]
						true, -- [25]
						false, -- [26]
						false, -- [27]
						true, -- [28]
						true, -- [29]
						false, -- [30]
						false, -- [31]
						false, -- [32]
						false, -- [33]
					},
					["Messages"] = {
						"神经蛙-逐风者 肉搏 蒜头妹妹 Hit -408 (Physical)", -- [1]
						"雲木彡-逐风者 肉搏 蒜头妹妹 Crit -538 (Physical)", -- [2]
						"神经蛙-逐风者 致死打击 蒜头妹妹 Hit -460 (Physical)", -- [3]
						"时间的小溪-逐风者 肉搏 蒜头妹妹 Hit -44 (Physical)", -- [4]
						"时间的小溪-逐风者 肉搏 蒜头妹妹 Hit -97 (Physical)", -- [5]
						"蒜头妹妹 肉搏 神经蛙-逐风者 Parry (1)", -- [6]
						"神经蛙-逐风者 肉搏 蒜头妹妹 Hit -387 (Physical)", -- [7]
						"雲木彡-逐风者 重伤 (伤害/跳) 蒜头妹妹 Tick -74 (Physical)", -- [8]
						"雲木彡-逐风者 撕裂 (伤害/跳) 蒜头妹妹 Tick -29 (Physical)", -- [9]
						"时间的小溪-逐风者 肉搏 蒜头妹妹 Hit -40 (Physical)", -- [10]
						"时间的小溪-逐风者 肉搏 蒜头妹妹 Hit -113 (Physical)", -- [11]
						"时间的小溪-逐风者 脑部损伤 蒜头妹妹 Crit -233 (Physical)", -- [12]
						"蒜头妹妹 奉献 (伤害/跳) 神经蛙-逐风者 Tick -15 (Holy)", -- [13]
						"蒜头妹妹 奉献 (伤害/跳) 时间的小溪-逐风者 Tick -15 (Holy)", -- [14]
						"雲木彡-逐风者 拦截昏迷 蒜头妹妹 Hit -37 (Physical)", -- [15]
						"蒜头妹妹 奉献 (伤害/跳) 时间的小溪-逐风者 Tick -13 (Holy)", -- [16]
						"雲木彡-逐风者 断筋 蒜头妹妹 Crit -60 (Physical)", -- [17]
						"时间的小溪-逐风者 肉搏 蒜头妹妹 Miss (1)", -- [18]
						"雲木彡-逐风者 肉搏 蒜头妹妹 Hit -297 (Physical)", -- [19]
						"时间的小溪-逐风者 肉搏 蒜头妹妹 Crit -176 (Physical)", -- [20]
						"时间的小溪-逐风者 背刺 蒜头妹妹 Hit -290 (Physical)", -- [21]
						"蒜头妹妹 奉献 (伤害/跳) 神经蛙-逐风者 Tick -13 (Holy)", -- [22]
						"蒜头妹妹 奉献 (伤害/跳) 时间的小溪-逐风者 Tick -14 (Holy)", -- [23]
						"蒜头妹妹 奉献 (伤害/跳) 雲木彡-逐风者 Tick -14 (Holy)", -- [24]
						"雲木彡-逐风者 撕裂 (伤害/跳) 蒜头妹妹 Tick -28 (Physical)", -- [25]
						"蒜头妹妹 肉搏 神经蛙-逐风者 Hit -302 (Physical)", -- [26]
						"蒜头妹妹 命令圣印 神经蛙-逐风者 Hit -445 (Holy)", -- [27]
						"神经蛙-逐风者 肉搏 蒜头妹妹 Crit -834 (Physical)", -- [28]
						"蒜头妹妹死亡。", -- [29]
						"蒜头妹妹 奉献 (伤害/跳) 神经蛙-逐风者 Tick -12 (Holy)", -- [30]
						"蒜头妹妹 奉献 (伤害/跳) 时间的小溪-逐风者 Tick -12 (Holy)", -- [31]
						"蒜头妹妹 奉献 (伤害/跳) 雲木彡-逐风者 Tick -14 (Holy)", -- [32]
						"蒜头妹妹 奉献 (伤害/跳) 时间的小溪-逐风者 Tick -12 (Holy)", -- [33]
					},
					["DeathAt"] = 13489.201,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
					},
					["MessageTimes"] = {
						-7.516999999999825, -- [1]
						-6.333000000000538, -- [2]
						-5.033000000001266, -- [3]
						-4.667000000001281, -- [4]
						-4.567000000000917, -- [5]
						-3.966000000000349, -- [6]
						-3.717000000000553, -- [7]
						-3.316000000000713, -- [8]
						-3.25, -- [9]
						-2.850000000000364, -- [10]
						-2.75, -- [11]
						-2.75, -- [12]
						-2.615999999999985, -- [13]
						-2.615999999999985, -- [14]
						-2.050000000001091, -- [15]
						-1.632999999999811, -- [16]
						-1.300000000001091, -- [17]
						-1.050000000001091, -- [18]
						-1.015999999999622, -- [19]
						-0.9500000000007276, -- [20]
						-0.9160000000010768, -- [21]
						-0.6329999999998108, -- [22]
						-0.6329999999998108, -- [23]
						-0.566000000000713, -- [24]
						-0.2489999999997963, -- [25]
						-0.1660000000010768, -- [26]
						-0.1499999999996362, -- [27]
						-0.01599999999962165, -- [28]
						0, -- [29]
						0.3670000000001892, -- [30]
						0.3670000000001892, -- [31]
						0.433999999999287, -- [32]
						1.384000000000015, -- [33]
					},
					["HealthMax"] = {
						4121, -- [1]
						4121, -- [2]
						4121, -- [3]
						4121, -- [4]
						4121, -- [5]
						4121, -- [6]
						4121, -- [7]
						4121, -- [8]
						4121, -- [9]
						4121, -- [10]
						4121, -- [11]
						4121, -- [12]
						4121, -- [13]
						4121, -- [14]
						4121, -- [15]
						4121, -- [16]
						4121, -- [17]
						4121, -- [18]
						4121, -- [19]
						4121, -- [20]
						4121, -- [21]
						4121, -- [22]
						4121, -- [23]
						4121, -- [24]
						4121, -- [25]
						4121, -- [26]
						4121, -- [27]
						4121, -- [28]
						4121, -- [29]
						4121, -- [30]
						4121, -- [31]
						4121, -- [32]
						4121, -- [33]
					},
					["Health"] = {
						3840, -- [1]
						3432, -- [2]
						2894, -- [3]
						2434, -- [4]
						2434, -- [5]
						2293, -- [6]
						2293, -- [7]
						1906, -- [8]
						1906, -- [9]
						1803, -- [10]
						1763, -- [11]
						1763, -- [12]
						1763, -- [13]
						1763, -- [14]
						1417, -- [15]
						1380, -- [16]
						1380, -- [17]
						1320, -- [18]
						1320, -- [19]
						1320, -- [20]
						1320, -- [21]
						557, -- [22]
						557, -- [23]
						557, -- [24]
						557, -- [25]
						557, -- [26]
						557, -- [27]
						557, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
					},
					["KilledBy"] = "神经蛙-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"MISC", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "旋风斩",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastDamageTaken"] = 289,
			["LastHealTime"] = 13742.82,
			["TimeLast"] = {
				["TimeHeal"] = 13742.203,
				["Dispelled"] = 13100.206,
				["Dispels"] = 13654.197,
				["OVERALL"] = 14083.21,
				["DamageTaken"] = 14081.21,
				["DeathCount"] = 13487.201,
				["HealingTaken"] = 13393.211,
				["HOT_Time"] = 13386.211,
				["TimeDamage"] = 14083.21,
				["Healing"] = 13742.203,
				["ActiveTime"] = 14083.21,
				["DOT_Time"] = 13796.207,
				["Damage"] = 14083.21,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4121, -- [1]
				4121, -- [2]
				4121, -- [3]
				4121, -- [4]
				4121, -- [5]
				4121, -- [6]
				4121, -- [7]
				4121, -- [8]
				4121, -- [9]
				4121, -- [10]
				4121, -- [11]
				4121, -- [12]
				4121, -- [13]
				4121, -- [14]
				4121, -- [15]
				4121, -- [16]
				4121, -- [17]
				4121, -- [18]
				4121, -- [19]
				4121, -- [20]
				4121, -- [21]
				4121, -- [22]
				4121, -- [23]
				4121, -- [24]
				4121, -- [25]
				4121, -- [26]
				4121, -- [27]
				4121, -- [28]
				4121, -- [29]
				4121, -- [30]
				4121, -- [31]
				4121, -- [32]
				4121, -- [33]
				4121, -- [34]
				4121, -- [35]
				4121, -- [36]
				4121, -- [37]
				4121, -- [38]
				4121, -- [39]
				4121, -- [40]
				4121, -- [41]
				4121, -- [42]
				4121, -- [43]
				4121, -- [44]
				4121, -- [45]
				4121, -- [46]
				4121, -- [47]
				4121, -- [48]
				4121, -- [49]
				4121, -- [50]
			},
			["NextEventNum"] = 37,
			["LastDamageTime"] = 14083.644,
			["LastEvents"] = {
				"蒜头妹妹 肉搏 神经蛙-逐风者 Parry (1)", -- [1]
				"吹风吹姑娘-逐风者 魔爆术 蒜头妹妹 Hit -293 (Arcane)", -- [2]
				"蒜头妹妹 奉献 (伤害/跳) 雲木彡-逐风者 Tick -57 (Holy)", -- [3]
				"妖儿-逐风者 冰霜新星 蒜头妹妹 Hit -27 (Frost)", -- [4]
				"妖儿-逐风者 冰锥术 蒜头妹妹 Crit -1037 (Frost)", -- [5]
				"蒜头妹妹 以眼还眼 妖儿-逐风者 Hit -342 (Holy)", -- [6]
				"蒜头妹妹 奉献 (伤害/跳) 妖儿-逐风者 Tick -57 (Holy)", -- [7]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -51 (Holy)", -- [8]
				"蒜头妹妹 命令审判 一路酱-逐风者 Crit -459 (Holy)", -- [9]
				"蒜头妹妹 奉献 (伤害/跳) 妖儿-逐风者 Tick -66 (Holy)", -- [10]
				"妖儿-逐风者 冲击波 蒜头妹妹 Crit -756 (Fire)", -- [11]
				"蒜头妹妹 以眼还眼 妖儿-逐风者 Hit -287 (Holy)", -- [12]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -60 (Holy)", -- [13]
				"蒜头妹妹 肉搏 一路酱-逐风者 Hit -379 (Physical)", -- [14]
				"蒜头妹妹 命令圣印 一路酱-逐风者 Hit -436 (Holy)", -- [15]
				"蒜头妹妹 奉献 (伤害/跳) 妖儿-逐风者 Tick -66 (Holy)", -- [16]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -60 (Holy)", -- [17]
				"妖儿-逐风者 点燃 (伤害/跳) 蒜头妹妹 Tick -151 (Fire)", -- [18]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -59 (Holy)", -- [19]
				"蒜头妹妹 奉献 (伤害/跳) 老白鲨-逐风者 Tick -72 (Holy)", -- [20]
				"一路酱-逐风者 心灵尖啸 蒜头妹妹 Resist (Shadow)", -- [21]
				"妖儿-逐风者 点燃 (伤害/跳) 蒜头妹妹 Tick -151 (Fire)", -- [22]
				"蒜头妹妹 肉搏 一路酱-逐风者 Crit -609 (Physical)", -- [23]
				"蒜头妹妹 命令圣印 一路酱-逐风者 Hit -350 (Holy)", -- [24]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -59 (Holy)", -- [25]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -59 (Holy)", -- [26]
				"蒜头妹妹 奉献 (伤害/跳) 老白鲨-逐风者 Tick -72 (Holy)", -- [27]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -60 (Holy)", -- [28]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -59 (Holy)", -- [29]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -59 (Holy)", -- [30]
				"蒜头妹妹 奉献 (伤害/跳) 一路酱-逐风者 Tick -59 (Holy)", -- [31]
				"蒜头妹妹 命令审判 初代大魔王-逐风者 Hit -263 (Holy)", -- [32]
				"蒜头妹妹 命令审判 老白鲨-逐风者 Hit -272 (Holy)", -- [33]
				"蒜头妹妹 肉搏 老白鲨-逐风者 Hit -330 (Physical)", -- [34]
				"雲木彡-逐风者 旋风斩 蒜头妹妹 Hit -289 (Physical)", -- [35]
				"蒜头妹妹 肉搏 雲木彡-逐风者 Hit -272 (Physical)", -- [36]
				"神经蛙-逐风者 挫志怒吼 蒜头妹妹 Immune (Physical)", -- [37]
				"吹风吹姑娘-逐风者 魔爆术 蒜头妹妹 Immune (Arcane)", -- [38]
				"蒜头妹妹 圣光闪现 特变电工 Hit +452", -- [39]
				"蒜头妹妹 命令审判 神经蛙-逐风者 Hit -260 (Holy)", -- [40]
				"请叫我天哥-逐风者 多重射击 蒜头妹妹 Immune (Physical)", -- [41]
				"吹风吹姑娘-逐风者 魔爆术 蒜头妹妹 Hit -291 (Arcane)", -- [42]
				"蒜头妹妹 奉献 (伤害/跳) 神经蛙-逐风者 Tick -58 (Holy)", -- [43]
				"蒜头妹妹 奉献 (伤害/跳) 吹风吹姑娘-逐风者 Absorb -57 (57 被吸收) (Holy)", -- [44]
				"吹风吹姑娘-逐风者 魔爆术 蒜头妹妹 Hit -293 (Arcane)", -- [45]
				"蒜头妹妹 奉献 (伤害/跳) 神经蛙-逐风者 Tick -57 (Holy)", -- [46]
				"蒜头妹妹 奉献 (伤害/跳) 吹风吹姑娘-逐风者 Absorb -57 (57 被吸收) (Holy)", -- [47]
				"雲木彡-逐风者 铁皮手雷 蒜头妹妹 Hit -158 (Fire)", -- [48]
				"蒜头妹妹 奉献 (伤害/跳) 神经蛙-逐风者 Tick -57 (Holy)", -- [49]
				"蒜头妹妹 奉献 (伤害/跳) 吹风吹姑娘-逐风者 Absorb -57 (57 被吸收) (Holy)", -- [50]
			},
			["Name"] = "蒜头妹妹",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13747.27, -- [1]
				13747.287, -- [2]
				13747.437, -- [3]
				13783.389, -- [4]
				13784.938, -- [5]
				13784.938, -- [6]
				13785.273, -- [7]
				13785.473, -- [8]
				13785.539, -- [9]
				13786.273, -- [10]
				13786.423, -- [11]
				13786.439, -- [12]
				13786.473, -- [13]
				13787.24, -- [14]
				13787.256, -- [15]
				13787.256, -- [16]
				13787.473, -- [17]
				13788.44, -- [18]
				13788.473, -- [19]
				13789.106, -- [20]
				13789.706, -- [21]
				13790.44, -- [22]
				13791.04, -- [23]
				13791.056, -- [24]
				13791.54, -- [25]
				13792.54, -- [26]
				13792.74, -- [27]
				13793.54, -- [28]
				13794.54, -- [29]
				13795.54, -- [30]
				13796.54, -- [31]
				13863.845, -- [32]
				14078.277, -- [33]
				14079.827, -- [34]
				14081.494, -- [35]
				14083.644, -- [36]
				13741.486, -- [37]
				13742.77, -- [38]
				13742.82, -- [39]
				13743.27, -- [40]
				13743.87, -- [41]
				13744.27, -- [42]
				13745.22, -- [43]
				13745.22, -- [44]
				13745.77, -- [45]
				13746.237, -- [46]
				13746.237, -- [47]
				13746.287, -- [48]
				13747.237, -- [49]
				13747.237, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 289,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 289,
					},
					["DOT_Time"] = 0,
					["Damage"] = 874,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 602,
						["Holy"] = 272,
					},
					["PartialAbsorb"] = {
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 272,
								},
							},
							["amount"] = 272,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 272,
								},
								["肉搏"] = {
									["count"] = 330,
								},
							},
							["amount"] = 602,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 289,
								},
							},
							["amount"] = 289,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 4.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["命令审判"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 272,
									["min"] = 272,
									["count"] = 1,
									["amount"] = 272,
								},
							},
							["count"] = 1,
							["amount"] = 272,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 330,
									["min"] = 272,
									["count"] = 2,
									["amount"] = 602,
								},
							},
							["count"] = 2,
							["amount"] = 602,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 4.5,
					["TimeDamaging"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["WhoDispelled"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["强效力量祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 3,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["急救"] = {
									["count"] = 3.52,
								},
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 14.02,
						},
					},
					["DOTs"] = {
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["吹风吹姑娘-逐风者"] = {
									["count"] = 9,
								},
								["神经蛙-逐风者"] = {
									["count"] = 78,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 18,
								},
								["源堂法雷尔-逐风者"] = {
									["count"] = 3,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 54,
								},
								["老白鲨-逐风者"] = {
									["count"] = 30,
								},
								["雲木彡-逐风者"] = {
									["count"] = 39,
								},
								["一路酱-逐风者"] = {
									["count"] = 30,
								},
								["妖儿-逐风者"] = {
									["count"] = 9,
								},
								["蓝色空间号-逐风者"] = {
									["count"] = 18,
								},
							},
							["amount"] = 288,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["HOT_Time"] = 9,
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["昏迷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 5.18,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 21.02,
								},
								["命令圣印"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 3.43,
								},
							},
							["amount"] = 29.65,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.67,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 5.529999999999999,
								},
								["命令圣印"] = {
									["count"] = 0.09,
								},
								["肉搏"] = {
									["count"] = 3.29,
								},
							},
							["amount"] = 10.58,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 0.32,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["辩护"] = {
									["count"] = 0.02,
								},
								["命令圣印"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 0.27,
								},
							},
							["amount"] = 5.329999999999999,
						},
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 3,
								},
								["神圣力量"] = {
									["count"] = 1.5,
								},
								["急救"] = {
									["count"] = 3.52,
								},
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 14.02,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["以眼还眼"] = {
									["count"] = 2.12,
								},
								["命令审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.62,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 0.07,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 6.73,
								},
								["命令圣印"] = {
									["count"] = 0.04,
								},
								["肉搏"] = {
									["count"] = 2.27,
								},
							},
							["amount"] = 9.11,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 10.39,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 14.89,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 2.2,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 7.340000000000001,
								},
								["命令圣印"] = {
									["count"] = 0.04,
								},
								["肉搏"] = {
									["count"] = 6.3,
								},
							},
							["amount"] = 15.88,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 0.12,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 2.94,
								},
								["命令圣印"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 5.53,
								},
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.12,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.03,
								},
							},
							["amount"] = 2.53,
						},
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["以眼还眼"] = {
									["count"] = 3.17,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 1.07,
								},
							},
							["amount"] = 4.24,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1734,
								},
							},
							["amount"] = 1734,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 417,
								},
							},
							["amount"] = 417,
						},
						["开心亿点点-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1260,
								},
							},
							["amount"] = 1260,
						},
						["破裤子残腿-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 416,
								},
							},
							["amount"] = 416,
						},
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 694,
								},
							},
							["amount"] = 694,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 2717,
								},
								["神圣力量"] = {
									["count"] = 105,
								},
								["急救"] = {
									["count"] = 750,
								},
								["圣光闪现"] = {
									["count"] = 1310,
								},
							},
							["amount"] = 4882,
						},
					},
					["ElementDoneAbsorb"] = {
						["Holy"] = 461,
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["拳击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰冻陷阱效果"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["挫志怒吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["脑部损伤"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 27,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 27,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["拳击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰冻陷阱效果"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["挫志怒吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["脑部损伤"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["地精工兵炸药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 27,
									["amount"] = 0,
								},
							},
							["count"] = 27,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 145.47,
					["Dispelled"] = 1,
					["ElementTaken"] = {
						["Physical"] = 3918,
						["Melee"] = 6713,
						["Arcane"] = 2648,
						["Fire"] = 2962,
						["Frost"] = 2759,
						["Nature"] = 204,
					},
					["DOT_Time"] = 288,
					["Damage"] = 25721,
					["Attacks"] = {
						["命令审判"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 940,
									["min"] = 459,
									["count"] = 3,
									["amount"] = 1928,
								},
								["Hit"] = {
									["max"] = 499,
									["min"] = 248,
									["count"] = 13,
									["amount"] = 3958,
								},
							},
							["count"] = 16,
							["amount"] = 5886,
						},
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 57,
									["min"] = 57,
									["count"] = 3,
									["amount"] = 171,
								},
								["Tick"] = {
									["max"] = 73,
									["min"] = 12,
									["count"] = 93,
									["amount"] = 5101,
								},
							},
							["count"] = 96,
							["amount"] = 5272,
						},
						["命令圣印"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 769,
									["min"] = 769,
									["count"] = 1,
									["amount"] = 769,
								},
								["Hit"] = {
									["max"] = 561,
									["min"] = 350,
									["count"] = 9,
									["amount"] = 3875,
								},
							},
							["count"] = 10,
							["amount"] = 4644,
						},
						["昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["以眼还眼"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 342,
									["min"] = 287,
									["count"] = 3,
									["amount"] = 971,
								},
								["Absorb"] = {
									["max"] = 150,
									["min"] = 140,
									["count"] = 2,
									["amount"] = 290,
								},
							},
							["count"] = 5,
							["amount"] = 1261,
						},
						["辩护"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 745,
									["min"] = 551,
									["count"] = 5,
									["amount"] = 3115,
								},
								["Hit"] = {
									["max"] = 435,
									["min"] = 238,
									["count"] = 17,
									["amount"] = 5543,
								},
							},
							["count"] = 25,
							["amount"] = 8658,
						},
						["制裁之锤"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["Heals"] = {
						["圣光术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1372,
									["min"] = 1345,
									["count"] = 2,
									["amount"] = 2717,
								},
							},
							["count"] = 2,
							["amount"] = 2717,
						},
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 105,
									["min"] = 105,
									["count"] = 1,
									["amount"] = 105,
								},
							},
							["count"] = 1,
							["amount"] = 105,
						},
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 3,
									["amount"] = 750,
								},
							},
							["count"] = 3,
							["amount"] = 750,
						},
						["圣光闪现"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 452,
									["min"] = 218,
									["count"] = 15,
									["amount"] = 5831,
								},
							},
							["count"] = 15,
							["amount"] = 5831,
						},
					},
					["DamageTaken"] = 19204,
					["Dispels"] = 2,
					["WhoHealed"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 2717,
								},
								["神圣力量"] = {
									["count"] = 105,
								},
								["急救"] = {
									["count"] = 750,
								},
								["圣光闪现"] = {
									["count"] = 1310,
								},
							},
							["amount"] = 4882,
						},
					},
					["Healing"] = 9403,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 19,
								},
								["Tick"] = {
									["count"] = 13,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 42,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 16,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Parry"] = {
									["count"] = 3,
								},
							},
							["amount"] = 27,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 8,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 43,
								},
								["肉搏"] = {
									["count"] = 241,
								},
							},
							["amount"] = 284,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 54,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 302,
								},
								["冲击波"] = {
									["count"] = 1252,
								},
								["冰锥术"] = {
									["count"] = 2071,
								},
								["火焰冲击"] = {
									["count"] = 525,
								},
							},
							["amount"] = 4204,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 204,
								},
							},
							["amount"] = 204,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 842,
								},
								["断筋"] = {
									["count"] = 87,
								},
								["肉搏"] = {
									["count"] = 2532,
								},
							},
							["amount"] = 3461,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 250,
								},
							},
							["amount"] = 250,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 311,
								},
								["摔绊"] = {
									["count"] = 15,
								},
							},
							["amount"] = 326,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 290,
								},
								["脑部损伤"] = {
									["count"] = 233,
								},
								["凿击"] = {
									["count"] = 43,
								},
								["肉搏"] = {
									["count"] = 470,
								},
							},
							["amount"] = 1036,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 462,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 715,
								},
								["拦截昏迷"] = {
									["count"] = 47,
								},
								["断筋"] = {
									["count"] = 83,
								},
								["拳击"] = {
									["count"] = 28,
								},
								["肉搏"] = {
									["count"] = 1523,
								},
							},
							["amount"] = 2858,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 289,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 173,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 90,
								},
								["拦截昏迷"] = {
									["count"] = 37,
								},
								["断筋"] = {
									["count"] = 120,
								},
								["铁皮手雷"] = {
									["count"] = 158,
								},
								["肉搏"] = {
									["count"] = 1697,
								},
							},
							["amount"] = 2564,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["地精工兵炸药"] = {
									["count"] = 725,
								},
							},
							["amount"] = 725,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 2648,
								},
								["冰锥术"] = {
									["count"] = 566,
								},
								["冰霜新星"] = {
									["count"] = 68,
								},
							},
							["amount"] = 3282,
						},
					},
					["ElementDone"] = {
						["Melee"] = 8658,
						["Holy"] = 17063,
					},
					["HealingTaken"] = 4882,
					["DamagedWho"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 258,
								},
								["肉搏"] = {
									["count"] = 378,
								},
							},
							["amount"] = 636,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 263,
								},
							},
							["amount"] = 263,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 257,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 171,
								},
								["以眼还眼"] = {
									["count"] = 290,
								},
								["肉搏"] = {
									["count"] = 355,
								},
							},
							["amount"] = 1073,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 286,
								},
							},
							["amount"] = 286,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1345,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 1391,
								},
								["命令圣印"] = {
									["count"] = 445,
								},
								["肉搏"] = {
									["count"] = 603,
								},
							},
							["amount"] = 3784,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 754,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 380,
								},
								["命令圣印"] = {
									["count"] = 1564,
								},
								["肉搏"] = {
									["count"] = 833,
								},
							},
							["amount"] = 3531,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 469,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 343,
								},
								["命令圣印"] = {
									["count"] = 440,
								},
								["肉搏"] = {
									["count"] = 807,
								},
							},
							["amount"] = 2059,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 459,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 585,
								},
								["命令圣印"] = {
									["count"] = 786,
								},
								["肉搏"] = {
									["count"] = 988,
								},
							},
							["amount"] = 2818,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 248,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 792,
								},
								["肉搏"] = {
									["count"] = 652,
								},
							},
							["amount"] = 1692,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 592,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 694,
								},
								["命令圣印"] = {
									["count"] = 947,
								},
								["肉搏"] = {
									["count"] = 2064,
								},
							},
							["amount"] = 4297,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 301,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 670,
								},
								["命令圣印"] = {
									["count"] = 462,
								},
								["肉搏"] = {
									["count"] = 1692,
								},
							},
							["amount"] = 3125,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 57,
								},
							},
							["amount"] = 57,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["以眼还眼"] = {
									["count"] = 971,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 189,
								},
							},
							["amount"] = 1160,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 940,
								},
							},
							["amount"] = 940,
						},
					},
					["TimeDamage"] = 114.95,
					["TimeDamaging"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.03,
								},
							},
							["amount"] = 2.53,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["以眼还眼"] = {
									["count"] = 2.12,
								},
								["命令审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.62,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["昏迷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 5.18,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 21.02,
								},
								["命令圣印"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 3.43,
								},
							},
							["amount"] = 29.65,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.67,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 5.529999999999999,
								},
								["命令圣印"] = {
									["count"] = 0.09,
								},
								["肉搏"] = {
									["count"] = 3.29,
								},
							},
							["amount"] = 10.58,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 0.32,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 4.7,
								},
								["辩护"] = {
									["count"] = 0.02,
								},
								["命令圣印"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 0.27,
								},
							},
							["amount"] = 5.329999999999999,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 10.39,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 14.89,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 2.2,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 7.340000000000001,
								},
								["命令圣印"] = {
									["count"] = 0.04,
								},
								["肉搏"] = {
									["count"] = 6.3,
								},
							},
							["amount"] = 15.88,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 0.12,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 2.94,
								},
								["命令圣印"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 5.53,
								},
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.12,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 0.07,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 6.73,
								},
								["命令圣印"] = {
									["count"] = 0.04,
								},
								["肉搏"] = {
									["count"] = 2.27,
								},
							},
							["amount"] = 9.11,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["以眼还眼"] = {
									["count"] = 3.17,
								},
								["奉献 (伤害/跳)"] = {
									["count"] = 1.07,
								},
							},
							["amount"] = 4.24,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["命令审判"] = {
									["count"] = 1.5,
								},
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeHeal"] = 30.52,
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 93,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 25,
								},
							},
							["amount"] = 131,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 25,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DispelledWho"] = {
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["法术反制 - 沉默 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 14078.21,
			["LastActive"] = 14083.21,
		},
		["重生-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02E8E265",
			["TimeLast"] = {
				["TimeHeal"] = 14046.208,
				["Dispelled"] = 13654.197,
				["OVERALL"] = 14087.211,
				["DamageTaken"] = 14087.211,
				["HealingTaken"] = 14046.208,
				["TimeDamage"] = 14080.21,
				["ActiveTime"] = 14080.21,
				["Healing"] = 14046.208,
				["ManaGain"] = 12900.209,
				["DOT_Time"] = 14078.21,
				["Damage"] = 14080.21,
			},
			["LastAttackedBy"] = "雲木彡-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["Healing"] = {
					1730, -- [1]
				},
				["DamageTaken"] = {
					5851, -- [1]
				},
				["HealingTaken"] = {
					1730, -- [1]
				},
				["TimeDamage"] = {
					38.91, -- [1]
				},
				["ActiveTime"] = {
					40.41, -- [1]
				},
				["ManaGain"] = {
					120, -- [1]
				},
				["DOT_Time"] = {
					36, -- [1]
				},
				["Damage"] = {
					10488, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "重伤 (伤害/跳)",
			["LastFightIn"] = 11,
			["LastHealTime"] = 14046.241,
			["type"] = "Grouped",
			["LastDamageTaken"] = 86,
			["LastEventHealth"] = {
				3729, -- [1]
				3696, -- [2]
				3012, -- [3]
				3012, -- [4]
				2599, -- [5]
				1943, -- [6]
				1943, -- [7]
				1635, -- [8]
				1549, -- [9]
				1516, -- [10]
				1171, -- [11]
				5035, -- [12]
				5035, -- [13]
				5035, -- [14]
				5035, -- [15]
				5035, -- [16]
				5035, -- [17]
				5035, -- [18]
				219, -- [19]
				219, -- [20]
				219, -- [21]
				219, -- [22]
				4921, -- [23]
				4921, -- [24]
				4895, -- [25]
				4895, -- [26]
				3836, -- [27]
				3023, -- [28]
				4753, -- [29]
				4590, -- [30]
				4427, -- [31]
				4427, -- [32]
				4427, -- [33]
				4533, -- [34]
				4533, -- [35]
				4533, -- [36]
				4533, -- [37]
				4533, -- [38]
				4533, -- [39]
				4533, -- [40]
				4483, -- [41]
				4483, -- [42]
				4443, -- [43]
				4102, -- [44]
				4102, -- [45]
				4067, -- [46]
				4067, -- [47]
				3729, -- [48]
				3729, -- [49]
				3729, -- [50]
			},
			["LastEventHealthMax"] = {
				5035, -- [1]
				5035, -- [2]
				5035, -- [3]
				5035, -- [4]
				5035, -- [5]
				5035, -- [6]
				5035, -- [7]
				5035, -- [8]
				5035, -- [9]
				5035, -- [10]
				5035, -- [11]
				5035, -- [12]
				5035, -- [13]
				5035, -- [14]
				5035, -- [15]
				5035, -- [16]
				5035, -- [17]
				5035, -- [18]
				5035, -- [19]
				5035, -- [20]
				5035, -- [21]
				5035, -- [22]
				5035, -- [23]
				5035, -- [24]
				5035, -- [25]
				5035, -- [26]
				5035, -- [27]
				5035, -- [28]
				5035, -- [29]
				5035, -- [30]
				5035, -- [31]
				5035, -- [32]
				5035, -- [33]
				5035, -- [34]
				5035, -- [35]
				5035, -- [36]
				5035, -- [37]
				5035, -- [38]
				5035, -- [39]
				5035, -- [40]
				5035, -- [41]
				5035, -- [42]
				5035, -- [43]
				5035, -- [44]
				5035, -- [45]
				5035, -- [46]
				5035, -- [47]
				5035, -- [48]
				5035, -- [49]
				5035, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"天命 <重生-火妖鲁西弗隆>", -- [1]
			},
			["NextEventNum"] = 13,
			["LastDamageTime"] = 14081.01,
			["LastEvents"] = {
				"雲木彡-逐风者 断筋 重生-火妖鲁西弗隆 Hit -33 (Physical)", -- [1]
				"雲木彡-逐风者 肉搏 重生-火妖鲁西弗隆 Crit -684 (Physical)", -- [2]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -101 (Nature)", -- [3]
				"雲木彡-逐风者 致死打击 重生-火妖鲁西弗隆 Hit -413 (Physical)", -- [4]
				"雲木彡-逐风者 肉搏 重生-火妖鲁西弗隆 Crit -656 (Physical)", -- [5]
				"重生-火妖鲁西弗隆 肉搏 雲木彡-逐风者 Hit -253 (Physical)", -- [6]
				"雲木彡-逐风者 旋风斩 重生-火妖鲁西弗隆 Hit -308 (Physical)", -- [7]
				"雲木彡-逐风者 重伤 (伤害/跳) 重生-火妖鲁西弗隆 Tick -86 (Physical)", -- [8]
				"雲木彡-逐风者 断筋 重生-火妖鲁西弗隆 Hit -33 (Physical)", -- [9]
				"雲木彡-逐风者 肉搏 重生-火妖鲁西弗隆 Hit -345 (Physical)", -- [10]
				"雲木彡-逐风者 断筋 重生-火妖鲁西弗隆 Crit -74 (Physical)", -- [11]
				"雲木彡-逐风者 重伤 (伤害/跳) 重生-火妖鲁西弗隆 Tick -86 (Physical)", -- [12]
				"重生-火妖鲁西弗隆 自动射击 老白鲨-逐风者 Hit -263 (Physical)", -- [13]
				"重生-火妖鲁西弗隆 奥术射击 老白鲨-逐风者 Hit -217 (Arcane)", -- [14]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 老白鲨-逐风者 Tick -112 (Nature)", -- [15]
				"重生-火妖鲁西弗隆 自动射击 老白鲨-逐风者 Hit -257 (Physical)", -- [16]
				"重生-火妖鲁西弗隆 多重射击 老白鲨-逐风者 Crit -1001 (Physical)", -- [17]
				"请叫我天哥-逐风者 驱散射击 重生-火妖鲁西弗隆 Hit -105 (Physical)", -- [18]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 时间的小溪-逐风者 Tick -101 (Nature)", -- [19]
				"重生-火妖鲁西弗隆 奥术射击 时间的小溪-逐风者 Hit -198 (Arcane)", -- [20]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 老白鲨-逐风者 Tick -111 (Nature)", -- [21]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 老白鲨-逐风者 Tick -111 (Nature)", -- [22]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 老戏骨-逐风者 Tick -101 (Nature)", -- [23]
				"妖儿-逐风者 冰霜新星 重生-火妖鲁西弗隆 Hit -26 (Frost)", -- [24]
				"重生-火妖鲁西弗隆 自动射击 初代大魔王-逐风者 Crit -909 (Physical)", -- [25]
				"妖儿-逐风者 冰锥术 重生-火妖鲁西弗隆 Crit -1059 (Frost)", -- [26]
				"妖儿-逐风者 冲击波 重生-火妖鲁西弗隆 Crit -813 (Fire)", -- [27]
				"重生-火妖鲁西弗隆 治疗药水 重生-火妖鲁西弗隆 Hit +1730", -- [28]
				"妖儿-逐风者 点燃 (伤害/跳) 重生-火妖鲁西弗隆 Tick -163 (Fire)", -- [29]
				"妖儿-逐风者 点燃 (伤害/跳) 重生-火妖鲁西弗隆 Tick -163 (Fire)", -- [30]
				"重生-火妖鲁西弗隆 自动射击 初代大魔王-逐风者 Hit -332 (Physical)", -- [31]
				"重生-火妖鲁西弗隆 多重射击 初代大魔王-逐风者 Hit -587 (Physical)", -- [32]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 初代大魔王-逐风者 Tick -101 (Nature)", -- [33]
				"重生-火妖鲁西弗隆 自动射击 源堂法雷尔-逐风者 Hit -315 (Physical)", -- [34]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -101 (Nature)", -- [35]
				"重生-火妖鲁西弗隆 自动射击 源堂法雷尔-逐风者 Crit -764 (Physical)", -- [36]
				"重生-火妖鲁西弗隆 多重射击 雲木彡-逐风者 Absorb -390 (390 被吸收) (Physical)", -- [37]
				"重生-火妖鲁西弗隆 多重射击 老白鲨-逐风者 Crit -939 (Physical)", -- [38]
				"重生-火妖鲁西弗隆 多重射击 源堂法雷尔-逐风者 Hit -467 (Physical)", -- [39]
				"老白鲨-逐风者 拦截昏迷 重生-火妖鲁西弗隆 Hit -50 (Physical)", -- [40]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -101 (Nature)", -- [41]
				"雲木彡-逐风者 拦截昏迷 重生-火妖鲁西弗隆 Hit -40 (Physical)", -- [42]
				"老白鲨-逐风者 肉搏 重生-火妖鲁西弗隆 Hit -341 (Physical)", -- [43]
				"老白鲨-逐风者 断筋 重生-火妖鲁西弗隆 Hit -35 (Physical)", -- [44]
				"老白鲨-逐风者 强化断筋 重生-火妖鲁西弗隆 Resist (Physical)", -- [45]
				"雲木彡-逐风者 肉搏 重生-火妖鲁西弗隆 Hit -305 (Physical)", -- [46]
				"雲木彡-逐风者 断筋 重生-火妖鲁西弗隆 Hit -33 (Physical)", -- [47]
				"重生-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 源堂法雷尔-逐风者 Tick -101 (Nature)", -- [48]
				"重生-火妖鲁西弗隆 肉搏 雲木彡-逐风者 Hit -236 (Physical)", -- [49]
				"重生-火妖鲁西弗隆 摔绊 雲木彡-逐风者 Hit -29 (Physical)", -- [50]
			},
			["Name"] = "重生-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				14077.477, -- [1]
				14078.177, -- [2]
				14078.694, -- [3]
				14079.843, -- [4]
				14079.86, -- [5]
				14081.01, -- [6]
				14081.494, -- [7]
				14082.894, -- [8]
				14083.077, -- [9]
				14083.427, -- [10]
				14084.994, -- [11]
				14087.994, -- [12]
				13663.447, -- [13]
				13665.747, -- [14]
				13665.981, -- [15]
				13666.381, -- [16]
				13668.048, -- [17]
				13746.887, -- [18]
				13882.613, -- [19]
				13882.846, -- [20]
				13893.897, -- [21]
				13896.897, -- [22]
				14041.441, -- [23]
				14041.775, -- [24]
				14043.191, -- [25]
				14043.292, -- [26]
				14044.808, -- [27]
				14046.241, -- [28]
				14046.841, -- [29]
				14048.842, -- [30]
				14050.075, -- [31]
				14050.758, -- [32]
				14051.058, -- [33]
				14067.059, -- [34]
				14069.693, -- [35]
				14069.943, -- [36]
				14072.176, -- [37]
				14072.176, -- [38]
				14072.21, -- [39]
				14072.276, -- [40]
				14072.676, -- [41]
				14072.693, -- [42]
				14073.526, -- [43]
				14073.71, -- [44]
				14073.71, -- [45]
				14074.01, -- [46]
				14074.077, -- [47]
				14075.677, -- [48]
				14077.294, -- [49]
				14077.46, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["老戏骨-逐风者"] = {
									["count"] = 3,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 3,
								},
								["源堂法雷尔-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 18,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5746,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 12,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 1191,
						["Frost"] = 1085,
						["Melee"] = 2331,
						["Fire"] = 1139,
					},
					["DOT_Time"] = 18,
					["Damage"] = 5827,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 390,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 4732,
						["Melee"] = 489,
						["Nature"] = 606,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["强化断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 404,
								},
								["自动射击"] = {
									["count"] = 1079,
								},
								["多重射击"] = {
									["count"] = 467,
								},
							},
							["amount"] = 1950,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["自动射击"] = {
									["count"] = 1241,
								},
								["多重射击"] = {
									["count"] = 587,
								},
							},
							["amount"] = 1929,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 939,
								},
							},
							["amount"] = 939,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 29,
								},
								["多重射击"] = {
									["count"] = 390,
								},
								["肉搏"] = {
									["count"] = 489,
								},
							},
							["amount"] = 908,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
							},
							["amount"] = 101,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 413,
								},
								["旋风斩"] = {
									["count"] = 308,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 172,
								},
								["断筋"] = {
									["count"] = 173,
								},
								["拦截昏迷"] = {
									["count"] = 40,
								},
								["肉搏"] = {
									["count"] = 1990,
								},
							},
							["amount"] = 3096,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 50,
								},
								["断筋"] = {
									["count"] = 35,
								},
								["肉搏"] = {
									["count"] = 341,
								},
							},
							["amount"] = 426,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 326,
								},
								["冲击波"] = {
									["count"] = 813,
								},
								["冰锥术"] = {
									["count"] = 1059,
								},
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 2224,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["强化断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1730,
								},
							},
							["amount"] = 1730,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.699999999999999,
								},
								["自动射击"] = {
									["count"] = 1.75,
								},
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 6.48,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.3,
								},
								["自动射击"] = {
									["count"] = 3,
								},
								["多重射击"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 3.98,
						},
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.17,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.67,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1730,
									["min"] = 1730,
									["count"] = 1,
									["amount"] = 1730,
								},
							},
							["count"] = 1,
							["amount"] = 1730,
						},
					},
					["WhoHealed"] = {
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1730,
								},
							},
							["amount"] = 1730,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 18.13,
					["Healing"] = 1730,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 6,
									["amount"] = 606,
								},
							},
							["count"] = 6,
							["amount"] = 606,
						},
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
							},
							["count"] = 1,
							["amount"] = 29,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 909,
									["min"] = 764,
									["count"] = 2,
									["amount"] = 1673,
								},
								["Hit"] = {
									["max"] = 332,
									["min"] = 315,
									["count"] = 2,
									["amount"] = 647,
								},
							},
							["count"] = 4,
							["amount"] = 2320,
						},
						["多重射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 390,
									["min"] = 390,
									["count"] = 1,
									["amount"] = 390,
								},
								["Crit"] = {
									["max"] = 939,
									["min"] = 939,
									["count"] = 1,
									["amount"] = 939,
								},
								["Hit"] = {
									["max"] = 587,
									["min"] = 467,
									["count"] = 2,
									["amount"] = 1054,
								},
							},
							["count"] = 4,
							["amount"] = 2383,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 253,
									["min"] = 236,
									["count"] = 2,
									["amount"] = 489,
								},
							},
							["count"] = 2,
							["amount"] = 489,
						},
					},
					["HealingTaken"] = 1730,
					["RageGain"] = 0,
					["TimeDamage"] = 16.63,
					["TimeDamaging"] = {
						["老戏骨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.17,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.67,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.3,
								},
								["自动射击"] = {
									["count"] = 3,
								},
								["多重射击"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 3.98,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.699999999999999,
								},
								["自动射击"] = {
									["count"] = 1.75,
								},
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 6.48,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["源堂法雷尔-逐风者"] = {
									["count"] = 12,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 3,
								},
								["老白鲨-逐风者"] = {
									["count"] = 9,
								},
								["老戏骨-逐风者"] = {
									["count"] = 3,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 6,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 36,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 18,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementDoneResist"] = {
						["Nature"] = 50,
					},
					["TimeSpent"] = {
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.3,
								},
								["自动射击"] = {
									["count"] = 3,
								},
								["多重射击"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 3.98,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.92,
								},
								["奥术射击"] = {
									["count"] = 2.77,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.73,
								},
							},
							["amount"] = 7.92,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.699999999999999,
								},
								["自动射击"] = {
									["count"] = 1.75,
								},
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 6.48,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 0.23,
								},
							},
							["amount"] = 1.73,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 3.23,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.9,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.63,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.17,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.67,
						},
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 5851,
					["ElementDoneAbsorb"] = {
						["Physical"] = 571,
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["强化断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["强化断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 40.41,
					["WhoHealed"] = {
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1730,
								},
							},
							["amount"] = 1730,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 1139,
						["Physical"] = 1296,
						["Melee"] = 2331,
						["Frost"] = 1085,
					},
					["DOT_Time"] = 36,
					["Damage"] = 10488,
					["HealedWho"] = {
						["重生-火妖鲁西弗隆"] = {
							["Details"] = {
								["治疗药水"] = {
									["count"] = 1730,
								},
							},
							["amount"] = 1730,
						},
					},
					["TimeHeal"] = 1.5,
					["Heals"] = {
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1730,
									["min"] = 1730,
									["count"] = 1,
									["amount"] = 1730,
								},
							},
							["count"] = 1,
							["amount"] = 1730,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 413,
								},
								["旋风斩"] = {
									["count"] = 308,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 172,
								},
								["断筋"] = {
									["count"] = 173,
								},
								["拦截昏迷"] = {
									["count"] = 40,
								},
								["肉搏"] = {
									["count"] = 1990,
								},
							},
							["amount"] = 3096,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 105,
								},
							},
							["amount"] = 105,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 50,
								},
								["断筋"] = {
									["count"] = 35,
								},
								["肉搏"] = {
									["count"] = 341,
								},
							},
							["amount"] = 426,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["点燃 (伤害/跳)"] = {
									["count"] = 326,
								},
								["冲击波"] = {
									["count"] = 813,
								},
								["冰锥术"] = {
									["count"] = 1059,
								},
								["冰霜新星"] = {
									["count"] = 26,
								},
							},
							["amount"] = 2224,
						},
					},
					["Healing"] = 1730,
					["WhoDispelled"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Dispelled"] = 1,
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 112,
									["min"] = 56,
									["count"] = 12,
									["amount"] = 1208,
								},
							},
							["count"] = 12,
							["amount"] = 1208,
						},
						["奥术射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 518,
									["min"] = 518,
									["count"] = 1,
									["amount"] = 518,
								},
								["Hit"] = {
									["max"] = 218,
									["min"] = 198,
									["count"] = 3,
									["amount"] = 633,
								},
							},
							["count"] = 4,
							["amount"] = 1151,
						},
						["摔绊"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 56,
									["min"] = 56,
									["count"] = 1,
									["amount"] = 56,
								},
								["Hit"] = {
									["max"] = 29,
									["min"] = 29,
									["count"] = 1,
									["amount"] = 29,
								},
							},
							["count"] = 2,
							["amount"] = 85,
						},
						["多重射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 390,
									["min"] = 390,
									["count"] = 1,
									["amount"] = 390,
								},
								["Crit"] = {
									["max"] = 1001,
									["min"] = 939,
									["count"] = 2,
									["amount"] = 1940,
								},
								["Hit"] = {
									["max"] = 587,
									["min"] = 396,
									["count"] = 4,
									["amount"] = 2013,
								},
							},
							["count"] = 7,
							["amount"] = 4343,
						},
						["自动射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 909,
									["min"] = 764,
									["count"] = 2,
									["amount"] = 1673,
								},
								["Hit"] = {
									["max"] = 332,
									["min"] = 257,
									["count"] = 4,
									["amount"] = 1167,
								},
							},
							["count"] = 8,
							["amount"] = 2840,
						},
						["驱散射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 181,
									["min"] = 181,
									["count"] = 1,
									["amount"] = 181,
								},
							},
							["count"] = 1,
							["amount"] = 181,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 253,
									["min"] = 191,
									["count"] = 3,
									["amount"] = 680,
								},
							},
							["count"] = 3,
							["amount"] = 680,
						},
					},
					["HealingTaken"] = 1730,
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["TimeDamage"] = 38.91,
					["TimeDamaging"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 4.699999999999999,
								},
								["自动射击"] = {
									["count"] = 1.75,
								},
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 6.48,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 0.17,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.67,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 0.23,
								},
							},
							["amount"] = 1.73,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.3,
								},
								["自动射击"] = {
									["count"] = 3,
								},
								["多重射击"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 3.98,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.92,
								},
								["奥术射击"] = {
									["count"] = 2.77,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.73,
								},
							},
							["amount"] = 7.92,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 3.23,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.9,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 9.63,
						},
					},
					["ManaGain"] = 120,
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 404,
								},
								["自动射击"] = {
									["count"] = 1079,
								},
								["多重射击"] = {
									["count"] = 467,
								},
							},
							["amount"] = 1950,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 29,
								},
								["多重射击"] = {
									["count"] = 390,
								},
								["肉搏"] = {
									["count"] = 489,
								},
							},
							["amount"] = 908,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 299,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 181,
								},
								["多重射击"] = {
									["count"] = 563,
								},
							},
							["amount"] = 744,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
							},
							["amount"] = 101,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["自动射击"] = {
									["count"] = 1241,
								},
								["多重射击"] = {
									["count"] = 587,
								},
							},
							["amount"] = 1929,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 167,
								},
								["奥术射击"] = {
									["count"] = 736,
								},
								["多重射击"] = {
									["count"] = 396,
								},
							},
							["amount"] = 1299,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 334,
								},
								["奥术射击"] = {
									["count"] = 217,
								},
								["摔绊"] = {
									["count"] = 56,
								},
								["自动射击"] = {
									["count"] = 520,
								},
								["多重射击"] = {
									["count"] = 1940,
								},
								["肉搏"] = {
									["count"] = 191,
								},
							},
							["amount"] = 3258,
						},
					},
					["ElementDone"] = {
						["Nature"] = 1208,
						["Physical"] = 7449,
						["Melee"] = 680,
						["Arcane"] = 1151,
					},
				},
			},
			["UnitLockout"] = 14041.208,
			["LastActive"] = 14087.211,
		},
		["静悄悄发育-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02FF3EEC",
			["LastEventHealth"] = {
				2444, -- [1]
				2444, -- [2]
				2444, -- [3]
				4487, -- [4]
				4487, -- [5]
				4487, -- [6]
				4487, -- [7]
				4487, -- [8]
				4487, -- [9]
				4487, -- [10]
				4670, -- [11]
				4670, -- [12]
				4670, -- [13]
				4670, -- [14]
				4670, -- [15]
				4670, -- [16]
				4670, -- [17]
				4670, -- [18]
				4712, -- [19]
				4642, -- [20]
				4581, -- [21]
				4581, -- [22]
				4581, -- [23]
				4221, -- [24]
				4221, -- [25]
				4189, -- [26]
				3408, -- [27]
				3408, -- [28]
				3408, -- [29]
				3408, -- [30]
				3408, -- [31]
				2825, -- [32]
				2752, -- [33]
				2713, -- [34]
				2633, -- [35]
				1789, -- [36]
				1403, -- [37]
				903, -- [38]
				334, -- [39]
				56, -- [40]
				0, -- [41]
				4867, -- [42]
				4867, -- [43]
				4867, -- [44]
				4867, -- [45]
				4867, -- [46]
				4867, -- [47]
				4867, -- [48]
				4867, -- [49]
				2444, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"MISC", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					2, -- [1]
				},
				["TimeDamage"] = {
					50.46000000000001, -- [1]
				},
				["ActiveTime"] = {
					50.46000000000001, -- [1]
				},
				["DOT_Time"] = {
					15, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					9010, -- [1]
				},
				["Damage"] = {
					16321, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = "静悄悄发育-火妖鲁西弗隆",
			["LastEventHealthMax"] = {
				4757, -- [1]
				4757, -- [2]
				4757, -- [3]
				4757, -- [4]
				4757, -- [5]
				4757, -- [6]
				4757, -- [7]
				4757, -- [8]
				4757, -- [9]
				4757, -- [10]
				4867, -- [11]
				4867, -- [12]
				4867, -- [13]
				4867, -- [14]
				4867, -- [15]
				4867, -- [16]
				4867, -- [17]
				4867, -- [18]
				4867, -- [19]
				4867, -- [20]
				4867, -- [21]
				4867, -- [22]
				4867, -- [23]
				4867, -- [24]
				4867, -- [25]
				4867, -- [26]
				4867, -- [27]
				4867, -- [28]
				4867, -- [29]
				4867, -- [30]
				4867, -- [31]
				4867, -- [32]
				4867, -- [33]
				4867, -- [34]
				4867, -- [35]
				4867, -- [36]
				4867, -- [37]
				4867, -- [38]
				4867, -- [39]
				4867, -- [40]
				4867, -- [41]
				4867, -- [42]
				4867, -- [43]
				4867, -- [44]
				4867, -- [45]
				4867, -- [46]
				4867, -- [47]
				4867, -- [48]
				4867, -- [49]
				4757, -- [50]
			},
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
					},
					["Messages"] = {
						"静悄悄发育-火妖鲁西弗隆 多重射击 灬山河灬-逐风者 Hit -447 (Physical)", -- [1]
						"静悄悄发育-火妖鲁西弗隆 自动射击 灬山河灬-逐风者 Crit -766 (Physical)", -- [2]
						"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Hit -360 (Physical)", -- [3]
						"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Dodge (1)", -- [4]
						"神经蛙-逐风者 断筋 静悄悄发育-火妖鲁西弗隆 Hit -32 (Physical)", -- [5]
						"神经蛙-逐风者 压制 静悄悄发育-火妖鲁西弗隆 Crit -781 (Physical)", -- [6]
						"静悄悄发育-火妖鲁西弗隆 猛禽一击 神经蛙-逐风者 Crit -334 (Physical)", -- [7]
						"静悄悄发育-火妖鲁西弗隆 摔绊 神经蛙-逐风者 Hit -28 (Physical)", -- [8]
						"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Dodge (1)", -- [9]
						"静悄悄发育-火妖鲁西弗隆 肉搏 神经蛙-逐风者 Hit -39 (Physical)", -- [10]
						"初代大魔王-逐风者 火焰冲击 静悄悄发育-火妖鲁西弗隆 Hit -583 (Fire)", -- [11]
						"神经蛙-逐风者 重伤 (伤害/跳) 静悄悄发育-火妖鲁西弗隆 Tick -73 (Physical)", -- [12]
						"神经蛙-逐风者 断筋 静悄悄发育-火妖鲁西弗隆 Hit -39 (Physical)", -- [13]
						"初代大魔王-逐风者 冰霜新星 静悄悄发育-火妖鲁西弗隆 Hit -80 (Frost)", -- [14]
						"神经蛙-逐风者 压制 静悄悄发育-火妖鲁西弗隆 Crit -844 (Physical)", -- [15]
						"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Hit -386 (Physical)", -- [16]
						"初代大魔王-逐风者 冰锥术 静悄悄发育-火妖鲁西弗隆 Hit -500 (Frost)", -- [17]
						"神经蛙-逐风者 斩杀 静悄悄发育-火妖鲁西弗隆 Hit -569 (Physical)", -- [18]
						"初代大魔王-逐风者 魔爆术 静悄悄发育-火妖鲁西弗隆 Hit -278 (Arcane)", -- [19]
						"神经蛙-逐风者 重伤 (伤害/跳) 静悄悄发育-火妖鲁西弗隆 Tick -114 (Physical)", -- [20]
						"静悄悄发育-火妖鲁西弗隆死亡。", -- [21]
					},
					["DeathAt"] = 13995.204,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
					},
					["MessageTimes"] = {
						-13.70100000000093, -- [1]
						-13.41700000000128, -- [2]
						-10.36700000000019, -- [3]
						-10.31700000000092, -- [4]
						-10.20000000000073, -- [5]
						-8.700000000000728, -- [6]
						-7.067000000000917, -- [7]
						-6.884000000000015, -- [8]
						-6.516999999999825, -- [9]
						-6.217000000000553, -- [10]
						-6.033000000001266, -- [11]
						-5.667000000001281, -- [12]
						-4.533000000001266, -- [13]
						-3.983000000000175, -- [14]
						-3.033000000001266, -- [15]
						-2.717000000000553, -- [16]
						-2.467000000000553, -- [17]
						-1.515999999999622, -- [18]
						-0.9660000000003492, -- [19]
						0, -- [20]
						0, -- [21]
					},
					["HealthMax"] = {
						4867, -- [1]
						4867, -- [2]
						4867, -- [3]
						4867, -- [4]
						4867, -- [5]
						4867, -- [6]
						4867, -- [7]
						4867, -- [8]
						4867, -- [9]
						4867, -- [10]
						4867, -- [11]
						4867, -- [12]
						4867, -- [13]
						4867, -- [14]
						4867, -- [15]
						4867, -- [16]
						4867, -- [17]
						4867, -- [18]
						4867, -- [19]
						4867, -- [20]
						4867, -- [21]
					},
					["Health"] = {
						4581, -- [1]
						4581, -- [2]
						4581, -- [3]
						4221, -- [4]
						4221, -- [5]
						4189, -- [6]
						3408, -- [7]
						3408, -- [8]
						3408, -- [9]
						3408, -- [10]
						3408, -- [11]
						2825, -- [12]
						2752, -- [13]
						2713, -- [14]
						2633, -- [15]
						1789, -- [16]
						1403, -- [17]
						903, -- [18]
						334, -- [19]
						56, -- [20]
						0, -- [21]
					},
					["KilledBy"] = "神经蛙-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"MISC", -- [21]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
					},
					["Messages"] = {
						"静悄悄发育-火妖鲁西弗隆 自动射击 神经蛙-逐风者 Crit -523 (Physical)", -- [1]
						"纳格兰放牛娃-逐风者 铁皮手雷 静悄悄发育-火妖鲁西弗隆 Hit -179 (Fire)", -- [2]
						"纳格兰放牛娃-逐风者 拦截昏迷 静悄悄发育-火妖鲁西弗隆 Hit -46 (Physical)", -- [3]
						"纳格兰放牛娃-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Crit -728 (Physical)", -- [4]
						"静悄悄发育-火妖鲁西弗隆 驱散射击 纳格兰放牛娃-逐风者 Hit -120 (Physical)", -- [5]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 静悄悄发育-火妖鲁西弗隆 Tick -81 (Physical)", -- [6]
						"纳格兰放牛娃-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Hit -338 (Physical)", -- [7]
						"纳格兰放牛娃-逐风者 斩杀 静悄悄发育-火妖鲁西弗隆 Hit -516 (Physical)", -- [8]
						"静悄悄发育-火妖鲁西弗隆死亡。", -- [9]
					},
					["DeathAt"] = 13266.202,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["MessageTimes"] = {
						-13.36700000000019, -- [1]
						-9.584000000000742, -- [2]
						-6.183000000000902, -- [3]
						-5.233000000000175, -- [4]
						-4.450000000000728, -- [5]
						-2.200000000000728, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["HealthMax"] = {
						4757, -- [1]
						4757, -- [2]
						4757, -- [3]
						4757, -- [4]
						4757, -- [5]
						4757, -- [6]
						4757, -- [7]
						4757, -- [8]
						4757, -- [9]
					},
					["Health"] = {
						1612, -- [1]
						1612, -- [2]
						1433, -- [3]
						1387, -- [4]
						626, -- [5]
						0, -- [6]
						584, -- [7]
						584, -- [8]
						0, -- [9]
					},
					["KilledBy"] = "纳格兰放牛娃-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
					},
				}, -- [2]
			},
			["level"] = 60,
			["LastDamageAbility"] = "重伤 (伤害/跳)",
			["LastFightIn"] = 11,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 114,
			["TimeLast"] = {
				["Healing"] = 13366.209,
				["DeathCount"] = 13993.204,
				["DOT_Time"] = 13370.209,
				["ActiveTime"] = 14086.211,
				["TimeDamage"] = 14086.211,
				["OVERALL"] = 14086.211,
				["DamageTaken"] = 13993.204,
				["Damage"] = 14086.211,
			},
			["Owner"] = false,
			["Pet"] = {
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆>", -- [1]
			},
			["NextEventNum"] = 50,
			["LastDamageTime"] = 14086.577,
			["LastEvents"] = {
				"静悄悄发育-火妖鲁西弗隆 驱散射击 神经蛙-逐风者 Hit -120 (Physical)", -- [1]
				"静悄悄发育-火妖鲁西弗隆 自动射击 雲木彡-逐风者 Crit -580 (Physical)", -- [2]
				"静悄悄发育-火妖鲁西弗隆 自动射击 雲木彡-逐风者 Hit -232 (Physical)", -- [3]
				"静悄悄发育-火妖鲁西弗隆 瞄准射击 柠檬-逐风者 Absorb -714 (714 被吸收) (Physical)", -- [4]
				"静悄悄发育-火妖鲁西弗隆 肉搏 柠檬-逐风者 Absorb -236 (1)", -- [5]
				"静悄悄发育-火妖鲁西弗隆 自动射击 柠檬-逐风者 Hit -57 (236 被吸收) (Physical)", -- [6]
				"静悄悄发育-火妖鲁西弗隆 多重射击 柠檬-逐风者 Hit -399 (Physical)", -- [7]
				"静悄悄发育-火妖鲁西弗隆 驱散射击 一路酱-逐风者 Crit -317 (Physical)", -- [8]
				"静悄悄发育-火妖鲁西弗隆 瞄准射击 一路酱-逐风者 Hit -689 (Physical)", -- [9]
				"静悄悄发育-火妖鲁西弗隆 自动射击 一路酱-逐风者 Hit -278 (Physical)", -- [10]
				"静悄悄发育-火妖鲁西弗隆 多重射击 初代大魔王-逐风者 Hit -486 (Physical)", -- [11]
				"静悄悄发育-火妖鲁西弗隆 自动射击 初代大魔王-逐风者 Crit -793 (Physical)", -- [12]
				"静悄悄发育-火妖鲁西弗隆 驱散射击 初代大魔王-逐风者 Absorb -174 (174 被吸收) (Physical)", -- [13]
				"静悄悄发育-火妖鲁西弗隆 自动射击 初代大魔王-逐风者 Immune (Physical)", -- [14]
				"静悄悄发育-火妖鲁西弗隆 奥术射击 初代大魔王-逐风者 Hit -159 (Arcane)", -- [15]
				"静悄悄发育-火妖鲁西弗隆 自动射击 初代大魔王-逐风者 Hit -355 (Physical)", -- [16]
				"静悄悄发育-火妖鲁西弗隆 多重射击 初代大魔王-逐风者 Hit -478 (Physical)", -- [17]
				"静悄悄发育-火妖鲁西弗隆 自动射击 初代大魔王-逐风者 Hit -330 (Physical)", -- [18]
				"灬山河灬-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Hit -70 (Physical)", -- [19]
				"灬山河灬-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Hit -61 (Physical)", -- [20]
				"静悄悄发育-火妖鲁西弗隆 多重射击 灬山河灬-逐风者 Hit -447 (Physical)", -- [21]
				"静悄悄发育-火妖鲁西弗隆 自动射击 灬山河灬-逐风者 Crit -766 (Physical)", -- [22]
				"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Hit -360 (Physical)", -- [23]
				"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Dodge (1)", -- [24]
				"神经蛙-逐风者 断筋 静悄悄发育-火妖鲁西弗隆 Hit -32 (Physical)", -- [25]
				"神经蛙-逐风者 压制 静悄悄发育-火妖鲁西弗隆 Crit -781 (Physical)", -- [26]
				"静悄悄发育-火妖鲁西弗隆 猛禽一击 神经蛙-逐风者 Crit -334 (Physical)", -- [27]
				"静悄悄发育-火妖鲁西弗隆 摔绊 神经蛙-逐风者 Hit -28 (Physical)", -- [28]
				"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Dodge (1)", -- [29]
				"静悄悄发育-火妖鲁西弗隆 肉搏 神经蛙-逐风者 Hit -39 (Physical)", -- [30]
				"初代大魔王-逐风者 火焰冲击 静悄悄发育-火妖鲁西弗隆 Hit -583 (Fire)", -- [31]
				"神经蛙-逐风者 重伤 (伤害/跳) 静悄悄发育-火妖鲁西弗隆 Tick -73 (Physical)", -- [32]
				"神经蛙-逐风者 断筋 静悄悄发育-火妖鲁西弗隆 Hit -39 (Physical)", -- [33]
				"初代大魔王-逐风者 冰霜新星 静悄悄发育-火妖鲁西弗隆 Hit -80 (Frost)", -- [34]
				"神经蛙-逐风者 压制 静悄悄发育-火妖鲁西弗隆 Crit -844 (Physical)", -- [35]
				"神经蛙-逐风者 肉搏 静悄悄发育-火妖鲁西弗隆 Hit -386 (Physical)", -- [36]
				"初代大魔王-逐风者 冰锥术 静悄悄发育-火妖鲁西弗隆 Hit -500 (Frost)", -- [37]
				"神经蛙-逐风者 斩杀 静悄悄发育-火妖鲁西弗隆 Hit -569 (Physical)", -- [38]
				"初代大魔王-逐风者 魔爆术 静悄悄发育-火妖鲁西弗隆 Hit -278 (Arcane)", -- [39]
				"神经蛙-逐风者 重伤 (伤害/跳) 静悄悄发育-火妖鲁西弗隆 Tick -114 (Physical)", -- [40]
				"静悄悄发育-火妖鲁西弗隆死亡。", -- [41]
				"静悄悄发育-火妖鲁西弗隆 多重射击 老白鲨-逐风者 Hit -377 (Physical)", -- [42]
				"静悄悄发育-火妖鲁西弗隆 肉搏 雲木彡-逐风者 Absorb -727 (1)", -- [43]
				"静悄悄发育-火妖鲁西弗隆 多重射击 雲木彡-逐风者 Crit -129 (727 被吸收) (Physical)", -- [44]
				"静悄悄发育-火妖鲁西弗隆 自动射击 雲木彡-逐风者 Hit -274 (Physical)", -- [45]
				"静悄悄发育-火妖鲁西弗隆 自动射击 雲木彡-逐风者 Hit -250 (Physical)", -- [46]
				"静悄悄发育-火妖鲁西弗隆 自动射击 雲木彡-逐风者 Hit -254 (Physical)", -- [47]
				"静悄悄发育-火妖鲁西弗隆 自动射击 雲木彡-逐风者 Hit -256 (Physical)", -- [48]
				"静悄悄发育-火妖鲁西弗隆 多重射击 雲木彡-逐风者 Crit -849 (Physical)", -- [49]
				"静悄悄发育-火妖鲁西弗隆 自动射击 雲木彡-逐风者 Hit -199 (Physical)", -- [50]
			},
			["Name"] = "静悄悄发育-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13382.41, -- [1]
				13387.077, -- [2]
				13390.194, -- [3]
				13446.265, -- [4]
				13449.382, -- [5]
				13449.382, -- [6]
				13449.415, -- [7]
				13449.848, -- [8]
				13455.749, -- [9]
				13456.116, -- [10]
				13947.434, -- [11]
				13947.718, -- [12]
				13949.151, -- [13]
				13953.901, -- [14]
				13956.068, -- [15]
				13956.985, -- [16]
				13959.118, -- [17]
				13961.769, -- [18]
				13975.336, -- [19]
				13975.686, -- [20]
				13980.053, -- [21]
				13980.337, -- [22]
				13983.387, -- [23]
				13983.437, -- [24]
				13983.554, -- [25]
				13985.054, -- [26]
				13986.687, -- [27]
				13986.87, -- [28]
				13987.237, -- [29]
				13987.537, -- [30]
				13987.721, -- [31]
				13988.087, -- [32]
				13989.221, -- [33]
				13989.771, -- [34]
				13990.721, -- [35]
				13991.037, -- [36]
				13991.287, -- [37]
				13992.238, -- [38]
				13992.788, -- [39]
				13993.754, -- [40]
				13993.754, -- [41]
				14073.827, -- [42]
				14073.96, -- [43]
				14073.96, -- [44]
				14074.043, -- [45]
				14080.094, -- [46]
				14083.01, -- [47]
				14085.961, -- [48]
				14086.577, -- [49]
				13381.56, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 3116,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 727,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 727,
						["Physical"] = 2389,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1034,
								},
								["多重射击"] = {
									["count"] = 978,
								},
								["肉搏"] = {
									["count"] = 727,
								},
							},
							["amount"] = 2739,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 377,
								},
							},
							["amount"] = 377,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 4.58,
								},
								["多重射击"] = {
									["count"] = 0.62,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 5.33,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6.83,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["自动射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 274,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1034,
								},
							},
							["count"] = 4,
							["amount"] = 1034,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 849,
									["min"] = 129,
									["count"] = 2,
									["amount"] = 978,
								},
								["Hit"] = {
									["max"] = 377,
									["min"] = 377,
									["count"] = 1,
									["amount"] = 377,
								},
							},
							["count"] = 3,
							["amount"] = 1355,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 727,
									["min"] = 727,
									["count"] = 1,
									["amount"] = 727,
								},
							},
							["count"] = 1,
							["amount"] = 727,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 6.83,
					["TimeDamaging"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 4.58,
								},
								["多重射击"] = {
									["count"] = 0.62,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 5.33,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["灬山河灬-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["TimeSpent"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.03,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.03,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 4.2,
								},
								["多重射击"] = {
									["count"] = 3,
								},
								["驱散射击"] = {
									["count"] = 1.43,
								},
							},
							["amount"] = 10.13,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 1.75,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 1.5,
								},
								["摔绊"] = {
									["count"] = 0.18,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 0.85,
								},
								["肉搏"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 4.7,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 7.68,
								},
								["多重射击"] = {
									["count"] = 2.12,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 11.43,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.37,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 0.43,
								},
							},
							["amount"] = 2.3,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 5.25,
								},
								["自动射击"] = {
									["count"] = 4.78,
								},
								["多重射击"] = {
									["count"] = 2.02,
								},
								["奥术射击"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 12.62,
						},
					},
					["DamageTaken"] = 9010,
					["ElementDoneAbsorb"] = {
						["Physical"] = 1851,
					},
					["PartialResist"] = {
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["鬼魅攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 16,
						},
					},
					["DeathCount"] = 2,
					["PartialAbsorb"] = {
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["鬼魅攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 50.46000000000001,
					["ElementTaken"] = {
						["Physical"] = 4049,
						["Melee"] = 3341,
						["Arcane"] = 278,
						["Fire"] = 762,
						["Frost"] = 580,
					},
					["DOT_Time"] = 15,
					["Damage"] = 16321,
					["Healing"] = 0,
					["ElementDone"] = {
						["Arcane"] = 357,
						["Physical"] = 14457,
						["Melee"] = 1002,
						["Nature"] = 505,
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 27,
								},
							},
							["amount"] = 39,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["DamagedWho"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 399,
								},
								["自动射击"] = {
									["count"] = 57,
								},
								["瞄准射击"] = {
									["count"] = 714,
								},
								["肉搏"] = {
									["count"] = 236,
								},
							},
							["amount"] = 1406,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 159,
								},
								["自动射击"] = {
									["count"] = 1478,
								},
								["多重射击"] = {
									["count"] = 964,
								},
								["驱散射击"] = {
									["count"] = 174,
								},
							},
							["amount"] = 2775,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 513,
								},
								["自动射击"] = {
									["count"] = 369,
								},
							},
							["amount"] = 882,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 334,
								},
								["摔绊"] = {
									["count"] = 28,
								},
								["自动射击"] = {
									["count"] = 523,
								},
								["驱散射击"] = {
									["count"] = 120,
								},
								["肉搏"] = {
									["count"] = 39,
								},
							},
							["amount"] = 1044,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 377,
								},
								["自动射击"] = {
									["count"] = 257,
								},
							},
							["amount"] = 634,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 120,
								},
								["自动射击"] = {
									["count"] = 2045,
								},
								["多重射击"] = {
									["count"] = 1247,
								},
								["肉搏"] = {
									["count"] = 727,
								},
							},
							["amount"] = 4139,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 278,
								},
								["瞄准射击"] = {
									["count"] = 689,
								},
								["驱散射击"] = {
									["count"] = 317,
								},
							},
							["amount"] = 1284,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 505,
								},
								["自动射击"] = {
									["count"] = 1770,
								},
								["多重射击"] = {
									["count"] = 1564,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 4037,
						},
					},
					["TimeDamage"] = 50.46000000000001,
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.03,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.03,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 4.2,
								},
								["多重射击"] = {
									["count"] = 3,
								},
								["驱散射击"] = {
									["count"] = 1.43,
								},
							},
							["amount"] = 10.13,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 1.75,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 1.5,
								},
								["摔绊"] = {
									["count"] = 0.18,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 0.85,
								},
								["肉搏"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 4.7,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 7.68,
								},
								["多重射击"] = {
									["count"] = 2.12,
								},
								["肉搏"] = {
									["count"] = 0.13,
								},
							},
							["amount"] = 11.43,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.37,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["驱散射击"] = {
									["count"] = 0.43,
								},
							},
							["amount"] = 2.3,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 5.25,
								},
								["自动射击"] = {
									["count"] = 4.78,
								},
								["多重射击"] = {
									["count"] = 2.02,
								},
								["奥术射击"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 12.62,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 27,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 16,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Attacks"] = {
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["自动射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 793,
									["min"] = 523,
									["count"] = 4,
									["amount"] = 2662,
								},
								["Hit"] = {
									["max"] = 369,
									["min"] = 57,
									["count"] = 15,
									["amount"] = 4115,
								},
							},
							["count"] = 20,
							["amount"] = 6777,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 689,
									["min"] = 689,
									["count"] = 1,
									["amount"] = 689,
								},
								["Absorb"] = {
									["max"] = 714,
									["min"] = 714,
									["count"] = 1,
									["amount"] = 714,
								},
							},
							["count"] = 2,
							["amount"] = 1403,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 5,
									["amount"] = 505,
								},
							},
							["count"] = 5,
							["amount"] = 505,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 198,
									["min"] = 159,
									["count"] = 2,
									["amount"] = 357,
								},
							},
							["count"] = 2,
							["amount"] = 357,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 334,
									["min"] = 334,
									["count"] = 1,
									["amount"] = 334,
								},
							},
							["count"] = 1,
							["amount"] = 334,
						},
						["驱散射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 174,
									["min"] = 174,
									["count"] = 1,
									["amount"] = 174,
								},
								["Crit"] = {
									["max"] = 317,
									["min"] = 317,
									["count"] = 1,
									["amount"] = 317,
								},
								["Hit"] = {
									["max"] = 120,
									["min"] = 120,
									["count"] = 3,
									["amount"] = 360,
								},
							},
							["count"] = 5,
							["amount"] = 851,
						},
						["多重射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1117,
									["min"] = 129,
									["count"] = 3,
									["amount"] = 2095,
								},
								["Hit"] = {
									["max"] = 513,
									["min"] = 269,
									["count"] = 7,
									["amount"] = 2969,
								},
							},
							["count"] = 10,
							["amount"] = 5064,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
								["Absorb"] = {
									["max"] = 727,
									["min"] = 236,
									["count"] = 2,
									["amount"] = 963,
								},
							},
							["count"] = 3,
							["amount"] = 1002,
						},
					},
					["WhoDamaged"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["鬼魅攻击"] = {
									["count"] = 153,
								},
								["凿击"] = {
									["count"] = 117,
								},
								["肉搏"] = {
									["count"] = 586,
								},
							},
							["amount"] = 856,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 278,
								},
								["冰锥术"] = {
									["count"] = 500,
								},
								["冰霜新星"] = {
									["count"] = 80,
								},
								["火焰冲击"] = {
									["count"] = 583,
								},
							},
							["amount"] = 1441,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 300,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 201,
								},
								["断筋"] = {
									["count"] = 138,
								},
								["拦截昏迷"] = {
									["count"] = 45,
								},
								["肉搏"] = {
									["count"] = 943,
								},
							},
							["amount"] = 1627,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1625,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 187,
								},
								["断筋"] = {
									["count"] = 71,
								},
								["斩杀"] = {
									["count"] = 569,
								},
								["肉搏"] = {
									["count"] = 746,
								},
							},
							["amount"] = 3198,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 81,
								},
								["斩杀"] = {
									["count"] = 516,
								},
								["拦截昏迷"] = {
									["count"] = 46,
								},
								["铁皮手雷"] = {
									["count"] = 179,
								},
								["肉搏"] = {
									["count"] = 1066,
								},
							},
							["amount"] = 1888,
						},
					},
				},
			},
			["UnitLockout"] = 13955.202,
			["LastActive"] = 14086.211,
		},
		["理想三旬丶-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02E89B96",
			["LastEventHealth"] = {
				676, -- [1]
				676, -- [2]
				676, -- [3]
				2980, -- [4]
				2980, -- [5]
				2739, -- [6]
				1222, -- [7]
				1095, -- [8]
				1095, -- [9]
				598, -- [10]
				11, -- [11]
				0, -- [12]
				2980, -- [13]
				2980, -- [14]
				2980, -- [15]
				2980, -- [16]
				2980, -- [17]
				2980, -- [18]
				2980, -- [19]
				2980, -- [20]
				2980, -- [21]
				2980, -- [22]
				2980, -- [23]
				2980, -- [24]
				2980, -- [25]
				2980, -- [26]
				606, -- [27]
				532, -- [28]
				532, -- [29]
				580, -- [30]
				596, -- [31]
				596, -- [32]
				596, -- [33]
				596, -- [34]
				596, -- [35]
				612, -- [36]
				612, -- [37]
				612, -- [38]
				612, -- [39]
				612, -- [40]
				612, -- [41]
				628, -- [42]
				628, -- [43]
				628, -- [44]
				628, -- [45]
				628, -- [46]
				676, -- [47]
				676, -- [48]
				676, -- [49]
				676, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"MISC", -- [12]
				"DAMAGE", -- [13]
				"MISC", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					18, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["DamageTaken"] = {
					8433, -- [1]
				},
				["Absorbs"] = {
					2912, -- [1]
				},
				["HealingTaken"] = {
					3606, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					86.61999999999999, -- [1]
				},
				["ActiveTime"] = {
					104.62, -- [1]
				},
				["ManaGain"] = {
					1098, -- [1]
				},
				["DOT_Time"] = {
					54, -- [1]
				},
				["Damage"] = {
					30260, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
					},
					["Messages"] = {
						"理想三旬丶-火妖鲁西弗隆 冰霜新星 柠檬-逐风者 Hit -88 (Frost)", -- [1]
						"柠檬-逐风者 暗影守卫 理想三旬丶-火妖鲁西弗隆 Hit -241 (Shadow)", -- [2]
						"时间的小溪-逐风者 伏击 理想三旬丶-火妖鲁西弗隆 Crit -1517 (Physical)", -- [3]
						"时间的小溪-逐风者 肉搏 理想三旬丶-火妖鲁西弗隆 Hit -127 (Physical)", -- [4]
						"时间的小溪-逐风者 肉搏 理想三旬丶-火妖鲁西弗隆 Miss (1)", -- [5]
						"时间的小溪-逐风者 背刺 理想三旬丶-火妖鲁西弗隆 Hit -497 (Physical)", -- [6]
						"妖儿-逐风者 火焰冲击 理想三旬丶-火妖鲁西弗隆 Hit -587 (Fire)", -- [7]
						"雲木彡-逐风者 断筋 理想三旬丶-火妖鲁西弗隆 Hit -40 (Physical)", -- [8]
						"理想三旬丶-火妖鲁西弗隆死亡。", -- [9]
					},
					["DeathAt"] = 13567.207,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
					},
					["MessageTimes"] = {
						-7.134000000000015, -- [1]
						-6.900000000001455, -- [2]
						-3.850000000000364, -- [3]
						-3.75, -- [4]
						-2.850000000000364, -- [5]
						-2.833000000000538, -- [6]
						-2.650000000001455, -- [7]
						-0.01699999999982538, -- [8]
						0, -- [9]
					},
					["HealthMax"] = {
						2980, -- [1]
						2980, -- [2]
						2980, -- [3]
						2980, -- [4]
						2980, -- [5]
						2980, -- [6]
						2980, -- [7]
						2980, -- [8]
						2980, -- [9]
					},
					["Health"] = {
						2980, -- [1]
						2980, -- [2]
						2739, -- [3]
						1222, -- [4]
						1095, -- [5]
						1095, -- [6]
						598, -- [7]
						11, -- [8]
						0, -- [9]
					},
					["KilledBy"] = "雲木彡-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "断筋",
			["LastFightIn"] = 9,
			["type"] = "Grouped",
			["LastDamageTaken"] = 40,
			["LastHealTime"] = 13482.651,
			["TimeLast"] = {
				["TimeHeal"] = 13482.201,
				["Dispelled"] = 13084.205,
				["OVERALL"] = 13863.212,
				["DamageTaken"] = 13565.207,
				["Absorbs"] = 13482.201,
				["HealingTaken"] = 13482.201,
				["DeathCount"] = 13565.207,
				["ActiveTime"] = 13863.212,
				["TimeDamage"] = 13863.212,
				["ManaGain"] = 13371.21,
				["DOT_Time"] = 13498.202,
				["Damage"] = 13863.212,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2980, -- [1]
				2980, -- [2]
				2980, -- [3]
				2980, -- [4]
				2980, -- [5]
				2980, -- [6]
				2980, -- [7]
				2980, -- [8]
				2980, -- [9]
				2980, -- [10]
				2980, -- [11]
				2980, -- [12]
				2980, -- [13]
				2980, -- [14]
				2980, -- [15]
				2980, -- [16]
				2980, -- [17]
				2980, -- [18]
				2980, -- [19]
				2980, -- [20]
				2980, -- [21]
				2980, -- [22]
				2980, -- [23]
				2980, -- [24]
				2980, -- [25]
				2980, -- [26]
				2980, -- [27]
				2980, -- [28]
				2980, -- [29]
				2980, -- [30]
				2980, -- [31]
				2980, -- [32]
				2980, -- [33]
				2980, -- [34]
				2980, -- [35]
				2980, -- [36]
				2980, -- [37]
				2980, -- [38]
				2980, -- [39]
				2980, -- [40]
				2980, -- [41]
				2980, -- [42]
				2980, -- [43]
				2980, -- [44]
				2980, -- [45]
				2980, -- [46]
				2980, -- [47]
				2980, -- [48]
				2980, -- [49]
				2980, -- [50]
			},
			["NextEventNum"] = 20,
			["LastDamageTime"] = 13864.028,
			["LastEvents"] = {
				"理想三旬丶-火妖鲁西弗隆 冰锥术 时间的小溪-逐风者 Hit -420 (Frost)", -- [1]
				"理想三旬丶-火妖鲁西弗隆 冰锥术 雲木彡-逐风者 Hit -420 (Frost)", -- [2]
				"理想三旬丶-火妖鲁西弗隆 冰霜新星 时间的小溪-逐风者 Hit -92 (Frost)", -- [3]
				"理想三旬丶-火妖鲁西弗隆 冰霜新星 柠檬-逐风者 Hit -88 (Frost)", -- [4]
				"柠檬-逐风者 暗影守卫 理想三旬丶-火妖鲁西弗隆 Hit -241 (Shadow)", -- [5]
				"时间的小溪-逐风者 伏击 理想三旬丶-火妖鲁西弗隆 Crit -1517 (Physical)", -- [6]
				"时间的小溪-逐风者 肉搏 理想三旬丶-火妖鲁西弗隆 Hit -127 (Physical)", -- [7]
				"时间的小溪-逐风者 肉搏 理想三旬丶-火妖鲁西弗隆 Miss (1)", -- [8]
				"时间的小溪-逐风者 背刺 理想三旬丶-火妖鲁西弗隆 Hit -497 (Physical)", -- [9]
				"妖儿-逐风者 火焰冲击 理想三旬丶-火妖鲁西弗隆 Hit -587 (Fire)", -- [10]
				"雲木彡-逐风者 断筋 理想三旬丶-火妖鲁西弗隆 Hit -40 (Physical)", -- [11]
				"理想三旬丶-火妖鲁西弗隆死亡。", -- [12]
				"理想三旬丶-火妖鲁西弗隆 寒冰箭 初代大魔王-逐风者 Hit -78 (Frost)", -- [13]
				"初代大魔王-逐风者 interrupts 理想三旬丶-火妖鲁西弗隆 寒冰箭 (法术反制)", -- [14]
				"理想三旬丶-火妖鲁西弗隆 火焰冲击 蓝色空间号-逐风者 Hit -630 (Fire)", -- [15]
				"理想三旬丶-火妖鲁西弗隆 冰锥术 蓝色空间号-逐风者 Hit -433 (Frost)", -- [16]
				"理想三旬丶-火妖鲁西弗隆 冰霜新星 蓝色空间号-逐风者 Absorb -93 (93 被吸收) (Frost)", -- [17]
				"理想三旬丶-火妖鲁西弗隆 魔爆术 蓝色空间号-逐风者 Crit -453 (Arcane)", -- [18]
				"理想三旬丶-火妖鲁西弗隆 火焰冲击 初代大魔王-逐风者 Hit -607 (Fire)", -- [19]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 雲木彡-逐风者 Tick -41 (Frost)", -- [20]
				"理想三旬丶-火妖鲁西弗隆 寒冰箭 神经蛙-逐风者 Hit -752 (Frost)", -- [21]
				"理想三旬丶-火妖鲁西弗隆 寒冰箭 神经蛙-逐风者 Hit -764 (Frost)", -- [22]
				"理想三旬丶-火妖鲁西弗隆 火焰冲击 神经蛙-逐风者 Hit -570 (Fire)", -- [23]
				"蓝色空间号-逐风者 暗言术：痛 (伤害/跳) 理想三旬丶-火妖鲁西弗隆 Absorb -174 (174 被吸收) (Shadow)", -- [24]
				"蓝色空间号-逐风者 肉搏 理想三旬丶-火妖鲁西弗隆 Absorb -162 (1)", -- [25]
				"蓝色空间号-逐风者 暗言术：痛 (伤害/跳) 理想三旬丶-火妖鲁西弗隆 Tick -17 (162 被吸收) (Shadow)", -- [26]
				"神经蛙-逐风者 重伤 (伤害/跳) 理想三旬丶-火妖鲁西弗隆 Tick -74 (Physical)", -- [27]
				"柠檬-逐风者 暗言术：痛 (伤害/跳) 理想三旬丶-火妖鲁西弗隆 Absorb -250 (250 被吸收) (Shadow)", -- [28]
				"神经蛙-逐风者 重伤 (伤害/跳) 理想三旬丶-火妖鲁西弗隆 Absorb -74 (74 被吸收) (Physical)", -- [29]
				"理想三旬丶-火妖鲁西弗隆 寒冰箭 神经蛙-逐风者 Hit -752 (Frost)", -- [30]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 雲木彡-逐风者 Tick -189 (Frost)", -- [31]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 一路酱-逐风者 Tick -155 (Frost)", -- [32]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 柠檬-逐风者 Tick -172 (Frost)", -- [33]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 柠檬-逐风者 Tick -172 (Frost)", -- [34]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 一路酱-逐风者 Tick -154 (Frost)", -- [35]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 雲木彡-逐风者 Tick -189 (Frost)", -- [36]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 一路酱-逐风者 Tick -155 (Frost)", -- [37]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 柠檬-逐风者 Tick -172 (Frost)", -- [38]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 一路酱-逐风者 Tick -154 (Frost)", -- [39]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 雲木彡-逐风者 Tick -189 (Frost)", -- [40]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 柠檬-逐风者 Tick -172 (Frost)", -- [41]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 一路酱-逐风者 Tick -155 (Frost)", -- [42]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 雲木彡-逐风者 Tick -189 (Frost)", -- [43]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 雲木彡-逐风者 Tick -189 (Frost)", -- [44]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 柠檬-逐风者 Tick -172 (Frost)", -- [45]
				"理想三旬丶-火妖鲁西弗隆 暴风雪 (伤害/跳) 一路酱-逐风者 Tick -116 (43 被抵抗) (Frost)", -- [46]
				"理想三旬丶-火妖鲁西弗隆 寒冰箭 雲木彡-逐风者 Hit -744 (Frost)", -- [47]
				"理想三旬丶-火妖鲁西弗隆 寒冰箭 雲木彡-逐风者 Hit -770 (Frost)", -- [48]
				"理想三旬丶-火妖鲁西弗隆 火焰冲击 时间的小溪-逐风者 Crit -850 (Fire)", -- [49]
				"理想三旬丶-火妖鲁西弗隆 肉搏 时间的小溪-逐风者 Hit -89 (Physical)", -- [50]
			},
			["Name"] = "理想三旬丶-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13511.319, -- [1]
				13511.319, -- [2]
				13513.136, -- [3]
				13558.906, -- [4]
				13559.14, -- [5]
				13562.19, -- [6]
				13562.29, -- [7]
				13563.19, -- [8]
				13563.207, -- [9]
				13563.39, -- [10]
				13566.023, -- [11]
				13566.04, -- [12]
				13827.809, -- [13]
				13828.377, -- [14]
				13843.744, -- [15]
				13845.677, -- [16]
				13847.344, -- [17]
				13848.861, -- [18]
				13864.028, -- [19]
				13379.2, -- [20]
				13385.744, -- [21]
				13388.327, -- [22]
				13388.377, -- [23]
				13471.417, -- [24]
				13474.417, -- [25]
				13474.417, -- [26]
				13479.651, -- [27]
				13479.901, -- [28]
				13482.651, -- [29]
				13489.101, -- [30]
				13493.935, -- [31]
				13493.935, -- [32]
				13493.935, -- [33]
				13494.935, -- [34]
				13494.935, -- [35]
				13495.935, -- [36]
				13495.935, -- [37]
				13495.935, -- [38]
				13496.918, -- [39]
				13496.918, -- [40]
				13496.918, -- [41]
				13497.918, -- [42]
				13497.918, -- [43]
				13498.919, -- [44]
				13498.919, -- [45]
				13498.919, -- [46]
				13505.769, -- [47]
				13508.403, -- [48]
				13509.153, -- [49]
				13511.253, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["雲木彡-逐风者"] = {
									["count"] = 21,
								},
								["一路酱-逐风者"] = {
									["count"] = 18,
								},
								["柠檬-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 54,
						},
					},
					["ElementDoneResist"] = {
						["Frost"] = 43,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 12,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 9,
						},
						["Frost"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoHealed"] = {
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 2912,
								},
							},
							["amount"] = 2912,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 694,
								},
							},
							["amount"] = 694,
						},
					},
					["ElementDoneAbsorb"] = {
						["Frost"] = 1182,
					},
					["Absorbs"] = 2912,
					["DeathCount"] = 1,
					["ElementTaken"] = {
						["Shadow"] = 899,
						["Melee"] = 2019,
						["Fire"] = 1139,
						["Physical"] = 4240,
						["Frost"] = 136,
					},
					["DOT_Time"] = 54,
					["Damage"] = 30260,
					["TimeHeal"] = 18,
					["ElementDone"] = {
						["Frost"] = 18375,
						["Fire"] = 6556,
						["Melee"] = 675,
						["Arcane"] = 4654,
					},
					["DamagedWho"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 860,
								},
								["冰霜新星"] = {
									["count"] = 278,
								},
								["魔爆术"] = {
									["count"] = 1491,
								},
								["寒冰箭"] = {
									["count"] = 1685,
								},
								["冰锥术"] = {
									["count"] = 417,
								},
								["肉搏"] = {
									["count"] = 586,
								},
							},
							["amount"] = 5317,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 607,
								},
								["寒冰箭"] = {
									["count"] = 78,
								},
							},
							["amount"] = 685,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 87,
								},
								["魔爆术"] = {
									["count"] = 294,
								},
								["寒冰箭"] = {
									["count"] = 759,
								},
								["火焰冲击"] = {
									["count"] = 924,
								},
								["冰锥术"] = {
									["count"] = 837,
								},
							},
							["amount"] = 2901,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 761,
								},
							},
							["amount"] = 761,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 425,
								},
								["寒冰箭"] = {
									["count"] = 3029,
								},
								["火焰冲击"] = {
									["count"] = 1150,
								},
								["冰霜新星"] = {
									["count"] = 105,
								},
							},
							["amount"] = 4709,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 658,
								},
								["寒冰箭"] = {
									["count"] = 838,
								},
								["火焰冲击"] = {
									["count"] = 660,
								},
								["冰锥术"] = {
									["count"] = 476,
								},
							},
							["amount"] = 2632,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 757,
								},
								["冰霜新星"] = {
									["count"] = 93,
								},
								["冰锥术"] = {
									["count"] = 433,
								},
								["火焰冲击"] = {
									["count"] = 630,
								},
							},
							["amount"] = 1913,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 89,
								},
								["冰霜新星"] = {
									["count"] = 182,
								},
								["魔爆术"] = {
									["count"] = 590,
								},
								["寒冰箭"] = {
									["count"] = 78,
								},
								["火焰冲击"] = {
									["count"] = 850,
								},
								["冰锥术"] = {
									["count"] = 1269,
								},
							},
							["amount"] = 3058,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 330,
								},
								["寒冰箭"] = {
									["count"] = 825,
								},
								["冰霜新星"] = {
									["count"] = 98,
								},
							},
							["amount"] = 1253,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1027,
								},
								["寒冰箭"] = {
									["count"] = 1514,
								},
								["冰锥术"] = {
									["count"] = 420,
								},
							},
							["amount"] = 2961,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 534,
								},
								["暴风雪 (伤害/跳)"] = {
									["count"] = 889,
								},
								["火焰冲击"] = {
									["count"] = 534,
								},
							},
							["amount"] = 1957,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 624,
								},
								["寒冰箭"] = {
									["count"] = 912,
								},
							},
							["amount"] = 1536,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 577,
								},
							},
							["amount"] = 577,
						},
					},
					["WhoDamaged"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 191,
								},
								["肉搏"] = {
									["count"] = 162,
								},
							},
							["amount"] = 353,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 250,
								},
								["暗影守卫"] = {
									["count"] = 458,
								},
							},
							["amount"] = 708,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1942,
								},
								["伏击"] = {
									["count"] = 2072,
								},
								["铁皮手雷"] = {
									["count"] = 141,
								},
								["肉搏"] = {
									["count"] = 1367,
								},
							},
							["amount"] = 5522,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 411,
								},
								["冰霜新星"] = {
									["count"] = 136,
								},
							},
							["amount"] = 547,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 148,
								},
								["肉搏"] = {
									["count"] = 131,
								},
							},
							["amount"] = 279,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 587,
								},
							},
							["amount"] = 587,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 359,
								},
								["断筋"] = {
									["count"] = 38,
								},
							},
							["amount"] = 397,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["理想三旬丶-火妖鲁西弗隆"] = {
									["max"] = 857,
									["min"] = 67,
									["count"] = 12,
									["amount"] = 2912,
								},
							},
							["count"] = 12,
							["amount"] = 2912,
						},
					},
					["TimeHealing"] = {
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
					},
					["Dispelled"] = 1,
					["PartialResist"] = {
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["伏击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
					},
					["ManaGained"] = {
						["补充法力"] = {
							["Details"] = {
								["理想三旬丶-火妖鲁西弗隆"] = {
									["count"] = 1098,
								},
							},
							["amount"] = 1098,
						},
					},
					["PartialAbsorb"] = {
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 69,
									["min"] = 67,
									["count"] = 2,
									["amount"] = 136,
								},
							},
							["count"] = 3,
							["amount"] = 136,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 74,
									["min"] = 74,
									["count"] = 1,
									["amount"] = 74,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 74,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 217,
									["min"] = 217,
									["count"] = 1,
									["amount"] = 217,
								},
							},
							["count"] = 2,
							["amount"] = 217,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 250,
									["min"] = 162,
									["count"] = 3,
									["amount"] = 586,
								},
							},
							["count"] = 3,
							["amount"] = 586,
						},
						["伏击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 857,
									["min"] = 857,
									["count"] = 1,
									["amount"] = 857,
								},
							},
							["count"] = 2,
							["amount"] = 857,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 411,
									["min"] = 411,
									["count"] = 1,
									["amount"] = 411,
								},
							},
							["count"] = 2,
							["amount"] = 411,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 141,
									["min"] = 141,
									["count"] = 1,
									["amount"] = 141,
								},
							},
							["count"] = 2,
							["amount"] = 141,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 359,
									["min"] = 131,
									["count"] = 2,
									["amount"] = 490,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 490,
						},
					},
					["ActiveTime"] = 104.62,
					["WhoDispelled"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["法术反制 - 沉默 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 857,
									["min"] = 67,
									["count"] = 12,
									["amount"] = 2912,
								},
							},
							["count"] = 12,
							["amount"] = 2912,
						},
					},
					["ManaGainedFrom"] = {
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["补充法力"] = {
									["count"] = 1098,
								},
							},
							["amount"] = 1098,
						},
					},
					["TimeSpent"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 6,
								},
								["火焰冲击"] = {
									["count"] = 1.4,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.4,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.49,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.49,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.48,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 3,
								},
								["魔爆术"] = {
									["count"] = 2.98,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.75,
								},
								["冰锥术"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 12.8,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.01,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.01,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 0.25,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.75,
						},
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 18,
								},
							},
							["amount"] = 18,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1,
								},
								["冰霜新星"] = {
									["count"] = 4.5,
								},
								["魔爆术"] = {
									["count"] = 1.52,
								},
								["寒冰箭"] = {
									["count"] = 1.67,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 11.69,
						},
					},
					["HealedWho"] = {
						["理想三旬丶-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 2912,
								},
							},
							["amount"] = 2912,
						},
					},
					["Attacks"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 189,
									["min"] = 41,
									["count"] = 18,
									["amount"] = 2776,
								},
							},
							["count"] = 18,
							["amount"] = 2776,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 89,
									["min"] = 89,
									["count"] = 1,
									["amount"] = 89,
								},
								["Absorb"] = {
									["max"] = 586,
									["min"] = 586,
									["count"] = 1,
									["amount"] = 586,
								},
							},
							["count"] = 2,
							["amount"] = 675,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 93,
									["min"] = 87,
									["count"] = 2,
									["amount"] = 180,
								},
								["Hit"] = {
									["max"] = 105,
									["min"] = 88,
									["count"] = 7,
									["amount"] = 663,
								},
							},
							["count"] = 9,
							["amount"] = 843,
						},
						["魔爆术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 453,
									["min"] = 453,
									["count"] = 1,
									["amount"] = 453,
								},
								["Hit"] = {
									["max"] = 338,
									["min"] = 266,
									["count"] = 14,
									["amount"] = 4201,
								},
							},
							["count"] = 15,
							["amount"] = 4654,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 151,
									["min"] = 151,
									["count"] = 1,
									["amount"] = 151,
								},
								["Hit"] = {
									["max"] = 838,
									["min"] = 78,
									["count"] = 16,
									["amount"] = 10328,
								},
							},
							["count"] = 17,
							["amount"] = 10479,
						},
						["冰锥术"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 416,
									["min"] = 416,
									["count"] = 1,
									["amount"] = 416,
								},
								["Hit"] = {
									["max"] = 476,
									["min"] = 417,
									["count"] = 9,
									["amount"] = 3861,
								},
							},
							["count"] = 10,
							["amount"] = 4277,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 924,
									["min"] = 850,
									["count"] = 2,
									["amount"] = 1774,
								},
								["Hit"] = {
									["max"] = 660,
									["min"] = 534,
									["count"] = 8,
									["amount"] = 4782,
								},
							},
							["count"] = 10,
							["amount"] = 6556,
						},
					},
					["HealingTaken"] = 3606,
					["ElementTakenAbsorb"] = {
						["Shadow"] = 803,
						["Melee"] = 490,
						["Fire"] = 552,
						["Physical"] = 931,
						["Frost"] = 136,
					},
					["TimeDamage"] = 86.61999999999999,
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1,
								},
								["冰霜新星"] = {
									["count"] = 4.5,
								},
								["魔爆术"] = {
									["count"] = 1.52,
								},
								["寒冰箭"] = {
									["count"] = 1.67,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 11.69,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 0.25,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.75,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 6,
								},
								["火焰冲击"] = {
									["count"] = 1.4,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 10.4,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.49,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.49,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 3,
								},
								["魔爆术"] = {
									["count"] = 2.98,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.75,
								},
								["冰锥术"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 12.8,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 6.01,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9.01,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 3,
								},
								["暴风雪 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.48,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
								["寒冰箭"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 1098,
					["DamageTaken"] = 8433,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 18,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 32,
								},
							},
							["amount"] = 54,
						},
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 8,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 15,
						},
					},
				},
			},
			["UnitLockout"] = 12991.199,
			["LastActive"] = 13863.212,
		},
		["浪呵呵发育 <静悄悄发育-火妖鲁西弗隆>"] = {
			["GUID"] = "Pet-0-5427-529-22362-682-02011B672C",
			["LastEventHealth"] = {
				3197, -- [1]
				3197, -- [2]
				3197, -- [3]
				3197, -- [4]
				3197, -- [5]
				3197, -- [6]
				3197, -- [7]
				3197, -- [8]
				3197, -- [9]
				3197, -- [10]
				3197, -- [11]
				3197, -- [12]
				3197, -- [13]
				3197, -- [14]
				3197, -- [15]
				3129, -- [16]
				3129, -- [17]
				3197, -- [18]
				3197, -- [19]
				3197, -- [20]
				3197, -- [21]
				3197, -- [22]
				3197, -- [23]
				3164, -- [24]
				3164, -- [25]
			},
			["LastAttackedBy"] = "初代大魔王-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					17.03, -- [1]
				},
				["Damage"] = {
					819, -- [1]
				},
				["DamageTaken"] = {
					134, -- [1]
				},
				["ActiveTime"] = {
					17.03, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "浪呵呵发育",
			["level"] = 1,
			["LastDamageAbility"] = "暴风雪 (伤害/跳)",
			["LastFightIn"] = 10,
			["type"] = "Pet",
			["ownerName"] = "静悄悄发育-火妖鲁西弗隆",
			["LastDamageTaken"] = 33,
			["TimeLast"] = {
				["ActiveTime"] = 13980.203,
				["TimeDamage"] = 13980.203,
				["OVERALL"] = 13981.203,
				["DamageTaken"] = 13981.203,
				["Damage"] = 13979.203,
			},
			["LastEventHealthMax"] = {
				3197, -- [1]
				3197, -- [2]
				3197, -- [3]
				3197, -- [4]
				3197, -- [5]
				3197, -- [6]
				3197, -- [7]
				3197, -- [8]
				3197, -- [9]
				3197, -- [10]
				3197, -- [11]
				3197, -- [12]
				3197, -- [13]
				3197, -- [14]
				3197, -- [15]
				3197, -- [16]
				3197, -- [17]
				3197, -- [18]
				3197, -- [19]
				3197, -- [20]
				3197, -- [21]
				3197, -- [22]
				3197, -- [23]
				3197, -- [24]
				3197, -- [25]
			},
			["NextEventNum"] = 26,
			["LastDamageTime"] = 13980.67,
			["LastEvents"] = {
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Hit -64 (Physical)", -- [1]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 灬山河灬-逐风者 Hit -51 (Physical)", -- [2]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Hit -61 (Physical)", -- [3]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 灬山河灬-逐风者 Hit -58 (Physical)", -- [4]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Miss (1)", -- [5]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Hit -59 (Physical)", -- [6]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 灬山河灬-逐风者 Hit -46 (Physical)", -- [7]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Dodge (1)", -- [8]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 灬山河灬-逐风者 Hit -50 (Physical)", -- [9]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Hit -65 (Physical)", -- [10]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 柠檬-逐风者 Miss (1)", -- [11]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 柠檬-逐风者 Absorb -105 (105 被吸收) (Physical)", -- [12]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 柠檬-逐风者 Dodge (1)", -- [13]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 柠檬-逐风者 Absorb -53 (53 被吸收) (Physical)", -- [14]
				"雲木彡-逐风者 雷霆一击 浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> Hit -68 (Physical)", -- [15]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 一路酱-逐风者 Hit -68 (Physical)", -- [16]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 一路酱-逐风者 Hit -43 (Physical)", -- [17]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 初代大魔王-逐风者 Dodge (1)", -- [18]
				"初代大魔王-逐风者 冰冻 浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> Resist (Frost)", -- [19]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 初代大魔王-逐风者 Hit -55 (Physical)", -- [20]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Dodge (1)", -- [21]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 爪击 灬山河灬-逐风者 Hit -41 (Physical)", -- [22]
				"初代大魔王-逐风者 暴风雪 (伤害/跳) 浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> Tick -33 (Frost)", -- [23]
				"浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> 肉搏 灬山河灬-逐风者 Dodge (1)", -- [24]
				"初代大魔王-逐风者 暴风雪 (伤害/跳) 浪呵呵发育 <静悄悄发育-火妖鲁西弗隆> Tick -33 (Frost)", -- [25]
			},
			["Name"] = "浪呵呵发育",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
			},
			["LastEventTimes"] = {
				13366.476, -- [1]
				13367.293, -- [2]
				13367.793, -- [3]
				13368.909, -- [4]
				13369.076, -- [5]
				13370.393, -- [6]
				13370.509, -- [7]
				13371.676, -- [8]
				13372.16, -- [9]
				13372.993, -- [10]
				13447.365, -- [11]
				13447.382, -- [12]
				13448.665, -- [13]
				13449.012, -- [14]
				13450.548, -- [15]
				13455.465, -- [16]
				13455.482, -- [17]
				13948.601, -- [18]
				13948.634, -- [19]
				13948.634, -- [20]
				13979.37, -- [21]
				13979.37, -- [22]
				13980.653, -- [23]
				13980.67, -- [24]
				13981.653, -- [25]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["爪击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 105,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 158,
								},
								["Hit"] = {
									["max"] = 58,
									["min"] = 41,
									["count"] = 7,
									["amount"] = 344,
								},
							},
							["count"] = 9,
							["amount"] = 502,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 5,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 68,
									["min"] = 59,
									["count"] = 5,
									["amount"] = 317,
								},
							},
							["count"] = 12,
							["amount"] = 317,
						},
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 68,
								},
							},
							["amount"] = 68,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 66,
								},
							},
							["amount"] = 66,
						},
					},
					["TimeSpent"] = {
						["一路酱-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.54,
								},
								["肉搏"] = {
									["count"] = 8.290000000000001,
								},
							},
							["amount"] = 10.83,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.53,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 2.78,
								},
							},
							["amount"] = 3.15,
						},
					},
					["DamageTaken"] = 134,
					["ElementDoneAbsorb"] = {
						["Physical"] = 158,
					},
					["ElementDone"] = {
						["Melee"] = 317,
						["Physical"] = 502,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 5,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 12,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
					},
					["DamagedWho"] = {
						["一路酱-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 43,
								},
								["肉搏"] = {
									["count"] = 68,
								},
							},
							["amount"] = 111,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 246,
								},
								["肉搏"] = {
									["count"] = 249,
								},
							},
							["amount"] = 495,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 55,
								},
							},
							["amount"] = 55,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 158,
								},
							},
							["amount"] = 158,
						},
					},
					["TimeDamage"] = 17.03,
					["TimeDamaging"] = {
						["一路酱-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 2.54,
								},
								["肉搏"] = {
									["count"] = 8.290000000000001,
								},
							},
							["amount"] = 10.83,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.53,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.37,
								},
								["肉搏"] = {
									["count"] = 2.78,
								},
							},
							["amount"] = 3.15,
						},
					},
					["ElementTaken"] = {
						["Frost"] = 66,
						["Physical"] = 68,
					},
					["ActiveTime"] = 17.03,
					["Damage"] = 819,
				},
			},
			["UnitLockout"] = 13366.209,
			["LastActive"] = 13981.203,
		},
		["芋头妹妹"] = {
			["GUID"] = "Player-5458-02EB4E5E",
			["TimeLast"] = {
				["TimeHeal"] = 14078.21,
				["Dispelled"] = 13093.206,
				["Healing"] = 14078.21,
				["OVERALL"] = 14087.211,
				["DamageTaken"] = 13110.207,
				["FDamage"] = 13110.207,
				["Absorbs"] = 13109.207,
				["HealingTaken"] = 14078.21,
				["Overhealing"] = 12986.198,
				["TimeDamage"] = 14087.211,
				["ActiveTime"] = 14087.211,
				["ManaGain"] = 14084.21,
				["DOT_Time"] = 14087.211,
				["Damage"] = 14087.211,
			},
			["LastAttackedBy"] = "柠檬-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"MISC", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"HEAL", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					17.99, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["Healing"] = {
					4769, -- [1]
				},
				["DamageTaken"] = {
					6603, -- [1]
				},
				["FDamage"] = {
					2337, -- [1]
				},
				["Absorbs"] = {
					1120, -- [1]
				},
				["HealingTaken"] = {
					6306, -- [1]
				},
				["Overhealing"] = {
					530, -- [1]
				},
				["TimeDamage"] = {
					110.75, -- [1]
				},
				["ActiveTime"] = {
					128.7400000000001, -- [1]
				},
				["ManaGain"] = {
					4870, -- [1]
				},
				["DOT_Time"] = {
					324, -- [1]
				},
				["Damage"] = {
					18030, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 11,
			["LastHealTime"] = 14079.06,
			["type"] = "Grouped",
			["LastDamageTaken"] = 190,
			["LastEventHealthMax"] = {
				4554, -- [1]
				4554, -- [2]
				4554, -- [3]
				4554, -- [4]
				4554, -- [5]
				4554, -- [6]
				4554, -- [7]
				4554, -- [8]
				4554, -- [9]
				4554, -- [10]
				4554, -- [11]
				4554, -- [12]
				4554, -- [13]
				4554, -- [14]
				4554, -- [15]
				4554, -- [16]
				4554, -- [17]
				4554, -- [18]
				4554, -- [19]
				4554, -- [20]
				4554, -- [21]
				4554, -- [22]
				4554, -- [23]
				4554, -- [24]
				4554, -- [25]
				4554, -- [26]
				4554, -- [27]
				4554, -- [28]
				4554, -- [29]
				4554, -- [30]
				4554, -- [31]
				4554, -- [32]
				4554, -- [33]
				4554, -- [34]
				4554, -- [35]
				4554, -- [36]
				4554, -- [37]
				4554, -- [38]
				4554, -- [39]
				4554, -- [40]
				4554, -- [41]
				4554, -- [42]
				4554, -- [43]
				4554, -- [44]
				4554, -- [45]
				4554, -- [46]
				4554, -- [47]
				4554, -- [48]
				4554, -- [49]
				4554, -- [50]
			},
			["LastEventHealth"] = {
				4554, -- [1]
				4554, -- [2]
				4554, -- [3]
				4554, -- [4]
				4554, -- [5]
				4554, -- [6]
				4554, -- [7]
				4554, -- [8]
				4554, -- [9]
				4554, -- [10]
				4554, -- [11]
				4554, -- [12]
				4554, -- [13]
				3822, -- [14]
				3822, -- [15]
				4423, -- [16]
				4554, -- [17]
				4554, -- [18]
				2813, -- [19]
				2813, -- [20]
				2904, -- [21]
				2904, -- [22]
				2904, -- [23]
				1, -- [24]
				1, -- [25]
				2172, -- [26]
				3065, -- [27]
				3071, -- [28]
				3077, -- [29]
				3077, -- [30]
				3077, -- [31]
				3083, -- [32]
				3083, -- [33]
				3083, -- [34]
				2534, -- [35]
				4554, -- [36]
				4554, -- [37]
				4554, -- [38]
				4554, -- [39]
				4554, -- [40]
				4554, -- [41]
				4554, -- [42]
				4554, -- [43]
				4554, -- [44]
				4554, -- [45]
				4554, -- [46]
				4554, -- [47]
				4554, -- [48]
				4554, -- [49]
				4554, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"汉纳姆 <芋头妹妹>", -- [1]
			},
			["NextEventNum"] = 19,
			["LastDamageTime"] = 14087.327,
			["LastEvents"] = {
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -150 (Shadow)", -- [1]
				"芋头妹妹 灼热之痛 老戏骨-逐风者 Hit -318 (Fire)", -- [2]
				"芋头妹妹 肉搏 蓝色空间号-逐风者 Absorb -96 (1)", -- [3]
				"芋头妹妹 腐蚀术 (伤害/跳) 蓝色空间号-逐风者 Tick -49 (96 被吸收) (Shadow)", -- [4]
				"芋头妹妹 献祭 蓝色空间号-逐风者 Hit -300 (Fire)", -- [5]
				"芋头妹妹 灼热之痛 蓝色空间号-逐风者 Hit -295 (Fire)", -- [6]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -60 (Shadow)", -- [7]
				"初代大魔王-逐风者 interrupts 芋头妹妹 献祭 (法术反制)", -- [8]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -60 (Shadow)", -- [9]
				"芋头妹妹 腐蚀术 (伤害/跳) 初代大魔王-逐风者 Tick -145 (Shadow)", -- [10]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -60 (Shadow)", -- [11]
				"芋头妹妹 腐蚀术 (伤害/跳) 初代大魔王-逐风者 Absorb -145 (145 被吸收) (Shadow)", -- [12]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -61 (Shadow)", -- [13]
				"芋头妹妹 死亡缠绕 老白鲨-逐风者 Hit -583 (Shadow)", -- [14]
				"芋头妹妹 死亡缠绕 芋头妹妹 Hit +583", -- [15]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 雲木彡-逐风者 Tick -66 (Shadow)", -- [16]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 雲木彡-逐风者 Tick -66 (Shadow)", -- [17]
				"芋头妹妹 腐蚀术 (伤害/跳) 雲木彡-逐风者 Tick -160 (Shadow)", -- [18]
				"芋头妹妹 吸取生命 (伤害/跳) 时间的小溪-逐风者 Tick -91 (Shadow)", -- [19]
				"芋头妹妹 吸取生命 芋头妹妹 Hit +91", -- [20]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 柠檬-逐风者 Absorb -150 (150 被吸收) (Shadow)", -- [21]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 时间的小溪-逐风者 Tick -60 (Shadow)", -- [22]
				"芋头妹妹 腐蚀术 (伤害/跳) 时间的小溪-逐风者 Tick -145 (Shadow)", -- [23]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 时间的小溪-逐风者 Tick -149 (Shadow)", -- [24]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 时间的小溪-逐风者 Tick -150 (Shadow)", -- [25]
				"芋头妹妹 特效治疗石 芋头妹妹 Hit +1440", -- [26]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -55 (Shadow)", -- [27]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -54 (Shadow)", -- [28]
				"芋头妹妹 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -131 (Shadow)", -- [29]
				"芋头妹妹 献祭 老白鲨-逐风者 Hit -270 (Fire)", -- [30]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -54 (Shadow)", -- [31]
				"芋头妹妹 腐蚀术 (伤害/跳) 老白鲨-逐风者 Tick -131 (Shadow)", -- [32]
				"芋头妹妹 献祭 (伤害/跳) 老白鲨-逐风者 Tick -110 (Fire)", -- [33]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 老白鲨-逐风者 Tick -54 (Shadow)", -- [34]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 一路酱-逐风者 Absorb -54 (54 被吸收) (Shadow)", -- [35]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Absorb -60 (60 被吸收) (Shadow)", -- [36]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -105 (Shadow)", -- [37]
				"芋头妹妹 痛苦诅咒 根基图腾 Immune (Shadow)", -- [38]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -105 (Shadow)", -- [39]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -105 (Shadow)", -- [40]
				"芋头妹妹 腐蚀术 (伤害/跳) 老戏骨-逐风者 Tick -146 (Shadow)", -- [41]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -105 (Shadow)", -- [42]
				"芋头妹妹 献祭 老戏骨-逐风者 Hit -300 (Fire)", -- [43]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -150 (Shadow)", -- [44]
				"芋头妹妹 腐蚀术 (伤害/跳) 老戏骨-逐风者 Tick -145 (Shadow)", -- [45]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -150 (Shadow)", -- [46]
				"芋头妹妹 献祭 (伤害/跳) 老戏骨-逐风者 Tick -123 (Fire)", -- [47]
				"芋头妹妹 腐蚀术 (伤害/跳) 老戏骨-逐风者 Tick -145 (Shadow)", -- [48]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 初代大魔王-逐风者 Tick -150 (Shadow)", -- [49]
				"芋头妹妹 献祭 (伤害/跳) 老戏骨-逐风者 Tick -122 (Fire)", -- [50]
			},
			["Name"] = "芋头妹妹",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13839.377, -- [1]
				13840.177, -- [2]
				13848.011, -- [3]
				13848.011, -- [4]
				13848.294, -- [5]
				13849.811, -- [6]
				13856.511, -- [7]
				13858.378, -- [8]
				13858.507, -- [9]
				13859.011, -- [10]
				13860.511, -- [11]
				13862.012, -- [12]
				13862.512, -- [13]
				14079.06, -- [14]
				14079.06, -- [15]
				14084.81, -- [16]
				14086.811, -- [17]
				14087.327, -- [18]
				13119.974, -- [19]
				13119.974, -- [20]
				13120.758, -- [21]
				13121.358, -- [22]
				13121.475, -- [23]
				13440.898, -- [24]
				13442.898, -- [25]
				13587.742, -- [26]
				13591.509, -- [27]
				13593.526, -- [28]
				13594.026, -- [29]
				13594.359, -- [30]
				13595.509, -- [31]
				13597.026, -- [32]
				13597.359, -- [33]
				13597.526, -- [34]
				13602.693, -- [35]
				13823.375, -- [36]
				13825.375, -- [37]
				13826.676, -- [38]
				13827.376, -- [39]
				13829.376, -- [40]
				13831.176, -- [41]
				13831.359, -- [42]
				13832.993, -- [43]
				13833.376, -- [44]
				13834.176, -- [45]
				13835.376, -- [46]
				13835.993, -- [47]
				13837.176, -- [48]
				13837.376, -- [49]
				13838.993, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["雲木彡-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["雲木彡-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 9,
					["Damage"] = 875,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 875,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 160,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 132,
								},
							},
							["amount"] = 292,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 583,
								},
							},
							["amount"] = 583,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["智慧祝福"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 682,
								},
							},
							["amount"] = 682,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 583,
								},
							},
							["amount"] = 583,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
						["生命分流"] = {
							["Details"] = {
								["芋头妹妹"] = {
									["count"] = 682,
								},
							},
							["amount"] = 682,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.52,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 583,
									["min"] = 583,
									["count"] = 1,
									["amount"] = 583,
								},
							},
							["count"] = 1,
							["amount"] = 583,
						},
					},
					["WhoHealed"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 583,
								},
							},
							["amount"] = 583,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6.52,
					["Healing"] = 583,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 583,
									["min"] = 583,
									["count"] = 1,
									["amount"] = 583,
								},
							},
							["count"] = 1,
							["amount"] = 583,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 160,
									["min"] = 160,
									["count"] = 1,
									["amount"] = 160,
								},
							},
							["count"] = 1,
							["amount"] = 160,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 66,
									["min"] = 66,
									["count"] = 2,
									["amount"] = 132,
								},
							},
							["count"] = 2,
							["amount"] = 132,
						},
					},
					["HealingTaken"] = 583,
					["RageGain"] = 0,
					["TimeDamage"] = 5.02,
					["TimeDamaging"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.52,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 772,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["时间的小溪-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["老戏骨-逐风者"] = {
									["count"] = 6,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 6,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 15,
								},
								["老白鲨-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 30,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["蓝色空间号-逐风者"] = {
									["count"] = 3,
								},
								["柠檬-逐风者"] = {
									["count"] = 3,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 24,
								},
								["吹风吹姑娘-逐风者"] = {
									["count"] = 6,
								},
								["老戏骨-逐风者"] = {
									["count"] = 9,
								},
								["雲木彡-逐风者"] = {
									["count"] = 3,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 6,
								},
								["老白鲨-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 60,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["柠檬-逐风者"] = {
									["count"] = 57,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 72,
								},
								["妖儿-逐风者"] = {
									["count"] = 9,
								},
								["一路酱-逐风者"] = {
									["count"] = 3,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 6,
								},
								["时间的小溪-逐风者"] = {
									["count"] = 39,
								},
								["老白鲨-逐风者"] = {
									["count"] = 12,
								},
								["雲木彡-逐风者"] = {
									["count"] = 6,
								},
								["吹风吹姑娘-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 219,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 6,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 17,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 14,
						},
					},
					["DamageTaken"] = 6603,
					["ElementDoneAbsorb"] = {
						["Shadow"] = 1350,
						["Fire"] = 607,
					},
					["Absorbs"] = 1120,
					["FDamagedWho"] = {
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 2337,
								},
							},
							["amount"] = 2337,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 1595,
						["Melee"] = 1638,
						["Arcane"] = 205,
						["Fire"] = 325,
						["Frost"] = 449,
						["Shadow"] = 2391,
					},
					["DOT_Time"] = 324,
					["Damage"] = 18030,
					["TimeHeal"] = 17.99,
					["FAttacks"] = {
						["灵魂链接"] = {
							["Details"] = {
								["Split"] = {
									["max"] = 310,
									["min"] = 13,
									["count"] = 29,
									["amount"] = 2337,
								},
							},
							["count"] = 29,
							["amount"] = 2337,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 10408,
						["Melee"] = 122,
						["Fire"] = 7500,
					},
					["DamagedWho"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 145,
								},
								["灼热之痛"] = {
									["count"] = 1403,
								},
								["献祭"] = {
									["count"] = 600,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1648,
								},
							},
							["amount"] = 3796,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 282,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2323,
								},
								["灼热之痛"] = {
									["count"] = 283,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 551,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 290,
								},
								["肉搏"] = {
									["count"] = 26,
								},
							},
							["amount"] = 3755,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 530,
								},
								["灼热之痛"] = {
									["count"] = 323,
								},
								["献祭"] = {
									["count"] = 300,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 181,
								},
							},
							["amount"] = 1334,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["灼热之痛"] = {
									["count"] = 318,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 436,
								},
								["献祭"] = {
									["count"] = 300,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 245,
								},
							},
							["amount"] = 1299,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 54,
								},
							},
							["amount"] = 54,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 132,
								},
							},
							["amount"] = 132,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["灼热之痛"] = {
									["count"] = 295,
								},
								["献祭"] = {
									["count"] = 300,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 96,
								},
							},
							["amount"] = 740,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 300,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1052,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 458,
								},
								["灼热之痛"] = {
									["count"] = 1374,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1165,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 246,
								},
							},
							["amount"] = 4595,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 583,
								},
								["献祭"] = {
									["count"] = 270,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 217,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 262,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 110,
								},
							},
							["amount"] = 1442,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 160,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 132,
								},
							},
							["amount"] = 292,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 290,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 301,
								},
							},
							["amount"] = 591,
						},
					},
					["WhoDamaged"] = {
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 274,
								},
								["冰霜冲击"] = {
									["count"] = 31,
								},
								["背刺"] = {
									["count"] = 1031,
								},
								["肉搏"] = {
									["count"] = 1587,
								},
							},
							["amount"] = 2923,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 294,
								},
								["心灵震爆"] = {
									["count"] = 443,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 142,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1512,
								},
								["肉搏"] = {
									["count"] = 51,
								},
							},
							["amount"] = 2442,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 290,
								},
							},
							["amount"] = 290,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 205,
								},
								["冰霜新星"] = {
									["count"] = 46,
								},
								["冰锥术"] = {
									["count"] = 372,
								},
								["火焰冲击"] = {
									["count"] = 325,
								},
							},
							["amount"] = 948,
						},
					},
					["Absorbed"] = {
						["伤害吸收"] = {
							["Details"] = {
								["芋头妹妹"] = {
									["max"] = 296,
									["min"] = 71,
									["count"] = 3,
									["amount"] = 445,
								},
							},
							["count"] = 3,
							["amount"] = 445,
						},
						["防护暗影结界"] = {
							["Details"] = {
								["芋头妹妹"] = {
									["max"] = 250,
									["min"] = 51,
									["count"] = 4,
									["amount"] = 675,
								},
							},
							["count"] = 4,
							["amount"] = 675,
						},
					},
					["TimeHealing"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 5.62,
								},
								["治疗药水"] = {
									["count"] = 1.13,
								},
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["特效治疗石"] = {
									["count"] = 2.13,
								},
								["防护暗影结界"] = {
									["count"] = 4.95,
								},
								["伤害吸收"] = {
									["count"] = 2.66,
								},
							},
							["amount"] = 17.99,
						},
					},
					["OverHeals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 530,
									["min"] = 530,
									["count"] = 1,
									["amount"] = 530,
								},
							},
							["count"] = 1,
							["amount"] = 530,
						},
					},
					["PartialResist"] = {
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 199,
									["min"] = 199,
									["count"] = 1,
									["amount"] = 199,
								},
							},
							["count"] = 199,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 61,
									["min"] = 61,
									["count"] = 1,
									["amount"] = 61,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 61,
							["amount"] = 8,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 90,
								},
							},
							["amount"] = 90,
						},
						["生命分流"] = {
							["Details"] = {
								["芋头妹妹"] = {
									["count"] = 4090,
								},
							},
							["amount"] = 4090,
						},
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 690,
								},
							},
							["amount"] = 690,
						},
					},
					["PartialAbsorb"] = {
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 125,
									["min"] = 125,
									["count"] = 1,
									["amount"] = 125,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 125,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 296,
									["min"] = 71,
									["count"] = 3,
									["amount"] = 445,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 445,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 250,
									["min"] = 51,
									["count"] = 3,
									["amount"] = 550,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 550,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 128.7400000000001,
					["ElementTakenResist"] = {
						["Shadow"] = 260,
					},
					["WhoDispelled"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["魔甲术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["强效智慧祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Dispelled"] = 2,
					["Heals"] = {
						["吸取生命"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 92,
									["min"] = 91,
									["count"] = 5,
									["amount"] = 458,
								},
							},
							["count"] = 5,
							["amount"] = 458,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 848,
									["min"] = 848,
									["count"] = 1,
									["amount"] = 848,
								},
							},
							["count"] = 1,
							["amount"] = 848,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 583,
									["min"] = 583,
									["count"] = 1,
									["amount"] = 583,
								},
							},
							["count"] = 1,
							["amount"] = 583,
						},
						["特效治疗石"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1440,
									["min"] = 1440,
									["count"] = 2,
									["amount"] = 2880,
								},
							},
							["count"] = 2,
							["amount"] = 2880,
						},
						["防护暗影结界"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 250,
									["min"] = 51,
									["count"] = 4,
									["amount"] = 675,
								},
							},
							["count"] = 4,
							["amount"] = 675,
						},
						["伤害吸收"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 296,
									["min"] = 71,
									["count"] = 3,
									["amount"] = 445,
								},
							},
							["count"] = 3,
							["amount"] = 445,
						},
					},
					["ElementTakenAbsorb"] = {
						["Melee"] = 445,
						["Shadow"] = 675,
					},
					["WhoHealed"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 417,
								},
							},
							["amount"] = 417,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 458,
								},
								["治疗药水"] = {
									["count"] = 848,
								},
								["死亡缠绕"] = {
									["count"] = 583,
								},
								["特效治疗石"] = {
									["count"] = 2880,
								},
								["防护暗影结界"] = {
									["count"] = 675,
								},
								["伤害吸收"] = {
									["count"] = 445,
								},
							},
							["amount"] = 5889,
						},
					},
					["Overhealing"] = 530,
					["Healing"] = 4769,
					["HealedWho"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 458,
								},
								["治疗药水"] = {
									["count"] = 848,
								},
								["死亡缠绕"] = {
									["count"] = 583,
								},
								["特效治疗石"] = {
									["count"] = 2880,
								},
								["防护暗影结界"] = {
									["count"] = 675,
								},
								["伤害吸收"] = {
									["count"] = 445,
								},
							},
							["amount"] = 5889,
						},
					},
					["TimeSpent"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.5,
								},
								["灼热之痛"] = {
									["count"] = 1.87,
								},
								["献祭"] = {
									["count"] = 1.62,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 12.82,
								},
							},
							["amount"] = 16.81,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 1.3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 18.38,
								},
								["灼热之痛"] = {
									["count"] = 0.82,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.78,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["肉搏"] = {
									["count"] = 0.7,
								},
							},
							["amount"] = 24.98,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["吸取生命"] = {
									["count"] = 5.62,
								},
								["治疗药水"] = {
									["count"] = 1.13,
								},
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["特效治疗石"] = {
									["count"] = 2.13,
								},
								["防护暗影结界"] = {
									["count"] = 4.95,
								},
								["伤害吸收"] = {
									["count"] = 2.66,
								},
							},
							["amount"] = 17.99,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["灼热之痛"] = {
									["count"] = 0.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.48,
								},
								["献祭"] = {
									["count"] = 1.5,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 2.12,
								},
							},
							["amount"] = 7.9,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.39,
								},
							},
							["amount"] = 1.39,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["灼热之痛"] = {
									["count"] = 1.5,
								},
								["献祭"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.28,
						},
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 12.89,
								},
							},
							["amount"] = 12.89,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 0.3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 11.84,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["灼热之痛"] = {
									["count"] = 1.66,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.48,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 0.64,
								},
							},
							["amount"] = 20.78,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["献祭"] = {
									["count"] = 0.33,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 8.48,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.52,
						},
						["根基图腾"] = {
							["Details"] = {
								["痛苦诅咒"] = {
									["count"] = 1.3,
								},
							},
							["amount"] = 1.3,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.8,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.56,
								},
							},
							["amount"] = 2.36,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.2,
								},
								["灼热之痛"] = {
									["count"] = 0.38,
								},
								["献祭"] = {
									["count"] = 0.85,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.13,
								},
							},
							["amount"] = 5.56,
						},
					},
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 583,
									["min"] = 530,
									["count"] = 2,
									["amount"] = 1113,
								},
							},
							["count"] = 2,
							["amount"] = 1113,
						},
						["献祭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 282,
									["min"] = 282,
									["count"] = 1,
									["amount"] = 282,
								},
								["Hit"] = {
									["max"] = 300,
									["min"] = 270,
									["count"] = 7,
									["amount"] = 2070,
								},
							},
							["count"] = 8,
							["amount"] = 2352,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 92,
									["min"] = 91,
									["count"] = 5,
									["amount"] = 458,
								},
							},
							["count"] = 5,
							["amount"] = 458,
						},
						["痛苦诅咒"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热之痛"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 325,
									["min"] = 325,
									["count"] = 1,
									["amount"] = 325,
								},
								["Crit"] = {
									["max"] = 483,
									["min"] = 478,
									["count"] = 2,
									["amount"] = 961,
								},
								["Hit"] = {
									["max"] = 323,
									["min"] = 283,
									["count"] = 9,
									["amount"] = 2710,
								},
							},
							["count"] = 12,
							["amount"] = 3996,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 96,
									["min"] = 26,
									["count"] = 2,
									["amount"] = 122,
								},
							},
							["count"] = 2,
							["amount"] = 122,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 150,
									["min"] = 53,
									["count"] = 11,
									["amount"] = 793,
								},
								["Tick"] = {
									["max"] = 150,
									["min"] = 27,
									["count"] = 62,
									["amount"] = 5247,
								},
							},
							["count"] = 73,
							["amount"] = 6040,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 145,
									["min"] = 145,
									["count"] = 3,
									["amount"] = 435,
								},
								["Tick"] = {
									["max"] = 160,
									["min"] = 49,
									["count"] = 17,
									["amount"] = 2362,
								},
							},
							["count"] = 20,
							["amount"] = 2797,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 123,
									["min"] = 110,
									["count"] = 10,
									["amount"] = 1152,
								},
							},
							["count"] = 10,
							["amount"] = 1152,
						},
					},
					["HealingTaken"] = 6306,
					["FDamage"] = 2337,
					["TimeDamage"] = 110.75,
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.5,
								},
								["灼热之痛"] = {
									["count"] = 1.87,
								},
								["献祭"] = {
									["count"] = 1.62,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 12.82,
								},
							},
							["amount"] = 16.81,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 1.3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 18.38,
								},
								["灼热之痛"] = {
									["count"] = 0.82,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 1.78,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["肉搏"] = {
									["count"] = 0.7,
								},
							},
							["amount"] = 24.98,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.8,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.56,
								},
							},
							["amount"] = 2.36,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["灼热之痛"] = {
									["count"] = 0.8,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.48,
								},
								["献祭"] = {
									["count"] = 1.5,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 2.12,
								},
							},
							["amount"] = 7.9,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.39,
								},
							},
							["amount"] = 1.39,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["灼热之痛"] = {
									["count"] = 1.5,
								},
								["献祭"] = {
									["count"] = 0.28,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.28,
						},
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 12.89,
								},
							},
							["amount"] = 12.89,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["献祭"] = {
									["count"] = 0.3,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 11.84,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 1.86,
								},
								["灼热之痛"] = {
									["count"] = 1.66,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.48,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 0.64,
								},
							},
							["amount"] = 20.78,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["献祭"] = {
									["count"] = 0.33,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.32,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 8.48,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.52,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.52,
						},
						["根基图腾"] = {
							["Details"] = {
								["痛苦诅咒"] = {
									["count"] = 1.3,
								},
							},
							["amount"] = 1.3,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.2,
								},
								["灼热之痛"] = {
									["count"] = 0.38,
								},
								["献祭"] = {
									["count"] = 0.85,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.13,
								},
							},
							["amount"] = 5.56,
						},
					},
					["ManaGain"] = 4870,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 14,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 84,
								},
							},
							["amount"] = 101,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 10,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 30,
						},
					},
					["ManaGainedFrom"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 4090,
								},
							},
							["amount"] = 4090,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 690,
								},
								["智慧祝福"] = {
									["count"] = 90,
								},
							},
							["amount"] = 780,
						},
					},
				},
			},
			["UnitLockout"] = 14078.21,
			["LastActive"] = 14087.211,
		},
		["雨中一枝花-黑龙费尔默"] = {
			["GUID"] = "Player-5450-02F4B96C",
			["TimeLast"] = {
				["ActiveTime"] = 13124.208,
				["ManaGain"] = 12959.213,
				["OVERALL"] = 13124.208,
				["TimeDamage"] = 13124.208,
				["Damage"] = 13124.208,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["Damage"] = {
					587, -- [1]
				},
				["ManaGain"] = {
					660, -- [1]
				},
				["TimeDamage"] = {
					1.5, -- [1]
				},
				["ActiveTime"] = {
					1.5, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastFightIn"] = 1,
			["type"] = "Grouped",
			["LastEventHealth"] = {
				3590, -- [1]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3590, -- [1]
			},
			["NextEventNum"] = 2,
			["LastDamageTime"] = 13124.841,
			["LastEvents"] = {
				"雨中一枝花-黑龙费尔默 火焰冲击 吹风吹姑娘-逐风者 Hit -587 (Fire)", -- [1]
			},
			["Name"] = "雨中一枝花-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
			},
			["LastEventTimes"] = {
				13124.841, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeSpent"] = {
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamagedWho"] = {
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 587,
								},
							},
							["amount"] = 587,
						},
					},
					["ElementDone"] = {
						["Fire"] = 587,
					},
					["Attacks"] = {
						["火焰冲击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 587,
									["min"] = 587,
									["count"] = 1,
									["amount"] = 587,
								},
							},
							["count"] = 1,
							["amount"] = 587,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 660,
								},
							},
							["amount"] = 660,
						},
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 660,
								},
							},
							["amount"] = 660,
						},
					},
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 660,
					["ActiveTime"] = 1.5,
					["Damage"] = 587,
				},
			},
			["UnitLockout"] = 13124.208,
			["LastActive"] = 13124.208,
		},
		["街头春丽-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02F7F3A4",
			["TimeLast"] = {
				["TimeHeal"] = 14069.21,
				["Dispelled"] = 13490.201,
				["Dispels"] = 13653.213,
				["DeathCount"] = 13499.202,
				["OVERALL"] = 14088.211,
				["DamageTaken"] = 13499.202,
				["Overhealing"] = 13398.211,
				["Healing"] = 14069.21,
				["HealingTaken"] = 14069.21,
				["HOT_Time"] = 14069.21,
				["TimeDamage"] = 14088.211,
				["ActiveTime"] = 14088.211,
				["ManaGain"] = 12910.21,
				["DOT_Time"] = 14088.211,
				["Damage"] = 14088.211,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"HEAL", -- [4]
				"HEAL", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"MISC", -- [42]
				"MISC", -- [43]
				"MISC", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					4.57, -- [1]
				},
				["Dispelled"] = {
					6, -- [1]
				},
				["Dispels"] = {
					11, -- [1]
				},
				["Healing"] = {
					2097, -- [1]
				},
				["DamageTaken"] = {
					6234, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["Overhealing"] = {
					348, -- [1]
				},
				["HealingTaken"] = {
					2097, -- [1]
				},
				["HOT_Time"] = {
					12, -- [1]
				},
				["ActiveTime"] = {
					79.06000000000002, -- [1]
				},
				["TimeDamage"] = {
					74.49000000000002, -- [1]
				},
				["ManaGain"] = {
					390, -- [1]
				},
				["DOT_Time"] = {
					192, -- [1]
				},
				["Damage"] = {
					14774, -- [1]
				},
			},
			["enClass"] = "PRIEST",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						false, -- [27]
					},
					["Messages"] = {
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -181 (Shadow)", -- [1]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 街头春丽-火妖鲁西弗隆 Tick -250 (Shadow)", -- [2]
						"柠檬-逐风者 dispels 街头春丽-火妖鲁西弗隆 真言术：韧 (驱散魔法)", -- [3]
						"柠檬-逐风者 dispels 街头春丽-火妖鲁西弗隆 神圣之灵 (驱散魔法)", -- [4]
						"柠檬-逐风者 dispels 街头春丽-火妖鲁西弗隆 防护恐惧结界 (驱散魔法)", -- [5]
						"柠檬-逐风者 dispels 街头春丽-火妖鲁西弗隆 心灵之火 (驱散魔法)", -- [6]
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -181 (Shadow)", -- [7]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 街头春丽-火妖鲁西弗隆 Tick -249 (Shadow)", -- [8]
						"街头春丽-火妖鲁西弗隆 dispels 街头春丽-火妖鲁西弗隆 暗影易伤 (驱散魔法)", -- [9]
						"街头春丽-火妖鲁西弗隆 dispels 街头春丽-火妖鲁西弗隆 暗影易伤 (驱散魔法)", -- [10]
						"街头春丽-火妖鲁西弗隆 dispels 街头春丽-火妖鲁西弗隆 暗言术：痛 (驱散魔法)", -- [11]
						"街头春丽-火妖鲁西弗隆 dispels 街头春丽-火妖鲁西弗隆 暗言术：痛 (驱散魔法)", -- [12]
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 一路酱-逐风者 Tick -167 (Shadow)", -- [13]
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -91 (90 被抵抗) (Shadow)", -- [14]
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 一路酱-逐风者 Tick -167 (Shadow)", -- [15]
						"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 柠檬-逐风者 Tick -176 (Shadow)", -- [16]
						"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 柠檬-逐风者 Tick -176 (Shadow)", -- [17]
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -181 (Shadow)", -- [18]
						"时间的小溪-逐风者 背刺 街头春丽-火妖鲁西弗隆 Crit -1119 (Physical)", -- [19]
						"时间的小溪-逐风者 肉搏 街头春丽-火妖鲁西弗隆 Hit -64 (Physical)", -- [20]
						"街头春丽-火妖鲁西弗隆 心灵尖啸 雲木彡-逐风者 Immune (Shadow)", -- [21]
						"雲木彡-逐风者 肉搏 街头春丽-火妖鲁西弗隆 Crit -886 (Physical)", -- [22]
						"雲木彡-逐风者 致死打击 街头春丽-火妖鲁西弗隆 Crit -1170 (Physical)", -- [23]
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 一路酱-逐风者 Tick -168 (Shadow)", -- [24]
						"雲木彡-逐风者 斩杀 街头春丽-火妖鲁西弗隆 Hit -959 (Physical)", -- [25]
						"街头春丽-火妖鲁西弗隆死亡。", -- [26]
						"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -136 (45 被抵抗) (Shadow)", -- [27]
					},
					["DeathAt"] = 13501.202,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["MessageTimes"] = {
						-11.33399999999892, -- [1]
						-11.33399999999892, -- [2]
						-11.3179999999993, -- [3]
						-11.3179999999993, -- [4]
						-9.816999999999098, -- [5]
						-9.816999999999098, -- [6]
						-8.333999999998923, -- [7]
						-8.333999999998923, -- [8]
						-8.266999999999825, -- [9]
						-8.266999999999825, -- [10]
						-8.266999999999825, -- [11]
						-8.266999999999825, -- [12]
						-7.033999999999651, -- [13]
						-5.333999999998923, -- [14]
						-4.016999999999825, -- [15]
						-3.867000000000189, -- [16]
						-2.867000000000189, -- [17]
						-2.333999999998923, -- [18]
						-1.850000000000364, -- [19]
						-1.75, -- [20]
						-1.699999999998909, -- [21]
						-1.617000000000189, -- [22]
						-1.5, -- [23]
						-1.016999999999825, -- [24]
						0, -- [25]
						0, -- [26]
						0.6499999999996362, -- [27]
					},
					["HealthMax"] = {
						4937, -- [1]
						4937, -- [2]
						4937, -- [3]
						4937, -- [4]
						4237, -- [5]
						4237, -- [6]
						4237, -- [7]
						4237, -- [8]
						4237, -- [9]
						4237, -- [10]
						4237, -- [11]
						4237, -- [12]
						4237, -- [13]
						4237, -- [14]
						4237, -- [15]
						4237, -- [16]
						4237, -- [17]
						4237, -- [18]
						4237, -- [19]
						4237, -- [20]
						4237, -- [21]
						4237, -- [22]
						4237, -- [23]
						4237, -- [24]
						4237, -- [25]
						4237, -- [26]
						4237, -- [27]
					},
					["Health"] = {
						4937, -- [1]
						4937, -- [2]
						4937, -- [3]
						4937, -- [4]
						4237, -- [5]
						4237, -- [6]
						4237, -- [7]
						4237, -- [8]
						3988, -- [9]
						3988, -- [10]
						3988, -- [11]
						3988, -- [12]
						3988, -- [13]
						3988, -- [14]
						3988, -- [15]
						3988, -- [16]
						3988, -- [17]
						3988, -- [18]
						3988, -- [19]
						2869, -- [20]
						2869, -- [21]
						2805, -- [22]
						1919, -- [23]
						749, -- [24]
						749, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["KilledBy"] = "雲木彡-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"MISC", -- [3]
						"MISC", -- [4]
						"MISC", -- [5]
						"MISC", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
						"MISC", -- [10]
						"MISC", -- [11]
						"MISC", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"MISC", -- [26]
						"DAMAGE", -- [27]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "斩杀",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastHealTime"] = 14069.693,
			["LastEventHealth"] = {
				4237, -- [1]
				4237, -- [2]
				4237, -- [3]
				3686, -- [4]
				3915, -- [5]
				3995, -- [6]
				3654, -- [7]
				3862, -- [8]
				3862, -- [9]
				3883, -- [10]
				3883, -- [11]
				3883, -- [12]
				3883, -- [13]
				3883, -- [14]
				3883, -- [15]
				3883, -- [16]
				3883, -- [17]
				3883, -- [18]
				3883, -- [19]
				3883, -- [20]
				3883, -- [21]
				3883, -- [22]
				4237, -- [23]
				4237, -- [24]
				1919, -- [25]
				749, -- [26]
				749, -- [27]
				0, -- [28]
				0, -- [29]
				1, -- [30]
				1, -- [31]
				1, -- [32]
				1, -- [33]
				4237, -- [34]
				4237, -- [35]
				4237, -- [36]
				4237, -- [37]
				4237, -- [38]
				4237, -- [39]
				4237, -- [40]
				4237, -- [41]
				4237, -- [42]
				4237, -- [43]
				4237, -- [44]
				4237, -- [45]
				4237, -- [46]
				4237, -- [47]
				4237, -- [48]
				4237, -- [49]
				4237, -- [50]
			},
			["LastDamageTaken"] = 959,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4237, -- [1]
				4237, -- [2]
				4237, -- [3]
				4237, -- [4]
				4237, -- [5]
				4237, -- [6]
				4237, -- [7]
				4237, -- [8]
				4237, -- [9]
				4237, -- [10]
				4237, -- [11]
				4237, -- [12]
				4237, -- [13]
				4237, -- [14]
				4237, -- [15]
				4237, -- [16]
				4237, -- [17]
				4237, -- [18]
				4237, -- [19]
				4237, -- [20]
				4237, -- [21]
				4237, -- [22]
				4237, -- [23]
				4237, -- [24]
				4237, -- [25]
				4237, -- [26]
				4237, -- [27]
				4237, -- [28]
				4237, -- [29]
				4237, -- [30]
				4237, -- [31]
				4237, -- [32]
				4237, -- [33]
				4237, -- [34]
				4237, -- [35]
				4237, -- [36]
				4237, -- [37]
				4237, -- [38]
				4237, -- [39]
				4237, -- [40]
				4237, -- [41]
				4237, -- [42]
				4237, -- [43]
				4237, -- [44]
				4237, -- [45]
				4237, -- [46]
				4237, -- [47]
				4237, -- [48]
				4237, -- [49]
				4237, -- [50]
			},
			["NextEventNum"] = 25,
			["LastDamageTime"] = 14088.244,
			["LastEvents"] = {
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 老白鲨-逐风者 Tick -201 (Shadow)", -- [1]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 老白鲨-逐风者 Tick -205 (Shadow)", -- [2]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 老白鲨-逐风者 Tick -200 (Shadow)", -- [3]
				"街头春丽-火妖鲁西弗隆 恢复 街头春丽-火妖鲁西弗隆 Tick +208", -- [4]
				"街头春丽-火妖鲁西弗隆 恢复 街头春丽-火妖鲁西弗隆 Tick +208", -- [5]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -180 (Shadow)", -- [6]
				"街头春丽-火妖鲁西弗隆 恢复 街头春丽-火妖鲁西弗隆 Tick +208", -- [7]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 源堂法雷尔-逐风者 Tick -181 (Shadow)", -- [8]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 源堂法雷尔-逐风者 Tick -180 (Shadow)", -- [9]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 源堂法雷尔-逐风者 Tick -181 (Shadow)", -- [10]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 雲木彡-逐风者 Tick -198 (Shadow)", -- [11]
				"街头春丽-火妖鲁西弗隆 心灵震爆 雲木彡-逐风者 Hit -683 (Shadow)", -- [12]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 源堂法雷尔-逐风者 Tick -181 (Shadow)", -- [13]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 雲木彡-逐风者 Resist (Shadow)", -- [14]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 雲木彡-逐风者 Tick -199 (Shadow)", -- [15]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 源堂法雷尔-逐风者 Tick -180 (Shadow)", -- [16]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 雲木彡-逐风者 Tick -195 (Shadow)", -- [17]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 雲木彡-逐风者 Tick -194 (Shadow)", -- [18]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 雲木彡-逐风者 Tick -194 (Shadow)", -- [19]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 雲木彡-逐风者 Tick -199 (Shadow)", -- [20]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 源堂法雷尔-逐风者 Tick -180 (Shadow)", -- [21]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 雲木彡-逐风者 Tick -194 (Shadow)", -- [22]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 雲木彡-逐风者 Tick -198 (Shadow)", -- [23]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 源堂法雷尔-逐风者 Tick -181 (Shadow)", -- [24]
				"雲木彡-逐风者 致死打击 街头春丽-火妖鲁西弗隆 Crit -1170 (Physical)", -- [25]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 一路酱-逐风者 Tick -168 (Shadow)", -- [26]
				"雲木彡-逐风者 斩杀 街头春丽-火妖鲁西弗隆 Hit -959 (Physical)", -- [27]
				"街头春丽-火妖鲁西弗隆死亡。", -- [28]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -136 (45 被抵抗) (Shadow)", -- [29]
				"街头春丽-火妖鲁西弗隆 肉搏 柠檬-逐风者 Absorb -84 (1)", -- [30]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -96 (84 被吸收) (Shadow)", -- [31]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -181 (Shadow)", -- [32]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 柠檬-逐风者 Tick -181 (Shadow)", -- [33]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -194 (Shadow)", -- [34]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -199 (Shadow)", -- [35]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -194 (Shadow)", -- [36]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -195 (Shadow)", -- [37]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -194 (Shadow)", -- [38]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -199 (Shadow)", -- [39]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -194 (Shadow)", -- [40]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 纳格兰放牛娃-逐风者 Tick -195 (Shadow)", -- [41]
				"街头春丽-火妖鲁西弗隆 dispels 吹风吹姑娘-逐风者 冰甲术 (驱散魔法)", -- [42]
				"街头春丽-火妖鲁西弗隆 dispels 吹风吹姑娘-逐风者 奥术智慧 (驱散魔法)", -- [43]
				"街头春丽-火妖鲁西弗隆 dispels 吹风吹姑娘-逐风者 寒冰护体 (驱散魔法)", -- [44]
				"街头春丽-火妖鲁西弗隆 心灵震爆 吹风吹姑娘-逐风者 Hit -635 (Shadow)", -- [45]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 老白鲨-逐风者 Tick -198 (Shadow)", -- [46]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 老白鲨-逐风者 Tick -200 (Shadow)", -- [47]
				"街头春丽-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 老白鲨-逐风者 Tick -204 (Shadow)", -- [48]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 老白鲨-逐风者 Tick -200 (Shadow)", -- [49]
				"街头春丽-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 老白鲨-逐风者 Tick -200 (Shadow)", -- [50]
			},
			["Name"] = "街头春丽-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13667.581, -- [1]
				13668.298, -- [2]
				13668.614, -- [3]
				13928.55, -- [4]
				13931.55, -- [5]
				14044.774, -- [6]
				14069.693, -- [7]
				14070.243, -- [8]
				14073.226, -- [9]
				14076.243, -- [10]
				14078.794, -- [11]
				14078.827, -- [12]
				14079.227, -- [13]
				14080.227, -- [14]
				14081.81, -- [15]
				14082.227, -- [16]
				14082.744, -- [17]
				14083.777, -- [18]
				14084.794, -- [19]
				14084.794, -- [20]
				14085.227, -- [21]
				14085.961, -- [22]
				14087.794, -- [23]
				14088.244, -- [24]
				13497.902, -- [25]
				13498.385, -- [26]
				13499.402, -- [27]
				13499.402, -- [28]
				13500.052, -- [29]
				13503.069, -- [30]
				13503.069, -- [31]
				13506.069, -- [32]
				13509.053, -- [33]
				13644.896, -- [34]
				13645.396, -- [35]
				13645.896, -- [36]
				13646.913, -- [37]
				13647.996, -- [38]
				13648.396, -- [39]
				13649.013, -- [40]
				13649.996, -- [41]
				13651.813, -- [42]
				13651.813, -- [43]
				13653.413, -- [44]
				13656.463, -- [45]
				13662.297, -- [46]
				13664.447, -- [47]
				13665.297, -- [48]
				13665.464, -- [49]
				13666.448, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["源堂法雷尔-逐风者"] = {
									["count"] = 21,
								},
								["柠檬-逐风者"] = {
									["count"] = 3,
								},
								["雲木彡-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 36,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["雲木彡-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 3,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 16,
								},
							},
							["amount"] = 18,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 48,
					["Damage"] = 3698,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 3698,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1264,
								},
							},
							["amount"] = 1264,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 180,
								},
							},
							["amount"] = 180,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 683,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 794,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 777,
								},
							},
							["amount"] = 2254,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 208,
								},
							},
							["amount"] = 208,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 6.2,
								},
							},
							["amount"] = 6.2,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 0.03,
								},
								["精神鞭笞"] = {
									["count"] = 1,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 3.3,
								},
							},
							["amount"] = 8.830000000000002,
						},
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["恢复"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 208,
									["min"] = 208,
									["count"] = 1,
									["amount"] = 208,
								},
							},
							["count"] = 1,
							["amount"] = 208,
						},
					},
					["WhoHealed"] = {
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 208,
								},
							},
							["amount"] = 208,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 18.03,
					["Healing"] = 208,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["心灵震爆"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 683,
									["min"] = 683,
									["count"] = 1,
									["amount"] = 683,
								},
							},
							["count"] = 1,
							["amount"] = 683,
						},
						["精神鞭笞"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 199,
									["min"] = 180,
									["count"] = 12,
									["amount"] = 2238,
								},
							},
							["count"] = 12,
							["amount"] = 2238,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 195,
									["min"] = 194,
									["count"] = 4,
									["amount"] = 777,
								},
							},
							["count"] = 4,
							["amount"] = 777,
						},
					},
					["HealingTaken"] = 208,
					["RageGain"] = 0,
					["TimeDamage"] = 16.53,
					["TimeDamaging"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 6.2,
								},
							},
							["amount"] = 6.2,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 0.03,
								},
								["精神鞭笞"] = {
									["count"] = 1,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 3.3,
								},
							},
							["amount"] = 8.830000000000002,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["恢复"] = {
							["Details"] = {
								["街头春丽-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["柠檬-逐风者"] = {
									["count"] = 27,
								},
								["老戏骨-逐风者"] = {
									["count"] = 9,
								},
								["神经蛙-逐风者"] = {
									["count"] = 6,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 6,
								},
								["蓝色空间号-逐风者"] = {
									["count"] = 6,
								},
								["老白鲨-逐风者"] = {
									["count"] = 9,
								},
								["雲木彡-逐风者"] = {
									["count"] = 15,
								},
								["源堂法雷尔-逐风者"] = {
									["count"] = 21,
								},
								["一路酱-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 108,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["蓝色空间号-逐风者"] = {
									["count"] = 9,
								},
								["柠檬-逐风者"] = {
									["count"] = 6,
								},
								["老白鲨-逐风者"] = {
									["count"] = 15,
								},
								["老戏骨-逐风者"] = {
									["count"] = 12,
								},
								["神经蛙-逐风者"] = {
									["count"] = 3,
								},
								["纳格兰放牛娃-逐风者"] = {
									["count"] = 18,
								},
								["雲木彡-逐风者"] = {
									["count"] = 21,
								},
							},
							["amount"] = 84,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 225,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 6234,
					["ElementDoneAbsorb"] = {
						["Shadow"] = 265,
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 12,
					["ElementTaken"] = {
						["Shadow"] = 499,
						["Physical"] = 3656,
						["Melee"] = 1671,
						["Nature"] = 408,
					},
					["HOTs"] = {
						["恢复"] = {
							["Details"] = {
								["街头春丽-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["Damage"] = 14774,
					["TimeHeal"] = 4.57,
					["Dispels"] = 11,
					["ElementDone"] = {
						["Shadow"] = 14365,
						["Melee"] = 84,
						["Nature"] = 325,
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 390,
								},
							},
							["amount"] = 390,
						},
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1170,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 300,
								},
								["横扫攻击"] = {
									["count"] = 42,
								},
								["断筋"] = {
									["count"] = 66,
								},
								["斩杀"] = {
									["count"] = 959,
								},
								["肉搏"] = {
									["count"] = 1607,
								},
							},
							["amount"] = 4144,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 499,
								},
							},
							["amount"] = 499,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 1119,
								},
								["肉搏"] = {
									["count"] = 64,
								},
							},
							["amount"] = 1183,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
					},
					["TimeHealing"] = {
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 4.5,
								},
								["快速治疗"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 4.57,
						},
					},
					["OverHeals"] = {
						["快速治疗"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 140,
									["min"] = 140,
									["count"] = 1,
									["amount"] = 140,
								},
							},
							["count"] = 1,
							["amount"] = 140,
						},
						["恢复"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 208,
									["min"] = 208,
									["count"] = 1,
									["amount"] = 208,
								},
							},
							["count"] = 1,
							["amount"] = 208,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["横扫攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 390,
								},
							},
							["amount"] = 390,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["横扫攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 79.06000000000002,
					["WhoDispelled"] = {
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影易伤 (驱散魔法)"] = {
									["count"] = 1,
								},
								["暗言术：痛 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["神圣之灵 (驱散魔法)"] = {
									["count"] = 1,
								},
								["心灵之火 (驱散魔法)"] = {
									["count"] = 1,
								},
								["真言术：韧 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护恐惧结界 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["Dispelled"] = 6,
					["Heals"] = {
						["恢复"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 209,
									["min"] = 208,
									["count"] = 3,
									["amount"] = 625,
								},
							},
							["count"] = 3,
							["amount"] = 625,
						},
						["快速治疗"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1472,
									["min"] = 1472,
									["count"] = 1,
									["amount"] = 1472,
								},
							},
							["count"] = 1,
							["amount"] = 1472,
						},
					},
					["Overhealing"] = 348,
					["DOT_Time"] = 192,
					["WhoHealed"] = {
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 625,
								},
								["快速治疗"] = {
									["count"] = 1472,
								},
							},
							["amount"] = 2097,
						},
					},
					["Healing"] = 2097,
					["HealedWho"] = {
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 625,
								},
								["快速治疗"] = {
									["count"] = 1472,
								},
							},
							["amount"] = 2097,
						},
					},
					["TimeSpent"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 11.03,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1.15,
								},
							},
							["amount"] = 13.68,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 0.02,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 4,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 7.09,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 5.699999999999999,
								},
							},
							["amount"] = 6.6,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2.23,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 2.26,
								},
							},
							["amount"] = 4.49,
						},
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["恢复"] = {
									["count"] = 4.5,
								},
								["快速治疗"] = {
									["count"] = 0.07,
								},
							},
							["amount"] = 4.57,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1.5,
								},
								["射击"] = {
									["count"] = 5.5,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3.07,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 4.1,
								},
							},
							["amount"] = 14.17,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["精神鞭笞"] = {
									["count"] = 1,
								},
								["心灵震爆"] = {
									["count"] = 0.03,
								},
								["心灵尖啸"] = {
									["count"] = 0.63,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 4.93,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 6.370000000000001,
								},
							},
							["amount"] = 12.96,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 6.2,
								},
							},
							["amount"] = 6.2,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3.3,
								},
							},
							["amount"] = 3.3,
						},
					},
					["Attacks"] = {
						["精神鞭笞"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 84,
									["min"] = 84,
									["count"] = 1,
									["amount"] = 84,
								},
							},
							["count"] = 1,
							["amount"] = 84,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 683,
									["min"] = 632,
									["count"] = 4,
									["amount"] = 2633,
								},
							},
							["count"] = 4,
							["amount"] = 2633,
						},
						["射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 98,
									["min"] = 66,
									["count"] = 4,
									["amount"] = 325,
								},
							},
							["count"] = 4,
							["amount"] = 325,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 181,
									["min"] = 181,
									["count"] = 1,
									["amount"] = 181,
								},
								["Tick"] = {
									["max"] = 205,
									["min"] = 91,
									["count"] = 35,
									["amount"] = 6206,
								},
							},
							["count"] = 36,
							["amount"] = 6387,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 201,
									["min"] = 176,
									["count"] = 28,
									["amount"] = 5345,
								},
							},
							["count"] = 28,
							["amount"] = 5345,
						},
					},
					["HealingTaken"] = 2097,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 63,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 70,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["TimeDamage"] = 74.49000000000002,
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 11.03,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1.15,
								},
							},
							["amount"] = 13.68,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 0.02,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 4,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 3.07,
								},
							},
							["amount"] = 7.09,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 0.9,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 5.699999999999999,
								},
							},
							["amount"] = 6.6,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 2.23,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 2.26,
								},
							},
							["amount"] = 4.49,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 1.5,
								},
								["射击"] = {
									["count"] = 5.5,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3.07,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 4.1,
								},
							},
							["amount"] = 14.17,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["精神鞭笞"] = {
									["count"] = 1,
								},
								["心灵震爆"] = {
									["count"] = 0.03,
								},
								["心灵尖啸"] = {
									["count"] = 0.63,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 4.93,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 6.370000000000001,
								},
							},
							["amount"] = 12.96,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 6.2,
								},
							},
							["amount"] = 6.2,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3.3,
								},
							},
							["amount"] = 3.3,
						},
					},
					["ManaGain"] = 390,
					["DamagedWho"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 84,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1408,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 352,
								},
							},
							["amount"] = 1844,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 635,
								},
							},
							["amount"] = 635,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 632,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 563,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 733,
								},
							},
							["amount"] = 1928,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 279,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 182,
								},
							},
							["amount"] = 461,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 398,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1166,
								},
							},
							["amount"] = 1564,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 367,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 534,
								},
							},
							["amount"] = 901,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 683,
								},
								["射击"] = {
									["count"] = 325,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 607,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1001,
								},
							},
							["amount"] = 2616,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 683,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 999,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 1377,
								},
							},
							["amount"] = 3059,
						},
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1264,
								},
							},
							["amount"] = 1264,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 502,
								},
							},
							["amount"] = 502,
						},
					},
					["DispelledWho"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["真言术：盾 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["街头春丽-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影易伤 (驱散魔法)"] = {
									["count"] = 1,
								},
								["暗言术：痛 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["自由行动 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["奥术智慧 (驱散魔法)"] = {
									["count"] = 1,
								},
								["冰甲术 (驱散魔法)"] = {
									["count"] = 1,
								},
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["先祖坚韧 (驱散魔法)"] = {
									["count"] = 1,
								},
								["坚韧祷言 (驱散魔法)"] = {
									["count"] = 1,
								},
								["自由行动 (驱散魔法)"] = {
									["count"] = 1,
								},
								["野性印记 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
				},
			},
			["UnitLockout"] = 14044.208,
			["LastActive"] = 14088.211,
		},
		["天命 <重生-火妖鲁西弗隆>"] = {
			["GUID"] = "Pet-0-5427-529-22362-10737-0301204DAE",
			["LastEventHealth"] = {
				4069, -- [1]
				4069, -- [2]
				4069, -- [3]
				4069, -- [4]
				4069, -- [5]
				4069, -- [6]
				4069, -- [7]
				4069, -- [8]
				4069, -- [9]
				4069, -- [10]
				4069, -- [11]
				4069, -- [12]
				4000, -- [13]
				3711, -- [14]
				3711, -- [15]
				3711, -- [16]
				4069, -- [17]
				4069, -- [18]
				4069, -- [19]
			},
			["LastAttackedBy"] = "吹风吹姑娘-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					19.98, -- [1]
				},
				["Damage"] = {
					858, -- [1]
				},
				["DamageTaken"] = {
					358, -- [1]
				},
				["ActiveTime"] = {
					19.98, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "天命",
			["level"] = 1,
			["LastDamageAbility"] = "魔爆术",
			["LastFightIn"] = 11,
			["type"] = "Pet",
			["ownerName"] = "重生-火妖鲁西弗隆",
			["LastDamageTaken"] = 289,
			["TimeLast"] = {
				["ActiveTime"] = 14069.21,
				["TimeDamage"] = 14069.21,
				["OVERALL"] = 14069.21,
				["DamageTaken"] = 13655.197,
				["Damage"] = 14069.21,
			},
			["LastEventHealthMax"] = {
				4069, -- [1]
				4069, -- [2]
				4069, -- [3]
				4069, -- [4]
				4069, -- [5]
				4069, -- [6]
				4069, -- [7]
				4069, -- [8]
				4069, -- [9]
				4069, -- [10]
				4069, -- [11]
				4069, -- [12]
				4069, -- [13]
				4069, -- [14]
				4069, -- [15]
				4069, -- [16]
				4069, -- [17]
				4069, -- [18]
				4069, -- [19]
			},
			["NextEventNum"] = 20,
			["LastDamageTime"] = 14069.91,
			["LastEvents"] = {
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Hit -61 (Physical)", -- [1]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Hit -61 (Physical)", -- [2]
				"天命 <重生-火妖鲁西弗隆> 撕咬 纳格兰放牛娃-逐风者 Hit -63 (Physical)", -- [3]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Hit -54 (Physical)", -- [4]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Hit -63 (Physical)", -- [5]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Immune (1)", -- [6]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Miss (1)", -- [7]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Miss (1)", -- [8]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Immune (1)", -- [9]
				"天命 <重生-火妖鲁西弗隆> 肉搏 纳格兰放牛娃-逐风者 Hit -57 (Physical)", -- [10]
				"天命 <重生-火妖鲁西弗隆> 撕咬 纳格兰放牛娃-逐风者 Hit -65 (Physical)", -- [11]
				"吹风吹姑娘-逐风者 冰霜新星 天命 <重生-火妖鲁西弗隆> Hit -69 (Frost)", -- [12]
				"吹风吹姑娘-逐风者 魔爆术 天命 <重生-火妖鲁西弗隆> Hit -289 (Arcane)", -- [13]
				"天命 <重生-火妖鲁西弗隆> 肉搏 老白鲨-逐风者 Hit -57 (Physical)", -- [14]
				"天命 <重生-火妖鲁西弗隆> 撕咬 老白鲨-逐风者 Hit -56 (Physical)", -- [15]
				"天命 <重生-火妖鲁西弗隆> 肉搏 老白鲨-逐风者 Hit -62 (Physical)", -- [16]
				"天命 <重生-火妖鲁西弗隆> 肉搏 源堂法雷尔-逐风者 Hit -118 (Physical)", -- [17]
				"天命 <重生-火妖鲁西弗隆> 撕咬 源堂法雷尔-逐风者 Hit -71 (Physical)", -- [18]
				"天命 <重生-火妖鲁西弗隆> 肉搏 源堂法雷尔-逐风者 Hit -70 (Physical)", -- [19]
			},
			["Name"] = "天命",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
			},
			["LastEventTimes"] = {
				13636.462, -- [1]
				13637.962, -- [2]
				13638.445, -- [3]
				13639.479, -- [4]
				13640.979, -- [5]
				13642.479, -- [6]
				13643.996, -- [7]
				13645.496, -- [8]
				13646.996, -- [9]
				13648.496, -- [10]
				13648.963, -- [11]
				13651.88, -- [12]
				13656.163, -- [13]
				13662.581, -- [14]
				13662.714, -- [15]
				13664.081, -- [16]
				14068.409, -- [17]
				14069.243, -- [18]
				14069.91, -- [19]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 259,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 188,
						["Physical"] = 71,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 71,
								},
								["肉搏"] = {
									["count"] = 188,
								},
							},
							["amount"] = 259,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.83,
								},
								["肉搏"] = {
									["count"] = 2.17,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 71,
									["min"] = 71,
									["count"] = 1,
									["amount"] = 71,
								},
							},
							["count"] = 1,
							["amount"] = 71,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 118,
									["min"] = 70,
									["count"] = 2,
									["amount"] = 188,
								},
							},
							["count"] = 2,
							["amount"] = 188,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3,
					["TimeDamaging"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.83,
								},
								["肉搏"] = {
									["count"] = 2.17,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["撕咬"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 71,
									["min"] = 56,
									["count"] = 4,
									["amount"] = 255,
								},
							},
							["count"] = 4,
							["amount"] = 255,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 118,
									["min"] = 54,
									["count"] = 9,
									["amount"] = 603,
								},
							},
							["count"] = 13,
							["amount"] = 603,
						},
					},
					["TimeSpent"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.83,
								},
								["肉搏"] = {
									["count"] = 2.17,
								},
							},
							["amount"] = 3,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 13.03,
								},
							},
							["amount"] = 13.98,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.13,
								},
								["肉搏"] = {
									["count"] = 2.87,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 358,
					["WhoDamaged"] = {
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 289,
								},
								["冰霜新星"] = {
									["count"] = 69,
								},
							},
							["amount"] = 358,
						},
					},
					["ElementDone"] = {
						["Melee"] = 603,
						["Physical"] = 255,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 13,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DamagedWho"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 71,
								},
								["肉搏"] = {
									["count"] = 188,
								},
							},
							["amount"] = 259,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 128,
								},
								["肉搏"] = {
									["count"] = 296,
								},
							},
							["amount"] = 424,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 56,
								},
								["肉搏"] = {
									["count"] = 119,
								},
							},
							["amount"] = 175,
						},
					},
					["TimeDamage"] = 19.98,
					["TimeDamaging"] = {
						["源堂法雷尔-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.83,
								},
								["肉搏"] = {
									["count"] = 2.17,
								},
							},
							["amount"] = 3,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 13.03,
								},
							},
							["amount"] = 13.98,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 0.13,
								},
								["肉搏"] = {
									["count"] = 2.87,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTaken"] = {
						["Arcane"] = 289,
						["Frost"] = 69,
					},
					["ActiveTime"] = 19.98,
					["Damage"] = 858,
				},
			},
			["UnitLockout"] = 13636.212,
			["LastActive"] = 14069.21,
		},
		["贰公主洛基-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-0321F52A",
			["LastEventHealth"] = {
				3603, -- [1]
				3603, -- [2]
				3603, -- [3]
				3603, -- [4]
				3603, -- [5]
				3603, -- [6]
				3603, -- [7]
				3603, -- [8]
				3603, -- [9]
				3603, -- [10]
				3603, -- [11]
				3603, -- [12]
				3603, -- [13]
				3603, -- [14]
				3603, -- [15]
				4843, -- [16]
				4843, -- [17]
				4843, -- [18]
				4843, -- [19]
				4843, -- [20]
				4843, -- [21]
				4843, -- [22]
				4843, -- [23]
				4843, -- [24]
				3603, -- [25]
				3603, -- [26]
				3522, -- [27]
				3522, -- [28]
				3522, -- [29]
				3522, -- [30]
				3603, -- [31]
				3603, -- [32]
				3578, -- [33]
				3578, -- [34]
				3578, -- [35]
				3578, -- [36]
				3578, -- [37]
				3578, -- [38]
				3578, -- [39]
				3578, -- [40]
				3578, -- [41]
				3578, -- [42]
				3578, -- [43]
				3603, -- [44]
				3603, -- [45]
				3603, -- [46]
			},
			["LastAttackedBy"] = "妖儿-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
			},
			["TimeWindows"] = {
				["ActiveTime"] = {
					36.75000000000001, -- [1]
				},
				["DamageTaken"] = {
					106, -- [1]
				},
				["TimeDamage"] = {
					36.75000000000001, -- [1]
				},
				["DOT_Time"] = {
					99, -- [1]
				},
				["Damage"] = {
					6041, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastDamageTaken"] = 25,
			["TimeLast"] = {
				["DamageTaken"] = 14041.208,
				["ActiveTime"] = 14051.208,
				["TimeDamage"] = 14051.208,
				["OVERALL"] = 14051.208,
				["DOT_Time"] = 14050.208,
				["Damage"] = 14051.208,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3603, -- [1]
				3603, -- [2]
				3603, -- [3]
				3603, -- [4]
				3603, -- [5]
				3603, -- [6]
				3603, -- [7]
				3603, -- [8]
				3603, -- [9]
				3603, -- [10]
				3603, -- [11]
				3603, -- [12]
				3603, -- [13]
				3603, -- [14]
				3603, -- [15]
				4843, -- [16]
				4843, -- [17]
				4843, -- [18]
				4843, -- [19]
				4843, -- [20]
				4843, -- [21]
				4843, -- [22]
				4843, -- [23]
				4843, -- [24]
				3603, -- [25]
				3603, -- [26]
				3603, -- [27]
				3603, -- [28]
				3603, -- [29]
				3603, -- [30]
				3603, -- [31]
				3603, -- [32]
				3603, -- [33]
				3603, -- [34]
				3603, -- [35]
				3603, -- [36]
				3603, -- [37]
				3603, -- [38]
				3603, -- [39]
				3603, -- [40]
				3603, -- [41]
				3603, -- [42]
				3603, -- [43]
				3603, -- [44]
				3603, -- [45]
				3603, -- [46]
			},
			["NextEventNum"] = 47,
			["LastDamageTime"] = 14051.275,
			["LastEvents"] = {
				"贰公主洛基-火妖鲁西弗隆 月火术 蓝色空间号-逐风者 Absorb -259 (259 被吸收) (Arcane)", -- [1]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Absorb -71 (71 被吸收) (Nature)", -- [2]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Absorb -124 (124 被吸收) (Arcane)", -- [3]
				"贰公主洛基-火妖鲁西弗隆 肉搏 初代大魔王-逐风者 Absorb -38 (1)", -- [4]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -32 (38 被吸收) (Nature)", -- [5]
				"贰公主洛基-火妖鲁西弗隆 月火术 老戏骨-逐风者 Hit -241 (Arcane)", -- [6]
				"贰公主洛基-火妖鲁西弗隆 月火术 蓝色空间号-逐风者 Hit -256 (Arcane)", -- [7]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 蓝色空间号-逐风者 Tick -124 (Arcane)", -- [8]
				"贰公主洛基-火妖鲁西弗隆 月火术 蓝色空间号-逐风者 Hit -232 (Arcane)", -- [9]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 蓝色空间号-逐风者 Tick -71 (Nature)", -- [10]
				"贰公主洛基-火妖鲁西弗隆 月火术 初代大魔王-逐风者 Crit -536 (Arcane)", -- [11]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 蓝色空间号-逐风者 Tick -71 (Nature)", -- [12]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 蓝色空间号-逐风者 Tick -124 (Arcane)", -- [13]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 蓝色空间号-逐风者 Tick -70 (Nature)", -- [14]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -123 (Arcane)", -- [15]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -70 (Nature)", -- [16]
				"贰公主洛基-火妖鲁西弗隆 纠缠根须 (伤害/跳) 初代大魔王-逐风者 Tick -33 (Nature)", -- [17]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -123 (Arcane)", -- [18]
				"贰公主洛基-火妖鲁西弗隆 肉搏 初代大魔王-逐风者 Hit -164 (Physical)", -- [19]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -71 (Nature)", -- [20]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -123 (Arcane)", -- [21]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -70 (Nature)", -- [22]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -71 (Nature)", -- [23]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -123 (Arcane)", -- [24]
				"贰公主洛基-火妖鲁西弗隆 月火术 初代大魔王-逐风者 Hit -260 (Arcane)", -- [25]
				"初代大魔王-逐风者 冰霜新星 贰公主洛基-火妖鲁西弗隆 Hit -81 (Frost)", -- [26]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -71 (Nature)", -- [27]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -124 (Arcane)", -- [28]
				"贰公主洛基-火妖鲁西弗隆 月火术 初代大魔王-逐风者 Hit -218 (Arcane)", -- [29]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -70 (Nature)", -- [30]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 老戏骨-逐风者 Tick -124 (Arcane)", -- [31]
				"妖儿-逐风者 冰霜新星 贰公主洛基-火妖鲁西弗隆 Hit -25 (Frost)", -- [32]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -124 (Arcane)", -- [33]
				"贰公主洛基-火妖鲁西弗隆 月火术 妖儿-逐风者 Hit -241 (Arcane)", -- [34]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -70 (Nature)", -- [35]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 老戏骨-逐风者 Tick -124 (Arcane)", -- [36]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -70 (Nature)", -- [37]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -124 (Arcane)", -- [38]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 妖儿-逐风者 Tick -124 (Arcane)", -- [39]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 老戏骨-逐风者 Tick -124 (Arcane)", -- [40]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -71 (Nature)", -- [41]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -124 (Arcane)", -- [42]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -70 (Nature)", -- [43]
				"贰公主洛基-火妖鲁西弗隆 虫群 (伤害/跳) 初代大魔王-逐风者 Tick -70 (Nature)", -- [44]
				"贰公主洛基-火妖鲁西弗隆 月火术 (伤害/跳) 初代大魔王-逐风者 Tick -124 (Arcane)", -- [45]
				"贰公主洛基-火妖鲁西弗隆 月火术 初代大魔王-逐风者 Crit -494 (Arcane)", -- [46]
			},
			["Name"] = "贰公主洛基-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
			},
			["LastEventTimes"] = {
				13474.217, -- [1]
				13823.025, -- [2]
				13823.525, -- [3]
				13825.026, -- [4]
				13825.026, -- [5]
				13839.36, -- [6]
				13842.593, -- [7]
				13845.594, -- [8]
				13845.644, -- [9]
				13846.144, -- [10]
				13847.661, -- [11]
				13848.144, -- [12]
				13848.611, -- [13]
				13850.161, -- [14]
				13850.677, -- [15]
				13852.844, -- [16]
				13853.328, -- [17]
				13853.661, -- [18]
				13854.411, -- [19]
				13854.844, -- [20]
				13856.661, -- [21]
				13856.844, -- [22]
				13858.861, -- [23]
				13859.661, -- [24]
				13859.695, -- [25]
				13860.028, -- [26]
				13860.861, -- [27]
				13862.695, -- [28]
				13862.745, -- [29]
				13863.228, -- [30]
				14039.841, -- [31]
				14041.775, -- [32]
				14042.024, -- [33]
				14042.441, -- [34]
				14042.574, -- [35]
				14042.841, -- [36]
				14044.574, -- [37]
				14045.041, -- [38]
				14045.441, -- [39]
				14045.858, -- [40]
				14046.575, -- [41]
				14048.025, -- [42]
				14048.575, -- [43]
				14050.575, -- [44]
				14051.025, -- [45]
				14051.275, -- [46]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["初代大魔王-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["老戏骨-逐风者"] = {
									["count"] = 9,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 12,
								},
								["妖儿-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 25,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 8,
								},
							},
							["amount"] = 10,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 25,
					},
					["DOT_Time"] = 39,
					["Damage"] = 2078,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Nature"] = 351,
						["Arcane"] = 1727,
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["老戏骨-逐风者"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 372,
								},
							},
							["amount"] = 372,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 351,
								},
								["月火术"] = {
									["count"] = 494,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 496,
								},
							},
							["amount"] = 1341,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 241,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 124,
								},
							},
							["amount"] = 365,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["妖儿-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["老戏骨-逐风者"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 2.19,
								},
							},
							["amount"] = 2.19,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 4.4,
								},
								["月火术"] = {
									["count"] = 0.25,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.87,
								},
							},
							["amount"] = 8.52,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 0.42,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.8200000000000001,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 11.53,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 71,
									["min"] = 70,
									["count"] = 5,
									["amount"] = 351,
								},
							},
							["count"] = 5,
							["amount"] = 351,
						},
						["月火术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 494,
									["min"] = 494,
									["count"] = 1,
									["amount"] = 494,
								},
								["Hit"] = {
									["max"] = 241,
									["min"] = 241,
									["count"] = 1,
									["amount"] = 241,
								},
							},
							["count"] = 2,
							["amount"] = 735,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 124,
									["min"] = 124,
									["count"] = 8,
									["amount"] = 992,
								},
							},
							["count"] = 8,
							["amount"] = 992,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 11.53,
					["TimeDamaging"] = {
						["老戏骨-逐风者"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 2.19,
								},
							},
							["amount"] = 2.19,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 4.4,
								},
								["月火术"] = {
									["count"] = 0.25,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.87,
								},
							},
							["amount"] = 8.52,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 0.42,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.8200000000000001,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["初代大魔王-逐风者"] = {
									["count"] = 39,
								},
								["蓝色空间号-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 48,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["初代大魔王-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["蓝色空间号-逐风者"] = {
									["count"] = 6,
								},
								["老戏骨-逐风者"] = {
									["count"] = 9,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 30,
								},
								["妖儿-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 48,
						},
					},
					["TimeSpent"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 2.48,
								},
								["月火术"] = {
									["count"] = 3.05,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.97,
								},
							},
							["amount"] = 7.499999999999999,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 2.19,
								},
							},
							["amount"] = 3.69,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 11.16,
								},
								["肉搏"] = {
									["count"] = 2.25,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 0.48,
								},
								["月火术"] = {
									["count"] = 1.83,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 9.02,
								},
							},
							["amount"] = 24.74,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 0.42,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.8200000000000001,
						},
					},
					["DamageTaken"] = 106,
					["ElementDoneAbsorb"] = {
						["Nature"] = 109,
						["Arcane"] = 383,
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 36.75000000000001,
					["ElementTaken"] = {
						["Frost"] = 106,
					},
					["DOT_Time"] = 99,
					["Damage"] = 6041,
					["ElementDone"] = {
						["Nature"] = 1122,
						["Melee"] = 202,
						["Arcane"] = 4717,
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamagedWho"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 212,
								},
								["月火术"] = {
									["count"] = 747,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 248,
								},
							},
							["amount"] = 1207,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 241,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 372,
								},
							},
							["amount"] = 613,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 877,
								},
								["肉搏"] = {
									["count"] = 202,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 33,
								},
								["月火术"] = {
									["count"] = 1508,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1236,
								},
							},
							["amount"] = 3856,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 241,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 124,
								},
							},
							["amount"] = 365,
						},
					},
					["TimeDamage"] = 36.75000000000001,
					["TimeDamaging"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 2.48,
								},
								["月火术"] = {
									["count"] = 3.05,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.97,
								},
							},
							["amount"] = 7.499999999999999,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 2.19,
								},
							},
							["amount"] = 3.69,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 11.16,
								},
								["肉搏"] = {
									["count"] = 2.25,
								},
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 0.48,
								},
								["月火术"] = {
									["count"] = 1.83,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 9.02,
								},
							},
							["amount"] = 24.74,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 0.42,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 0.4,
								},
							},
							["amount"] = 0.8200000000000001,
						},
					},
					["Attacks"] = {
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 71,
									["min"] = 32,
									["count"] = 15,
									["amount"] = 1018,
								},
								["Absorb"] = {
									["max"] = 71,
									["min"] = 71,
									["count"] = 1,
									["amount"] = 71,
								},
							},
							["count"] = 16,
							["amount"] = 1089,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 164,
									["min"] = 164,
									["count"] = 1,
									["amount"] = 164,
								},
								["Absorb"] = {
									["max"] = 38,
									["min"] = 38,
									["count"] = 1,
									["amount"] = 38,
								},
							},
							["count"] = 2,
							["amount"] = 202,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 33,
									["min"] = 33,
									["count"] = 1,
									["amount"] = 33,
								},
							},
							["count"] = 1,
							["amount"] = 33,
						},
						["月火术"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 259,
									["min"] = 259,
									["count"] = 1,
									["amount"] = 259,
								},
								["Crit"] = {
									["max"] = 536,
									["min"] = 494,
									["count"] = 2,
									["amount"] = 1030,
								},
								["Hit"] = {
									["max"] = 260,
									["min"] = 218,
									["count"] = 6,
									["amount"] = 1448,
								},
							},
							["count"] = 9,
							["amount"] = 2737,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 124,
									["min"] = 123,
									["count"] = 15,
									["amount"] = 1856,
								},
								["Absorb"] = {
									["max"] = 124,
									["min"] = 124,
									["count"] = 1,
									["amount"] = 124,
								},
							},
							["count"] = 16,
							["amount"] = 1980,
						},
					},
					["WhoDamaged"] = {
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 81,
								},
							},
							["amount"] = 81,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 16,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 17,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 15,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 25,
						},
					},
				},
			},
			["UnitLockout"] = 14039.207,
			["LastActive"] = 14051.208,
		},
		["孤塔的监视者 <罗拉娜的凝视-逐风者>"] = {
			["GUID"] = "Pet-0-5427-30-20185-5828-040127A3BA",
			["LastEventHealth"] = {
				3883, -- [1]
				2643, -- [2]
				2356, -- [3]
				2241, -- [4]
				2126, -- [5]
				2011, -- [6]
				1939, -- [7]
				1646, -- [8]
				3883, -- [9]
				3883, -- [10]
				3883, -- [11]
				3883, -- [12]
				3883, -- [13]
				3883, -- [14]
				3883, -- [15]
				3883, -- [16]
				3883, -- [17]
			},
			["LastAttackedBy"] = "纳格兰放牛娃-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
			},
			["TimeWindows"] = {
				["Damage"] = {
					356, -- [1]
				},
				["TimeDamage"] = {
					7.319999999999999, -- [1]
				},
				["DamageTaken"] = {
					1799, -- [1]
				},
				["ActiveTime"] = {
					7.319999999999999, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "孤塔的监视者",
			["level"] = 1,
			["LastDamageAbility"] = "重伤 (伤害/跳)",
			["LastFightIn"] = 3,
			["type"] = "Pet",
			["ownerName"] = "罗拉娜的凝视-逐风者",
			["LastEventHealthMax"] = {
				3883, -- [1]
				3883, -- [2]
				3883, -- [3]
				3883, -- [4]
				3883, -- [5]
				3883, -- [6]
				3883, -- [7]
				3883, -- [8]
				3883, -- [9]
				3883, -- [10]
				3883, -- [11]
				3883, -- [12]
				3883, -- [13]
				3883, -- [14]
				3883, -- [15]
				3883, -- [16]
				3883, -- [17]
			},
			["LastDamageTaken"] = 114,
			["TimeLast"] = {
				["ActiveTime"] = 13354.208,
				["TimeDamage"] = 13354.208,
				["OVERALL"] = 13354.208,
				["DamageTaken"] = 13032.201,
				["Damage"] = 13354.208,
			},
			["NextEventNum"] = 18,
			["LastDamageTime"] = 13355.025,
			["LastEvents"] = {
				"纳格兰放牛娃-逐风者 旋风斩 孤塔的监视者 <罗拉娜的凝视-逐风者> Crit -688 (Physical)", -- [1]
				"吹风吹姑娘-逐风者 魔爆术 孤塔的监视者 <罗拉娜的凝视-逐风者> Hit -287 (Arcane)", -- [2]
				"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 孤塔的监视者 <罗拉娜的凝视-逐风者> Tick -115 (Physical)", -- [3]
				"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 孤塔的监视者 <罗拉娜的凝视-逐风者> Tick -115 (Physical)", -- [4]
				"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 孤塔的监视者 <罗拉娜的凝视-逐风者> Tick -115 (Physical)", -- [5]
				"吹风吹姑娘-逐风者 冰霜新星 孤塔的监视者 <罗拉娜的凝视-逐风者> Hit -72 (Frost)", -- [6]
				"吹风吹姑娘-逐风者 魔爆术 孤塔的监视者 <罗拉娜的凝视-逐风者> Hit -293 (Arcane)", -- [7]
				"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 孤塔的监视者 <罗拉娜的凝视-逐风者> Tick -114 (Physical)", -- [8]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 肉搏 灬山河灬-逐风者 Dodge (1)", -- [9]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 爪击 灬山河灬-逐风者 Dodge (Physical)", -- [10]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 肉搏 时间的小溪-逐风者 Hit -55 (Physical)", -- [11]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 爪击 时间的小溪-逐风者 Hit -35 (Physical)", -- [12]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 肉搏 纳格兰放牛娃-逐风者 Hit -56 (Physical)", -- [13]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 爪击 纳格兰放牛娃-逐风者 Hit -31 (Physical)", -- [14]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 肉搏 灬山河灬-逐风者 Hit -64 (Physical)", -- [15]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 爪击 灬山河灬-逐风者 Crit -70 (Physical)", -- [16]
				"孤塔的监视者 <罗拉娜的凝视-逐风者> 肉搏 灬山河灬-逐风者 Hit -45 (Physical)", -- [17]
			},
			["Name"] = "孤塔的监视者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
			},
			["LastEventTimes"] = {
				13021.067, -- [1]
				13023.584, -- [2]
				13024.084, -- [3]
				13027.084, -- [4]
				13030.084, -- [5]
				13030.801, -- [6]
				13032.318, -- [7]
				13033.101, -- [8]
				13109.024, -- [9]
				13109.024, -- [10]
				13121.975, -- [11]
				13121.991, -- [12]
				13297.654, -- [13]
				13297.671, -- [14]
				13353.741, -- [15]
				13353.741, -- [16]
				13355.025, -- [17]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DamagedWho"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 70,
								},
								["肉搏"] = {
									["count"] = 109,
								},
							},
							["amount"] = 179,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 31,
								},
								["肉搏"] = {
									["count"] = 56,
								},
							},
							["amount"] = 87,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 35,
								},
								["肉搏"] = {
									["count"] = 55,
								},
							},
							["amount"] = 90,
						},
					},
					["ElementDone"] = {
						["Melee"] = 220,
						["Physical"] = 136,
					},
					["TimeSpent"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.28,
								},
							},
							["amount"] = 4.28,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DamageTaken"] = 1799,
					["Attacks"] = {
						["爪击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 35,
									["min"] = 31,
									["count"] = 2,
									["amount"] = 66,
								},
								["Crit"] = {
									["max"] = 70,
									["min"] = 70,
									["count"] = 1,
									["amount"] = 70,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 136,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 64,
									["min"] = 45,
									["count"] = 4,
									["amount"] = 220,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 220,
						},
					},
					["PartialResist"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["TimeDamaging"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.28,
								},
							},
							["amount"] = 4.28,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.52,
						},
					},
					["PartialAbsorb"] = {
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 7.319999999999999,
					["WhoDamaged"] = {
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 459,
								},
								["旋风斩"] = {
									["count"] = 688,
								},
							},
							["amount"] = 1147,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 580,
								},
								["冰霜新星"] = {
									["count"] = 72,
								},
							},
							["amount"] = 652,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 1147,
						["Frost"] = 72,
						["Arcane"] = 580,
					},
					["TimeDamage"] = 7.319999999999999,
					["Damage"] = 356,
				},
			},
			["UnitLockout"] = 13020.2,
			["LastActive"] = 13354.208,
		},
		["从天而降-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02F86D2D",
			["TimeLast"] = {
				["TimeHeal"] = 14000.205,
				["Dispelled"] = 13784.206,
				["Dispels"] = 13784.206,
				["HealingTaken"] = 14000.205,
				["OVERALL"] = 14087.211,
				["DamageTaken"] = 14087.211,
				["Interrupts"] = 13596.209,
				["DeathCount"] = 14006.205,
				["RageGain"] = 14086.211,
				["Overhealing"] = 13881.213,
				["TimeDamage"] = 14082.21,
				["Healing"] = 14000.205,
				["ActiveTime"] = 14082.21,
				["DOT_Time"] = 14012.206,
				["Damage"] = 14079.21,
			},
			["LastAttackedBy"] = "老白鲨-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"MISC", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					6, -- [1]
				},
				["Dispelled"] = {
					4, -- [1]
				},
				["Dispels"] = {
					4, -- [1]
				},
				["Healing"] = {
					366, -- [1]
				},
				["DamageTaken"] = {
					21329, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["Interrupts"] = {
					1, -- [1]
				},
				["RageGain"] = {
					268, -- [1]
				},
				["Overhealing"] = {
					96, -- [1]
				},
				["ActiveTime"] = {
					108.55, -- [1]
				},
				["HealingTaken"] = {
					366, -- [1]
				},
				["TimeDamage"] = {
					102.55, -- [1]
				},
				["DOT_Time"] = {
					63, -- [1]
				},
				["Damage"] = {
					33101, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						false, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
					},
					["Messages"] = {
						"初代大魔王-逐风者 魔爆术 从天而降-火妖鲁西弗隆 Hit -305 (Arcane)", -- [1]
						"从天而降-火妖鲁西弗隆 拦截昏迷 请叫我天哥-逐风者 Hit -38 (Physical)", -- [2]
						"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [3]
						"从天而降-火妖鲁西弗隆 断筋 请叫我天哥-逐风者 Hit -28 (Physical)", -- [4]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [5]
						"从天而降-火妖鲁西弗隆 肉搏 请叫我天哥-逐风者 Hit -333 (Physical)", -- [6]
						"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [7]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [8]
						"请叫我天哥-逐风者 摔绊 从天而降-火妖鲁西弗隆 Hit -16 (Physical)", -- [9]
						"从天而降-火妖鲁西弗隆 致死打击 请叫我天哥-逐风者 Dodge (Physical)", -- [10]
						"从天而降-火妖鲁西弗隆 英勇打击 请叫我天哥-逐风者 Hit -404 (Physical)", -- [11]
						"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [12]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [13]
						"从天而降-火妖鲁西弗隆 神圣力量 从天而降-火妖鲁西弗隆 Hit +82", -- [14]
						"从天而降-火妖鲁西弗隆 压制 请叫我天哥-逐风者 Crit -637 (Physical)", -- [15]
						"神经蛙-逐风者 断筋 从天而降-火妖鲁西弗隆 Hit -30 (Physical)", -- [16]
						"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [17]
						"从天而降-火妖鲁西弗隆 肉搏 请叫我文哥 Crit -699 (Physical)", -- [18]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [19]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -89 (Physical)", -- [20]
						"请叫我天哥-逐风者 多重射击 从天而降-火妖鲁西弗隆 Hit -329 (Physical)", -- [21]
						"神经蛙-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -316 (Physical)", -- [22]
						"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [23]
						"神经蛙-逐风者 断筋 从天而降-火妖鲁西弗隆 Hit -30 (Physical)", -- [24]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我文哥 Tick -89 (Physical)", -- [25]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -90 (Physical)", -- [26]
						"神经蛙-逐风者 斩杀 从天而降-火妖鲁西弗隆 Hit -483 (Physical)", -- [27]
						"从天而降-火妖鲁西弗隆死亡。", -- [28]
					},
					["DeathAt"] = 14008.205,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
					},
					["MessageTimes"] = {
						-14.33399999999892, -- [1]
						-14.18399999999929, -- [2]
						-13.58399999999892, -- [3]
						-13.1349999999984, -- [4]
						-12.5679999999993, -- [5]
						-11.80099999999948, -- [6]
						-10.58399999999892, -- [7]
						-9.583999999998923, -- [8]
						-8.98399999999856, -- [9]
						-8.566999999999098, -- [10]
						-8.000999999998385, -- [11]
						-7.600999999998749, -- [12]
						-6.566999999999098, -- [13]
						-6.566999999999098, -- [14]
						-6.566999999999098, -- [15]
						-4.633999999998196, -- [16]
						-4.583999999998923, -- [17]
						-3.716999999998734, -- [18]
						-3.566999999999098, -- [19]
						-3.533999999999651, -- [20]
						-2.333999999998923, -- [21]
						-1.666999999999462, -- [22]
						-1.599999999998545, -- [23]
						-1.533999999999651, -- [24]
						-0.6829999999990832, -- [25]
						-0.5499999999992724, -- [26]
						-0.03299999999944703, -- [27]
						0, -- [28]
					},
					["HealthMax"] = {
						4879, -- [1]
						4879, -- [2]
						4879, -- [3]
						4879, -- [4]
						4879, -- [5]
						4879, -- [6]
						4879, -- [7]
						4879, -- [8]
						4879, -- [9]
						4879, -- [10]
						4879, -- [11]
						4879, -- [12]
						4879, -- [13]
						4879, -- [14]
						4879, -- [15]
						4879, -- [16]
						4879, -- [17]
						4879, -- [18]
						4879, -- [19]
						4879, -- [20]
						4879, -- [21]
						4879, -- [22]
						4879, -- [23]
						4879, -- [24]
						4879, -- [25]
						4879, -- [26]
						4879, -- [27]
						4879, -- [28]
					},
					["Health"] = {
						1858, -- [1]
						1858, -- [2]
						1556, -- [3]
						1445, -- [4]
						1445, -- [5]
						1448, -- [6]
						1448, -- [7]
						1341, -- [8]
						1341, -- [9]
						1325, -- [10]
						1325, -- [11]
						1328, -- [12]
						1217, -- [13]
						1217, -- [14]
						1217, -- [15]
						1302, -- [16]
						1302, -- [17]
						1164, -- [18]
						1164, -- [19]
						1164, -- [20]
						1164, -- [21]
						839, -- [22]
						839, -- [23]
						839, -- [24]
						382, -- [25]
						382, -- [26]
						385, -- [27]
						0, -- [28]
					},
					["KilledBy"] = "神经蛙-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"HEAL", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"MISC", -- [28]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
					},
					["Messages"] = {
						"从天而降-火妖鲁西弗隆 肉搏 纳格兰放牛娃-逐风者 Hit -403 (Physical)", -- [1]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -73 (Physical)", -- [2]
						"从天而降-火妖鲁西弗隆 致死打击 纳格兰放牛娃-逐风者 Hit -519 (Physical)", -- [3]
						"吹风吹姑娘-逐风者 冰锥术 从天而降-火妖鲁西弗隆 Hit -568 (Frost)", -- [4]
						"吹风吹姑娘-逐风者 冰霜新星 从天而降-火妖鲁西弗隆 Hit -70 (Frost)", -- [5]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -72 (Physical)", -- [6]
						"吹风吹姑娘-逐风者 魔爆术 从天而降-火妖鲁西弗隆 Hit -292 (Arcane)", -- [7]
						"纳格兰放牛娃-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -87 (Physical)", -- [8]
						"从天而降-火妖鲁西弗隆 斩杀 纳格兰放牛娃-逐风者 Crit -1391 (Physical)", -- [9]
						"神经蛙-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -263 (Physical)", -- [10]
						"吹风吹姑娘-逐风者 冰霜新星 从天而降-火妖鲁西弗隆 Hit -73 (Frost)", -- [11]
						"纳格兰放牛娃-逐风者 重伤 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -73 (Physical)", -- [12]
						"神经蛙-逐风者 雷霆一击 从天而降-火妖鲁西弗隆 Hit -60 (Physical)", -- [13]
						"从天而降-火妖鲁西弗隆 肉搏 吹风吹姑娘-逐风者 Immune (1)", -- [14]
						"吹风吹姑娘-逐风者 魔爆术 从天而降-火妖鲁西弗隆 Hit -320 (Arcane)", -- [15]
						"从天而降-火妖鲁西弗隆 断筋 神经蛙-逐风者 Hit -26 (Physical)", -- [16]
						"吹风吹姑娘-逐风者 冰锥术 从天而降-火妖鲁西弗隆 Crit -1209 (Frost)", -- [17]
						"从天而降-火妖鲁西弗隆 肉搏 吹风吹姑娘-逐风者 Immune (1)", -- [18]
						"从天而降-火妖鲁西弗隆 断筋 吹风吹姑娘-逐风者 Immune (Physical)", -- [19]
						"吹风吹姑娘-逐风者 魔爆术 从天而降-火妖鲁西弗隆 Hit -317 (Arcane)", -- [20]
						"请叫我天哥-逐风者 自动射击 从天而降-火妖鲁西弗隆 Hit -214 (Physical)", -- [21]
						"请叫我天哥-逐风者 多重射击 从天而降-火妖鲁西弗隆 Hit -307 (Physical)", -- [22]
						"从天而降-火妖鲁西弗隆死亡。", -- [23]
					},
					["DeathAt"] = 13745.203,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
					},
					["MessageTimes"] = {
						-14.90099999999984, -- [1]
						-14.58399999999892, -- [2]
						-14.41699999999946, -- [3]
						-14.13400000000002, -- [4]
						-12.63400000000002, -- [5]
						-11.58399999999892, -- [6]
						-11.13400000000002, -- [7]
						-11.01699999999983, -- [8]
						-10.78399999999965, -- [9]
						-10.5669999999991, -- [10]
						-9.61700000000019, -- [11]
						-8.600000000000364, -- [12]
						-8.399999999999636, -- [13]
						-6.016999999999825, -- [14]
						-3.882999999999811, -- [15]
						-3.666999999999462, -- [16]
						-2.5, -- [17]
						-1.833000000000538, -- [18]
						-1.682999999999083, -- [19]
						-1.015999999999622, -- [20]
						-0.75, -- [21]
						-0.01599999999962165, -- [22]
						0, -- [23]
					},
					["HealthMax"] = {
						4879, -- [1]
						4879, -- [2]
						4879, -- [3]
						4879, -- [4]
						4879, -- [5]
						4879, -- [6]
						4879, -- [7]
						4879, -- [8]
						4879, -- [9]
						4879, -- [10]
						4879, -- [11]
						4879, -- [12]
						4879, -- [13]
						4879, -- [14]
						4879, -- [15]
						4879, -- [16]
						4879, -- [17]
						4879, -- [18]
						4879, -- [19]
						4879, -- [20]
						4879, -- [21]
						4879, -- [22]
						4879, -- [23]
					},
					["Health"] = {
						3922, -- [1]
						3922, -- [2]
						3849, -- [3]
						3852, -- [4]
						3284, -- [5]
						3217, -- [6]
						3145, -- [7]
						2853, -- [8]
						2766, -- [9]
						2766, -- [10]
						2506, -- [11]
						2433, -- [12]
						2433, -- [13]
						2304, -- [14]
						2310, -- [15]
						1990, -- [16]
						1990, -- [17]
						784, -- [18]
						784, -- [19]
						784, -- [20]
						467, -- [21]
						253, -- [22]
						0, -- [23]
					},
					["KilledBy"] = "请叫我天哥-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"MISC", -- [23]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						false, -- [29]
						false, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						false, -- [36]
					},
					["Messages"] = {
						"从天而降-火妖鲁西弗隆 肉搏 柠檬-逐风者 Hit -272 (Physical)", -- [1]
						"柠檬-逐风者 暗影守卫 从天而降-火妖鲁西弗隆 Hit -265 (Shadow)", -- [2]
						"从天而降-火妖鲁西弗隆 断筋 时间的小溪-逐风者 Dodge (Physical)", -- [3]
						"妖儿-逐风者 冰霜新星 从天而降-火妖鲁西弗隆 Hit -28 (Frost)", -- [4]
						"从天而降-火妖鲁西弗隆 dispels 从天而降-火妖鲁西弗隆 冰霜新星 (逃命专家)", -- [5]
						"从天而降-火妖鲁西弗隆 dispels 从天而降-火妖鲁西弗隆 冰霜新星 (逃命专家)", -- [6]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -283 (Shadow)", -- [7]
						"时间的小溪-逐风者 背刺 从天而降-火妖鲁西弗隆 Crit -791 (Physical)", -- [8]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -45 (Physical)", -- [9]
						"柠檬-逐风者 心灵震爆 从天而降-火妖鲁西弗隆 Hit -951 (Shadow)", -- [10]
						"从天而降-火妖鲁西弗隆 拳击 柠檬-逐风者 Hit -37 (Physical)", -- [11]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Miss (1)", -- [12]
						"柠檬-逐风者 暗影守卫 从天而降-火妖鲁西弗隆 Hit -289 (Shadow)", -- [13]
						"柠檬-逐风者 精神鞭笞 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -298 (Shadow)", -- [14]
						"从天而降-火妖鲁西弗隆 英勇打击 柠檬-逐风者 Hit -444 (Physical)", -- [15]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -56 (Physical)", -- [16]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -306 (Shadow)", -- [17]
						"从天而降-火妖鲁西弗隆 旋风斩 时间的小溪-逐风者 Hit -457 (Physical)", -- [18]
						"妖儿-逐风者 冰冻 从天而降-火妖鲁西弗隆 Resist (Frost)", -- [19]
						"从天而降-火妖鲁西弗隆 旋风斩 妖儿-逐风者 Hit -446 (Physical)", -- [20]
						"从天而降-火妖鲁西弗隆 旋风斩 柠檬-逐风者 Hit -322 (Physical)", -- [21]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Miss (1)", -- [22]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -48 (Physical)", -- [23]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -95 (Physical)", -- [24]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -306 (Shadow)", -- [25]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -57 (Physical)", -- [26]
						"柠檬-逐风者 地精工兵炸药 从天而降-火妖鲁西弗隆 Hit -538 (Fire)", -- [27]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -100 (Physical)", -- [28]
						"从天而降-火妖鲁西弗隆 致死打击 妖儿-逐风者 Hit -709 (Physical)", -- [29]
						"从天而降-火妖鲁西弗隆 肉搏 妖儿-逐风者 Crit -956 (Physical)", -- [30]
						"时间的小溪-逐风者 铁皮手雷 从天而降-火妖鲁西弗隆 Hit -214 (Fire)", -- [31]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -57 (Physical)", -- [32]
						"时间的小溪-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -108 (Physical)", -- [33]
						"柠檬-逐风者 暗言术：痛 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -307 (Shadow)", -- [34]
						"从天而降-火妖鲁西弗隆死亡。", -- [35]
						"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 妖儿-逐风者 Absorb -126 (126 被吸收) (Physical)", -- [36]
					},
					["DeathAt"] = 13579.208,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
					},
					["MessageTimes"] = {
						-14.2510000000002, -- [1]
						-14.0679999999993, -- [2]
						-12.8179999999993, -- [3]
						-11.68399999999929, -- [4]
						-10.10099999999875, -- [5]
						-10.10099999999875, -- [6]
						-9.016999999999825, -- [7]
						-8.083999999998923, -- [8]
						-8.083999999998923, -- [9]
						-7.683999999999287, -- [10]
						-7.516999999999825, -- [11]
						-7.466999999998734, -- [12]
						-7.466999999998734, -- [13]
						-6.40099999999984, -- [14]
						-6.299999999999272, -- [15]
						-6.266999999999825, -- [16]
						-6.016999999999825, -- [17]
						-6.016999999999825, -- [18]
						-6.016999999999825, -- [19]
						-6.016999999999825, -- [20]
						-6.016999999999825, -- [21]
						-5.649999999999636, -- [22]
						-4.466999999998734, -- [23]
						-3.849999999998545, -- [24]
						-3.033999999999651, -- [25]
						-2.664999999999054, -- [26]
						-2.649999999999636, -- [27]
						-2.049999999999272, -- [28]
						-2.016999999999825, -- [29]
						-1.983999999998559, -- [30]
						-1.449999999998909, -- [31]
						-0.8670000000001892, -- [32]
						-0.25, -- [33]
						-0.01699999999982538, -- [34]
						0, -- [35]
						1.050000000001091, -- [36]
					},
					["HealthMax"] = {
						4879, -- [1]
						4879, -- [2]
						4879, -- [3]
						4879, -- [4]
						4879, -- [5]
						4879, -- [6]
						4879, -- [7]
						4879, -- [8]
						4879, -- [9]
						4879, -- [10]
						4879, -- [11]
						4879, -- [12]
						4879, -- [13]
						4879, -- [14]
						4879, -- [15]
						4879, -- [16]
						4879, -- [17]
						4879, -- [18]
						4879, -- [19]
						4879, -- [20]
						4879, -- [21]
						4879, -- [22]
						4879, -- [23]
						4879, -- [24]
						4879, -- [25]
						4879, -- [26]
						4879, -- [27]
						4879, -- [28]
						4879, -- [29]
						4879, -- [30]
						4879, -- [31]
						4879, -- [32]
						4879, -- [33]
						4879, -- [34]
						4879, -- [35]
						4879, -- [36]
					},
					["Health"] = {
						4879, -- [1]
						4879, -- [2]
						4618, -- [3]
						4618, -- [4]
						4593, -- [5]
						4593, -- [6]
						4596, -- [7]
						4313, -- [8]
						4313, -- [9]
						3477, -- [10]
						2529, -- [11]
						2529, -- [12]
						2529, -- [13]
						2240, -- [14]
						2240, -- [15]
						1942, -- [16]
						1886, -- [17]
						1886, -- [18]
						1886, -- [19]
						1886, -- [20]
						1886, -- [21]
						1584, -- [22]
						1584, -- [23]
						1536, -- [24]
						1444, -- [25]
						1138, -- [26]
						1081, -- [27]
						543, -- [28]
						543, -- [29]
						443, -- [30]
						446, -- [31]
						232, -- [32]
						175, -- [33]
						67, -- [34]
						0, -- [35]
						0, -- [36]
					},
					["KilledBy"] = "柠檬-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"MISC", -- [5]
						"MISC", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"MISC", -- [35]
						"DAMAGE", -- [36]
					},
				}, -- [3]
			},
			["level"] = 60,
			["LastDamageAbility"] = "重伤 (伤害/跳)",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastHealTime"] = 14000.555,
			["LastDamageTaken"] = 108,
			["LastEventHealth"] = {
				839, -- [1]
				382, -- [2]
				382, -- [3]
				385, -- [4]
				0, -- [5]
				1, -- [6]
				1, -- [7]
				4879, -- [8]
				4542, -- [9]
				4542, -- [10]
				4545, -- [11]
				4509, -- [12]
				3860, -- [13]
				3863, -- [14]
				3757, -- [15]
				3761, -- [16]
				4879, -- [17]
				2731, -- [18]
				2694, -- [19]
				2660, -- [20]
				2623, -- [21]
				2589, -- [22]
				2555, -- [23]
				2252, -- [24]
				2059, -- [25]
				2059, -- [26]
				1858, -- [27]
				1858, -- [28]
				1858, -- [29]
				1556, -- [30]
				1445, -- [31]
				1445, -- [32]
				1448, -- [33]
				1448, -- [34]
				1341, -- [35]
				1341, -- [36]
				1325, -- [37]
				1325, -- [38]
				1328, -- [39]
				1217, -- [40]
				1217, -- [41]
				1217, -- [42]
				1302, -- [43]
				1302, -- [44]
				1164, -- [45]
				1164, -- [46]
				1164, -- [47]
				1164, -- [48]
				839, -- [49]
				839, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4879, -- [1]
				4879, -- [2]
				4879, -- [3]
				4879, -- [4]
				4879, -- [5]
				4879, -- [6]
				4879, -- [7]
				4879, -- [8]
				4879, -- [9]
				4879, -- [10]
				4879, -- [11]
				4879, -- [12]
				4879, -- [13]
				4879, -- [14]
				4879, -- [15]
				4879, -- [16]
				4879, -- [17]
				4879, -- [18]
				4879, -- [19]
				4879, -- [20]
				4879, -- [21]
				4879, -- [22]
				4879, -- [23]
				4879, -- [24]
				4879, -- [25]
				4879, -- [26]
				4879, -- [27]
				4879, -- [28]
				4879, -- [29]
				4879, -- [30]
				4879, -- [31]
				4879, -- [32]
				4879, -- [33]
				4879, -- [34]
				4879, -- [35]
				4879, -- [36]
				4879, -- [37]
				4879, -- [38]
				4879, -- [39]
				4879, -- [40]
				4879, -- [41]
				4879, -- [42]
				4879, -- [43]
				4879, -- [44]
				4879, -- [45]
				4879, -- [46]
				4879, -- [47]
				4879, -- [48]
				4879, -- [49]
				4879, -- [50]
			},
			["NextEventNum"] = 18,
			["LastDamageTime"] = 14082.594,
			["LastEvents"] = {
				"神经蛙-逐风者 断筋 从天而降-火妖鲁西弗隆 Hit -30 (Physical)", -- [1]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我文哥 Tick -89 (Physical)", -- [2]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -90 (Physical)", -- [3]
				"神经蛙-逐风者 斩杀 从天而降-火妖鲁西弗隆 Hit -483 (Physical)", -- [4]
				"从天而降-火妖鲁西弗隆死亡。", -- [5]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我文哥 Tick -89 (Physical)", -- [6]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我文哥 Tick -89 (Physical)", -- [7]
				"从天而降-火妖鲁西弗隆 肉搏 老白鲨-逐风者 Hit -316 (Physical)", -- [8]
				"从天而降-火妖鲁西弗隆 旋风斩 雲木彡-逐风者 Hit -288 (Physical)", -- [9]
				"从天而降-火妖鲁西弗隆 旋风斩 老白鲨-逐风者 Crit -695 (Physical)", -- [10]
				"老白鲨-逐风者 断筋 从天而降-火妖鲁西弗隆 Hit -36 (Physical)", -- [11]
				"老白鲨-逐风者 肉搏 从天而降-火妖鲁西弗隆 Crit -649 (Physical)", -- [12]
				"从天而降-火妖鲁西弗隆 斩杀 老白鲨-逐风者 Crit -1037 (Physical)", -- [13]
				"老白鲨-逐风者 重伤 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -109 (Physical)", -- [14]
				"从天而降-火妖鲁西弗隆 肉搏 雲木彡-逐风者 Parry (1)", -- [15]
				"老白鲨-逐风者 重伤 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -109 (Physical)", -- [16]
				"老白鲨-逐风者 重伤 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -108 (Physical)", -- [17]
				"初代大魔王-逐风者 暴风雪 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -37 (Frost)", -- [18]
				"初代大魔王-逐风者 暴风雪 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -37 (Frost)", -- [19]
				"初代大魔王-逐风者 暴风雪 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -37 (Frost)", -- [20]
				"初代大魔王-逐风者 暴风雪 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -37 (Frost)", -- [21]
				"初代大魔王-逐风者 暴风雪 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -37 (Frost)", -- [22]
				"请叫我天哥-逐风者 多重射击 从天而降-火妖鲁西弗隆 Hit -307 (Physical)", -- [23]
				"请叫我天哥-逐风者 自动射击 从天而降-火妖鲁西弗隆 Hit -196 (Physical)", -- [24]
				"请叫我天哥-逐风者 自动射击 从天而降-火妖鲁西弗隆 Hit -201 (Physical)", -- [25]
				"从天而降-火妖鲁西弗隆 断筋 初代大魔王-逐风者 Absorb -39 (39 被吸收) (Physical)", -- [26]
				"从天而降-火妖鲁西弗隆 肉搏 初代大魔王-逐风者 Absorb -964 (964 被吸收) (1)", -- [27]
				"初代大魔王-逐风者 魔爆术 从天而降-火妖鲁西弗隆 Hit -305 (Arcane)", -- [28]
				"从天而降-火妖鲁西弗隆 拦截昏迷 请叫我天哥-逐风者 Hit -38 (Physical)", -- [29]
				"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [30]
				"从天而降-火妖鲁西弗隆 断筋 请叫我天哥-逐风者 Hit -28 (Physical)", -- [31]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [32]
				"从天而降-火妖鲁西弗隆 肉搏 请叫我天哥-逐风者 Hit -333 (Physical)", -- [33]
				"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [34]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [35]
				"请叫我天哥-逐风者 摔绊 从天而降-火妖鲁西弗隆 Hit -16 (Physical)", -- [36]
				"从天而降-火妖鲁西弗隆 致死打击 请叫我天哥-逐风者 Dodge (Physical)", -- [37]
				"从天而降-火妖鲁西弗隆 英勇打击 请叫我天哥-逐风者 Hit -404 (Physical)", -- [38]
				"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [39]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [40]
				"从天而降-火妖鲁西弗隆 神圣力量 从天而降-火妖鲁西弗隆 Hit +82", -- [41]
				"从天而降-火妖鲁西弗隆 压制 请叫我天哥-逐风者 Crit -637 (Physical)", -- [42]
				"神经蛙-逐风者 断筋 从天而降-火妖鲁西弗隆 Hit -30 (Physical)", -- [43]
				"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [44]
				"从天而降-火妖鲁西弗隆 肉搏 请叫我文哥 Crit -699 (Physical)", -- [45]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 初代大魔王-逐风者 Absorb -81 (81 被吸收) (Physical)", -- [46]
				"从天而降-火妖鲁西弗隆 重伤 (伤害/跳) 请叫我天哥-逐风者 Tick -89 (Physical)", -- [47]
				"请叫我天哥-逐风者 多重射击 从天而降-火妖鲁西弗隆 Hit -329 (Physical)", -- [48]
				"神经蛙-逐风者 肉搏 从天而降-火妖鲁西弗隆 Hit -316 (Physical)", -- [49]
				"请叫我天哥-逐风者 毒蛇钉刺 (伤害/跳) 从天而降-火妖鲁西弗隆 Tick -111 (Nature)", -- [50]
			},
			["Name"] = "从天而降-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				false, -- [35]
				true, -- [36]
				false, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				14005.588, -- [1]
				14006.439, -- [2]
				14006.572, -- [3]
				14007.089, -- [4]
				14007.122, -- [5]
				14009.439, -- [6]
				14012.49, -- [7]
				14076.143, -- [8]
				14077.727, -- [9]
				14077.727, -- [10]
				14077.91, -- [11]
				14078.21, -- [12]
				14079.527, -- [13]
				14081.244, -- [14]
				14082.594, -- [15]
				14084.244, -- [16]
				14087.244, -- [17]
				13981.653, -- [18]
				13982.653, -- [19]
				13983.654, -- [20]
				13984.654, -- [21]
				13985.654, -- [22]
				13988.804, -- [23]
				13989.038, -- [24]
				13991.154, -- [25]
				13991.204, -- [26]
				13991.521, -- [27]
				13992.788, -- [28]
				13992.938, -- [29]
				13993.538, -- [30]
				13993.987, -- [31]
				13994.554, -- [32]
				13995.321, -- [33]
				13996.538, -- [34]
				13997.538, -- [35]
				13998.138, -- [36]
				13998.555, -- [37]
				13999.121, -- [38]
				13999.521, -- [39]
				14000.555, -- [40]
				14000.555, -- [41]
				14000.555, -- [42]
				14002.488, -- [43]
				14002.538, -- [44]
				14003.405, -- [45]
				14003.555, -- [46]
				14003.588, -- [47]
				14004.788, -- [48]
				14005.455, -- [49]
				14005.522, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1011,
					["RageGainedFrom"] = {
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 21,
								},
							},
							["amount"] = 41,
						},
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 649,
						["Physical"] = 362,
					},
					["DOT_Time"] = 0,
					["Damage"] = 2336,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 316,
						["Physical"] = 2020,
					},
					["PartialAbsorb"] = {
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 288,
								},
							},
							["amount"] = 288,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 695,
								},
								["斩杀"] = {
									["count"] = 1037,
								},
								["肉搏"] = {
									["count"] = 316,
								},
							},
							["amount"] = 2048,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["老白鲨-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 36,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 326,
								},
								["肉搏"] = {
									["count"] = 649,
								},
							},
							["amount"] = 1011,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["从天而降-火妖鲁西弗隆"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["从天而降-火妖鲁西弗隆"] = {
									["count"] = 21,
								},
							},
							["amount"] = 21,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 695,
									["min"] = 695,
									["count"] = 1,
									["amount"] = 695,
								},
								["Hit"] = {
									["max"] = 288,
									["min"] = 288,
									["count"] = 1,
									["amount"] = 288,
								},
							},
							["count"] = 2,
							["amount"] = 983,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1037,
									["min"] = 1037,
									["count"] = 1,
									["amount"] = 1037,
								},
							},
							["count"] = 1,
							["amount"] = 1037,
						},
						["肉搏"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 316,
									["min"] = 316,
									["count"] = 1,
									["amount"] = 316,
								},
							},
							["count"] = 2,
							["amount"] = 316,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 41,
					["TimeDamage"] = 6,
					["TimeDamaging"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["请叫我文哥"] = {
									["count"] = 9,
								},
								["柠檬-逐风者"] = {
									["count"] = 3,
								},
								["初代大魔王-逐风者"] = {
									["count"] = 12,
								},
								["妖儿-逐风者"] = {
									["count"] = 3,
								},
								["雲木彡-逐风者"] = {
									["count"] = 6,
								},
								["一路酱-逐风者"] = {
									["count"] = 18,
								},
								["请叫我天哥-逐风者"] = {
									["count"] = 6,
								},
								["吹风吹姑娘-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 63,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 13,
								},
							},
							["amount"] = 17,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 16,
								},
							},
							["amount"] = 20,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 31,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 16,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["WhoHealed"] = {
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 366,
								},
							},
							["amount"] = 366,
						},
					},
					["RageGainedFrom"] = {
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 100,
								},
								["冲锋"] = {
									["count"] = 168,
								},
							},
							["amount"] = 268,
						},
					},
					["DeathCount"] = 3,
					["Overhealing"] = 96,
					["ElementTaken"] = {
						["Shadow"] = 5175,
						["Melee"] = 3181,
						["Arcane"] = 1557,
						["Physical"] = 5323,
						["Fire"] = 1484,
						["Frost"] = 4054,
						["Nature"] = 555,
					},
					["DOT_Time"] = 63,
					["Damage"] = 33101,
					["TimeHeal"] = 6,
					["Dispels"] = 4,
					["ElementDone"] = {
						["Melee"] = 12691,
						["Physical"] = 20410,
					},
					["DamagedWho"] = {
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 1394,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 179,
								},
								["英勇打击"] = {
									["count"] = 404,
								},
								["拦截昏迷"] = {
									["count"] = 38,
								},
								["断筋"] = {
									["count"] = 28,
								},
								["肉搏"] = {
									["count"] = 680,
								},
							},
							["amount"] = 2723,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1179,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 324,
								},
								["肉搏"] = {
									["count"] = 1382,
								},
							},
							["amount"] = 2959,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 161,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["断筋"] = {
									["count"] = 36,
								},
								["肉搏"] = {
									["count"] = 1975,
								},
							},
							["amount"] = 2221,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1404,
								},
								["英勇打击"] = {
									["count"] = 532,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 424,
								},
								["拳击"] = {
									["count"] = 43,
								},
								["断筋"] = {
									["count"] = 117,
								},
								["斩杀"] = {
									["count"] = 1498,
								},
								["肉搏"] = {
									["count"] = 2886,
								},
							},
							["amount"] = 6904,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 519,
								},
								["断筋"] = {
									["count"] = 35,
								},
								["斩杀"] = {
									["count"] = 1391,
								},
								["肉搏"] = {
									["count"] = 403,
								},
							},
							["amount"] = 2348,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 610,
								},
								["断筋"] = {
									["count"] = 41,
								},
								["英勇打击"] = {
									["count"] = 625,
								},
								["肉搏"] = {
									["count"] = 419,
								},
							},
							["amount"] = 1695,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 858,
								},
								["断筋"] = {
									["count"] = 41,
								},
								["英勇打击"] = {
									["count"] = 570,
								},
								["肉搏"] = {
									["count"] = 981,
								},
							},
							["amount"] = 2450,
						},
						["请叫我文哥"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 267,
								},
								["肉搏"] = {
									["count"] = 1002,
								},
							},
							["amount"] = 1269,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 808,
								},
								["旋风斩"] = {
									["count"] = 457,
								},
							},
							["amount"] = 1265,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 695,
								},
								["断筋"] = {
									["count"] = 34,
								},
								["斩杀"] = {
									["count"] = 1037,
								},
								["肉搏"] = {
									["count"] = 316,
								},
							},
							["amount"] = 2082,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 288,
								},
								["断筋"] = {
									["count"] = 59,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 158,
								},
								["肉搏"] = {
									["count"] = 653,
								},
							},
							["amount"] = 1158,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 26,
								},
							},
							["amount"] = 26,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 322,
								},
								["英勇打击"] = {
									["count"] = 912,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 67,
								},
								["拳击"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 45,
								},
								["断筋"] = {
									["count"] = 73,
								},
								["肉搏"] = {
									["count"] = 1038,
								},
							},
							["amount"] = 2494,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1349,
								},
								["英勇打击"] = {
									["count"] = 630,
								},
								["旋风斩"] = {
									["count"] = 446,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 126,
								},
								["肉搏"] = {
									["count"] = 956,
								},
							},
							["amount"] = 3507,
						},
					},
					["WhoDamaged"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["地精工兵炸药"] = {
									["count"] = 538,
								},
								["暗影守卫"] = {
									["count"] = 554,
								},
								["心灵震爆"] = {
									["count"] = 951,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3372,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 298,
								},
							},
							["amount"] = 5713,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["暴风雪 (伤害/跳)"] = {
									["count"] = 222,
								},
								["魔爆术"] = {
									["count"] = 305,
								},
								["铁皮手雷"] = {
									["count"] = 166,
								},
								["冰锥术"] = {
									["count"] = 550,
								},
							},
							["amount"] = 1243,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1252,
								},
								["冰锥术"] = {
									["count"] = 1777,
								},
								["冰霜新星"] = {
									["count"] = 303,
								},
							},
							["amount"] = 3332,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["雷霆一击"] = {
									["count"] = 60,
								},
								["断筋"] = {
									["count"] = 60,
								},
								["斩杀"] = {
									["count"] = 483,
								},
								["肉搏"] = {
									["count"] = 579,
								},
							},
							["amount"] = 1182,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 87,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 290,
								},
								["旋风斩"] = {
									["count"] = 574,
								},
							},
							["amount"] = 951,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 214,
								},
								["背刺"] = {
									["count"] = 791,
								},
								["肉搏"] = {
									["count"] = 566,
								},
							},
							["amount"] = 1571,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 36,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 326,
								},
								["肉搏"] = {
									["count"] = 1037,
								},
							},
							["amount"] = 1399,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 65,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 252,
								},
								["肉搏"] = {
									["count"] = 634,
								},
							},
							["amount"] = 951,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["背刺"] = {
									["count"] = 816,
								},
								["肉搏"] = {
									["count"] = 278,
								},
							},
							["amount"] = 1094,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 555,
								},
								["自动射击"] = {
									["count"] = 611,
								},
								["多重射击"] = {
									["count"] = 943,
								},
								["摔绊"] = {
									["count"] = 16,
								},
							},
							["amount"] = 2125,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冲击波"] = {
									["count"] = 566,
								},
								["冰锥术"] = {
									["count"] = 1147,
								},
								["冰霜新星"] = {
									["count"] = 55,
								},
							},
							["amount"] = 1768,
						},
					},
					["TimeHealing"] = {
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["Dispelled"] = 4,
					["PartialResist"] = {
						["地精工兵炸药"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["背刺"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 20,
						},
					},
					["PartialAbsorb"] = {
						["地精工兵炸药"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["雷霆一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["背刺"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暴风雪 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 0,
								},
							},
							["count"] = 20,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 108.55,
					["OverHeals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 96,
									["min"] = 96,
									["count"] = 1,
									["amount"] = 96,
								},
							},
							["count"] = 1,
							["amount"] = 96,
						},
					},
					["WhoDispelled"] = {
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰冻 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
					["InterruptData"] = {
						["一路酱-逐风者"] = {
							["Details"] = {
								["快速治疗 (拳击)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 110,
									["min"] = 80,
									["count"] = 4,
									["amount"] = 366,
								},
							},
							["count"] = 4,
							["amount"] = 366,
						},
					},
					["Interrupts"] = 1,
					["ElementDoneAbsorb"] = {
						["Melee"] = 1709,
						["Physical"] = 812,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 12,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 30,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 8,
								},
								["Tick"] = {
									["count"] = 16,
								},
								["Hit"] = {
									["count"] = 28,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 13,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 72,
						},
					},
					["Healing"] = 366,
					["TimeSpent"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.75,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.72,
								},
								["肉搏"] = {
									["count"] = 2.35,
								},
							},
							["amount"] = 8.120000000000001,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.13,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.65,
								},
								["肉搏"] = {
									["count"] = 2.27,
								},
							},
							["amount"] = 10.05,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.9500000000000001,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9.950000000000001,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.02,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.02,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.58,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.42,
								},
								["拳击"] = {
									["count"] = 0.62,
								},
								["断筋"] = {
									["count"] = 2.2,
								},
								["斩杀"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 4.8,
								},
							},
							["amount"] = 19.65,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.48,
								},
								["断筋"] = {
									["count"] = 1.55,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 6.050000000000001,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.8,
								},
							},
							["amount"] = 4.8,
						},
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["请叫我文哥"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.43,
								},
								["压制"] = {
									["count"] = 0.78,
								},
								["旋风斩"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 3.99,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.83,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.83,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.47,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.6,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.57,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.2,
								},
								["英勇打击"] = {
									["count"] = 0.57,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.16,
								},
								["断筋"] = {
									["count"] = 1.05,
								},
								["拦截昏迷"] = {
									["count"] = 1.42,
								},
								["斩杀"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 2.27,
								},
							},
							["amount"] = 8.49,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 6.03,
						},
					},
					["DamageTaken"] = 21329,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1179,
									["min"] = 858,
									["count"] = 3,
									["amount"] = 3049,
								},
								["Hit"] = {
									["max"] = 709,
									["min"] = 392,
									["count"] = 5,
									["amount"] = 2870,
								},
							},
							["count"] = 10,
							["amount"] = 5919,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 630,
									["min"] = 404,
									["count"] = 7,
									["amount"] = 3673,
								},
							},
							["count"] = 7,
							["amount"] = 3673,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 126,
									["min"] = 81,
									["count"] = 5,
									["amount"] = 450,
								},
								["Tick"] = {
									["max"] = 90,
									["min"] = 67,
									["count"] = 16,
									["amount"] = 1256,
								},
							},
							["count"] = 21,
							["amount"] = 1706,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 43,
									["min"] = 37,
									["count"] = 2,
									["amount"] = 80,
								},
							},
							["count"] = 2,
							["amount"] = 80,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 808,
									["min"] = 637,
									["count"] = 3,
									["amount"] = 2202,
								},
							},
							["count"] = 3,
							["amount"] = 2202,
						},
						["断筋"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 41,
									["min"] = 26,
									["count"] = 8,
									["amount"] = 271,
								},
								["Absorb"] = {
									["max"] = 39,
									["min"] = 36,
									["count"] = 2,
									["amount"] = 75,
								},
								["Crit"] = {
									["max"] = 86,
									["min"] = 59,
									["count"] = 3,
									["amount"] = 218,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 564,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 695,
									["min"] = 695,
									["count"] = 1,
									["amount"] = 695,
								},
								["Hit"] = {
									["max"] = 457,
									["min"] = 288,
									["count"] = 4,
									["amount"] = 1513,
								},
							},
							["count"] = 5,
							["amount"] = 2208,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 49,
									["min"] = 49,
									["count"] = 1,
									["amount"] = 49,
								},
								["Hit"] = {
									["max"] = 45,
									["min"] = 38,
									["count"] = 2,
									["amount"] = 83,
								},
							},
							["count"] = 3,
							["amount"] = 132,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1498,
									["min"] = 1037,
									["count"] = 3,
									["amount"] = 3926,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 3926,
						},
						["肉搏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 964,
									["min"] = 238,
									["count"] = 3,
									["amount"] = 1947,
								},
								["Hit"] = {
									["max"] = 422,
									["min"] = 271,
									["count"] = 12,
									["amount"] = 4270,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1230,
									["min"] = 653,
									["count"] = 8,
									["amount"] = 6474,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 30,
							["amount"] = 12691,
						},
					},
					["RageGain"] = 268,
					["HealedWho"] = {
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 366,
								},
							},
							["amount"] = 366,
						},
					},
					["TimeDamage"] = 102.55,
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.75,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.72,
								},
								["肉搏"] = {
									["count"] = 2.35,
								},
							},
							["amount"] = 8.120000000000001,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.13,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.65,
								},
								["肉搏"] = {
									["count"] = 2.27,
								},
							},
							["amount"] = 10.05,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.9500000000000001,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 9.950000000000001,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.58,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 8.42,
								},
								["拳击"] = {
									["count"] = 0.62,
								},
								["断筋"] = {
									["count"] = 2.2,
								},
								["斩杀"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 4.8,
								},
							},
							["amount"] = 19.65,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.48,
								},
								["断筋"] = {
									["count"] = 1.55,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 6.050000000000001,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.02,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.02,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.8,
								},
							},
							["amount"] = 4.8,
						},
						["请叫我文哥"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.43,
								},
								["压制"] = {
									["count"] = 0.78,
								},
								["旋风斩"] = {
									["count"] = 0.28,
								},
							},
							["amount"] = 3.99,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.83,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.83,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.47,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.6,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6.57,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["请叫我天哥-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.2,
								},
								["英勇打击"] = {
									["count"] = 0.57,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.16,
								},
								["断筋"] = {
									["count"] = 1.05,
								},
								["拦截昏迷"] = {
									["count"] = 1.42,
								},
								["斩杀"] = {
									["count"] = 0.32,
								},
								["肉搏"] = {
									["count"] = 2.27,
								},
							},
							["amount"] = 8.49,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 6.03,
						},
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["从天而降-火妖鲁西弗隆"] = {
									["count"] = 100,
								},
							},
							["amount"] = 100,
						},
						["冲锋"] = {
							["Details"] = {
								["从天而降-火妖鲁西弗隆"] = {
									["count"] = 168,
								},
							},
							["amount"] = 168,
						},
					},
					["HealingTaken"] = 366,
					["DispelledWho"] = {
						["从天而降-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰冻 (逃命专家)"] = {
									["count"] = 1,
								},
								["冰霜新星 (逃命专家)"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
					},
				},
			},
			["UnitLockout"] = 13959.202,
			["LastActive"] = 14087.211,
		},
		["汉纳姆 <芋头妹妹>"] = {
			["GUID"] = "Pet-0-5428-529-19964-417-020120063F",
			["LastEventHealth"] = {
				2239, -- [1]
				2239, -- [2]
				2239, -- [3]
				2239, -- [4]
				2668, -- [5]
				2668, -- [6]
				2668, -- [7]
				2668, -- [8]
				2668, -- [9]
				2668, -- [10]
				2668, -- [11]
				2668, -- [12]
				2668, -- [13]
				2668, -- [14]
				2668, -- [15]
				2668, -- [16]
				2668, -- [17]
				2076, -- [18]
				2668, -- [19]
				2668, -- [20]
				2668, -- [21]
				2668, -- [22]
				2668, -- [23]
				2589, -- [24]
				2590, -- [25]
				2431, -- [26]
				2391, -- [27]
				2348, -- [28]
				2348, -- [29]
				2272, -- [30]
				2253, -- [31]
				2234, -- [32]
				2147, -- [33]
				2147, -- [34]
				2126, -- [35]
				1816, -- [36]
				1816, -- [37]
				1657, -- [38]
				1657, -- [39]
				1657, -- [40]
				1657, -- [41]
				2054, -- [42]
				1960, -- [43]
				1960, -- [44]
				1813, -- [45]
				1732, -- [46]
				1732, -- [47]
				1702, -- [48]
				1621, -- [49]
				1621, -- [50]
			},
			["LastAttackedBy"] = "初代大魔王-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"MISC", -- [4]
				"MISC", -- [5]
				"DAMAGE", -- [6]
				"MISC", -- [7]
				"MISC", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"MISC", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"MISC", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"MISC", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"MISC", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"MISC", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"MISC", -- [50]
			},
			["TimeWindows"] = {
				["Dispels"] = {
					14, -- [1]
				},
				["ActiveTime"] = {
					33, -- [1]
				},
				["TimeDamage"] = {
					33, -- [1]
				},
				["DamageTaken"] = {
					1750, -- [1]
				},
				["Damage"] = {
					1530, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "汉纳姆",
			["level"] = 1,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 9,
			["type"] = "Pet",
			["ownerName"] = "芋头妹妹",
			["LastEventHealthMax"] = {
				2668, -- [1]
				2668, -- [2]
				2668, -- [3]
				2668, -- [4]
				2668, -- [5]
				2668, -- [6]
				2668, -- [7]
				2668, -- [8]
				2668, -- [9]
				2668, -- [10]
				2668, -- [11]
				2668, -- [12]
				2668, -- [13]
				2668, -- [14]
				2668, -- [15]
				2668, -- [16]
				2668, -- [17]
				2668, -- [18]
				2668, -- [19]
				2668, -- [20]
				2668, -- [21]
				2668, -- [22]
				2668, -- [23]
				2668, -- [24]
				2668, -- [25]
				2668, -- [26]
				2668, -- [27]
				2668, -- [28]
				2668, -- [29]
				2668, -- [30]
				2668, -- [31]
				2668, -- [32]
				2668, -- [33]
				2668, -- [34]
				2668, -- [35]
				2668, -- [36]
				2668, -- [37]
				2668, -- [38]
				2668, -- [39]
				2668, -- [40]
				2668, -- [41]
				2668, -- [42]
				2668, -- [43]
				2668, -- [44]
				2668, -- [45]
				2668, -- [46]
				2668, -- [47]
				2668, -- [48]
				2668, -- [49]
				2668, -- [50]
			},
			["LastDamageTaken"] = 79,
			["TimeLast"] = {
				["ActiveTime"] = 13859.211,
				["Dispels"] = 13862.212,
				["TimeDamage"] = 13859.211,
				["OVERALL"] = 13862.212,
				["DamageTaken"] = 13859.211,
				["Damage"] = 13859.211,
			},
			["NextEventNum"] = 25,
			["LastDamageTime"] = 13859.461,
			["LastEvents"] = {
				"汉纳姆 <芋头妹妹> 肉搏 柠檬-逐风者 Hit -81 (Physical)", -- [1]
				"汉纳姆 <芋头妹妹> 肉搏 柠檬-逐风者 Dodge (1)", -- [2]
				"汉纳姆 <芋头妹妹> 肉搏 柠檬-逐风者 Absorb -75 (75 被吸收) (1)", -- [3]
				"汉纳姆 <芋头妹妹> dispels 吹风吹姑娘-逐风者 冰甲术 (吞噬魔法)", -- [4]
				"汉纳姆 <芋头妹妹> dispels 老白鲨-逐风者 强效怒气 (吞噬魔法)", -- [5]
				"汉纳姆 <芋头妹妹> 肉搏 一路酱-逐风者 Absorb -105 (105 被吸收) (1)", -- [6]
				"汉纳姆 <芋头妹妹> dispels 一路酱-逐风者 真言术：盾 (吞噬魔法)", -- [7]
				"汉纳姆 <芋头妹妹> dispels 初代大魔王-逐风者 魔法抑制 (吞噬魔法)", -- [8]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -85 (Physical)", -- [9]
				"初代大魔王-逐风者 冰冻 汉纳姆 <芋头妹妹> Resist (Frost)", -- [10]
				"汉纳姆 <芋头妹妹> dispels 初代大魔王-逐风者 冰甲术 (吞噬魔法)", -- [11]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -96 (Physical)", -- [12]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -86 (Physical)", -- [13]
				"汉纳姆 <芋头妹妹> dispels 老戏骨-逐风者 治疗之道 (吞噬魔法)", -- [14]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -76 (Physical)", -- [15]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Dodge (1)", -- [16]
				"初代大魔王-逐风者 火焰冲击 汉纳姆 <芋头妹妹> Hit -592 (Fire)", -- [17]
				"汉纳姆 <芋头妹妹> dispels 初代大魔王-逐风者 冰甲术 (吞噬魔法)", -- [18]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -78 (Physical)", -- [19]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -96 (Physical)", -- [20]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -91 (Physical)", -- [21]
				"汉纳姆 <芋头妹妹> 肉搏 初代大魔王-逐风者 Hit -87 (Physical)", -- [22]
				"初代大魔王-逐风者 冰霜新星 汉纳姆 <芋头妹妹> Hit -79 (Frost)", -- [23]
				"汉纳姆 <芋头妹妹> dispels 初代大魔王-逐风者 寒冰护体 (吞噬魔法)", -- [24]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -159 (Shadow)", -- [25]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -40 (Shadow)", -- [26]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -43 (Shadow)", -- [27]
				"汉纳姆 <芋头妹妹> 肉搏 柠檬-逐风者 Hit -54 (Physical)", -- [28]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -76 (Shadow)", -- [29]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -19 (Shadow)", -- [30]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -19 (Shadow)", -- [31]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -87 (Shadow)", -- [32]
				"汉纳姆 <芋头妹妹> 肉搏 柠檬-逐风者 Hit -68 (Physical)", -- [33]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -21 (Shadow)", -- [34]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -310 (Shadow)", -- [35]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -77 (Shadow)", -- [36]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -82 (Shadow)", -- [37]
				"汉纳姆 <芋头妹妹> dispels 柠檬-逐风者 心灵专注 (吞噬魔法)", -- [38]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -20 (Shadow)", -- [39]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -13 (Shadow)", -- [40]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -189 (Shadow)", -- [41]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -94 (Shadow)", -- [42]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -117 (Shadow)", -- [43]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [44]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -81 (Shadow)", -- [45]
				"汉纳姆 <芋头妹妹> 肉搏 时间的小溪-逐风者 Hit -87 (Physical)", -- [46]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [47]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -81 (Shadow)", -- [48]
				"汉纳姆 <芋头妹妹> 肉搏 柠檬-逐风者 Hit -69 (Physical)", -- [49]
				"汉纳姆 <芋头妹妹> dispels 柠檬-逐风者 心灵之火 (吞噬魔法)", -- [50]
			},
			["Name"] = "汉纳姆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13116.324, -- [1]
				13118.308, -- [2]
				13120.341, -- [3]
				13124.008, -- [4]
				13595.159, -- [5]
				13602.459, -- [6]
				13603.31, -- [7]
				13822.559, -- [8]
				13829.542, -- [9]
				13829.542, -- [10]
				13830.659, -- [11]
				13832.643, -- [12]
				13837.193, -- [13]
				13838.743, -- [14]
				13841.243, -- [15]
				13844.91, -- [16]
				13845.76, -- [17]
				13846.86, -- [18]
				13849.194, -- [19]
				13851.211, -- [20]
				13853.211, -- [21]
				13859.461, -- [22]
				13860.028, -- [23]
				13862.245, -- [24]
				13099.356, -- [25]
				13099.89, -- [26]
				13101.707, -- [27]
				13101.84, -- [28]
				13101.99, -- [29]
				13102.273, -- [30]
				13102.673, -- [31]
				13103.507, -- [32]
				13103.84, -- [33]
				13104.49, -- [34]
				13104.807, -- [35]
				13104.99, -- [36]
				13105.323, -- [37]
				13106.19, -- [38]
				13106.29, -- [39]
				13106.29, -- [40]
				13106.457, -- [41]
				13107.123, -- [42]
				13107.657, -- [43]
				13107.79, -- [44]
				13107.974, -- [45]
				13108.19, -- [46]
				13108.79, -- [47]
				13110.974, -- [48]
				13112.674, -- [49]
				13114.307, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["法术锁定"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 15,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
					},
					["DamageTaken"] = 1750,
					["ElementTakenResist"] = {
						["Arcane"] = 147,
						["Shadow"] = 241,
					},
					["PartialResist"] = {
						["暗影守卫"] = {
							["Details"] = {
								["75% 抵抗"] = {
									["max"] = 181,
									["min"] = 181,
									["count"] = 1,
									["amount"] = 181,
								},
								["25% 抵抗"] = {
									["max"] = 60,
									["min"] = 60,
									["count"] = 1,
									["amount"] = 60,
								},
							},
							["count"] = 241,
							["amount"] = 2,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["25% 抵抗"] = {
									["max"] = 75,
									["min"] = 72,
									["count"] = 2,
									["amount"] = 147,
								},
							},
							["count"] = 147,
							["amount"] = 2,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 33,
					["ElementTaken"] = {
						["Physical"] = 396,
						["Arcane"] = 441,
						["Fire"] = 592,
						["Frost"] = 79,
						["Shadow"] = 242,
					},
					["Damage"] = 1530,
					["Dispels"] = 14,
					["ElementDoneAbsorb"] = {
						["Melee"] = 247,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 21,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["法术锁定"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 105,
									["min"] = 67,
									["count"] = 3,
									["amount"] = 247,
								},
								["Crit"] = {
									["max"] = 114,
									["min"] = 114,
									["count"] = 1,
									["amount"] = 114,
								},
								["Hit"] = {
									["max"] = 96,
									["min"] = 54,
									["count"] = 15,
									["amount"] = 1169,
								},
							},
							["count"] = 21,
							["amount"] = 1530,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1530,
					},
					["DamagedWho"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 587,
								},
							},
							["amount"] = 587,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 87,
								},
							},
							["amount"] = 87,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 105,
								},
							},
							["amount"] = 105,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 56,
								},
							},
							["amount"] = 56,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 695,
								},
							},
							["amount"] = 695,
						},
					},
					["TimeDamage"] = 33,
					["WhoDamaged"] = {
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 79,
								},
								["火焰冲击"] = {
									["count"] = 592,
								},
							},
							["amount"] = 671,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 242,
								},
							},
							["amount"] = 242,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 396,
								},
							},
							["amount"] = 396,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 441,
								},
							},
							["amount"] = 441,
						},
					},
					["TimeDamaging"] = {
						["柠檬-逐风者"] = {
							["Details"] = {
								["法术锁定"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 15,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["DispelledWho"] = {
						["初代大魔王-逐风者"] = {
							["Details"] = {
								["寒冰护体 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["冰甲术 (吞噬魔法)"] = {
									["count"] = 2,
								},
								["魔法抑制 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["心灵之火 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["心灵专注 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["时间的小溪-逐风者"] = {
							["Details"] = {
								["自由行动 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["吹风吹姑娘-逐风者"] = {
							["Details"] = {
								["野性印记 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["冰甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["治疗之道 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["真言术：盾 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["野性印记 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["强效怒气 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 13006.199,
			["LastActive"] = 13862.212,
		},
		["青橙"] = {
			["GUID"] = "Player-5458-02F58932",
			["LastEventHealth"] = {
				4488, -- [1]
				4453, -- [2]
				4453, -- [3]
				4453, -- [4]
				3453, -- [5]
				3120, -- [6]
				3144, -- [7]
				3144, -- [8]
				3144, -- [9]
				3032, -- [10]
				3032, -- [11]
				3032, -- [12]
				2713, -- [13]
				2737, -- [14]
				2737, -- [15]
				2737, -- [16]
				2737, -- [17]
				2737, -- [18]
				2648, -- [19]
				2648, -- [20]
				2648, -- [21]
				2648, -- [22]
				2648, -- [23]
				2535, -- [24]
				2422, -- [25]
				2422, -- [26]
				2422, -- [27]
				4789, -- [28]
				4223, -- [29]
				4223, -- [30]
				4388, -- [31]
				4388, -- [32]
				4388, -- [33]
				3795, -- [34]
				3769, -- [35]
				3816, -- [36]
				3816, -- [37]
				3816, -- [38]
				3816, -- [39]
				3816, -- [40]
				2839, -- [41]
				2839, -- [42]
				1796, -- [43]
				1796, -- [44]
				935, -- [45]
				358, -- [46]
				0, -- [47]
				4789, -- [48]
				4488, -- [49]
				4488, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"HEAL", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"HEAL", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"HEAL", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"MISC", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					18, -- [1]
				},
				["Healing"] = {
					628, -- [1]
				},
				["DamageTaken"] = {
					9075, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["HealingTaken"] = {
					628, -- [1]
				},
				["HOT_Time"] = {
					30, -- [1]
				},
				["TimeDamage"] = {
					49.63, -- [1]
				},
				["ActiveTime"] = {
					67.63000000000001, -- [1]
				},
				["RageGain"] = {
					162, -- [1]
				},
				["DOT_Time"] = {
					33, -- [1]
				},
				["Damage"] = {
					13521, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
					},
					["Messages"] = {
						"青橙 断筋 蓝色空间号-逐风者 Hit -40 (Physical)", -- [1]
						"青橙 肉搏 蓝色空间号-逐风者 Hit -417 (Physical)", -- [2]
						"雲木彡-逐风者 肉搏 青橙 Crit -593 (Physical)", -- [3]
						"雲木彡-逐风者 断筋 青橙 Hit -26 (Physical)", -- [4]
						"青橙 血之狂热 青橙 Tick +47", -- [5]
						"雲木彡-逐风者 撕裂 (伤害/跳) 青橙 Tick -28 (Physical)", -- [6]
						"雲木彡-逐风者 断筋 青橙 Hit -27 (Physical)", -- [7]
						"雲木彡-逐风者 重伤 (伤害/跳) 青橙 Tick -74 (Physical)", -- [8]
						"一路酱-逐风者 暗言术：痛 (伤害/跳) 青橙 Tick -193 (Shadow)", -- [9]
						"一路酱-逐风者 心灵震爆 青橙 Hit -655 (Shadow)", -- [10]
						"老戏骨-逐风者 闪电链 青橙 Hit -526 (Nature)", -- [11]
						"老戏骨-逐风者 冰霜震击 青橙 Hit -517 (Frost)", -- [12]
						"雲木彡-逐风者 肉搏 青橙 Hit -303 (Physical)", -- [13]
						"雲木彡-逐风者 肉搏 青橙 Crit -558 (Physical)", -- [14]
						"雲木彡-逐风者 斩杀 青橙 Hit -577 (Physical)", -- [15]
						"一路酱-逐风者 惩击 青橙 Hit -637 (Holy)", -- [16]
						"青橙死亡。", -- [17]
					},
					["DeathAt"] = 14064.209,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
					},
					["MessageTimes"] = {
						-6.90099999999984, -- [1]
						-6.450999999999112, -- [2]
						-5.751000000000204, -- [3]
						-4.283999999999651, -- [4]
						-3.751000000000204, -- [5]
						-2.783999999999651, -- [6]
						-2.783999999999651, -- [7]
						-2.734000000000378, -- [8]
						-2.549999999999272, -- [9]
						-2.516999999999825, -- [10]
						-2.334000000000742, -- [11]
						-2.234000000000378, -- [12]
						-1.950000000000728, -- [13]
						-1.933999999999287, -- [14]
						-1.217000000000553, -- [15]
						-0.01699999999982538, -- [16]
						0, -- [17]
					},
					["HealthMax"] = {
						4789, -- [1]
						4789, -- [2]
						4789, -- [3]
						4789, -- [4]
						4789, -- [5]
						4789, -- [6]
						4789, -- [7]
						4789, -- [8]
						4789, -- [9]
						4789, -- [10]
						4789, -- [11]
						4789, -- [12]
						4789, -- [13]
						4789, -- [14]
						4789, -- [15]
						4789, -- [16]
						4789, -- [17]
					},
					["Health"] = {
						4388, -- [1]
						4388, -- [2]
						4388, -- [3]
						3795, -- [4]
						3769, -- [5]
						3816, -- [6]
						3816, -- [7]
						3816, -- [8]
						3816, -- [9]
						3816, -- [10]
						2839, -- [11]
						2839, -- [12]
						1796, -- [13]
						1796, -- [14]
						935, -- [15]
						358, -- [16]
						0, -- [17]
					},
					["KilledBy"] = "一路酱-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"HEAL", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"MISC", -- [17]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "惩击",
			["LastFightIn"] = 11,
			["type"] = "Grouped",
			["LastDamageTaken"] = 637,
			["LastEventHealthMax"] = {
				4789, -- [1]
				4789, -- [2]
				4789, -- [3]
				4789, -- [4]
				4789, -- [5]
				4789, -- [6]
				4789, -- [7]
				4789, -- [8]
				4789, -- [9]
				4789, -- [10]
				4789, -- [11]
				4789, -- [12]
				4789, -- [13]
				4789, -- [14]
				4789, -- [15]
				4789, -- [16]
				4789, -- [17]
				4789, -- [18]
				4789, -- [19]
				4789, -- [20]
				4789, -- [21]
				4789, -- [22]
				4789, -- [23]
				4789, -- [24]
				4789, -- [25]
				4789, -- [26]
				4789, -- [27]
				4789, -- [28]
				4789, -- [29]
				4789, -- [30]
				4789, -- [31]
				4789, -- [32]
				4789, -- [33]
				4789, -- [34]
				4789, -- [35]
				4789, -- [36]
				4789, -- [37]
				4789, -- [38]
				4789, -- [39]
				4789, -- [40]
				4789, -- [41]
				4789, -- [42]
				4789, -- [43]
				4789, -- [44]
				4789, -- [45]
				4789, -- [46]
				4789, -- [47]
				4789, -- [48]
				4789, -- [49]
				4789, -- [50]
			},
			["TimeLast"] = {
				["TimeHeal"] = 14058.209,
				["OVERALL"] = 14075.21,
				["DamageTaken"] = 14062.209,
				["DeathCount"] = 14062.209,
				["ActiveTime"] = 14058.209,
				["HealingTaken"] = 14058.209,
				["HOT_Time"] = 14058.209,
				["TimeDamage"] = 14055.209,
				["RageGain"] = 14075.21,
				["Healing"] = 14058.209,
				["DOT_Time"] = 13788.206,
				["Damage"] = 14055.209,
			},
			["Owner"] = false,
			["LastHealTime"] = 14058.625,
			["NextEventNum"] = 48,
			["LastDamageTime"] = 14055.925,
			["LastEvents"] = {
				"老白鲨-逐风者 断筋 青橙 Hit -35 (Physical)", -- [1]
				"青橙 撕裂 (伤害/跳) 老白鲨-逐风者 Tick -31 (Physical)", -- [2]
				"青橙 重伤 (伤害/跳) 老白鲨-逐风者 Tick -84 (Physical)", -- [3]
				"老白鲨-逐风者 致死打击 青橙 Crit -1000 (Physical)", -- [4]
				"老白鲨-逐风者 肉搏 青橙 Hit -333 (Physical)", -- [5]
				"青橙 血之狂热 青橙 Tick +24", -- [6]
				"青橙 撕裂 (伤害/跳) 老白鲨-逐风者 Tick -31 (Physical)", -- [7]
				"青橙 重伤 (伤害/跳) 老白鲨-逐风者 Tick -84 (Physical)", -- [8]
				"老白鲨-逐风者 重伤 (伤害/跳) 青橙 Tick -112 (Physical)", -- [9]
				"青橙 肉搏 老白鲨-逐风者 Hit -338 (Physical)", -- [10]
				"青橙 致死打击 老白鲨-逐风者 Parry (Physical)", -- [11]
				"老白鲨-逐风者 旋风斩 青橙 Hit -319 (Physical)", -- [12]
				"青橙 血之狂热 青橙 Tick +24", -- [13]
				"青橙 断筋 老白鲨-逐风者 Hit -31 (Physical)", -- [14]
				"青橙 撕裂 (伤害/跳) 老白鲨-逐风者 Tick -31 (Physical)", -- [15]
				"青橙 重伤 (伤害/跳) 老白鲨-逐风者 Tick -84 (Physical)", -- [16]
				"青橙 血之狂热 青橙 Tick +24", -- [17]
				"老白鲨-逐风者 重伤 (伤害/跳) 青橙 Tick -113 (Physical)", -- [18]
				"青橙 拦截昏迷 一路酱-逐风者 Hit -49 (Physical)", -- [19]
				"青橙 断筋 一路酱-逐风者 Hit -35 (Physical)", -- [20]
				"青橙 肉搏 一路酱-逐风者 Hit -364 (Physical)", -- [21]
				"青橙 撕裂 (伤害/跳) 老白鲨-逐风者 Tick -31 (Physical)", -- [22]
				"老白鲨-逐风者 重伤 (伤害/跳) 青橙 Tick -113 (Physical)", -- [23]
				"老白鲨-逐风者 重伤 (伤害/跳) 青橙 Tick -113 (Physical)", -- [24]
				"老白鲨-逐风者 破胆怒吼 青橙 Immune (Physical)", -- [25]
				"青橙 肉搏 一路酱-逐风者 Hit -326 (Physical)", -- [26]
				"青橙 致死打击 一路酱-逐风者 Hit -404 (Physical)", -- [27]
				"妖儿-逐风者 冲击波 青橙 Hit -566 (Fire)", -- [28]
				"青橙 肉搏 妖儿-逐风者 Hit -387 (Physical)", -- [29]
				"青橙 致死打击 妖儿-逐风者 Hit -492 (Physical)", -- [30]
				"青橙 断筋 蓝色空间号-逐风者 Hit -40 (Physical)", -- [31]
				"青橙 肉搏 蓝色空间号-逐风者 Hit -417 (Physical)", -- [32]
				"雲木彡-逐风者 肉搏 青橙 Crit -593 (Physical)", -- [33]
				"雲木彡-逐风者 断筋 青橙 Hit -26 (Physical)", -- [34]
				"青橙 血之狂热 青橙 Tick +47", -- [35]
				"雲木彡-逐风者 撕裂 (伤害/跳) 青橙 Tick -28 (Physical)", -- [36]
				"雲木彡-逐风者 断筋 青橙 Hit -27 (Physical)", -- [37]
				"雲木彡-逐风者 重伤 (伤害/跳) 青橙 Tick -74 (Physical)", -- [38]
				"一路酱-逐风者 暗言术：痛 (伤害/跳) 青橙 Tick -193 (Shadow)", -- [39]
				"一路酱-逐风者 心灵震爆 青橙 Hit -655 (Shadow)", -- [40]
				"老戏骨-逐风者 闪电链 青橙 Hit -526 (Nature)", -- [41]
				"老戏骨-逐风者 冰霜震击 青橙 Hit -517 (Frost)", -- [42]
				"雲木彡-逐风者 肉搏 青橙 Hit -303 (Physical)", -- [43]
				"雲木彡-逐风者 肉搏 青橙 Crit -558 (Physical)", -- [44]
				"雲木彡-逐风者 斩杀 青橙 Hit -577 (Physical)", -- [45]
				"一路酱-逐风者 惩击 青橙 Hit -637 (Holy)", -- [46]
				"青橙死亡。", -- [47]
				"老白鲨-逐风者 肉搏 青橙 Hit -301 (Physical)", -- [48]
				"青橙 旋风斩 老白鲨-逐风者 Hit -250 (Physical)", -- [49]
				"青橙 旋风斩 一路酱-逐风者 Hit -307 (Physical)", -- [50]
			},
			["Name"] = "青橙",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				13778.256, -- [1]
				13779.522, -- [2]
				13779.589, -- [3]
				13779.756, -- [4]
				13781.156, -- [5]
				13781.756, -- [6]
				13782.506, -- [7]
				13782.606, -- [8]
				13782.773, -- [9]
				13782.923, -- [10]
				13783.089, -- [11]
				13783.473, -- [12]
				13783.756, -- [13]
				13784.673, -- [14]
				13785.523, -- [15]
				13785.606, -- [16]
				13785.756, -- [17]
				13785.773, -- [18]
				13786.544, -- [19]
				13788.14, -- [20]
				13788.256, -- [21]
				13788.506, -- [22]
				13788.773, -- [23]
				13791.79, -- [24]
				13792.157, -- [25]
				13794.09, -- [26]
				13794.173, -- [27]
				14044.808, -- [28]
				14044.958, -- [29]
				14045.108, -- [30]
				14055.475, -- [31]
				14055.925, -- [32]
				14056.625, -- [33]
				14058.092, -- [34]
				14058.625, -- [35]
				14059.592, -- [36]
				14059.592, -- [37]
				14059.642, -- [38]
				14059.826, -- [39]
				14059.859, -- [40]
				14060.042, -- [41]
				14060.142, -- [42]
				14060.426, -- [43]
				14060.442, -- [44]
				14061.159, -- [45]
				14062.359, -- [46]
				14062.376, -- [47]
				13777.357, -- [48]
				13778.039, -- [49]
				13778.039, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5280,
					["RageGainedFrom"] = {
						["青橙"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 1,
								},
								["冲锋"] = {
									["count"] = 63,
								},
							},
							["amount"] = 64,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 3,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 732,
						["Melee"] = 1454,
						["Holy"] = 637,
						["Frost"] = 517,
						["Fire"] = 566,
						["Shadow"] = 848,
						["Nature"] = 526,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1336,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 804,
						["Physical"] = 532,
					},
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["惩击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 417,
								},
								["断筋"] = {
									["count"] = 40,
								},
							},
							["amount"] = 457,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 492,
								},
								["肉搏"] = {
									["count"] = 387,
								},
							},
							["amount"] = 879,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["雲木彡-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 74,
								},
								["断筋"] = {
									["count"] = 53,
								},
								["斩杀"] = {
									["count"] = 577,
								},
								["肉搏"] = {
									["count"] = 1454,
								},
							},
							["amount"] = 2186,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 655,
								},
								["惩击"] = {
									["count"] = 637,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 193,
								},
							},
							["amount"] = 1485,
						},
						["老戏骨-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 517,
								},
								["闪电链"] = {
									["count"] = 526,
								},
							},
							["amount"] = 1043,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["冲击波"] = {
									["count"] = 566,
								},
							},
							["amount"] = 566,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["惩击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["青橙"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["青橙"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["冲锋"] = {
							["Details"] = {
								["青橙"] = {
									["count"] = 63,
								},
							},
							["amount"] = 63,
						},
					},
					["HealedWho"] = {
						["青橙"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 47,
								},
							},
							["amount"] = 47,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.45,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.95,
						},
						["青橙"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.65,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 47,
									["min"] = 47,
									["count"] = 1,
									["amount"] = 47,
								},
							},
							["count"] = 1,
							["amount"] = 47,
						},
					},
					["WhoHealed"] = {
						["青橙"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 47,
								},
							},
							["amount"] = 47,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 5.1,
					["Healing"] = 47,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 492,
									["min"] = 492,
									["count"] = 1,
									["amount"] = 492,
								},
							},
							["count"] = 1,
							["amount"] = 492,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 40,
									["min"] = 40,
									["count"] = 1,
									["amount"] = 40,
								},
							},
							["count"] = 1,
							["amount"] = 40,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 417,
									["min"] = 387,
									["count"] = 2,
									["amount"] = 804,
								},
							},
							["count"] = 2,
							["amount"] = 804,
						},
					},
					["HealingTaken"] = 47,
					["RageGain"] = 64,
					["TimeDamage"] = 3.6,
					["TimeDamaging"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.45,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.95,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.65,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["青橙"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["青橙"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 3,
								},
								["血之狂热"] = {
									["count"] = 15,
								},
							},
							["amount"] = 18,
						},
					},
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["老白鲨-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["老白鲨-逐风者"] = {
									["count"] = 12,
								},
								["柠檬-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 18,
						},
					},
					["DOT_Time"] = 33,
					["TimeSpent"] = {
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.15,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.58,
								},
								["横扫攻击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 7.58,
						},
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.95,
								},
							},
							["amount"] = 4.95,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 5.58,
								},
								["旋风斩"] = {
									["count"] = 1.45,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.02,
								},
								["肉搏"] = {
									["count"] = 4.82,
								},
							},
							["amount"] = 14.87,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["青橙"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 3,
								},
								["血之狂热"] = {
									["count"] = 15,
								},
							},
							["amount"] = 18,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.52,
								},
								["压制"] = {
									["count"] = 0.65,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 7.69,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.41,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.75,
								},
								["拦截昏迷"] = {
									["count"] = 0.94,
								},
								["肉搏"] = {
									["count"] = 1.79,
								},
							},
							["amount"] = 8.389999999999999,
						},
					},
					["HealedWho"] = {
						["青橙"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 222,
								},
								["血之狂热"] = {
									["count"] = 406,
								},
							},
							["amount"] = 628,
						},
					},
					["RageGainedFrom"] = {
						["青橙"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 105,
								},
								["怒不可遏"] = {
									["count"] = 7,
								},
								["血性狂暴"] = {
									["count"] = 50,
								},
							},
							["amount"] = 162,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["惩击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电链"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 30,
					["ActiveTime"] = 67.63000000000001,
					["ElementHitsTaken"] = {
						["Holy"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 10,
								},
							},
							["amount"] = 17,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTaken"] = {
						["Holy"] = 637,
						["Physical"] = 2989,
						["Melee"] = 2088,
						["Arcane"] = 288,
						["Frost"] = 569,
						["Fire"] = 1130,
						["Shadow"] = 848,
						["Nature"] = 526,
					},
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["青橙"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
					},
					["Damage"] = 13521,
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["惩击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电链"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["TimeHeal"] = 18,
					["WhoDamaged"] = {
						["老戏骨-逐风者"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 517,
								},
								["闪电链"] = {
									["count"] = 526,
								},
							},
							["amount"] = 1043,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 288,
								},
								["冲击波"] = {
									["count"] = 1130,
								},
								["冰霜新星"] = {
									["count"] = 52,
								},
							},
							["amount"] = 1470,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 74,
								},
								["断筋"] = {
									["count"] = 53,
								},
								["斩杀"] = {
									["count"] = 577,
								},
								["肉搏"] = {
									["count"] = 1454,
								},
							},
							["amount"] = 2186,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 655,
								},
								["惩击"] = {
									["count"] = 637,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 193,
								},
							},
							["amount"] = 1485,
						},
						["纳格兰放牛娃-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 452,
								},
							},
							["amount"] = 452,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1000,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 451,
								},
								["断筋"] = {
									["count"] = 35,
								},
								["旋风斩"] = {
									["count"] = 319,
								},
								["肉搏"] = {
									["count"] = 634,
								},
							},
							["amount"] = 2439,
						},
					},
					["DamageTaken"] = 9075,
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["青橙"] = {
									["count"] = 105,
								},
							},
							["amount"] = 105,
						},
						["怒不可遏"] = {
							["Details"] = {
								["青橙"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["血性狂暴"] = {
							["Details"] = {
								["青橙"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
					},
					["Healing"] = 628,
					["RageGain"] = 162,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 18,
						},
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 18,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 35,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1233,
									["min"] = 1233,
									["count"] = 1,
									["amount"] = 1233,
								},
								["Hit"] = {
									["max"] = 492,
									["min"] = 341,
									["count"] = 4,
									["amount"] = 1619,
								},
							},
							["count"] = 6,
							["amount"] = 2852,
						},
						["压制"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 290,
									["min"] = 290,
									["count"] = 1,
									["amount"] = 290,
								},
							},
							["count"] = 2,
							["amount"] = 290,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 91,
									["min"] = 84,
									["count"] = 6,
									["amount"] = 518,
								},
							},
							["count"] = 6,
							["amount"] = 518,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 32,
									["min"] = 31,
									["count"] = 5,
									["amount"] = 156,
								},
							},
							["count"] = 5,
							["amount"] = 156,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 49,
									["min"] = 35,
									["count"] = 2,
									["amount"] = 84,
								},
							},
							["count"] = 2,
							["amount"] = 84,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 341,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1224,
								},
							},
							["count"] = 4,
							["amount"] = 1224,
						},
						["横扫攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 270,
									["min"] = 270,
									["count"] = 1,
									["amount"] = 270,
								},
							},
							["count"] = 1,
							["amount"] = 270,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 40,
									["min"] = 25,
									["count"] = 4,
									["amount"] = 131,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 131,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 742,
									["min"] = 742,
									["count"] = 1,
									["amount"] = 742,
								},
								["Hit"] = {
									["max"] = 709,
									["min"] = 425,
									["count"] = 2,
									["amount"] = 1134,
								},
							},
							["count"] = 3,
							["amount"] = 1876,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 623,
									["min"] = 623,
									["count"] = 1,
									["amount"] = 623,
								},
								["Hit"] = {
									["max"] = 499,
									["min"] = 280,
									["count"] = 15,
									["amount"] = 5497,
								},
							},
							["count"] = 18,
							["amount"] = 6120,
						},
					},
					["HealingTaken"] = 628,
					["DamagedWho"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 40,
								},
								["斩杀"] = {
									["count"] = 709,
								},
								["肉搏"] = {
									["count"] = 878,
								},
							},
							["amount"] = 1627,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 723,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 182,
								},
								["压制"] = {
									["count"] = 290,
								},
								["肉搏"] = {
									["count"] = 1202,
								},
							},
							["amount"] = 2397,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 420,
								},
							},
							["amount"] = 420,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 336,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 156,
								},
								["旋风斩"] = {
									["count"] = 250,
								},
								["断筋"] = {
									["count"] = 31,
								},
								["斩杀"] = {
									["count"] = 425,
								},
								["肉搏"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1859,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 341,
								},
								["肉搏"] = {
									["count"] = 302,
								},
							},
							["amount"] = 643,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 25,
								},
								["旋风斩"] = {
									["count"] = 326,
								},
								["横扫攻击"] = {
									["count"] = 270,
								},
								["拦截昏迷"] = {
									["count"] = 35,
								},
								["斩杀"] = {
									["count"] = 742,
								},
								["肉搏"] = {
									["count"] = 702,
								},
							},
							["amount"] = 2100,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1637,
								},
								["旋风斩"] = {
									["count"] = 307,
								},
								["拦截昏迷"] = {
									["count"] = 49,
								},
								["断筋"] = {
									["count"] = 35,
								},
								["肉搏"] = {
									["count"] = 1069,
								},
							},
							["amount"] = 3097,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 492,
								},
								["肉搏"] = {
									["count"] = 886,
								},
							},
							["amount"] = 1378,
						},
					},
					["TimeDamage"] = 49.63,
					["TimeDamaging"] = {
						["蓝色空间号-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.95,
								},
							},
							["amount"] = 4.95,
						},
						["柠檬-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.52,
								},
								["压制"] = {
									["count"] = 0.65,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.35,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 7.69,
						},
						["灬山河灬-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["老白鲨-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.17,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 5.58,
								},
								["旋风斩"] = {
									["count"] = 1.45,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.02,
								},
								["肉搏"] = {
									["count"] = 4.82,
								},
							},
							["amount"] = 14.87,
						},
						["雲木彡-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["神经蛙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.58,
								},
								["横扫攻击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.5,
								},
							},
							["amount"] = 7.58,
						},
						["一路酱-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.41,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.75,
								},
								["拦截昏迷"] = {
									["count"] = 0.94,
								},
								["肉搏"] = {
									["count"] = 1.79,
								},
							},
							["amount"] = 8.389999999999999,
						},
						["妖儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3.15,
						},
					},
					["ElementDone"] = {
						["Melee"] = 6120,
						["Physical"] = 7401,
					},
					["WhoHealed"] = {
						["青橙"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 222,
								},
								["血之狂热"] = {
									["count"] = 406,
								},
							},
							["amount"] = 628,
						},
					},
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 116,
									["min"] = 106,
									["count"] = 2,
									["amount"] = 222,
								},
							},
							["count"] = 2,
							["amount"] = 222,
						},
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 48,
									["min"] = 24,
									["count"] = 10,
									["amount"] = 406,
								},
							},
							["count"] = 10,
							["amount"] = 406,
						},
					},
				},
			},
			["UnitLockout"] = 14044.208,
			["LastActive"] = 14075.21,
		},
	},
	["FightNum"] = 12,
	["CombatTimes"] = {
		{
			12981.198, -- [1]
			13042.202, -- [2]
			"01:30:02", -- [3]
			"01:31:03", -- [4]
			"时间的小溪-逐风者", -- [5]
		}, -- [1]
		{
			13083.205, -- [1]
			13144.209, -- [2]
			"01:31:44", -- [3]
			"01:32:45", -- [4]
			"初代大魔王-逐风者", -- [5]
		}, -- [2]
		{
			13249.201, -- [1]
			13332.207, -- [2]
			"01:34:31", -- [3]
			"01:35:53", -- [4]
			"神经蛙-逐风者", -- [5]
		}, -- [3]
		{
			13338.207, -- [1]
			13401.212, -- [2]
			"01:35:59", -- [3]
			"01:37:02", -- [4]
			"妖儿-逐风者", -- [5]
		}, -- [4]
		{
			13438.198, -- [1]
			13550.206, -- [2]
			"01:37:40", -- [3]
			"01:39:31", -- [4]
			"柠檬-逐风者", -- [5]
		}, -- [5]
		{
			13558.206, -- [1]
			13617.211, -- [2]
			"01:39:39", -- [3]
			"01:40:38", -- [4]
			"柠檬-逐风者", -- [5]
		}, -- [6]
		{
			13636.212, -- [1]
			13680.198, -- [2]
			"01:40:57", -- [3]
			"01:41:41", -- [4]
			"纳格兰放牛娃-逐风者", -- [5]
		}, -- [7]
		{
			13702.2, -- [1]
			13748.204, -- [2]
			"01:42:03", -- [3]
			"01:42:49", -- [4]
			"请叫我天哥-逐风者", -- [5]
		}, -- [8]
		{
			13775.205, -- [1]
			13798.207, -- [2]
			"01:43:17", -- [3]
			"01:43:39", -- [4]
			"蓝色空间号-逐风者", -- [5]
		}, -- [9]
		{
			13822.209, -- [1]
			13929.2, -- [2]
			"01:44:03", -- [3]
			"01:45:50", -- [4]
			"初代大魔王-逐风者", -- [5]
		}, -- [10]
		{
			13944.201, -- [1]
			14025.206, -- [2]
			"01:46:05", -- [3]
			"01:47:26", -- [4]
			"初代大魔王-逐风者", -- [5]
		}, -- [11]
		{
			14039.207, -- [1]
			14089.552, -- [2]
			"01:47:40", -- [3]
			"01:48:30", -- [4]
			"老戏骨-逐风者", -- [5]
		}, -- [12]
	},
	["FoughtWho"] = {
	},
}
