
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["红衣火炮 <才等等-逐风者>"] = {
			["GUID"] = "Creature-0-5427-489-24822-11199-00007A5041",
			["TimeLast"] = {
				["Damage"] = 17048.304,
				["OVERALL"] = 17048.304,
				["TimeDamage"] = 17048.304,
				["ActiveTime"] = 17048.304,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
			},
			["TimeWindows"] = {
				["Damage"] = {
					204, -- [1]
				},
				["TimeDamage"] = {
					4.5, -- [1]
				},
				["ActiveTime"] = {
					4.5, -- [1]
				},
			},
			["enClass"] = "PET",
			["level"] = 1,
			["LastFightIn"] = 3,
			["type"] = "Pet",
			["ownerName"] = "才等等-逐风者",
			["NextEventNum"] = 5,
			["LastDamageTime"] = 17048.887,
			["LastEvents"] = {
				"红衣火炮 <才等等-逐风者> 炮火 豹 Hit -56 (Fire)", -- [1]
				"红衣火炮 <才等等-逐风者> 炮火 豹 Hit -61 (Fire)", -- [2]
				"红衣火炮 <才等等-逐风者> 炮火 锘一-逐风者 Hit -49 (Fire)", -- [3]
				"红衣火炮 <才等等-逐风者> 炮火 豹 Hit -38 (Fire)", -- [4]
			},
			["Name"] = "红衣火炮",
			["LastEventTimes"] = {
				17045.42, -- [1]
				17047.221, -- [2]
				17047.221, -- [3]
				17048.887, -- [4]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["豹"] = {
							["Details"] = {
								["炮火"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["ElementDone"] = {
						["Fire"] = 204,
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DamagedWho"] = {
						["豹"] = {
							["Details"] = {
								["炮火"] = {
									["count"] = 155,
								},
							},
							["amount"] = 155,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["炮火"] = {
									["count"] = 49,
								},
							},
							["amount"] = 49,
						},
					},
					["TimeDamage"] = 4.5,
					["TimeDamaging"] = {
						["豹"] = {
							["Details"] = {
								["炮火"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["Attacks"] = {
						["炮火"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 61,
									["min"] = 38,
									["count"] = 4,
									["amount"] = 204,
								},
							},
							["count"] = 4,
							["amount"] = 204,
						},
					},
					["ActiveTime"] = 4.5,
					["Damage"] = 204,
				},
			},
			["UnitLockout"] = 17048.304,
			["LastActive"] = 17048.304,
		},
		["特变电工"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						false, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
					},
					["Messages"] = {
						"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -28 (Physical)", -- [1]
						"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -111 (Physical)", -- [2]
						"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -29 (Physical)", -- [3]
						"特变电工 断筋 帅哥祖师爷龙-逐风者 Hit -38 (Physical)", -- [4]
						"特变电工 肉搏 帅哥祖师爷龙-逐风者 Hit -450 (Physical)", -- [5]
						"狐狸不吃鱼-黑龙费尔默 冰霜震击 特变电工 Crit -818 (Frost)", -- [6]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Crit -108 (Physical)", -- [7]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -37 (Physical)", -- [8]
						"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -212 (Physical)", -- [9]
						"狐狸不吃鱼-黑龙费尔默 风暴打击 特变电工 Hit -216 (Physical)", -- [10]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -60 (Physical)", -- [11]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -33 (Physical)", -- [12]
						"特变电工 断筋 帅哥祖师爷龙-逐风者 Dodge (Physical)", -- [13]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -207 (Physical)", -- [14]
						"特变电工 肉搏 帅哥祖师爷龙-逐风者 Dodge (1)", -- [15]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Crit -70 (Physical)", -- [16]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -60 (Physical)", -- [17]
						"攻速一点二 肉搏 特变电工 Hit -37 (Physical)", -- [18]
						"攻速一点二 爪击 特变电工 Hit -23 (Physical)", -- [19]
						"特变电工 压制 帅哥祖师爷龙-逐风者 Hit -454 (Physical)", -- [20]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -37 (Physical)", -- [21]
						"攻速一点二 肉搏 特变电工 Hit -38 (Physical)", -- [22]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Miss (1)", -- [23]
						"攻速一点二 撕咬 特变电工 Hit -39 (Physical)", -- [24]
						"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -32 (Physical)", -- [25]
						"特变电工 破胆怒吼 狐狸不吃鱼-黑龙费尔默 Resist (Physical)", -- [26]
						"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -234 (Physical)", -- [27]
						"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -282 (Physical)", -- [28]
						"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -337 (Physical)", -- [29]
						"打架-黑龙费尔默 瞄准射击 特变电工 Hit -526 (Physical)", -- [30]
						"特变电工死亡。", -- [31]
					},
					["DeathAt"] = 17157.294,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
					},
					["MessageTimes"] = {
						-14.18400000000111, -- [1]
						-12.21700000000055, -- [2]
						-11.1830000000009, -- [3]
						-7.400000000001455, -- [4]
						-6.917000000001281, -- [5]
						-6.549999999999272, -- [6]
						-5.632000000001426, -- [7]
						-5.082999999998719, -- [8]
						-4.416000000001077, -- [9]
						-4.416000000001077, -- [10]
						-4.082999999998719, -- [11]
						-4, -- [12]
						-3.666000000001077, -- [13]
						-3.183000000000902, -- [14]
						-3.100000000002183, -- [15]
						-2.933000000000902, -- [16]
						-2.549999999999272, -- [17]
						-2.416000000001077, -- [18]
						-2.416000000001077, -- [19]
						-2.150000000001455, -- [20]
						-1.832999999998719, -- [21]
						-1.216000000000349, -- [22]
						-1, -- [23]
						-0.7659999999996217, -- [24]
						-0.7489999999997963, -- [25]
						-0.6490000000012515, -- [26]
						-0.5990000000019791, -- [27]
						-0.5829999999987194, -- [28]
						-0.5829999999987194, -- [29]
						-0.01599999999962165, -- [30]
						0, -- [31]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
					},
					["Health"] = {
						3166, -- [1]
						3186, -- [2]
						3123, -- [3]
						3143, -- [4]
						3143, -- [5]
						3143, -- [6]
						2325, -- [7]
						2217, -- [8]
						2180, -- [9]
						2180, -- [10]
						1752, -- [11]
						1692, -- [12]
						1659, -- [13]
						1659, -- [14]
						1452, -- [15]
						1452, -- [16]
						1382, -- [17]
						1322, -- [18]
						1322, -- [19]
						1262, -- [20]
						1262, -- [21]
						1225, -- [22]
						1187, -- [23]
						1187, -- [24]
						1148, -- [25]
						1116, -- [26]
						1116, -- [27]
						1116, -- [28]
						1116, -- [29]
						263, -- [30]
						0, -- [31]
					},
					["KilledBy"] = "打架-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"MISC", -- [31]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						false, -- [33]
						false, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						false, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						false, -- [42]
						true, -- [43]
						true, -- [44]
						true, -- [45]
						true, -- [46]
						true, -- [47]
						true, -- [48]
						true, -- [49]
						false, -- [50]
					},
					["Messages"] = {
						"尼罗恩 肉搏 特变电工 Hit -68 (Physical)", -- [1]
						"攻速一点二 撕咬 特变电工 Hit -47 (Physical)", -- [2]
						"特变电工 旋风斩 攻速一点二 Crit -610 (Physical)", -- [3]
						"特变电工 旋风斩 尼罗恩 Crit -732 (Physical)", -- [4]
						"特变电工 旋风斩 残缺一梦-火妖鲁西弗隆 Hit -262 (Physical)", -- [5]
						"打架-黑龙费尔默 瞄准射击 特变电工 Hit -589 (Physical)", -- [6]
						"攻速一点二 肉搏 特变电工 Hit -42 (Physical)", -- [7]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -231 (Physical)", -- [8]
						"攻速一点二 爪击 特变电工 Hit -22 (Physical)", -- [9]
						"尼罗恩 肉搏 特变电工 Hit -67 (Physical)", -- [10]
						"打架-黑龙费尔默 多重射击 特变电工 Hit -277 (Physical)", -- [11]
						"攻速一点二 肉搏 特变电工 Dodge (1)", -- [12]
						"打架-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [13]
						"攻速一点二 肉搏 特变电工 Miss (1)", -- [14]
						"特变电工 重伤 (伤害/跳) 攻速一点二 Tick -75 (Physical)", -- [15]
						"特变电工 重伤 (伤害/跳) 尼罗恩 Tick -76 (Physical)", -- [16]
						"特变电工 治疗药水 特变电工 Hit +1528", -- [17]
						"尼罗恩 肉搏 特变电工 Hit -77 (Physical)", -- [18]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -231 (Physical)", -- [19]
						"攻速一点二 爪击 特变电工 Hit -20 (Physical)", -- [20]
						"特变电工 致死打击 残缺一梦-火妖鲁西弗隆 Crit -802 (Physical)", -- [21]
						"攻速一点二 肉搏 特变电工 Hit -44 (Physical)", -- [22]
						"打架-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [23]
						"攻速一点二 肉搏 特变电工 Hit -38 (Physical)", -- [24]
						"特变电工 重伤 (伤害/跳) 攻速一点二 Tick -76 (Physical)", -- [25]
						"打架-黑龙费尔默 自动射击 特变电工 Crit -527 (Physical)", -- [26]
						"攻速一点二 肉搏 特变电工 Hit -39 (Physical)", -- [27]
						"攻速一点二 肉搏 特变电工 Crit -81 (Physical)", -- [28]
						"打架-黑龙费尔默 暗影箭 特变电工 Hit -17 (Shadow)", -- [29]
						"Chop 多重射击 特变电工 Hit -354 (Physical)", -- [30]
						"攻速一点二 爪击 特变电工 Hit -20 (Physical)", -- [31]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -223 (Physical)", -- [32]
						"特变电工 肉搏 狐狸不吃鱼-黑龙费尔默 Crit -948 (Physical)", -- [33]
						"特变电工 重伤 (伤害/跳) 攻速一点二 Tick -76 (Physical)", -- [34]
						"攻速一点二 肉搏 特变电工 Hit -41 (Physical)", -- [35]
						"原子弹 肉搏 特变电工 Hit -60 (Physical)", -- [36]
						"Chop 自动射击 特变电工 Hit -237 (Physical)", -- [37]
						"特变电工 断筋 狐狸不吃鱼-黑龙费尔默 Crit -102 (Physical)", -- [38]
						"原子弹 撕咬 特变电工 Miss (Physical)", -- [39]
						"攻速一点二 肉搏 特变电工 Hit -45 (Physical)", -- [40]
						"狐狸不吃鱼-黑龙费尔默 冰霜震击 特变电工 Hit -573 (Frost)", -- [41]
						"特变电工 斩杀 狐狸不吃鱼-黑龙费尔默 Crit -2659 (Physical)", -- [42]
						"打架-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [43]
						"原子弹 肉搏 特变电工 Hit -62 (Physical)", -- [44]
						"攻速一点二 肉搏 特变电工 Hit -43 (Physical)", -- [45]
						"打架-黑龙费尔默 瞄准射击 特变电工 Hit -589 (Physical)", -- [46]
						"打架-黑龙费尔默 暗影箭 特变电工 Hit -20 (Shadow)", -- [47]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -225 (Physical)", -- [48]
						"特变电工死亡。", -- [49]
						"特变电工 重伤 (伤害/跳) 攻速一点二 Tick -75 (Physical)", -- [50]
					},
					["DeathAt"] = 17080.289,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-12.40099999999802, -- [1]
						-12.05099999999948, -- [2]
						-11.8839999999982, -- [3]
						-11.8839999999982, -- [4]
						-11.8839999999982, -- [5]
						-11.5010000000002, -- [6]
						-11.26800000000003, -- [7]
						-11.03399999999965, -- [8]
						-10.43400000000111, -- [9]
						-10.30099999999948, -- [10]
						-10.1339999999982, -- [11]
						-10.0679999999993, -- [12]
						-9.550999999999476, -- [13]
						-8.86699999999837, -- [14]
						-8.86699999999837, -- [15]
						-8.86699999999837, -- [16]
						-8.734000000000378, -- [17]
						-8.300999999999476, -- [18]
						-8.03399999999965, -- [19]
						-8.001000000000204, -- [20]
						-7.86699999999837, -- [21]
						-7.650999999998021, -- [22]
						-6.550999999999476, -- [23]
						-6.451000000000931, -- [24]
						-5.850999999998749, -- [25]
						-5.416999999997643, -- [26]
						-5.234000000000378, -- [27]
						-4.033999999999651, -- [28]
						-3.951000000000931, -- [29]
						-3.299999999999272, -- [30]
						-3.133999999998196, -- [31]
						-2.984000000000378, -- [32]
						-2.916999999997643, -- [33]
						-2.86699999999837, -- [34]
						-2.833999999998923, -- [35]
						-2.734000000000378, -- [36]
						-2.549999999999272, -- [37]
						-2.516999999999825, -- [38]
						-1.934000000001106, -- [39]
						-1.633999999998196, -- [40]
						-1.566999999999098, -- [41]
						-1, -- [42]
						-0.9660000000003492, -- [43]
						-0.7340000000003783, -- [44]
						-0.4169999999976426, -- [45]
						-0.3169999999990978, -- [46]
						-0.2999999999992724, -- [47]
						0, -- [48]
						0, -- [49]
						0.1330000000016298, -- [50]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
						4969, -- [40]
						4969, -- [41]
						4969, -- [42]
						4969, -- [43]
						4969, -- [44]
						4969, -- [45]
						4969, -- [46]
						4969, -- [47]
						4969, -- [48]
						4969, -- [49]
						4969, -- [50]
					},
					["Health"] = {
						3550, -- [1]
						3482, -- [2]
						3435, -- [3]
						3435, -- [4]
						3435, -- [5]
						3435, -- [6]
						2846, -- [7]
						2804, -- [8]
						2573, -- [9]
						2551, -- [10]
						2484, -- [11]
						2207, -- [12]
						2207, -- [13]
						2096, -- [14]
						2096, -- [15]
						2096, -- [16]
						2096, -- [17]
						3624, -- [18]
						3547, -- [19]
						3316, -- [20]
						3296, -- [21]
						3296, -- [22]
						3252, -- [23]
						3141, -- [24]
						3103, -- [25]
						3103, -- [26]
						2576, -- [27]
						2537, -- [28]
						2456, -- [29]
						2439, -- [30]
						2085, -- [31]
						2065, -- [32]
						1842, -- [33]
						1842, -- [34]
						1842, -- [35]
						1801, -- [36]
						1741, -- [37]
						1504, -- [38]
						1504, -- [39]
						1504, -- [40]
						1459, -- [41]
						886, -- [42]
						886, -- [43]
						775, -- [44]
						713, -- [45]
						670, -- [46]
						670, -- [47]
						61, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "打架-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"HEAL", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"MISC", -- [49]
						"DAMAGE", -- [50]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
					},
					["Messages"] = {
						"豹 肉搏 特变电工 Crit -116 (Physical)", -- [1]
						"锘一-逐风者 自动射击 特变电工 Hit -243 (Physical)", -- [2]
						"特变电工 旋风斩 豹 Hit -327 (Physical)", -- [3]
						"特变电工 旋风斩 锘一-逐风者 Crit -1038 (Physical)", -- [4]
						"特变电工 旋风斩 残缺一梦-火妖鲁西弗隆 Hit -547 (Physical)", -- [5]
						"豹 肉搏 特变电工 Crit -107 (Physical)", -- [6]
						"豹 爪击 特变电工 Crit -82 (Physical)", -- [7]
						"特变电工 肉搏 残缺一梦-火妖鲁西弗隆 Hit -649 (Physical)", -- [8]
						"豹 肉搏 特变电工 Parry (1)", -- [9]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -156 (Shadow)", -- [10]
						"特变电工 重伤 (伤害/跳) 锘一-逐风者 Tick -134 (Physical)", -- [11]
						"豹 肉搏 特变电工 Miss (1)", -- [12]
						"特变电工 肉搏 锘一-逐风者 Crit -1007 (Physical)", -- [13]
						"特变电工 致死打击 锘一-逐风者 Hit -662 (Physical)", -- [14]
						"豹 肉搏 特变电工 Hit -57 (Physical)", -- [15]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -202 (Physical)", -- [16]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -157 (Shadow)", -- [17]
						"攻速一点二 肉搏 特变电工 Hit -41 (Physical)", -- [18]
						"攻速一点二 爪击 特变电工 Crit -44 (Physical)", -- [19]
						"打架-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [20]
						"攻速一点二 肉搏 特变电工 Hit -39 (Physical)", -- [21]
						"攻速一点二 撕咬 特变电工 Hit -49 (Physical)", -- [22]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -157 (Shadow)", -- [23]
						"特变电工 拦截昏迷 Chop Hit -54 (Physical)", -- [24]
						"攻速一点二 肉搏 特变电工 Hit -40 (Physical)", -- [25]
						"打架-黑龙费尔默 瞄准射击 特变电工 Hit -595 (Physical)", -- [26]
						"打架-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [27]
						"特变电工 斩杀 Chop Hit -827 (Physical)", -- [28]
						"打架-黑龙费尔默 多重射击 特变电工 Hit -288 (Physical)", -- [29]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -219 (Physical)", -- [30]
						"攻速一点二 肉搏 特变电工 Parry (1)", -- [31]
						"攻速一点二 爪击 特变电工 Hit -23 (Physical)", -- [32]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -157 (Shadow)", -- [33]
						"攻速一点二 肉搏 特变电工 Hit -45 (Physical)", -- [34]
						"打架-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [35]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -226 (Physical)", -- [36]
						"攻速一点二 爪击 特变电工 Crit -49 (Physical)", -- [37]
						"打架-黑龙费尔默 猛禽一击 特变电工 Hit -299 (Physical)", -- [38]
						"特变电工死亡。", -- [39]
					},
					["DeathAt"] = 17016.302,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
					},
					["MessageTimes"] = {
						-14.78399999999965, -- [1]
						-14.0669999999991, -- [2]
						-13.78399999999965, -- [3]
						-13.78399999999965, -- [4]
						-13.78399999999965, -- [5]
						-13.38400000000183, -- [6]
						-13.15000000000146, -- [7]
						-12.5669999999991, -- [8]
						-11.96700000000055, -- [9]
						-10.78399999999965, -- [10]
						-10.75, -- [11]
						-10.5669999999991, -- [12]
						-9.766999999999825, -- [13]
						-9.617000000002008, -- [14]
						-9.16700000000128, -- [15]
						-8.299999999999272, -- [16]
						-7.783999999999651, -- [17]
						-6.683000000000902, -- [18]
						-6.683000000000902, -- [19]
						-6.582999999998719, -- [20]
						-5.467000000000553, -- [21]
						-5.066999999999098, -- [22]
						-4.782999999999447, -- [23]
						-4.650000000001455, -- [24]
						-4.282999999999447, -- [25]
						-3.933000000000902, -- [26]
						-3.566999999999098, -- [27]
						-3.566999999999098, -- [28]
						-3.38300000000163, -- [29]
						-2.933000000000902, -- [30]
						-2.066999999999098, -- [31]
						-1.849999999998545, -- [32]
						-1.782999999999447, -- [33]
						-0.8499999999985448, -- [34]
						-0.5829999999987194, -- [35]
						-0.532999999999447, -- [36]
						-0.2160000000003493, -- [37]
						-0.03299999999944703, -- [38]
						0, -- [39]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
					},
					["Health"] = {
						3676, -- [1]
						3560, -- [2]
						3317, -- [3]
						3317, -- [4]
						3317, -- [5]
						3317, -- [6]
						3210, -- [7]
						3128, -- [8]
						3128, -- [9]
						3128, -- [10]
						2972, -- [11]
						2972, -- [12]
						2972, -- [13]
						2972, -- [14]
						2972, -- [15]
						2915, -- [16]
						2713, -- [17]
						2556, -- [18]
						2556, -- [19]
						2471, -- [20]
						2360, -- [21]
						2321, -- [22]
						2272, -- [23]
						2115, -- [24]
						2115, -- [25]
						2075, -- [26]
						1480, -- [27]
						1480, -- [28]
						1369, -- [29]
						1081, -- [30]
						862, -- [31]
						862, -- [32]
						839, -- [33]
						682, -- [34]
						637, -- [35]
						526, -- [36]
						300, -- [37]
						251, -- [38]
						0, -- [39]
					},
					["KilledBy"] = "打架-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"MISC", -- [39]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						false, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
					},
					["Messages"] = {
						"特变电工 断筋 Chop Hit -31 (Physical)", -- [1]
						"Chop 多重射击 特变电工 Hit -330 (Physical)", -- [2]
						"特变电工 肉搏 Chop Hit -314 (Physical)", -- [3]
						"Chop 驱散射击 特变电工 Hit -110 (Physical)", -- [4]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -198 (Physical)", -- [5]
						"攻速一点二 肉搏 特变电工 Hit -49 (Physical)", -- [6]
						"攻速一点二 爪击 特变电工 Miss (Physical)", -- [7]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -161 (Shadow)", -- [8]
						"特变电工 拦截昏迷 锘一-逐风者 Hit -47 (Physical)", -- [9]
						"攻速一点二 肉搏 特变电工 Hit -48 (Physical)", -- [10]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -67 (Shadow)", -- [11]
						"特变电工 断筋 锘一-逐风者 Hit -34 (Physical)", -- [12]
						"特变电工 肉搏 锘一-逐风者 Hit -403 (Physical)", -- [13]
						"残缺一梦-火妖鲁西弗隆 献祭 特变电工 Hit -335 (Fire)", -- [14]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [15]
						"攻速一点二 爪击 特变电工 Hit -25 (Physical)", -- [16]
						"打架-黑龙费尔默 瞄准射击 特变电工 Hit -589 (Physical)", -- [17]
						"攻速一点二 肉搏 特变电工 Hit -47 (Physical)", -- [18]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -217 (Physical)", -- [19]
						"原子弹 肉搏 特变电工 Hit -126 (Physical)", -- [20]
						"原子弹 撕咬 特变电工 Hit -58 (Physical)", -- [21]
						"攻速一点二 肉搏 特变电工 Miss (1)", -- [22]
						"攻速一点二 撕咬 特变电工 Hit -45 (Physical)", -- [23]
						"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 特变电工 Tick -138 (Fire)", -- [24]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 特变电工 Tick -161 (Shadow)", -- [25]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -66 (Shadow)", -- [26]
						"Chop 自动射击 特变电工 Hit -270 (Physical)", -- [27]
						"打架-黑龙费尔默 多重射击 特变电工 Hit -291 (Physical)", -- [28]
						"打架-黑龙费尔默 自动射击 特变电工 Hit -238 (Physical)", -- [29]
						"特变电工 斩杀 锘一-逐风者 Hit -881 (Physical)", -- [30]
						"残缺一梦-火妖鲁西弗隆 暗影箭 特变电工 Hit -716 (Shadow)", -- [31]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 特变电工 Tick -67 (Shadow)", -- [32]
						"Chop 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [33]
						"残缺一梦-火妖鲁西弗隆 暗影灼烧 特变电工 Hit -674 (Shadow)", -- [34]
						"特变电工死亡。", -- [35]
					},
					["DeathAt"] = 16821.291,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["MessageTimes"] = {
						-10.72600000000239, -- [1]
						-10.4429999999993, -- [2]
						-10.35900000000038, -- [3]
						-10.1260000000002, -- [4]
						-7.576000000000931, -- [5]
						-7.555000000000291, -- [6]
						-7.555000000000291, -- [7]
						-6.843000000000757, -- [8]
						-6.809000000001106, -- [9]
						-6.342000000000553, -- [10]
						-6.326000000000931, -- [11]
						-5.609000000000378, -- [12]
						-5.542000000001281, -- [13]
						-5.509000000001834, -- [14]
						-4.326000000000931, -- [15]
						-4.309000000001106, -- [16]
						-4.259000000001834, -- [17]
						-4.126000000000204, -- [18]
						-3.842000000000553, -- [19]
						-3.826000000000931, -- [20]
						-3.109000000000378, -- [21]
						-2.925999999999476, -- [22]
						-2.691999999999098, -- [23]
						-2.509000000001834, -- [24]
						-2.509000000001834, -- [25]
						-2.342000000000553, -- [26]
						-2.208999999998923, -- [27]
						-1.625, -- [28]
						-1.075000000000728, -- [29]
						-0.772000000000844, -- [30]
						-0.6419999999998254, -- [31]
						-0.342000000000553, -- [32]
						-0.1749999999992724, -- [33]
						0, -- [34]
						0, -- [35]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
					},
					["Health"] = {
						4756, -- [1]
						4756, -- [2]
						4426, -- [3]
						4426, -- [4]
						4316, -- [5]
						4118, -- [6]
						4118, -- [7]
						4069, -- [8]
						3908, -- [9]
						3908, -- [10]
						3908, -- [11]
						3793, -- [12]
						3793, -- [13]
						3793, -- [14]
						3458, -- [15]
						3392, -- [16]
						3367, -- [17]
						2778, -- [18]
						2731, -- [19]
						2731, -- [20]
						2388, -- [21]
						2330, -- [22]
						2330, -- [23]
						2285, -- [24]
						2285, -- [25]
						1986, -- [26]
						1920, -- [27]
						1650, -- [28]
						1359, -- [29]
						1121, -- [30]
						1121, -- [31]
						405, -- [32]
						338, -- [33]
						227, -- [34]
						0, -- [35]
					},
					["KilledBy"] = "残缺一梦-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"MISC", -- [35]
					},
				}, -- [4]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						false, -- [31]
						false, -- [32]
						false, -- [33]
						false, -- [34]
						false, -- [35]
						false, -- [36]
						true, -- [37]
						false, -- [38]
						false, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						false, -- [44]
						true, -- [45]
						false, -- [46]
						false, -- [47]
						true, -- [48]
						true, -- [49]
						true, -- [50]
					},
					["Messages"] = {
						"特变电工 肉搏 打架-黑龙费尔默 Hit -389 (Physical)", -- [1]
						"特变电工 战士的决心 特变电工 Hit +125 (73 过量治疗)", -- [2]
						"特变电工 断筋 打架-黑龙费尔默 Crit -72 (Physical)", -- [3]
						"特变电工 斩杀 打架-黑龙费尔默 Hit -564 (Physical)", -- [4]
						"特变电工 重伤 (伤害/跳) 打架-黑龙费尔默 Tick -76 (Physical)", -- [5]
						"豹 肉搏 特变电工 Crit -110 (Physical)", -- [6]
						"豹 爪击 特变电工 Hit -52 (Physical)", -- [7]
						"豹 肉搏 特变电工 Crit -130 (Physical)", -- [8]
						"豹 爪击 特变电工 Hit -48 (Physical)", -- [9]
						"豹 肉搏 特变电工 Hit -60 (Physical)", -- [10]
						"特变电工 肉搏 锘一-逐风者 Hit -397 (Physical)", -- [11]
						"豹 肉搏 特变电工 Crit -119 (Physical)", -- [12]
						"豹 爪击 特变电工 Hit -49 (Physical)", -- [13]
						"狐狸不吃鱼-黑龙费尔默 冰霜震击 特变电工 Hit -532 (Frost)", -- [14]
						"猎蝶兽兽-黑龙费尔默 奥术射击 特变电工 Hit -188 (Arcane)", -- [15]
						"豹 肉搏 特变电工 Dodge (1)", -- [16]
						"豹 爪击 特变电工 Hit -46 (Physical)", -- [17]
						"原子弹 肉搏 特变电工 Parry (1)", -- [18]
						"风蛇 闪电吐息 特变电工 Hit -111 (Nature)", -- [19]
						"豹 肉搏 特变电工 Dodge (1)", -- [20]
						"豹 爪击 特变电工 Hit -50 (Physical)", -- [21]
						"特变电工 撕裂 (伤害/跳) 锘一-逐风者 Tick -36 (Physical)", -- [22]
						"Chop 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [23]
						"原子弹 撕咬 特变电工 Hit -69 (Physical)", -- [24]
						"Chop 自动射击 特变电工 Hit -278 (Physical)", -- [25]
						"原子弹 肉搏 特变电工 Hit -64 (Physical)", -- [26]
						"豹 肉搏 特变电工 Crit -135 (Physical)", -- [27]
						"Chop 多重射击 特变电工 Crit -843 (Physical)", -- [28]
						"风蛇 肉搏 特变电工 Parry (1)", -- [29]
						"豹 爪击 特变电工 Hit -51 (Physical)", -- [30]
						"特变电工 横扫攻击 豹 Hit -258 (Physical)", -- [31]
						"特变电工 旋风斩 原子弹 Hit -341 (Physical)", -- [32]
						"特变电工 旋风斩 风蛇 Hit -315 (Physical)", -- [33]
						"特变电工 旋风斩 豹 Hit -263 (Physical)", -- [34]
						"特变电工 旋风斩 狐狸不吃鱼-黑龙费尔默 Hit -443 (Physical)", -- [35]
						"特变电工 横扫攻击 原子弹 Hit -349 (Physical)", -- [36]
						"猎蝶兽兽-黑龙费尔默 自动射击 特变电工 Crit -579 (Physical)", -- [37]
						"特变电工 肉搏 狐狸不吃鱼-黑龙费尔默 Hit -457 (Physical)", -- [38]
						"特变电工 横扫攻击 豹 Hit -364 (Physical)", -- [39]
						"豹 肉搏 特变电工 Hit -69 (Physical)", -- [40]
						"原子弹 肉搏 特变电工 Hit -64 (Physical)", -- [41]
						"Chop 奥术射击 特变电工 Crit -493 (Arcane)", -- [42]
						"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [43]
						"特变电工 撕裂 (伤害/跳) 锘一-逐风者 Tick -35 (Physical)", -- [44]
						"Chop 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [45]
						"特变电工 致死打击 狐狸不吃鱼-黑龙费尔默 Crit -1360 (Physical)", -- [46]
						"特变电工 横扫攻击 豹 Hit -1082 (Physical)", -- [47]
						"风蛇 肉搏 特变电工 Hit -71 (Physical)", -- [48]
						"豹 肉搏 特变电工 Crit -129 (Physical)", -- [49]
						"特变电工死亡。", -- [50]
					},
					["DeathAt"] = 16773.288,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-14.93399999999747, -- [1]
						-14.91699999999764, -- [2]
						-14.90099999999802, -- [3]
						-13.41699999999764, -- [4]
						-11.86699999999837, -- [5]
						-11.23400000000038, -- [6]
						-10.43399999999747, -- [7]
						-9.833999999998923, -- [8]
						-8.5, -- [9]
						-8.433999999997468, -- [10]
						-8.099999999998545, -- [11]
						-7.033999999999651, -- [12]
						-6.899999999997817, -- [13]
						-5.849999999998545, -- [14]
						-5.632999999997992, -- [15]
						-5.632999999997992, -- [16]
						-5.282999999999447, -- [17]
						-4.86699999999837, -- [18]
						-4.633999999998196, -- [19]
						-4.217000000000553, -- [20]
						-3.666999999997643, -- [21]
						-3.332999999998719, -- [22]
						-3.299999999999272, -- [23]
						-3.266999999999825, -- [24]
						-2.916999999997643, -- [25]
						-2.882999999997992, -- [26]
						-2.816999999999098, -- [27]
						-2.182999999997264, -- [28]
						-2.066999999999098, -- [29]
						-2.049999999999272, -- [30]
						-1.782999999999447, -- [31]
						-1.782999999999447, -- [32]
						-1.782999999999447, -- [33]
						-1.782999999999447, -- [34]
						-1.782999999999447, -- [35]
						-1.747999999999593, -- [36]
						-1.582999999998719, -- [37]
						-1.582999999998719, -- [38]
						-1.559999999997672, -- [39]
						-1.416999999997643, -- [40]
						-0.8669999999983702, -- [41]
						-0.7330000000001746, -- [42]
						-0.467000000000553, -- [43]
						-0.3329999999987194, -- [44]
						-0.282999999999447, -- [45]
						-0.2669999999998254, -- [46]
						-0.25, -- [47]
						-0.0499999999992724, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
						4969, -- [28]
						4969, -- [29]
						4969, -- [30]
						4969, -- [31]
						4969, -- [32]
						4969, -- [33]
						4969, -- [34]
						4969, -- [35]
						4969, -- [36]
						4969, -- [37]
						4969, -- [38]
						4969, -- [39]
						4969, -- [40]
						4969, -- [41]
						4969, -- [42]
						4969, -- [43]
						4969, -- [44]
						4969, -- [45]
						4969, -- [46]
						4969, -- [47]
						4969, -- [48]
						4969, -- [49]
						4969, -- [50]
					},
					["Health"] = {
						4917, -- [1]
						4917, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4859, -- [7]
						4807, -- [8]
						4677, -- [9]
						4629, -- [10]
						4569, -- [11]
						4569, -- [12]
						4450, -- [13]
						4064, -- [14]
						3532, -- [15]
						3532, -- [16]
						3344, -- [17]
						3298, -- [18]
						3298, -- [19]
						3187, -- [20]
						3187, -- [21]
						3137, -- [22]
						3137, -- [23]
						3026, -- [24]
						2957, -- [25]
						2679, -- [26]
						2615, -- [27]
						2480, -- [28]
						1637, -- [29]
						1637, -- [30]
						1586, -- [31]
						1586, -- [32]
						1586, -- [33]
						1586, -- [34]
						1586, -- [35]
						1586, -- [36]
						1586, -- [37]
						1586, -- [38]
						1007, -- [39]
						1007, -- [40]
						938, -- [41]
						874, -- [42]
						381, -- [43]
						270, -- [44]
						270, -- [45]
						270, -- [46]
						159, -- [47]
						159, -- [48]
						88, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "豹",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"HEAL", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"MISC", -- [50]
					},
				}, -- [5]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						false, -- [19]
						true, -- [20]
						false, -- [21]
						true, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
					},
					["Messages"] = {
						"特变电工 断筋 残缺一梦-火妖鲁西弗隆 Hit -26 (Physical)", -- [1]
						"Chop 多重射击 特变电工 Hit -340 (Physical)", -- [2]
						"特变电工 肉搏 (正义之手) 残缺一梦-火妖鲁西弗隆 Crit -499 (Physical)", -- [3]
						"Chop 自动射击 特变电工 Hit -247 (Physical)", -- [4]
						"特变电工 致死打击 残缺一梦-火妖鲁西弗隆 Hit -369 (Physical)", -- [5]
						"Chop 奥术射击 特变电工 Hit -207 (Arcane)", -- [6]
						"原子弹 野猪冲锋 特变电工 Resist (Physical)", -- [7]
						"特变电工 旋风斩 残缺一梦-火妖鲁西弗隆 Hit -227 (Physical)", -- [8]
						"原子弹 肉搏 特变电工 Hit -109 (Physical)", -- [9]
						"特变电工 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -53 (Physical)", -- [10]
						"Chop 自动射击 特变电工 Hit -247 (Physical)", -- [11]
						"原子弹 撕咬 特变电工 Hit -56 (Physical)", -- [12]
						"原子弹 肉搏 特变电工 Hit -49 (Physical)", -- [13]
						"特变电工 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Absorb -76 (76 被吸收) (Physical)", -- [14]
						"特变电工 肉搏 原子弹 Hit -241 (Physical)", -- [15]
						"特变电工 致死打击 原子弹 Hit -293 (Physical)", -- [16]
						"Chop 毒蛇钉刺 (伤害/跳) 特变电工 Tick -91 (Nature)", -- [17]
						"特变电工 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Absorb -76 (76 被吸收) (Physical)", -- [18]
						"特变电工 肉搏 尼罗恩 Parry (1)", -- [19]
						"Chop 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [20]
						"特变电工 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Absorb -76 (76 被吸收) (Physical)", -- [21]
						"Chop 多重射击 特变电工 Crit -850 (Physical)", -- [22]
						"残缺一梦-火妖鲁西弗隆 暗影灼烧 特变电工 Hit -654 (Shadow)", -- [23]
						"特变电工 肉搏 残缺一梦-火妖鲁西弗隆 Absorb -296 (1)", -- [24]
						"特变电工 旋风斩 残缺一梦-火妖鲁西弗隆 Hit -115 (296 被吸收) (Physical)", -- [25]
						"Chop 毒蛇钉刺 (伤害/跳) 特变电工 Tick -111 (Nature)", -- [26]
						"特变电工死亡。", -- [27]
					},
					["DeathAt"] = 16733.302,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["MessageTimes"] = {
						-14.45100000000093, -- [1]
						-13.68399999999747, -- [2]
						-13.6339999999982, -- [3]
						-13.43399999999747, -- [4]
						-12.93399999999747, -- [5]
						-12.11799999999857, -- [6]
						-11.78399999999965, -- [7]
						-11.43399999999747, -- [8]
						-11.0010000000002, -- [9]
						-10.60099999999875, -- [10]
						-10.10099999999875, -- [11]
						-9.383999999998196, -- [12]
						-9.001000000000204, -- [13]
						-7.600999999998749, -- [14]
						-7.283999999999651, -- [15]
						-6.933999999997468, -- [16]
						-6.001000000000204, -- [17]
						-4.599999999998545, -- [18]
						-3, -- [19]
						-2.984000000000378, -- [20]
						-1.599999999998545, -- [21]
						-1.283999999999651, -- [22]
						-0.8839999999981956, -- [23]
						-0.717000000000553, -- [24]
						-0.717000000000553, -- [25]
						0, -- [26]
						0, -- [27]
					},
					["HealthMax"] = {
						4969, -- [1]
						4969, -- [2]
						4969, -- [3]
						4969, -- [4]
						4969, -- [5]
						4969, -- [6]
						4969, -- [7]
						4969, -- [8]
						4969, -- [9]
						4969, -- [10]
						4969, -- [11]
						4969, -- [12]
						4969, -- [13]
						4969, -- [14]
						4969, -- [15]
						4969, -- [16]
						4969, -- [17]
						4969, -- [18]
						4969, -- [19]
						4969, -- [20]
						4969, -- [21]
						4969, -- [22]
						4969, -- [23]
						4969, -- [24]
						4969, -- [25]
						4969, -- [26]
						4969, -- [27]
					},
					["Health"] = {
						3043, -- [1]
						3043, -- [2]
						2703, -- [3]
						2703, -- [4]
						2456, -- [5]
						2456, -- [6]
						2249, -- [7]
						2249, -- [8]
						2249, -- [9]
						2140, -- [10]
						2140, -- [11]
						1893, -- [12]
						1837, -- [13]
						1788, -- [14]
						1788, -- [15]
						1788, -- [16]
						1788, -- [17]
						1697, -- [18]
						1697, -- [19]
						1697, -- [20]
						1586, -- [21]
						1586, -- [22]
						736, -- [23]
						82, -- [24]
						82, -- [25]
						82, -- [26]
						0, -- [27]
					},
					["KilledBy"] = "Chop",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"MISC", -- [27]
					},
				}, -- [6]
			},
			["TimeLast"] = {
				["TimeHeal"] = 17069.289,
				["HOT_Time"] = 16947.298,
				["OVERALL"] = 17155.294,
				["DamageTaken"] = 17155.294,
				["ActiveTime"] = 17154.293,
				["DeathCount"] = 17155.294,
				["HealingTaken"] = 17069.289,
				["Overhealing"] = 16756.304,
				["TimeDamage"] = 17154.293,
				["Healing"] = 17069.289,
				["RageGain"] = 17146.293,
				["DOT_Time"] = 17131.292,
				["Damage"] = 17152.293,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"MISC", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					10.5, -- [1]
				},
				["Healing"] = {
					5145, -- [1]
				},
				["DamageTaken"] = {
					40633, -- [1]
				},
				["HOT_Time"] = {
					12, -- [1]
				},
				["DeathCount"] = {
					6, -- [1]
				},
				["HealingTaken"] = {
					6574, -- [1]
				},
				["Overhealing"] = {
					73, -- [1]
				},
				["ActiveTime"] = {
					140.22, -- [1]
				},
				["RageGain"] = {
					326, -- [1]
				},
				["TimeDamage"] = {
					129.72, -- [1]
				},
				["DOT_Time"] = {
					51, -- [1]
				},
				["Damage"] = {
					48939, -- [1]
				},
			},
			["LastHealTime"] = 17069.622,
			["LastDamageTaken"] = 526,
			["level"] = 60,
			["LastDamageAbility"] = "瞄准射击",
			["LastFightIn"] = 4,
			["GUID"] = "Player-5458-02F6D2A3",
			["type"] = "Self",
			["LastEventHealth"] = {
				1116, -- [1]
				1116, -- [2]
				1116, -- [3]
				1116, -- [4]
				263, -- [5]
				0, -- [6]
				4288, -- [7]
				4288, -- [8]
				4288, -- [9]
				4259, -- [10]
				3918, -- [11]
				3851, -- [12]
				3851, -- [13]
				3851, -- [14]
				3823, -- [15]
				3823, -- [16]
				3712, -- [17]
				3684, -- [18]
				3684, -- [19]
				3684, -- [20]
				3416, -- [21]
				3416, -- [22]
				3416, -- [23]
				3305, -- [24]
				3276, -- [25]
				3166, -- [26]
				3186, -- [27]
				3123, -- [28]
				3143, -- [29]
				3143, -- [30]
				3143, -- [31]
				2325, -- [32]
				2217, -- [33]
				2180, -- [34]
				2180, -- [35]
				1752, -- [36]
				1692, -- [37]
				1659, -- [38]
				1659, -- [39]
				1452, -- [40]
				1452, -- [41]
				1382, -- [42]
				1322, -- [43]
				1322, -- [44]
				1262, -- [45]
				1262, -- [46]
				1225, -- [47]
				1187, -- [48]
				1187, -- [49]
				1148, -- [50]
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4969, -- [1]
				4969, -- [2]
				4969, -- [3]
				4969, -- [4]
				4969, -- [5]
				4969, -- [6]
				4969, -- [7]
				4969, -- [8]
				4969, -- [9]
				4969, -- [10]
				4969, -- [11]
				4969, -- [12]
				4969, -- [13]
				4969, -- [14]
				4969, -- [15]
				4969, -- [16]
				4969, -- [17]
				4969, -- [18]
				4969, -- [19]
				4969, -- [20]
				4969, -- [21]
				4969, -- [22]
				4969, -- [23]
				4969, -- [24]
				4969, -- [25]
				4969, -- [26]
				4969, -- [27]
				4969, -- [28]
				4969, -- [29]
				4969, -- [30]
				4969, -- [31]
				4969, -- [32]
				4969, -- [33]
				4969, -- [34]
				4969, -- [35]
				4969, -- [36]
				4969, -- [37]
				4969, -- [38]
				4969, -- [39]
				4969, -- [40]
				4969, -- [41]
				4969, -- [42]
				4969, -- [43]
				4969, -- [44]
				4969, -- [45]
				4969, -- [46]
				4969, -- [47]
				4969, -- [48]
				4969, -- [49]
				4969, -- [50]
			},
			["NextEventNum"] = 7,
			["LastDamageTime"] = 17154.694,
			["LastEvents"] = {
				"特变电工 破胆怒吼 狐狸不吃鱼-黑龙费尔默 Resist (Physical)", -- [1]
				"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -234 (Physical)", -- [2]
				"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -282 (Physical)", -- [3]
				"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -337 (Physical)", -- [4]
				"打架-黑龙费尔默 瞄准射击 特变电工 Hit -526 (Physical)", -- [5]
				"特变电工死亡。", -- [6]
				"特变电工 重伤 (伤害/跳) 断水流-黑龙费尔默 Tick -83 (Physical)", -- [7]
				"特变电工 肉搏 断水流-黑龙费尔默 Crit -662 (Physical)", -- [8]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -29 (Physical)", -- [9]
				"断水流-黑龙费尔默 肉搏 特变电工 Hit -341 (Physical)", -- [10]
				"断水流-黑龙费尔默 断筋 特变电工 Crit -67 (Physical)", -- [11]
				"特变电工 重伤 (伤害/跳) 断水流-黑龙费尔默 Tick -84 (Physical)", -- [12]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -28 (Physical)", -- [13]
				"特变电工 雷霆一击 断水流-黑龙费尔默 Hit -79 (Physical)", -- [14]
				"特变电工 肉搏 断水流-黑龙费尔默 Crit -765 (Physical)", -- [15]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -111 (Physical)", -- [16]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -28 (Physical)", -- [17]
				"特变电工 致死打击 断水流-黑龙费尔默 Hit -472 (Physical)", -- [18]
				"特变电工 肉搏 断水流-黑龙费尔默 Crit -722 (Physical)", -- [19]
				"断水流-黑龙费尔默 肉搏 特变电工 Hit -268 (Physical)", -- [20]
				"断水流-黑龙费尔默 致死打击 特变电工 Dodge (Physical)", -- [21]
				"特变电工 斩杀 断水流-黑龙费尔默 Hit -628 (Physical)", -- [22]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -111 (Physical)", -- [23]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -29 (Physical)", -- [24]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -110 (Physical)", -- [25]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -28 (Physical)", -- [26]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -111 (Physical)", -- [27]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 特变电工 Tick -29 (Physical)", -- [28]
				"特变电工 断筋 帅哥祖师爷龙-逐风者 Hit -38 (Physical)", -- [29]
				"特变电工 肉搏 帅哥祖师爷龙-逐风者 Hit -450 (Physical)", -- [30]
				"狐狸不吃鱼-黑龙费尔默 冰霜震击 特变电工 Crit -818 (Frost)", -- [31]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Crit -108 (Physical)", -- [32]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -37 (Physical)", -- [33]
				"狐狸不吃鱼-黑龙费尔默 肉搏 特变电工 Hit -212 (Physical)", -- [34]
				"狐狸不吃鱼-黑龙费尔默 风暴打击 特变电工 Hit -216 (Physical)", -- [35]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -60 (Physical)", -- [36]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -33 (Physical)", -- [37]
				"特变电工 断筋 帅哥祖师爷龙-逐风者 Dodge (Physical)", -- [38]
				"打架-黑龙费尔默 自动射击 特变电工 Hit -207 (Physical)", -- [39]
				"特变电工 肉搏 帅哥祖师爷龙-逐风者 Dodge (1)", -- [40]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Crit -70 (Physical)", -- [41]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -60 (Physical)", -- [42]
				"攻速一点二 肉搏 特变电工 Hit -37 (Physical)", -- [43]
				"攻速一点二 爪击 特变电工 Hit -23 (Physical)", -- [44]
				"特变电工 压制 帅哥祖师爷龙-逐风者 Hit -454 (Physical)", -- [45]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -37 (Physical)", -- [46]
				"攻速一点二 肉搏 特变电工 Hit -38 (Physical)", -- [47]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Miss (1)", -- [48]
				"攻速一点二 撕咬 特变电工 Hit -39 (Physical)", -- [49]
				"帅哥祖师爷龙-逐风者 肉搏 特变电工 Hit -32 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["Name"] = "特变电工",
			["LastEventTimes"] = {
				17154.694, -- [1]
				17154.744, -- [2]
				17154.76, -- [3]
				17154.76, -- [4]
				17155.327, -- [5]
				17155.343, -- [6]
				17127.892, -- [7]
				17128.659, -- [8]
				17129.176, -- [9]
				17130.925, -- [10]
				17131.092, -- [11]
				17131.692, -- [12]
				17132.176, -- [13]
				17132.176, -- [14]
				17132.476, -- [15]
				17134.109, -- [16]
				17135.176, -- [17]
				17135.192, -- [18]
				17135.227, -- [19]
				17135.609, -- [20]
				17136.092, -- [21]
				17136.742, -- [22]
				17137.126, -- [23]
				17138.176, -- [24]
				17140.126, -- [25]
				17141.159, -- [26]
				17143.126, -- [27]
				17144.16, -- [28]
				17147.943, -- [29]
				17148.426, -- [30]
				17148.793, -- [31]
				17149.711, -- [32]
				17150.26, -- [33]
				17150.927, -- [34]
				17150.927, -- [35]
				17151.26, -- [36]
				17151.343, -- [37]
				17151.677, -- [38]
				17152.16, -- [39]
				17152.243, -- [40]
				17152.41, -- [41]
				17152.793, -- [42]
				17152.927, -- [43]
				17152.927, -- [44]
				17153.193, -- [45]
				17153.51, -- [46]
				17154.127, -- [47]
				17154.343, -- [48]
				17154.577, -- [49]
				17154.594, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["断水流-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 5040,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 42,
								},
							},
							["amount"] = 62,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 11,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 19,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 18,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 13,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 1745,
						["Melee"] = 2477,
						["Frost"] = 818,
					},
					["DOT_Time"] = 6,
					["Damage"] = 6845,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 3920,
						["Physical"] = 2925,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 38,
								},
								["压制"] = {
									["count"] = 454,
								},
								["肉搏"] = {
									["count"] = 450,
								},
							},
							["amount"] = 942,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 874,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 167,
								},
								["雷霆一击"] = {
									["count"] = 79,
								},
								["断筋"] = {
									["count"] = 29,
								},
								["斩杀"] = {
									["count"] = 628,
								},
								["肉搏"] = {
									["count"] = 2784,
								},
							},
							["amount"] = 4561,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 31,
								},
								["斩杀"] = {
									["count"] = 625,
								},
								["肉搏"] = {
									["count"] = 686,
								},
							},
							["amount"] = 1342,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 437,
								},
							},
							["amount"] = 437,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["攻速一点二"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 39,
								},
								["爪击"] = {
									["count"] = 23,
								},
								["肉搏"] = {
									["count"] = 75,
								},
							},
							["amount"] = 137,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 443,
								},
								["断筋"] = {
									["count"] = 94,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 197,
								},
								["肉搏"] = {
									["count"] = 900,
								},
							},
							["amount"] = 1634,
						},
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 526,
								},
								["自动射击"] = {
									["count"] = 207,
								},
							},
							["amount"] = 733,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 216,
								},
								["肉搏"] = {
									["count"] = 1065,
								},
								["冰霜震击"] = {
									["count"] = 818,
								},
							},
							["amount"] = 2099,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 18,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 42,
								},
							},
							["amount"] = 42,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 5,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.63,
								},
								["雷霆一击"] = {
									["count"] = 0.48,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.6,
								},
							},
							["amount"] = 9.33,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.25,
								},
								["肉搏"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 3,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 18.83,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 472,
									["min"] = 402,
									["count"] = 2,
									["amount"] = 874,
								},
							},
							["count"] = 2,
							["amount"] = 874,
						},
						["雷霆一击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 79,
									["min"] = 79,
									["count"] = 1,
									["amount"] = 79,
								},
							},
							["count"] = 1,
							["amount"] = 79,
						},
						["压制"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 454,
									["min"] = 454,
									["count"] = 1,
									["amount"] = 454,
								},
							},
							["count"] = 1,
							["amount"] = 454,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 84,
									["min"] = 83,
									["count"] = 2,
									["amount"] = 167,
								},
							},
							["count"] = 2,
							["amount"] = 167,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 38,
									["min"] = 29,
									["count"] = 3,
									["amount"] = 98,
								},
							},
							["count"] = 4,
							["amount"] = 98,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 628,
									["min"] = 625,
									["count"] = 2,
									["amount"] = 1253,
								},
							},
							["count"] = 2,
							["amount"] = 1253,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 765,
									["min"] = 635,
									["count"] = 5,
									["amount"] = 3470,
								},
								["Hit"] = {
									["max"] = 450,
									["min"] = 450,
									["count"] = 1,
									["amount"] = 450,
								},
							},
							["count"] = 7,
							["amount"] = 3920,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 62,
					["TimeDamage"] = 18.83,
					["TimeDamaging"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 5,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.63,
								},
								["雷霆一击"] = {
									["count"] = 0.48,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.6,
								},
							},
							["amount"] = 9.33,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.25,
								},
								["肉搏"] = {
									["count"] = 0.25,
								},
							},
							["amount"] = 3,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["锘一-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 3,
								},
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 6,
								},
								["攻速一点二"] = {
									["count"] = 12,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 6,
								},
								["尼罗恩"] = {
									["count"] = 3,
								},
								["锘一-逐风者"] = {
									["count"] = 3,
								},
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 45,
						},
					},
					["TimeSpent"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.7000000000000001,
								},
								["斩杀"] = {
									["count"] = 2.98,
								},
								["肉搏"] = {
									["count"] = 4.85,
								},
							},
							["amount"] = 11.53,
						},
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 1.5,
								},
								["急救"] = {
									["count"] = 4.5,
								},
								["治疗药水"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 10.5,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.7,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.82,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.23,
								},
								["断筋"] = {
									["count"] = 3.24,
								},
								["拦截昏迷"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 6.5,
								},
							},
							["amount"] = 23.49,
						},
						["风蛇"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 0.04,
								},
								["肉搏"] = {
									["count"] = 1.37,
								},
							},
							["amount"] = 1.41,
						},
						["原子弹"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.35,
								},
								["横扫攻击"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 0.32,
								},
							},
							["amount"] = 0.7,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.32,
								},
								["昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 2.73,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.8,
								},
								["斩杀"] = {
									["count"] = 2.7,
								},
								["肉搏"] = {
									["count"] = 6.029999999999999,
								},
							},
							["amount"] = 19.08,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.63,
								},
								["雷霆一击"] = {
									["count"] = 0.48,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.6,
								},
							},
							["amount"] = 9.33,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 5,
						},
						["Chop"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.63,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 4.08,
								},
								["肉搏"] = {
									["count"] = 2.74,
								},
							},
							["amount"] = 11.95,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.31,
								},
								["挫志怒吼"] = {
									["count"] = 0.9,
								},
								["断筋"] = {
									["count"] = 6,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 7.090000000000001,
								},
							},
							["amount"] = 17.3,
						},
						["攻速一点二"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.18,
								},
								["旋风斩"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 4.83,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.7,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.22,
								},
								["斩杀"] = {
									["count"] = 1.38,
								},
								["肉搏"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 15.47,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["豹"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 1.54,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.04,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.07,
								},
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.35,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 5.09,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 52,
								},
								["急救"] = {
									["count"] = 1000,
								},
								["治疗药水"] = {
									["count"] = 4093,
								},
							},
							["amount"] = 5145,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 1429,
						},
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 524,
					},
					["DeathCount"] = 6,
					["Overhealing"] = 73,
					["ElementTaken"] = {
						["Physical"] = 21198,
						["Melee"] = 6757,
						["Arcane"] = 1284,
						["Frost"] = 3624,
						["Fire"] = 1752,
						["Shadow"] = 3296,
						["Nature"] = 2722,
					},
					["DOT_Time"] = 51,
					["Damage"] = 48939,
					["TimeHeal"] = 10.5,
					["ElementDone"] = {
						["Melee"] = 19882,
						["Physical"] = 29057,
					},
					["DamagedWho"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 76,
								},
								["断筋"] = {
									["count"] = 113,
								},
								["斩杀"] = {
									["count"] = 1550,
								},
								["肉搏"] = {
									["count"] = 1312,
								},
							},
							["amount"] = 3051,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1171,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 499,
								},
								["旋风斩"] = {
									["count"] = 1151,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 281,
								},
								["断筋"] = {
									["count"] = 119,
								},
								["拦截昏迷"] = {
									["count"] = 72,
								},
								["肉搏"] = {
									["count"] = 2111,
								},
							},
							["amount"] = 5404,
						},
						["风蛇"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 336,
								},
								["肉搏"] = {
									["count"] = 251,
								},
								["旋风斩"] = {
									["count"] = 315,
								},
							},
							["amount"] = 902,
						},
						["原子弹"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 293,
								},
								["横扫攻击"] = {
									["count"] = 349,
								},
								["旋风斩"] = {
									["count"] = 341,
								},
								["肉搏"] = {
									["count"] = 241,
								},
							},
							["amount"] = 1224,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1161,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 134,
								},
								["旋风斩"] = {
									["count"] = 1038,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 71,
								},
								["拦截昏迷"] = {
									["count"] = 47,
								},
								["断筋"] = {
									["count"] = 102,
								},
								["斩杀"] = {
									["count"] = 1441,
								},
								["肉搏"] = {
									["count"] = 3245,
								},
							},
							["amount"] = 7239,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 874,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 167,
								},
								["雷霆一击"] = {
									["count"] = 79,
								},
								["断筋"] = {
									["count"] = 29,
								},
								["斩杀"] = {
									["count"] = 628,
								},
								["肉搏"] = {
									["count"] = 2784,
								},
							},
							["amount"] = 4561,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 38,
								},
								["压制"] = {
									["count"] = 454,
								},
								["肉搏"] = {
									["count"] = 450,
								},
							},
							["amount"] = 942,
						},
						["Chop"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 468,
								},
								["拦截昏迷"] = {
									["count"] = 54,
								},
								["断筋"] = {
									["count"] = 62,
								},
								["斩杀"] = {
									["count"] = 2355,
								},
								["肉搏"] = {
									["count"] = 1348,
								},
							},
							["amount"] = 4287,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 815,
								},
								["断筋"] = {
									["count"] = 92,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 151,
								},
								["肉搏"] = {
									["count"] = 3312,
								},
							},
							["amount"] = 4370,
						},
						["攻速一点二"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 302,
								},
								["旋风斩"] = {
									["count"] = 610,
								},
							},
							["amount"] = 912,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1034,
								},
								["断筋"] = {
									["count"] = 100,
								},
								["斩杀"] = {
									["count"] = 2419,
								},
								["肉搏"] = {
									["count"] = 3423,
								},
							},
							["amount"] = 6976,
						},
						["尼罗恩"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 76,
								},
								["旋风斩"] = {
									["count"] = 732,
								},
							},
							["amount"] = 808,
						},
						["豹"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 1704,
								},
								["旋风斩"] = {
									["count"] = 590,
								},
							},
							["amount"] = 2294,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1360,
								},
								["旋风斩"] = {
									["count"] = 443,
								},
								["断筋"] = {
									["count"] = 102,
								},
								["斩杀"] = {
									["count"] = 2659,
								},
								["肉搏"] = {
									["count"] = 1405,
								},
							},
							["amount"] = 5969,
						},
					},
					["WhoDamaged"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 777,
								},
								["暗影箭"] = {
									["count"] = 37,
								},
								["猛禽一击"] = {
									["count"] = 299,
								},
								["自动射击"] = {
									["count"] = 3148,
								},
								["瞄准射击"] = {
									["count"] = 2888,
								},
								["多重射击"] = {
									["count"] = 1771,
								},
							},
							["amount"] = 8920,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1067,
								},
								["寒冰箭"] = {
									["count"] = 578,
								},
								["冰锥术"] = {
									["count"] = 1044,
								},
								["冰霜新星"] = {
									["count"] = 79,
								},
							},
							["amount"] = 2768,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 1328,
								},
								["献祭"] = {
									["count"] = 335,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 266,
								},
								["暗影箭"] = {
									["count"] = 716,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 949,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 138,
								},
							},
							["amount"] = 3732,
						},
						["风蛇"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 392,
								},
								["闪电吐息"] = {
									["count"] = 643,
								},
							},
							["amount"] = 1035,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 443,
								},
								["断筋"] = {
									["count"] = 94,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 197,
								},
								["肉搏"] = {
									["count"] = 900,
								},
							},
							["amount"] = 1634,
						},
						["原子弹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 534,
								},
								["撕咬"] = {
									["count"] = 250,
								},
							},
							["amount"] = 784,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 243,
								},
							},
							["amount"] = 243,
						},
						["攻速一点二"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 228,
								},
								["爪击"] = {
									["count"] = 226,
								},
								["肉搏"] = {
									["count"] = 885,
								},
							},
							["amount"] = 1339,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 437,
								},
							},
							["amount"] = 437,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 646,
								},
								["奥术射击"] = {
									["count"] = 700,
								},
								["摔绊"] = {
									["count"] = 32,
								},
								["驱散射击"] = {
									["count"] = 110,
								},
								["自动射击"] = {
									["count"] = 1516,
								},
								["铁皮手雷"] = {
									["count"] = 212,
								},
								["多重射击"] = {
									["count"] = 3066,
								},
							},
							["amount"] = 6282,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 656,
								},
								["奥术射击"] = {
									["count"] = 584,
								},
								["摔绊"] = {
									["count"] = 32,
								},
								["猛禽一击"] = {
									["count"] = 323,
								},
								["自动射击"] = {
									["count"] = 1485,
								},
								["多重射击"] = {
									["count"] = 942,
								},
								["肉搏"] = {
									["count"] = 251,
								},
							},
							["amount"] = 4273,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2402,
								},
							},
							["amount"] = 2402,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 624,
								},
								["肉搏"] = {
									["count"] = 913,
								},
								["驱散射击"] = {
									["count"] = 125,
								},
								["摔绊"] = {
									["count"] = 160,
								},
							},
							["amount"] = 1822,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 348,
								},
							},
							["amount"] = 348,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 378,
								},
								["肉搏"] = {
									["count"] = 1032,
								},
							},
							["amount"] = 1410,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 216,
								},
								["肉搏"] = {
									["count"] = 1065,
								},
								["冰霜震击"] = {
									["count"] = 1923,
								},
							},
							["amount"] = 3204,
						},
					},
					["ElementDoneBlock"] = {
						["Melee"] = 5,
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 1.5,
								},
								["急救"] = {
									["count"] = 4.5,
								},
								["治疗药水"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 10.5,
						},
					},
					["OverHeals"] = {
						["战士的决心"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 73,
									["min"] = 73,
									["count"] = 1,
									["amount"] = 73,
								},
							},
							["count"] = 1,
							["amount"] = 73,
						},
					},
					["PartialResist"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["地缚术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 25,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["野猪冲锋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["摔绊"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["闪电吐息"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 51,
									["min"] = 51,
									["count"] = 1,
									["amount"] = 51,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 51,
							["amount"] = 6,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 18,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 14,
						},
						["震荡射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 83,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 83,
						},
					},
					["PartialAbsorb"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["地缚术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["野猪冲锋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["摔绊"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 14,
									["amount"] = 0,
								},
							},
							["count"] = 14,
							["amount"] = 0,
						},
						["震荡射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 83,
									["amount"] = 0,
								},
							},
							["count"] = 83,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 140.22,
					["ElementTakenResist"] = {
						["Nature"] = 51,
					},
					["Heals"] = {
						["战士的决心"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 52,
									["min"] = 52,
									["count"] = 1,
									["amount"] = 52,
								},
							},
							["count"] = 1,
							["amount"] = 52,
						},
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 4,
									["amount"] = 1000,
								},
							},
							["count"] = 4,
							["amount"] = 1000,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1528,
									["min"] = 1097,
									["count"] = 3,
									["amount"] = 4093,
								},
							},
							["count"] = 3,
							["amount"] = 4093,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["HOT_Time"] = 12,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 11,
								},
								["Hit"] = {
									["count"] = 75,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 5,
								},
								["Crit"] = {
									["count"] = 12,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 108,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 55,
								},
								["Miss"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 12,
								},
								["Parry"] = {
									["count"] = 7,
								},
							},
							["amount"] = 83,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 10,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 15,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 19,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 26,
						},
					},
					["Healing"] = 5145,
					["DamageTaken"] = 40633,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 116,
								},
								["冲锋"] = {
									["count"] = 210,
								},
							},
							["amount"] = 326,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1360,
									["min"] = 802,
									["count"] = 2,
									["amount"] = 2162,
								},
								["Hit"] = {
									["max"] = 662,
									["min"] = 293,
									["count"] = 11,
									["amount"] = 5014,
								},
							},
							["count"] = 13,
							["amount"] = 7176,
						},
						["雷霆一击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 79,
									["min"] = 79,
									["count"] = 1,
									["amount"] = 79,
								},
							},
							["count"] = 1,
							["amount"] = 79,
						},
						["压制"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 454,
									["min"] = 454,
									["count"] = 1,
									["amount"] = 454,
								},
							},
							["count"] = 1,
							["amount"] = 454,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 3,
									["amount"] = 228,
								},
								["Tick"] = {
									["max"] = 134,
									["min"] = 53,
									["count"] = 12,
									["amount"] = 959,
								},
							},
							["count"] = 15,
							["amount"] = 1187,
						},
						["破胆怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏 (正义之手)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 499,
									["min"] = 499,
									["count"] = 1,
									["amount"] = 499,
								},
							},
							["count"] = 1,
							["amount"] = 499,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["挫志怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 36,
									["min"] = 35,
									["count"] = 2,
									["amount"] = 71,
								},
							},
							["count"] = 2,
							["amount"] = 71,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 54,
									["min"] = 36,
									["count"] = 4,
									["amount"] = 173,
								},
							},
							["count"] = 6,
							["amount"] = 173,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1038,
									["min"] = 610,
									["count"] = 3,
									["amount"] = 2380,
								},
								["Hit"] = {
									["max"] = 547,
									["min"] = 115,
									["count"] = 9,
									["amount"] = 2840,
								},
							},
							["count"] = 12,
							["amount"] = 5220,
						},
						["横扫攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1082,
									["min"] = 27,
									["count"] = 6,
									["amount"] = 2389,
								},
							},
							["count"] = 6,
							["amount"] = 2389,
						},
						["断筋"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 102,
									["min"] = 72,
									["count"] = 2,
									["amount"] = 174,
								},
								["Hit"] = {
									["max"] = 41,
									["min"] = 26,
									["count"] = 18,
									["amount"] = 583,
								},
							},
							["count"] = 22,
							["amount"] = 757,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2659,
									["min"] = 1046,
									["count"] = 3,
									["amount"] = 5499,
								},
								["Hit"] = {
									["max"] = 986,
									["min"] = 482,
									["count"] = 8,
									["amount"] = 5553,
								},
							},
							["count"] = 11,
							["amount"] = 11052,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 296,
									["min"] = 296,
									["count"] = 1,
									["amount"] = 296,
								},
								["Hit"] = {
									["max"] = 649,
									["min"] = 246,
									["count"] = 30,
									["amount"] = 11081,
								},
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1007,
									["min"] = 635,
									["count"] = 11,
									["amount"] = 8264,
								},
								["Hit (被格挡)"] = {
									["max"] = 241,
									["min"] = 241,
									["count"] = 1,
									["amount"] = 241,
								},
							},
							["count"] = 46,
							["amount"] = 19882,
						},
					},
					["RageGain"] = 326,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 210,
								},
							},
							["amount"] = 210,
						},
					},
					["TimeDamage"] = 129.72,
					["TimeDamaging"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.7000000000000001,
								},
								["斩杀"] = {
									["count"] = 2.98,
								},
								["肉搏"] = {
									["count"] = 4.85,
								},
							},
							["amount"] = 11.53,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.7,
								},
								["肉搏 (正义之手)"] = {
									["count"] = 0.82,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.23,
								},
								["断筋"] = {
									["count"] = 3.24,
								},
								["拦截昏迷"] = {
									["count"] = 4.5,
								},
								["肉搏"] = {
									["count"] = 6.5,
								},
							},
							["amount"] = 23.49,
						},
						["风蛇"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 0.04,
								},
								["肉搏"] = {
									["count"] = 1.37,
								},
							},
							["amount"] = 1.41,
						},
						["原子弹"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.35,
								},
								["横扫攻击"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 0.32,
								},
							},
							["amount"] = 0.7,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.32,
								},
								["昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 2.73,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 2.8,
								},
								["斩杀"] = {
									["count"] = 2.7,
								},
								["肉搏"] = {
									["count"] = 6.029999999999999,
								},
							},
							["amount"] = 19.08,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.62,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.63,
								},
								["雷霆一击"] = {
									["count"] = 0.48,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 2.6,
								},
							},
							["amount"] = 9.33,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.05,
								},
							},
							["amount"] = 5,
						},
						["Chop"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.63,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3,
								},
								["斩杀"] = {
									["count"] = 4.08,
								},
								["肉搏"] = {
									["count"] = 2.74,
								},
							},
							["amount"] = 11.95,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.31,
								},
								["挫志怒吼"] = {
									["count"] = 0.9,
								},
								["断筋"] = {
									["count"] = 6,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 7.090000000000001,
								},
							},
							["amount"] = 17.3,
						},
						["攻速一点二"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 4.18,
								},
								["旋风斩"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 4.83,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.7,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 3.22,
								},
								["斩杀"] = {
									["count"] = 1.38,
								},
								["肉搏"] = {
									["count"] = 7.67,
								},
							},
							["amount"] = 15.47,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["豹"] = {
							["Details"] = {
								["横扫攻击"] = {
									["count"] = 1.54,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.04,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.07,
								},
								["破胆怒吼"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.35,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.67,
								},
							},
							["amount"] = 5.09,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["战士的决心"] = {
									["count"] = 52,
								},
								["急救"] = {
									["count"] = 1000,
								},
								["治疗药水"] = {
									["count"] = 4093,
								},
							},
							["amount"] = 5145,
						},
					},
					["HealingTaken"] = 6574,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 31,
								},
								["Dodge"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 11,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 47,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 6,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 58,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 14,
								},
								["Crit"] = {
									["count"] = 11,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 94,
						},
					},
				},
			},
			["UnitLockout"] = 16646.297,
			["LastActive"] = 17155.294,
		},
		["里恩文 <总是那么无奈>"] = {
			["GUID"] = "Pet-0-5427-489-24822-1863-01011A973D",
			["LastEventHealth"] = {
				1709, -- [1]
				1709, -- [2]
				1709, -- [3]
				1709, -- [4]
				1709, -- [5]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
			},
			["TimeWindows"] = {
				["Damage"] = {
					418, -- [1]
				},
				["TimeDamage"] = {
					7.5, -- [1]
				},
				["ActiveTime"] = {
					7.5, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "里恩文",
			["level"] = 1,
			["LastFightIn"] = 4,
			["type"] = "Pet",
			["ownerName"] = "总是那么无奈",
			["TimeLast"] = {
				["Damage"] = 17147.293,
				["OVERALL"] = 17147.293,
				["TimeDamage"] = 17147.293,
				["ActiveTime"] = 17147.293,
			},
			["LastEventHealthMax"] = {
				1709, -- [1]
				1709, -- [2]
				1709, -- [3]
				1709, -- [4]
				1709, -- [5]
			},
			["NextEventNum"] = 6,
			["LastDamageTime"] = 17147.926,
			["LastEvents"] = {
				"里恩文 <总是那么无奈> 肉搏 爱恨情仇-黑龙费尔默 Hit -81 (Physical)", -- [1]
				"里恩文 <总是那么无奈> 肉搏 打架-黑龙费尔默 Hit -89 (Physical)", -- [2]
				"里恩文 <总是那么无奈> 肉搏 打架-黑龙费尔默 Hit -93 (Physical)", -- [3]
				"里恩文 <总是那么无奈> 肉搏 猎蝶兽兽-黑龙费尔默 Hit -81 (Physical)", -- [4]
				"里恩文 <总是那么无奈> 肉搏 猎蝶兽兽-黑龙费尔默 Hit -74 (Physical)", -- [5]
			},
			["Name"] = "里恩文",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
			},
			["LastEventTimes"] = {
				16728.102, -- [1]
				16853.026, -- [2]
				17014.919, -- [3]
				17145.926, -- [4]
				17147.926, -- [5]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 155,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 155,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 155,
								},
							},
							["amount"] = 155,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 81,
									["min"] = 74,
									["count"] = 2,
									["amount"] = 155,
								},
							},
							["count"] = 2,
							["amount"] = 155,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3,
					["TimeDamaging"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDone"] = {
						["Melee"] = 418,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["DamagedWho"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 182,
								},
							},
							["amount"] = 182,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 81,
								},
							},
							["amount"] = 81,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 155,
								},
							},
							["amount"] = 155,
						},
					},
					["TimeDamage"] = 7.5,
					["TimeDamaging"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 93,
									["min"] = 74,
									["count"] = 5,
									["amount"] = 418,
								},
							},
							["count"] = 5,
							["amount"] = 418,
						},
					},
					["ActiveTime"] = 7.5,
					["Damage"] = 418,
				},
			},
			["UnitLockout"] = 16727.302,
			["LastActive"] = 17147.293,
		},
		["芋头妹妹"] = {
			["GUID"] = "Player-5458-02EB4E5E",
			["TimeLast"] = {
				["TimeHeal"] = 17154.293,
				["Dispelled"] = 17065.305,
				["OVERALL"] = 17154.293,
				["Healing"] = 17154.293,
				["DamageTaken"] = 17154.293,
				["DeathCount"] = 17072.289,
				["Absorbs"] = 17069.289,
				["HealingTaken"] = 17154.293,
				["FDamage"] = 17154.293,
				["ActiveTime"] = 17154.293,
				["TimeDamage"] = 17154.293,
				["ManaGain"] = 16867.293,
				["DOT_Time"] = 17154.293,
				["Damage"] = 17154.293,
			},
			["LastAttackedBy"] = "残缺一梦-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"MISC", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"HEAL", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					7.100000000000001, -- [1]
				},
				["Dispelled"] = {
					7, -- [1]
				},
				["Healing"] = {
					2499, -- [1]
				},
				["DamageTaken"] = {
					21414, -- [1]
				},
				["DeathCount"] = {
					4, -- [1]
				},
				["Absorbs"] = {
					733, -- [1]
				},
				["HealingTaken"] = {
					6099, -- [1]
				},
				["FDamage"] = {
					7557, -- [1]
				},
				["TimeDamage"] = {
					120.3, -- [1]
				},
				["ActiveTime"] = {
					127.4, -- [1]
				},
				["ManaGain"] = {
					3407, -- [1]
				},
				["DOT_Time"] = {
					315, -- [1]
				},
				["Damage"] = {
					11720, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						false, -- [19]
						false, -- [20]
						false, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						false, -- [25]
						true, -- [26]
						true, -- [27]
						false, -- [28]
						true, -- [29]
						false, -- [30]
						false, -- [31]
						false, -- [32]
						true, -- [33]
						false, -- [34]
						true, -- [35]
						false, -- [36]
						true, -- [37]
						false, -- [38]
						true, -- [39]
						false, -- [40]
						false, -- [41]
						false, -- [42]
						false, -- [43]
						true, -- [44]
						false, -- [45]
						true, -- [46]
						true, -- [47]
						false, -- [48]
						false, -- [49]
						false, -- [50]
					},
					["Messages"] = {
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Absorb -60 (60 被吸收) (Shadow)", -- [1]
						"Chop 自动射击 芋头妹妹 Crit -491 (Physical)", -- [2]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -210 (Shadow)", -- [3]
						"原子弹 撕咬 芋头妹妹 Hit -52 (Physical)", -- [4]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -22 (Shadow)", -- [5]
						"尼罗恩 dispels 芋头妹妹 魔甲术 (吞噬魔法)", -- [6]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -60 (Shadow)", -- [7]
						"Chop 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -71 (Nature)", -- [8]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [9]
						"狐狸不吃鱼-黑龙费尔默 风暴打击 芋头妹妹 Hit -255 (Physical)", -- [10]
						"狐狸不吃鱼-黑龙费尔默 肉搏 芋头妹妹 Hit -309 (Physical)", -- [11]
						"狐狸不吃鱼-黑龙费尔默 肉搏 芋头妹妹 Crit -659 (Physical)", -- [12]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -109 (Shadow)", -- [13]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -132 (Shadow)", -- [14]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -282 (Shadow)", -- [15]
						"芋头妹妹 腐蚀术 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Absorb -145 (145 被吸收) (Shadow)", -- [16]
						"原子弹 肉搏 芋头妹妹 Hit -55 (Physical)", -- [17]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -23 (Shadow)", -- [18]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Absorb -60 (60 被吸收) (Shadow)", -- [19]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -60 (Shadow)", -- [20]
						"芋头妹妹 腐蚀术 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -145 (Shadow)", -- [21]
						"芋头妹妹 献祭 狐狸不吃鱼-黑龙费尔默 Crit -406 (Fire)", -- [22]
						"原子弹 肉搏 芋头妹妹 Absorb -77 (77 被吸收) (1)", -- [23]
						"芋头妹妹 肉搏 残缺一梦-火妖鲁西弗隆 Absorb -53 (1)", -- [24]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -36 (53 被吸收) (Shadow)", -- [25]
						"狐狸不吃鱼-黑龙费尔默 肉搏 芋头妹妹 Absorb -425 (1)", -- [26]
						"狐狸不吃鱼-黑龙费尔默 肉搏 芋头妹妹 Crit -142 (425 被吸收) (Physical)", -- [27]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -60 (Shadow)", -- [28]
						"Chop 自动射击 芋头妹妹 Hit -236 (Physical)", -- [29]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -101 (Shadow)", -- [30]
						"芋头妹妹 腐蚀术 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -102 (Shadow)", -- [31]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -61 (Shadow)", -- [32]
						"Chop 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -85 (Nature)", -- [33]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -36 (Shadow)", -- [34]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 芋头妹妹 Tick -102 (Shadow)", -- [35]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -43 (Shadow)", -- [36]
						"原子弹 肉搏 芋头妹妹 Miss (1)", -- [37]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -105 (Shadow)", -- [38]
						"Chop 奥术射击 芋头妹妹 Hit -67 (94 被抵抗) (Arcane)", -- [39]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -28 (Shadow)", -- [40]
						"芋头妹妹 腐蚀术 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -145 (Shadow)", -- [41]
						"芋头妹妹 献祭 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -110 (Fire)", -- [42]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -60 (Shadow)", -- [43]
						"火焰新星图腾 V 火焰新星 芋头妹妹 Hit -302 (Fire)", -- [44]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -129 (Shadow)", -- [45]
						"Chop 自动射击 芋头妹妹 Hit -218 (Physical)", -- [46]
						"芋头妹妹死亡。", -- [47]
						"芋头妹妹 腐蚀术 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -145 (Shadow)", -- [48]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -105 (Shadow)", -- [49]
						"芋头妹妹 腐蚀术 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -145 (Shadow)", -- [50]
					},
					["DeathAt"] = 17074.289,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-7.384000000001834, -- [1]
						-7.033999999999651, -- [2]
						-7.033999999999651, -- [3]
						-6.884000000001834, -- [4]
						-6.884000000001834, -- [5]
						-6.734000000000378, -- [6]
						-6.634000000001834, -- [7]
						-6.217000000000553, -- [8]
						-6.217000000000553, -- [9]
						-6.083999999998923, -- [10]
						-6.066999999999098, -- [11]
						-6.066999999999098, -- [12]
						-6.066999999999098, -- [13]
						-6.050999999999476, -- [14]
						-6.050999999999476, -- [15]
						-5.867000000002008, -- [16]
						-5.701000000000931, -- [17]
						-5.684000000001106, -- [18]
						-5.367000000002008, -- [19]
						-4.651000000001659, -- [20]
						-4.117000000002008, -- [21]
						-3.816999999999098, -- [22]
						-3.701000000000931, -- [23]
						-3.367000000002008, -- [24]
						-3.367000000002008, -- [25]
						-3.134000000001834, -- [26]
						-3.134000000001834, -- [27]
						-3.134000000001834, -- [28]
						-2.967000000000553, -- [29]
						-2.967000000000553, -- [30]
						-2.850999999998749, -- [31]
						-2.634000000001834, -- [32]
						-2.575000000000728, -- [33]
						-2.575000000000728, -- [34]
						-1.734000000000378, -- [35]
						-1.734000000000378, -- [36]
						-1.700000000000728, -- [37]
						-1.367000000002008, -- [38]
						-1.184000000001106, -- [39]
						-1.184000000001106, -- [40]
						-1.134000000001834, -- [41]
						-0.8169999999990978, -- [42]
						-0.6500000000014552, -- [43]
						-0.467000000000553, -- [44]
						-0.467000000000553, -- [45]
						0, -- [46]
						0, -- [47]
						0.1329999999979918, -- [48]
						1.365999999998167, -- [49]
						1.865999999998167, -- [50]
					},
					["HealthMax"] = {
						4554, -- [1]
						4554, -- [2]
						4554, -- [3]
						4554, -- [4]
						4554, -- [5]
						4554, -- [6]
						4554, -- [7]
						4554, -- [8]
						4554, -- [9]
						4554, -- [10]
						4554, -- [11]
						4554, -- [12]
						4554, -- [13]
						4554, -- [14]
						4554, -- [15]
						4554, -- [16]
						4554, -- [17]
						4554, -- [18]
						4554, -- [19]
						4554, -- [20]
						4554, -- [21]
						4554, -- [22]
						4554, -- [23]
						4554, -- [24]
						4554, -- [25]
						4554, -- [26]
						4554, -- [27]
						4554, -- [28]
						4554, -- [29]
						4554, -- [30]
						4554, -- [31]
						4554, -- [32]
						4554, -- [33]
						4554, -- [34]
						4554, -- [35]
						4554, -- [36]
						4554, -- [37]
						4554, -- [38]
						4554, -- [39]
						4554, -- [40]
						4554, -- [41]
						4554, -- [42]
						4554, -- [43]
						4554, -- [44]
						4554, -- [45]
						4554, -- [46]
						4554, -- [47]
						4554, -- [48]
						4554, -- [49]
						4554, -- [50]
					},
					["Health"] = {
						2918, -- [1]
						2924, -- [2]
						2924, -- [3]
						2433, -- [4]
						2433, -- [5]
						2381, -- [6]
						2381, -- [7]
						2381, -- [8]
						2381, -- [9]
						2310, -- [10]
						2310, -- [11]
						2310, -- [12]
						2310, -- [13]
						2310, -- [14]
						2310, -- [15]
						1087, -- [16]
						1087, -- [17]
						1032, -- [18]
						1032, -- [19]
						1032, -- [20]
						1032, -- [21]
						1032, -- [22]
						1032, -- [23]
						1032, -- [24]
						1032, -- [25]
						1032, -- [26]
						1032, -- [27]
						890, -- [28]
						890, -- [29]
						890, -- [30]
						654, -- [31]
						654, -- [32]
						654, -- [33]
						654, -- [34]
						569, -- [35]
						569, -- [36]
						569, -- [37]
						467, -- [38]
						467, -- [39]
						467, -- [40]
						467, -- [41]
						400, -- [42]
						400, -- [43]
						400, -- [44]
						400, -- [45]
						98, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						1, -- [50]
					},
					["KilledBy"] = "Chop",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"MISC", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"MISC", -- [47]
						"DAMAGE", -- [48]
						"DAMAGE", -- [49]
						"DAMAGE", -- [50]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
					},
					["Messages"] = {
						"豹 爪击 芋头妹妹 Hit -62 (Physical)", -- [1]
						"芋头妹妹 痛苦诅咒 (伤害/跳) Chop Tick -150 (Shadow)", -- [2]
						"芋头妹妹 特效治疗石 芋头妹妹 Hit +1440", -- [3]
						"锘一-逐风者 瞄准射击 芋头妹妹 Hit -806 (Physical)", -- [4]
						"豹 肉搏 芋头妹妹 Miss (1)", -- [5]
						"尼罗恩 肉搏 芋头妹妹 Hit -85 (Physical)", -- [6]
						"锘一-逐风者 自动射击 芋头妹妹 Hit -324 (Physical)", -- [7]
						"残缺一梦-火妖鲁西弗隆 肉搏 芋头妹妹 Absorb -231 (1)", -- [8]
						"残缺一梦-火妖鲁西弗隆 暗影灼烧 芋头妹妹 Hit -368 (231 被吸收) (Shadow)", -- [9]
						"芋头妹妹死亡。", -- [10]
						"芋头妹妹 腐蚀术 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -101 (Shadow)", -- [11]
						"芋头妹妹 痛苦诅咒 (伤害/跳) Chop Tick -150 (Shadow)", -- [12]
					},
					["DeathAt"] = 16999.301,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["MessageTimes"] = {
						-1.44999999999709, -- [1]
						-0.6999999999970896, -- [2]
						-0.565999999998894, -- [3]
						-0.5159999999996217, -- [4]
						-0.3999999999978172, -- [5]
						-0.25, -- [6]
						-0.03299999999944703, -- [7]
						-0.03299999999944703, -- [8]
						-0.03299999999944703, -- [9]
						0, -- [10]
						0.5339999999996508, -- [11]
						1.30000000000291, -- [12]
					},
					["HealthMax"] = {
						4554, -- [1]
						4554, -- [2]
						4554, -- [3]
						4554, -- [4]
						4554, -- [5]
						4554, -- [6]
						4554, -- [7]
						4554, -- [8]
						4554, -- [9]
						4554, -- [10]
						4554, -- [11]
						4554, -- [12]
					},
					["Health"] = {
						127, -- [1]
						65, -- [2]
						72, -- [3]
						1512, -- [4]
						706, -- [5]
						706, -- [6]
						621, -- [7]
						621, -- [8]
						621, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
					},
					["KilledBy"] = "残缺一梦-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"HEAL", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"MISC", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						false, -- [26]
						true, -- [27]
						false, -- [28]
						false, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						false, -- [33]
						true, -- [34]
						false, -- [35]
						true, -- [36]
						true, -- [37]
						false, -- [38]
						false, -- [39]
						true, -- [40]
						false, -- [41]
						false, -- [42]
					},
					["Messages"] = {
						"狐狸不吃鱼-黑龙费尔默 冰霜震击 芋头妹妹 Hit -365 (Frost)", -- [1]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -156 (Shadow)", -- [2]
						"原子弹 肉搏 芋头妹妹 Hit -57 (Physical)", -- [3]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -24 (Shadow)", -- [4]
						"原子弹 撕咬 芋头妹妹 Hit -53 (Physical)", -- [5]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -22 (Shadow)", -- [6]
						"Chop 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -71 (Nature)", -- [7]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [8]
						"Chop 多重射击 芋头妹妹 Crit -729 (Physical)", -- [9]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -312 (Shadow)", -- [10]
						"Chop 自动射击 芋头妹妹 Hit -227 (Physical)", -- [11]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -97 (Shadow)", -- [12]
						"猎蝶兽兽-黑龙费尔默 自动射击 芋头妹妹 Crit -515 (Physical)", -- [13]
						"猎蝶兽兽-黑龙费尔默 奥术射击 芋头妹妹 Crit -157 (94 被抵抗) (Arcane)", -- [14]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -220 (Shadow)", -- [15]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -67 (Shadow)", -- [16]
						"原子弹 肉搏 芋头妹妹 Hit -64 (Physical)", -- [17]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -27 (Shadow)", -- [18]
						"锘一-逐风者 驱散射击 芋头妹妹 Crit -254 (Physical)", -- [19]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -108 (Shadow)", -- [20]
						"猎蝶兽兽-黑龙费尔默 多重射击 芋头妹妹 Hit -272 (Physical)", -- [21]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -116 (Shadow)", -- [22]
						"Chop 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -71 (Nature)", -- [23]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [24]
						"猎蝶兽兽-黑龙费尔默 自动射击 芋头妹妹 Hit -189 (Physical)", -- [25]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -81 (Shadow)", -- [26]
						"Chop 自动射击 芋头妹妹 Hit -220 (Physical)", -- [27]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -94 (Shadow)", -- [28]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 锘一-逐风者 Tick -60 (Shadow)", -- [29]
						"狐狸不吃鱼-黑龙费尔默 肉搏 芋头妹妹 Hit -211 (Physical)", -- [30]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -90 (Shadow)", -- [31]
						"狐狸不吃鱼-黑龙费尔默 风暴打击 芋头妹妹 Crit -393 (Physical)", -- [32]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -168 (Shadow)", -- [33]
						"风蛇 闪电吐息 芋头妹妹 Hit -46 (54 被抵抗) (Nature)", -- [34]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -19 (Shadow)", -- [35]
						"猎蝶兽兽-黑龙费尔默 自动射击 芋头妹妹 Hit -198 (Physical)", -- [36]
						"锘一-逐风者 多重射击 芋头妹妹 Hit -323 (Physical)", -- [37]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -84 (Shadow)", -- [38]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -138 (Shadow)", -- [39]
						"芋头妹妹死亡。", -- [40]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 锘一-逐风者 Tick -60 (Shadow)", -- [41]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -61 (Shadow)", -- [42]
					},
					["DeathAt"] = 16765.304,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageTimes"] = {
						-6.600000000002183, -- [1]
						-6.583000000002357, -- [2]
						-6.100000000002183, -- [3]
						-6.100000000002183, -- [4]
						-5.817000000002736, -- [5]
						-5.817000000002736, -- [6]
						-5.233000000000175, -- [7]
						-5.233000000000175, -- [8]
						-5.183000000000902, -- [9]
						-5.183000000000902, -- [10]
						-4.950000000000728, -- [11]
						-4.950000000000728, -- [12]
						-4.483000000000175, -- [13]
						-4.483000000000175, -- [14]
						-4.483000000000175, -- [15]
						-4.483000000000175, -- [16]
						-4.100000000002183, -- [17]
						-4.083000000002357, -- [18]
						-2.533000000003085, -- [19]
						-2.516999999999825, -- [20]
						-2.38300000000163, -- [21]
						-2.38300000000163, -- [22]
						-2.25, -- [23]
						-2.25, -- [24]
						-2.166000000001077, -- [25]
						-2.166000000001077, -- [26]
						-1.983000000000175, -- [27]
						-1.983000000000175, -- [28]
						-1.88300000000163, -- [29]
						-1.233000000000175, -- [30]
						-1.216000000000349, -- [31]
						-0.9330000000009022, -- [32]
						-0.9160000000010768, -- [33]
						-0.566000000002532, -- [34]
						-0.566000000002532, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0.1169999999983702, -- [41]
						1.216999999996915, -- [42]
					},
					["HealthMax"] = {
						4554, -- [1]
						4554, -- [2]
						4554, -- [3]
						4554, -- [4]
						4554, -- [5]
						4554, -- [6]
						4554, -- [7]
						4554, -- [8]
						4554, -- [9]
						4554, -- [10]
						4554, -- [11]
						4554, -- [12]
						4554, -- [13]
						4554, -- [14]
						4554, -- [15]
						4554, -- [16]
						4554, -- [17]
						4554, -- [18]
						4554, -- [19]
						4554, -- [20]
						4554, -- [21]
						4554, -- [22]
						4554, -- [23]
						4554, -- [24]
						4554, -- [25]
						4554, -- [26]
						4554, -- [27]
						4554, -- [28]
						4554, -- [29]
						4554, -- [30]
						4554, -- [31]
						4554, -- [32]
						4554, -- [33]
						4554, -- [34]
						4554, -- [35]
						4554, -- [36]
						4554, -- [37]
						4554, -- [38]
						4554, -- [39]
						4554, -- [40]
						4554, -- [41]
						4554, -- [42]
					},
					["Health"] = {
						4128, -- [1]
						3763, -- [2]
						3769, -- [3]
						3769, -- [4]
						3712, -- [5]
						3712, -- [6]
						3659, -- [7]
						3659, -- [8]
						3659, -- [9]
						3659, -- [10]
						2859, -- [11]
						2859, -- [12]
						2632, -- [13]
						2632, -- [14]
						1960, -- [15]
						1960, -- [16]
						1966, -- [17]
						1966, -- [18]
						1902, -- [19]
						1902, -- [20]
						1648, -- [21]
						1648, -- [22]
						1376, -- [23]
						1376, -- [24]
						1311, -- [25]
						1122, -- [26]
						1122, -- [27]
						902, -- [28]
						902, -- [29]
						902, -- [30]
						902, -- [31]
						691, -- [32]
						691, -- [33]
						298, -- [34]
						298, -- [35]
						258, -- [36]
						258, -- [37]
						258, -- [38]
						258, -- [39]
						0, -- [40]
						0, -- [41]
						1, -- [42]
					},
					["KilledBy"] = "锘一-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"MISC", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
					},
				}, -- [3]
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						false, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						false, -- [22]
						true, -- [23]
						false, -- [24]
						true, -- [25]
						false, -- [26]
						false, -- [27]
						true, -- [28]
						false, -- [29]
						true, -- [30]
						false, -- [31]
						true, -- [32]
						false, -- [33]
						true, -- [34]
						false, -- [35]
						true, -- [36]
						false, -- [37]
						true, -- [38]
						false, -- [39]
						true, -- [40]
						false, -- [41]
						false, -- [42]
						true, -- [43]
						false, -- [44]
						true, -- [45]
						false, -- [46]
						true, -- [47]
						false, -- [48]
						true, -- [49]
						false, -- [50]
					},
					["Messages"] = {
						"攻速一点二 爪击 芋头妹妹 Hit -17 (Physical)", -- [1]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -7 (Shadow)", -- [2]
						"打架-黑龙费尔默 奥术射击 芋头妹妹 Hit -132 (Arcane)", -- [3]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -56 (Shadow)", -- [4]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -42 (Shadow)", -- [5]
						"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -71 (Nature)", -- [6]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [7]
						"尼罗恩 肉搏 芋头妹妹 Hit -55 (Physical)", -- [8]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -23 (Shadow)", -- [9]
						"猎蝶兽兽-黑龙费尔默 奥术射击 芋头妹妹 Hit -99 (47 被抵抗) (Arcane)", -- [10]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -42 (Shadow)", -- [11]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 攻速一点二 Tick -149 (Shadow)", -- [12]
						"攻速一点二 肉搏 芋头妹妹 Hit -35 (Physical)", -- [13]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -15 (Shadow)", -- [14]
						"猎蝶兽兽-黑龙费尔默 自动射击 芋头妹妹 Hit -179 (Physical)", -- [15]
						"打架-黑龙费尔默 自动射击 芋头妹妹 Crit -417 (Physical)", -- [16]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -76 (Shadow)", -- [17]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -178 (Shadow)", -- [18]
						"攻速一点二 肉搏 芋头妹妹 Hit -37 (Physical)", -- [19]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -15 (Shadow)", -- [20]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 芋头妹妹 Tick -102 (Shadow)", -- [21]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -43 (Shadow)", -- [22]
						"攻速一点二 爪击 芋头妹妹 Hit -17 (Physical)", -- [23]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -7 (Shadow)", -- [24]
						"锘一-逐风者 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -69 (Nature)", -- [25]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -29 (Shadow)", -- [26]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -43 (Shadow)", -- [27]
						"尼罗恩 肉搏 芋头妹妹 Hit -63 (Physical)", -- [28]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -27 (Shadow)", -- [29]
						"攻速一点二 肉搏 芋头妹妹 Hit -40 (Physical)", -- [30]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -17 (Shadow)", -- [31]
						"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -71 (Nature)", -- [32]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [33]
						"残缺一梦-火妖鲁西弗隆 献祭 芋头妹妹 Crit -319 (Fire)", -- [34]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -136 (Shadow)", -- [35]
						"残缺一梦-火妖鲁西弗隆 暗影灼烧 芋头妹妹 Hit -398 (Shadow)", -- [36]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -170 (Shadow)", -- [37]
						"打架-黑龙费尔默 自动射击 芋头妹妹 Crit -420 (Physical)", -- [38]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -180 (Shadow)", -- [39]
						"攻速一点二 肉搏 芋头妹妹 Hit -34 (Physical)", -- [40]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -42 (Shadow)", -- [41]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -14 (Shadow)", -- [42]
						"尼罗恩 肉搏 芋头妹妹 Hit -66 (Physical)", -- [43]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -28 (Shadow)", -- [44]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 芋头妹妹 Tick -103 (Shadow)", -- [45]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -44 (Shadow)", -- [46]
						"锘一-逐风者 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -69 (Nature)", -- [47]
						"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -29 (Shadow)", -- [48]
						"芋头妹妹死亡。", -- [49]
						"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -73 (Shadow)", -- [50]
					},
					["DeathAt"] = 16715.301,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
						0, -- [45]
						0, -- [46]
						0, -- [47]
						0, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["MessageTimes"] = {
						-5.550999999999476, -- [1]
						-5.550999999999476, -- [2]
						-5.400999999998021, -- [3]
						-5.400999999998021, -- [4]
						-4.783999999999651, -- [5]
						-4.717000000000553, -- [6]
						-4.717000000000553, -- [7]
						-4.700000000000728, -- [8]
						-4.683999999997468, -- [9]
						-4.550999999999476, -- [10]
						-4.550999999999476, -- [11]
						-4.433999999997468, -- [12]
						-4.416999999997643, -- [13]
						-4.400999999998021, -- [14]
						-3.566999999999098, -- [15]
						-3.550999999999476, -- [16]
						-3.550999999999476, -- [17]
						-3.550999999999476, -- [18]
						-3.217000000000553, -- [19]
						-3.200999999997293, -- [20]
						-3.183999999997468, -- [21]
						-3.183999999997468, -- [22]
						-3.11699999999837, -- [23]
						-3.11699999999837, -- [24]
						-3.016999999999825, -- [25]
						-3.016999999999825, -- [26]
						-2.800999999999476, -- [27]
						-2.683999999997468, -- [28]
						-2.666999999997643, -- [29]
						-2, -- [30]
						-2, -- [31]
						-1.734000000000378, -- [32]
						-1.734000000000378, -- [33]
						-1.599999999998545, -- [34]
						-1.599999999998545, -- [35]
						-1.450000000000728, -- [36]
						-1.450000000000728, -- [37]
						-0.8339999999989232, -- [38]
						-0.8339999999989232, -- [39]
						-0.7999999999992724, -- [40]
						-0.7999999999992724, -- [41]
						-0.7839999999996508, -- [42]
						-0.683999999997468, -- [43]
						-0.6669999999976426, -- [44]
						-0.183999999997468, -- [45]
						-0.183999999997468, -- [46]
						-0.01699999999982538, -- [47]
						-0.01699999999982538, -- [48]
						0, -- [49]
						1.200000000000728, -- [50]
					},
					["HealthMax"] = {
						4694, -- [1]
						4694, -- [2]
						4694, -- [3]
						4694, -- [4]
						4694, -- [5]
						4694, -- [6]
						4694, -- [7]
						4694, -- [8]
						4694, -- [9]
						4694, -- [10]
						4694, -- [11]
						4694, -- [12]
						4694, -- [13]
						4694, -- [14]
						4694, -- [15]
						4694, -- [16]
						4694, -- [17]
						4694, -- [18]
						4694, -- [19]
						4694, -- [20]
						4694, -- [21]
						4694, -- [22]
						4694, -- [23]
						4694, -- [24]
						4694, -- [25]
						4694, -- [26]
						4694, -- [27]
						4694, -- [28]
						4694, -- [29]
						4694, -- [30]
						4694, -- [31]
						4694, -- [32]
						4694, -- [33]
						4694, -- [34]
						4694, -- [35]
						4694, -- [36]
						4694, -- [37]
						4694, -- [38]
						4694, -- [39]
						4694, -- [40]
						4694, -- [41]
						4694, -- [42]
						4694, -- [43]
						4694, -- [44]
						4694, -- [45]
						4694, -- [46]
						4694, -- [47]
						4694, -- [48]
						4554, -- [49]
						4554, -- [50]
					},
					["Health"] = {
						2771, -- [1]
						2771, -- [2]
						2771, -- [3]
						2771, -- [4]
						2622, -- [5]
						2622, -- [6]
						2551, -- [7]
						2551, -- [8]
						2496, -- [9]
						2496, -- [10]
						2496, -- [11]
						2397, -- [12]
						2397, -- [13]
						2397, -- [14]
						2368, -- [15]
						2368, -- [16]
						1772, -- [17]
						1772, -- [18]
						1772, -- [19]
						1772, -- [20]
						1772, -- [21]
						1772, -- [22]
						1633, -- [23]
						1633, -- [24]
						1633, -- [25]
						1633, -- [26]
						1547, -- [27]
						1547, -- [28]
						1547, -- [29]
						1484, -- [30]
						1484, -- [31]
						1451, -- [32]
						1451, -- [33]
						1380, -- [34]
						1380, -- [35]
						1061, -- [36]
						1061, -- [37]
						663, -- [38]
						663, -- [39]
						663, -- [40]
						663, -- [41]
						663, -- [42]
						209, -- [43]
						209, -- [44]
						143, -- [45]
						143, -- [46]
						143, -- [47]
						143, -- [48]
						0, -- [49]
						0, -- [50]
					},
					["KilledBy"] = "锘一-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"DAMAGE", -- [44]
						"DAMAGE", -- [45]
						"DAMAGE", -- [46]
						"DAMAGE", -- [47]
						"DAMAGE", -- [48]
						"MISC", -- [49]
						"DAMAGE", -- [50]
					},
				}, -- [4]
			},
			["LastHealTime"] = 17154.794,
			["level"] = 60,
			["LastDamageAbility"] = "腐蚀术 (伤害/跳)",
			["LastFightIn"] = 4,
			["LastDamageTaken"] = 103,
			["type"] = "Ungrouped",
			["LastEventHealth"] = {
				1032, -- [1]
				1032, -- [2]
				1032, -- [3]
				1032, -- [4]
				1032, -- [5]
				1032, -- [6]
				1032, -- [7]
				1032, -- [8]
				890, -- [9]
				890, -- [10]
				890, -- [11]
				654, -- [12]
				654, -- [13]
				654, -- [14]
				654, -- [15]
				569, -- [16]
				569, -- [17]
				569, -- [18]
				467, -- [19]
				467, -- [20]
				467, -- [21]
				467, -- [22]
				400, -- [23]
				400, -- [24]
				400, -- [25]
				400, -- [26]
				98, -- [27]
				0, -- [28]
				0, -- [29]
				0, -- [30]
				1, -- [31]
				1, -- [32]
				1, -- [33]
				4554, -- [34]
				1164, -- [35]
				1164, -- [36]
				1111, -- [37]
				1111, -- [38]
				1008, -- [39]
				934, -- [40]
				955, -- [41]
				955, -- [42]
				888, -- [43]
				888, -- [44]
				785, -- [45]
				785, -- [46]
				785, -- [47]
				1087, -- [48]
				1032, -- [49]
				1032, -- [50]
			},
			["GuardianReverseGUIDs"] = {
				["汉纳姆"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "Pet-0-5427-489-24822-417-010120063F",
					},
				},
			},
			["LastEventHealthMax"] = {
				4554, -- [1]
				4554, -- [2]
				4554, -- [3]
				4554, -- [4]
				4554, -- [5]
				4554, -- [6]
				4554, -- [7]
				4554, -- [8]
				4554, -- [9]
				4554, -- [10]
				4554, -- [11]
				4554, -- [12]
				4554, -- [13]
				4554, -- [14]
				4554, -- [15]
				4554, -- [16]
				4554, -- [17]
				4554, -- [18]
				4554, -- [19]
				4554, -- [20]
				4554, -- [21]
				4554, -- [22]
				4554, -- [23]
				4554, -- [24]
				4554, -- [25]
				4554, -- [26]
				4554, -- [27]
				4554, -- [28]
				4554, -- [29]
				4554, -- [30]
				4554, -- [31]
				4554, -- [32]
				4554, -- [33]
				4554, -- [34]
				4554, -- [35]
				4554, -- [36]
				4554, -- [37]
				4554, -- [38]
				4554, -- [39]
				4554, -- [40]
				4554, -- [41]
				4554, -- [42]
				4554, -- [43]
				4554, -- [44]
				4554, -- [45]
				4554, -- [46]
				4554, -- [47]
				4554, -- [48]
				4554, -- [49]
				4554, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"汉纳姆 <芋头妹妹>", -- [1]
			},
			["NextEventNum"] = 48,
			["LastDamageTime"] = 17154.794,
			["LastEvents"] = {
				"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -60 (Shadow)", -- [1]
				"芋头妹妹 腐蚀术 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -145 (Shadow)", -- [2]
				"芋头妹妹 献祭 狐狸不吃鱼-黑龙费尔默 Crit -406 (Fire)", -- [3]
				"原子弹 肉搏 芋头妹妹 Absorb -77 (77 被吸收) (1)", -- [4]
				"芋头妹妹 肉搏 残缺一梦-火妖鲁西弗隆 Absorb -53 (1)", -- [5]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -36 (53 被吸收) (Shadow)", -- [6]
				"狐狸不吃鱼-黑龙费尔默 肉搏 芋头妹妹 Absorb -425 (1)", -- [7]
				"狐狸不吃鱼-黑龙费尔默 肉搏 芋头妹妹 Crit -142 (425 被吸收) (Physical)", -- [8]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -60 (Shadow)", -- [9]
				"Chop 自动射击 芋头妹妹 Hit -236 (Physical)", -- [10]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -101 (Shadow)", -- [11]
				"芋头妹妹 腐蚀术 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -102 (Shadow)", -- [12]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -61 (Shadow)", -- [13]
				"Chop 毒蛇钉刺 (伤害/跳) 芋头妹妹 Tick -85 (Nature)", -- [14]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -36 (Shadow)", -- [15]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 芋头妹妹 Tick -102 (Shadow)", -- [16]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -43 (Shadow)", -- [17]
				"原子弹 肉搏 芋头妹妹 Miss (1)", -- [18]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -105 (Shadow)", -- [19]
				"Chop 奥术射击 芋头妹妹 Hit -67 (94 被抵抗) (Arcane)", -- [20]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -28 (Shadow)", -- [21]
				"芋头妹妹 腐蚀术 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -145 (Shadow)", -- [22]
				"芋头妹妹 献祭 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -110 (Fire)", -- [23]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -60 (Shadow)", -- [24]
				"火焰新星图腾 V 火焰新星 芋头妹妹 Hit -302 (Fire)", -- [25]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -129 (Shadow)", -- [26]
				"Chop 自动射击 芋头妹妹 Hit -218 (Physical)", -- [27]
				"芋头妹妹死亡。", -- [28]
				"芋头妹妹 腐蚀术 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -145 (Shadow)", -- [29]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -105 (Shadow)", -- [30]
				"芋头妹妹 腐蚀术 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -145 (Shadow)", -- [31]
				"芋头妹妹 献祭 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -110 (Fire)", -- [32]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 狐狸不吃鱼-黑龙费尔默 Tick -105 (Shadow)", -- [33]
				"Environment Falling 芋头妹妹 Hit -699 (Physical)", -- [34]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 芋头妹妹 Tick -74 (Shadow)", -- [35]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -31 (Shadow)", -- [36]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 芋头妹妹 Tick -103 (Shadow)", -- [37]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -44 (Shadow)", -- [38]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 芋头妹妹 Tick -74 (Shadow)", -- [39]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -31 (Shadow)", -- [40]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 芋头妹妹 Tick -73 (Shadow)", -- [41]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -31 (Shadow)", -- [42]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 芋头妹妹 Tick -103 (Shadow)", -- [43]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -44 (Shadow)", -- [44]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 帅哥祖师爷龙-逐风者 Tick -61 (Shadow)", -- [45]
				"芋头妹妹 死亡缠绕 帅哥祖师爷龙-逐风者 Hit -529 (Shadow)", -- [46]
				"芋头妹妹 死亡缠绕 芋头妹妹 Hit +529", -- [47]
				"原子弹 肉搏 芋头妹妹 Hit -55 (Physical)", -- [48]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -23 (Shadow)", -- [49]
				"芋头妹妹 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Absorb -60 (60 被吸收) (Shadow)", -- [50]
			},
			["Name"] = "芋头妹妹",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				17068.138, -- [1]
				17068.672, -- [2]
				17068.972, -- [3]
				17069.088, -- [4]
				17069.422, -- [5]
				17069.422, -- [6]
				17069.655, -- [7]
				17069.655, -- [8]
				17069.655, -- [9]
				17069.822, -- [10]
				17069.822, -- [11]
				17069.938, -- [12]
				17070.155, -- [13]
				17070.214, -- [14]
				17070.214, -- [15]
				17071.055, -- [16]
				17071.055, -- [17]
				17071.089, -- [18]
				17071.422, -- [19]
				17071.605, -- [20]
				17071.605, -- [21]
				17071.655, -- [22]
				17071.972, -- [23]
				17072.139, -- [24]
				17072.322, -- [25]
				17072.322, -- [26]
				17072.789, -- [27]
				17072.789, -- [28]
				17072.922, -- [29]
				17074.155, -- [30]
				17074.655, -- [31]
				17074.972, -- [32]
				17076.139, -- [33]
				17084.823, -- [34]
				17150.177, -- [35]
				17150.177, -- [36]
				17151.677, -- [37]
				17151.677, -- [38]
				17152.177, -- [39]
				17152.177, -- [40]
				17154.177, -- [41]
				17154.177, -- [42]
				17154.677, -- [43]
				17154.677, -- [44]
				17154.777, -- [45]
				17154.794, -- [46]
				17154.794, -- [47]
				17067.088, -- [48]
				17067.105, -- [49]
				17067.422, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["帅哥祖师爷龙-逐风者"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 427,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Shadow"] = 427,
						["Physical"] = 0,
					},
					["DOT_Time"] = 3,
					["Damage"] = 590,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
						["灵魂链接"] = {
							["Details"] = {
								["Split"] = {
									["max"] = 44,
									["min"] = 31,
									["count"] = 5,
									["amount"] = 181,
								},
							},
							["count"] = 5,
							["amount"] = 181,
						},
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Shadow"] = 590,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 529,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 61,
								},
							},
							["amount"] = 590,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 206,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 221,
								},
							},
							["amount"] = 427,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 529,
								},
							},
							["amount"] = 529,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 181,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.02,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 0.12,
						},
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 5.5,
								},
							},
							["amount"] = 5.5,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 529,
									["min"] = 529,
									["count"] = 1,
									["amount"] = 529,
								},
							},
							["count"] = 1,
							["amount"] = 529,
						},
					},
					["WhoHealed"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 529,
								},
							},
							["amount"] = 529,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 7.119999999999999,
					["Healing"] = 529,
					["FDamagedWho"] = {
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 181,
								},
							},
							["amount"] = 181,
						},
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 529,
									["min"] = 529,
									["count"] = 1,
									["amount"] = 529,
								},
							},
							["count"] = 1,
							["amount"] = 529,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 61,
									["min"] = 61,
									["count"] = 1,
									["amount"] = 61,
								},
							},
							["count"] = 1,
							["amount"] = 61,
						},
					},
					["HealingTaken"] = 529,
					["RageGain"] = 0,
					["TimeDamage"] = 5.619999999999999,
					["TimeDamaging"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.02,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 0.12,
						},
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 5.5,
								},
							},
							["amount"] = 5.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 3,
								},
								["锘一-逐风者"] = {
									["count"] = 3,
								},
								["狐狸不吃鱼-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 12,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 9,
								},
								["Chop"] = {
									["count"] = 3,
								},
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 18,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 9,
								},
								["锘一-逐风者"] = {
									["count"] = 6,
								},
								["狐狸不吃鱼-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 54,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 21,
								},
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 57,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 15,
								},
								["锘一-逐风者"] = {
									["count"] = 57,
								},
								["帅哥祖师爷龙-逐风者"] = {
									["count"] = 3,
								},
								["Chop"] = {
									["count"] = 24,
								},
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 3,
								},
								["攻速一点二"] = {
									["count"] = 36,
								},
								["狐狸不吃鱼-黑龙费尔默"] = {
									["count"] = 30,
								},
							},
							["amount"] = 246,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 63,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 38,
								},
							},
							["amount"] = 47,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 26,
								},
							},
							["amount"] = 34,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 14,
								},
							},
							["amount"] = 17,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 19,
								},
							},
							["amount"] = 23,
						},
					},
					["DamageTaken"] = 21414,
					["ElementTakenResist"] = {
						["Fire"] = 76,
						["Arcane"] = 376,
						["Nature"] = 194,
					},
					["Absorbs"] = 733,
					["DeathCount"] = 4,
					["FDamagedWho"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["牺牲祝福"] = {
									["count"] = 209,
								},
							},
							["amount"] = 209,
						},
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 7348,
								},
							},
							["amount"] = 7348,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 12859,
						["Melee"] = 3408,
						["Arcane"] = 554,
						["Frost"] = 365,
						["Fire"] = 759,
						["Shadow"] = 1888,
						["Nature"] = 1581,
					},
					["DOT_Time"] = 315,
					["Damage"] = 11720,
					["TimeHeal"] = 7.100000000000001,
					["FAttacks"] = {
						["牺牲祝福"] = {
							["Details"] = {
								["Split"] = {
									["max"] = 55,
									["min"] = 0,
									["count"] = 20,
									["amount"] = 209,
								},
							},
							["count"] = 20,
							["amount"] = 209,
						},
						["灵魂链接"] = {
							["Details"] = {
								["Split"] = {
									["max"] = 312,
									["min"] = 7,
									["count"] = 116,
									["amount"] = 7348,
								},
							},
							["count"] = 116,
							["amount"] = 7348,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 9821,
						["Melee"] = 128,
						["Fire"] = 1771,
					},
					["DamagedWho"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 123,
								},
								["献祭"] = {
									["count"] = 300,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 436,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 467,
								},
							},
							["amount"] = 1326,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 92,
								},
								["肉搏"] = {
									["count"] = 128,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 783,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1284,
								},
							},
							["amount"] = 2287,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 479,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 383,
								},
							},
							["amount"] = 862,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 122,
								},
								["献祭"] = {
									["count"] = 300,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 291,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1232,
								},
							},
							["amount"] = 1945,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 529,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 61,
								},
							},
							["amount"] = 590,
						},
						["Chop"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 530,
								},
								["献祭"] = {
									["count"] = 300,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 145,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 661,
								},
							},
							["amount"] = 1636,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 60,
								},
							},
							["amount"] = 60,
						},
						["攻速一点二"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1261,
								},
							},
							["amount"] = 1261,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 220,
								},
								["献祭"] = {
									["count"] = 406,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 435,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 692,
								},
							},
							["amount"] = 1753,
						},
					},
					["WhoDamaged"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1377,
								},
								["多重射击"] = {
									["count"] = 412,
								},
								["奥术射击"] = {
									["count"] = 132,
								},
							},
							["amount"] = 1921,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 766,
								},
								["献祭"] = {
									["count"] = 424,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 307,
								},
								["肉搏"] = {
									["count"] = 231,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 815,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 33,
								},
							},
							["amount"] = 2576,
						},
						["风蛇"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 46,
								},
							},
							["amount"] = 46,
						},
						["原子弹"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 105,
								},
								["肉搏"] = {
									["count"] = 348,
								},
							},
							["amount"] = 453,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 345,
								},
								["猛禽一击"] = {
									["count"] = 248,
								},
								["瞄准射击"] = {
									["count"] = 806,
								},
								["自动射击"] = {
									["count"] = 728,
								},
								["驱散射击"] = {
									["count"] = 317,
								},
								["多重射击"] = {
									["count"] = 1320,
								},
							},
							["amount"] = 3764,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 2584,
								},
							},
							["amount"] = 2584,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 196,
								},
								["拦截昏迷"] = {
									["count"] = 32,
								},
							},
							["amount"] = 228,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 472,
								},
								["自动射击"] = {
									["count"] = 1392,
								},
								["多重射击"] = {
									["count"] = 1038,
								},
								["奥术射击"] = {
									["count"] = 166,
								},
							},
							["amount"] = 3068,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 142,
								},
								["奥术射击"] = {
									["count"] = 256,
								},
								["自动射击"] = {
									["count"] = 1375,
								},
								["多重射击"] = {
									["count"] = 272,
								},
								["翼龙钉刺 (伤害/跳)"] = {
									["count"] = 105,
								},
							},
							["amount"] = 2150,
						},
						["攻速一点二"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 42,
								},
								["爪击"] = {
									["count"] = 54,
								},
								["肉搏"] = {
									["count"] = 323,
								},
							},
							["amount"] = 419,
						},
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 365,
								},
								["地震术"] = {
									["count"] = 391,
								},
								["闪电之盾"] = {
									["count"] = 80,
								},
								["风暴打击"] = {
									["count"] = 648,
								},
								["肉搏"] = {
									["count"] = 1746,
								},
							},
							["amount"] = 3230,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 455,
								},
							},
							["amount"] = 455,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 109,
								},
								["肉搏"] = {
									["count"] = 109,
								},
							},
							["amount"] = 218,
						},
						["火焰新星图腾 V"] = {
							["Details"] = {
								["火焰新星"] = {
									["count"] = 302,
								},
							},
							["amount"] = 302,
						},
					},
					["Absorbed"] = {
						["伤害吸收"] = {
							["Details"] = {
								["芋头妹妹"] = {
									["max"] = 425,
									["min"] = 77,
									["count"] = 2,
									["amount"] = 502,
								},
							},
							["count"] = 2,
							["amount"] = 502,
						},
						["防护暗影结界"] = {
							["Details"] = {
								["芋头妹妹"] = {
									["max"] = 231,
									["min"] = 231,
									["count"] = 1,
									["amount"] = 231,
								},
							},
							["count"] = 1,
							["amount"] = 231,
						},
					},
					["TimeHealing"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 3,
								},
								["特效治疗石"] = {
									["count"] = 1.5,
								},
								["防护暗影结界"] = {
									["count"] = 0.53,
								},
								["伤害吸收"] = {
									["count"] = 2.07,
								},
							},
							["amount"] = 7.100000000000001,
						},
					},
					["Dispelled"] = 7,
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电吐息"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 54,
									["min"] = 54,
									["count"] = 1,
									["amount"] = 54,
								},
							},
							["count"] = 54,
							["amount"] = 1,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 16,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["50% 抵抗"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
							},
							["count"] = 76,
							["amount"] = 2,
						},
						["闪电之盾"] = {
							["Details"] = {
								["75% 抵抗"] = {
									["max"] = 114,
									["min"] = 114,
									["count"] = 1,
									["amount"] = 114,
								},
							},
							["count"] = 114,
							["amount"] = 1,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["翼龙钉刺 (伤害/跳)"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 26,
									["min"] = 26,
									["count"] = 1,
									["amount"] = 26,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 26,
							["amount"] = 4,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["75% 抵抗"] = {
									["max"] = 94,
									["min"] = 94,
									["count"] = 1,
									["amount"] = 94,
								},
								["50% 抵抗"] = {
									["max"] = 188,
									["min"] = 47,
									["count"] = 3,
									["amount"] = 282,
								},
							},
							["count"] = 376,
							["amount"] = 5,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 34,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 34,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["芋头妹妹"] = {
									["count"] = 3407,
								},
							},
							["amount"] = 3407,
						},
					},
					["FDamage"] = 7557,
					["ActiveTime"] = 127.4,
					["WhoDispelled"] = {
						["尼罗恩"] = {
							["Details"] = {
								["魔甲术 (吞噬魔法)"] = {
									["count"] = 1,
								},
								["牺牲祝福 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["猎人印记 (清洁术)"] = {
									["count"] = 1,
								},
								["翼龙钉刺 (清洁术)"] = {
									["count"] = 1,
								},
								["献祭 (清洁术)"] = {
									["count"] = 1,
								},
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["Heals"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 530,
									["min"] = 529,
									["count"] = 2,
									["amount"] = 1059,
								},
							},
							["count"] = 2,
							["amount"] = 1059,
						},
						["特效治疗石"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1440,
									["min"] = 1440,
									["count"] = 1,
									["amount"] = 1440,
								},
							},
							["count"] = 1,
							["amount"] = 1440,
						},
						["防护暗影结界"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 231,
									["min"] = 231,
									["count"] = 1,
									["amount"] = 231,
								},
							},
							["count"] = 1,
							["amount"] = 231,
						},
						["伤害吸收"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 425,
									["min"] = 77,
									["count"] = 2,
									["amount"] = 502,
								},
							},
							["count"] = 2,
							["amount"] = 502,
						},
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 900,
					},
					["HealedWho"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1059,
								},
								["特效治疗石"] = {
									["count"] = 1440,
								},
								["防护暗影结界"] = {
									["count"] = 231,
								},
								["伤害吸收"] = {
									["count"] = 502,
								},
							},
							["amount"] = 3232,
						},
					},
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 93,
								},
							},
							["amount"] = 103,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8,
						},
					},
					["Healing"] = 2499,
					["WhoHealed"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1701,
								},
								["圣光闪现"] = {
									["count"] = 1166,
								},
							},
							["amount"] = 2867,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1059,
								},
								["特效治疗石"] = {
									["count"] = 1440,
								},
								["防护暗影结界"] = {
									["count"] = 231,
								},
								["伤害吸收"] = {
									["count"] = 502,
								},
							},
							["amount"] = 3232,
						},
					},
					["TimeSpent"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 0.64,
								},
								["献祭"] = {
									["count"] = 0.3,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.08,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.12,
								},
							},
							["amount"] = 10.14,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.95,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.11,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 15.25,
								},
							},
							["amount"] = 21.33,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 3,
								},
								["特效治疗石"] = {
									["count"] = 1.5,
								},
								["防护暗影结界"] = {
									["count"] = 0.53,
								},
								["伤害吸收"] = {
									["count"] = 2.07,
								},
							},
							["amount"] = 7.100000000000001,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.21,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.9,
								},
							},
							["amount"] = 5.109999999999999,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 0.35,
								},
								["献祭"] = {
									["count"] = 0.87,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.73,
								},
							},
							["amount"] = 16.95,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.02,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 0.12,
						},
						["Chop"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.3,
								},
								["献祭"] = {
									["count"] = 1.47,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.26,
								},
							},
							["amount"] = 9.23,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.17,
								},
							},
							["amount"] = 0.17,
						},
						["攻速一点二"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.049999999999999,
								},
							},
							["amount"] = 3.049999999999999,
						},
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 1,
								},
								["献祭"] = {
									["count"] = 0.45,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.48,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 9,
								},
							},
							["amount"] = 12.93,
						},
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 41.27000000000001,
								},
							},
							["amount"] = 41.27000000000001,
						},
					},
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 530,
									["min"] = 529,
									["count"] = 2,
									["amount"] = 1059,
								},
							},
							["count"] = 2,
							["amount"] = 1059,
						},
						["献祭"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 406,
									["min"] = 406,
									["count"] = 1,
									["amount"] = 406,
								},
								["Hit"] = {
									["max"] = 300,
									["min"] = 300,
									["count"] = 3,
									["amount"] = 900,
								},
							},
							["count"] = 4,
							["amount"] = 1306,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 150,
									["min"] = 60,
									["count"] = 5,
									["amount"] = 390,
								},
								["Tick"] = {
									["max"] = 150,
									["min"] = 36,
									["count"] = 77,
									["amount"] = 5711,
								},
							},
							["count"] = 82,
							["amount"] = 6101,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
							},
							["count"] = 1,
							["amount"] = 92,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 123,
									["min"] = 110,
									["count"] = 4,
									["amount"] = 465,
								},
							},
							["count"] = 4,
							["amount"] = 465,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 145,
									["min"] = 145,
									["count"] = 2,
									["amount"] = 290,
								},
								["Tick"] = {
									["max"] = 160,
									["min"] = 101,
									["count"] = 16,
									["amount"] = 2279,
								},
							},
							["count"] = 18,
							["amount"] = 2569,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 75,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 128,
								},
							},
							["count"] = 2,
							["amount"] = 128,
						},
					},
					["HealingTaken"] = 6099,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 231,
									["min"] = 231,
									["count"] = 1,
									["amount"] = 231,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 231,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["火焰新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["猛禽一击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["翼龙钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 425,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 502,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 31,
									["amount"] = 0,
								},
							},
							["count"] = 34,
							["amount"] = 502,
						},
					},
					["TimeDamage"] = 120.3,
					["TimeDamaging"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 0.64,
								},
								["献祭"] = {
									["count"] = 0.3,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.08,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 8.12,
								},
							},
							["amount"] = 10.14,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["吸取生命 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["肉搏"] = {
									["count"] = 1.95,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.11,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 15.25,
								},
							},
							["amount"] = 21.33,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.21,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.9,
								},
							},
							["amount"] = 5.109999999999999,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 0.35,
								},
								["献祭"] = {
									["count"] = 0.87,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 13.73,
								},
							},
							["amount"] = 16.95,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.02,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.1,
								},
							},
							["amount"] = 0.12,
						},
						["Chop"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 0.3,
								},
								["献祭"] = {
									["count"] = 1.47,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.2,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.26,
								},
							},
							["amount"] = 9.23,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 0.17,
								},
							},
							["amount"] = 0.17,
						},
						["攻速一点二"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 3.049999999999999,
								},
							},
							["amount"] = 3.049999999999999,
						},
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 1,
								},
								["献祭"] = {
									["count"] = 0.45,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.48,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 9,
								},
							},
							["amount"] = 12.93,
						},
						["汉纳姆 <芋头妹妹>"] = {
							["Details"] = {
								["灵魂链接"] = {
									["count"] = 41.27000000000001,
								},
							},
							["amount"] = 41.27000000000001,
						},
					},
					["ManaGain"] = 3407,
					["ElementTakenAbsorb"] = {
						["Melee"] = 502,
						["Shadow"] = 231,
					},
					["ManaGainedFrom"] = {
						["芋头妹妹"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 3407,
								},
							},
							["amount"] = 3407,
						},
					},
				},
			},
			["UnitLockout"] = 17075.289,
			["LastActive"] = 17154.293,
		},
		["我是老毕-黑龙费尔默"] = {
			["GUID"] = "Player-5450-02F2336A",
			["LastEventHealth"] = {
				3953, -- [1]
				3698, -- [2]
				3614, -- [3]
				3850, -- [4]
				3174, -- [5]
				4392, -- [6]
				4392, -- [7]
				4087, -- [8]
				4063, -- [9]
				4063, -- [10]
				3868, -- [11]
				3847, -- [12]
				3847, -- [13]
				3709, -- [14]
				3709, -- [15]
				3399, -- [16]
				3293, -- [17]
				3270, -- [18]
				3157, -- [19]
				2986, -- [20]
				2863, -- [21]
				3906, -- [22]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"MISC", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
			},
			["TimeWindows"] = {
				["RageGain"] = {
					10, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					1.5, -- [1]
				},
				["TimeDamage"] = {
					1.5, -- [1]
				},
				["DamageTaken"] = {
					3183, -- [1]
				},
				["Damage"] = {
					363, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 1,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				3953, -- [1]
				3953, -- [2]
				3953, -- [3]
				3953, -- [4]
				3953, -- [5]
				5723, -- [6]
				5723, -- [7]
				5723, -- [8]
				5723, -- [9]
				5723, -- [10]
				5723, -- [11]
				5723, -- [12]
				5723, -- [13]
				5723, -- [14]
				5723, -- [15]
				5723, -- [16]
				5723, -- [17]
				5723, -- [18]
				5723, -- [19]
				5723, -- [20]
				5723, -- [21]
				3953, -- [22]
			},
			["LastDamageTaken"] = 326,
			["Owner"] = false,
			["TimeLast"] = {
				["RageGain"] = 16716.301,
				["Dispelled"] = 16682.299,
				["ActiveTime"] = 16720.301,
				["TimeDamage"] = 16720.301,
				["OVERALL"] = 16779.305,
				["DamageTaken"] = 16779.305,
				["Damage"] = 16720.301,
			},
			["NextEventNum"] = 23,
			["LastDamageTime"] = 16720.985,
			["LastEvents"] = {
				"Environment Falling 我是老毕-黑龙费尔默 Hit -301 (Physical)", -- [1]
				"Chop 毒蛇钉刺 (伤害/跳) 我是老毕-黑龙费尔默 Tick -102 (Nature)", -- [2]
				"蒜头妹妹 dispels 我是老毕-黑龙费尔默 毒蛇钉刺 (清洁术)", -- [3]
				"爱恨情仇-黑龙费尔默 瞄准射击 我是老毕-黑龙费尔默 Hit -676 (Physical)", -- [4]
				"打架-黑龙费尔默 自动射击 我是老毕-黑龙费尔默 Hit -203 (Physical)", -- [5]
				"攻速一点二 肉搏 我是老毕-黑龙费尔默 Hit -23 (Physical)", -- [6]
				"爱恨情仇-黑龙费尔默 自动射击 我是老毕-黑龙费尔默 Hit -282 (Physical)", -- [7]
				"攻速一点二 爪击 我是老毕-黑龙费尔默 Crit -24 (Physical)", -- [8]
				"攻速一点二 肉搏 我是老毕-黑龙费尔默 Miss (1)", -- [9]
				"爱恨情仇-黑龙费尔默 多重射击 我是老毕-黑龙费尔默 Hit -195 (Physical)", -- [10]
				"攻速一点二 肉搏 我是老毕-黑龙费尔默 Hit -21 (Physical)", -- [11]
				"我是老毕-黑龙费尔默 槌击 尼罗恩 Hit -363 (Physical)", -- [12]
				"爱恨情仇-黑龙费尔默 自动射击 我是老毕-黑龙费尔默 Hit -138 (Physical)", -- [13]
				"攻速一点二 肉搏 我是老毕-黑龙费尔默 Hit -21 (Physical)", -- [14]
				"打架-黑龙费尔默 瞄准射击 我是老毕-黑龙费尔默 Hit -289 (Physical)", -- [15]
				"打架-黑龙费尔默 自动射击 我是老毕-黑龙费尔默 Hit -106 (Physical)", -- [16]
				"攻速一点二 肉搏 我是老毕-黑龙费尔默 Hit -23 (Physical)", -- [17]
				"打架-黑龙费尔默 多重射击 我是老毕-黑龙费尔默 Hit -131 (Physical)", -- [18]
				"Chop 多重射击 我是老毕-黑龙费尔默 Hit -171 (Physical)", -- [19]
				"Chop 自动射击 我是老毕-黑龙费尔默 Hit -123 (Physical)", -- [20]
				"原子弹 肉搏 我是老毕-黑龙费尔默 Hit -28 (Physical)", -- [21]
				"Environment Falling 我是老毕-黑龙费尔默 Hit -326 (Physical)", -- [22]
			},
			["Name"] = "我是老毕-黑龙费尔默",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
			},
			["LastEventTimes"] = {
				16647.964, -- [1]
				16681.266, -- [2]
				16682.866, -- [3]
				16716.818, -- [4]
				16717.185, -- [5]
				16717.185, -- [6]
				16717.351, -- [7]
				16717.485, -- [8]
				16718.385, -- [9]
				16718.418, -- [10]
				16719.601, -- [11]
				16720.985, -- [12]
				16721.235, -- [13]
				16721.802, -- [14]
				16721.802, -- [15]
				16722.268, -- [16]
				16723.018, -- [17]
				16724.218, -- [18]
				16730.052, -- [19]
				16730.269, -- [20]
				16730.835, -- [21]
				16779.655, -- [22]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 1,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 3183,
					["RageGainedFrom"] = {
						["我是老毕-黑龙费尔默"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 1.5,
					["ElementTaken"] = {
						["Physical"] = 2965,
						["Melee"] = 116,
						["Nature"] = 102,
					},
					["RageGained"] = {
						["激怒"] = {
							["Details"] = {
								["我是老毕-黑龙费尔默"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
					["WhoDispelled"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["毒蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDone"] = {
						["Physical"] = 363,
					},
					["Attacks"] = {
						["槌击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 363,
									["min"] = 363,
									["count"] = 1,
									["amount"] = 363,
								},
							},
							["count"] = 1,
							["amount"] = 363,
						},
					},
					["RageGain"] = 10,
					["DamagedWho"] = {
						["尼罗恩"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 363,
								},
							},
							["amount"] = 363,
						},
					},
					["TimeDamage"] = 1.5,
					["WhoDamaged"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 309,
								},
								["瞄准射击"] = {
									["count"] = 289,
								},
								["多重射击"] = {
									["count"] = 131,
								},
							},
							["amount"] = 729,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 102,
								},
								["自动射击"] = {
									["count"] = 123,
								},
								["多重射击"] = {
									["count"] = 171,
								},
							},
							["amount"] = 396,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 420,
								},
								["瞄准射击"] = {
									["count"] = 676,
								},
								["多重射击"] = {
									["count"] = 195,
								},
							},
							["amount"] = 1291,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 627,
								},
							},
							["amount"] = 627,
						},
						["原子弹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 28,
								},
							},
							["amount"] = 28,
						},
						["攻速一点二"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 24,
								},
								["肉搏"] = {
									["count"] = 88,
								},
							},
							["amount"] = 112,
						},
					},
					["Damage"] = 363,
					["TimeDamaging"] = {
						["尼罗恩"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["TimeSpent"] = {
						["尼罗恩"] = {
							["Details"] = {
								["槌击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
				},
			},
			["UnitLockout"] = 16779.305,
			["LastActive"] = 16779.305,
		},
		["布雷斯塔-逐风者"] = {
			["GUID"] = "Player-5451-02F00713",
			["LastEventHealth"] = {
				1777, -- [1]
				1522, -- [2]
				1522, -- [3]
				1522, -- [4]
				1428, -- [5]
				1428, -- [6]
				1428, -- [7]
				1326, -- [8]
				1272, -- [9]
				3345, -- [10]
				3345, -- [11]
				3282, -- [12]
				3169, -- [13]
				3169, -- [14]
				3063, -- [15]
				3295, -- [16]
				3103, -- [17]
				3103, -- [18]
				2992, -- [19]
				3124, -- [20]
				3018, -- [21]
				3983, -- [22]
				3983, -- [23]
				3983, -- [24]
				3983, -- [25]
			},
			["LastAttackedBy"] = "猎蝶兽兽-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"HEAL", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"HEAL", -- [23]
				"HEAL", -- [24]
				"HEAL", -- [25]
			},
			["TimeWindows"] = {
				["HealingTaken"] = {
					2537, -- [1]
				},
				["TimeHeal"] = {
					10.3, -- [1]
				},
				["HOT_Time"] = {
					18, -- [1]
				},
				["ActiveTime"] = {
					15.3, -- [1]
				},
				["TimeDamage"] = {
					5, -- [1]
				},
				["Healing"] = {
					3485, -- [1]
				},
				["DamageTaken"] = {
					1541, -- [1]
				},
				["Damage"] = {
					90, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "毒蛇钉刺 (伤害/跳)",
			["LastFightIn"] = 4,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				4013, -- [1]
				4013, -- [2]
				4013, -- [3]
				4013, -- [4]
				4013, -- [5]
				4013, -- [6]
				4013, -- [7]
				4013, -- [8]
				4013, -- [9]
				4013, -- [10]
				4013, -- [11]
				4013, -- [12]
				4013, -- [13]
				4013, -- [14]
				4013, -- [15]
				4013, -- [16]
				4013, -- [17]
				4013, -- [18]
				4013, -- [19]
				4013, -- [20]
				4013, -- [21]
				3983, -- [22]
				3983, -- [23]
				3983, -- [24]
				3983, -- [25]
			},
			["LastHealTime"] = 17131.842,
			["LastDamageTaken"] = 103,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 17131.292,
				["Healing"] = 17131.292,
				["DamageTaken"] = 16909.296,
				["HealingTaken"] = 16903.295,
				["HOT_Time"] = 17131.292,
				["ActiveTime"] = 17131.292,
				["OVERALL"] = 17131.292,
				["TimeDamage"] = 16904.296,
				["Damage"] = 16904.296,
			},
			["NextEventNum"] = 26,
			["LastDamageTime"] = 16905.196,
			["LastEvents"] = {
				"冰箱里的肉 奥术飞弹 布雷斯塔-逐风者 Hit -165 (55 被抵抗) (Arcane)", -- [1]
				"爱恨情仇-黑龙费尔默 毒蛇钉刺 (伤害/跳) 布雷斯塔-逐风者 Tick -106 (Nature)", -- [2]
				"冰箱里的肉 奥术飞弹 布雷斯塔-逐风者 Hit -220 (Arcane)", -- [3]
				"布雷斯塔-逐风者 回春术 布雷斯塔-逐风者 Tick +232", -- [4]
				"风蛇 肉搏 布雷斯塔-逐风者 Hit -102 (Physical)", -- [5]
				"布雷斯塔-逐风者 荆棘术 风蛇 Hit -18 (Nature)", -- [6]
				"打你屁屁 肉搏 布雷斯塔-逐风者 Hit -54 (Physical)", -- [7]
				"布雷斯塔-逐风者 荆棘术 打你屁屁 Hit -18 (Nature)", -- [8]
				"布雷斯塔-逐风者 治疗之触 布雷斯塔-逐风者 Hit +2073", -- [9]
				"打你屁屁 肉搏 布雷斯塔-逐风者 Hit -63 (Physical)", -- [10]
				"布雷斯塔-逐风者 荆棘术 打你屁屁 Hit -18 (Nature)", -- [11]
				"风蛇 肉搏 布雷斯塔-逐风者 Hit -113 (Physical)", -- [12]
				"布雷斯塔-逐风者 荆棘术 风蛇 Hit -18 (Nature)", -- [13]
				"爱恨情仇-黑龙费尔默 毒蛇钉刺 (伤害/跳) 布雷斯塔-逐风者 Tick -106 (Nature)", -- [14]
				"布雷斯塔-逐风者 回春术 布雷斯塔-逐风者 Tick +232", -- [15]
				"猎蝶兽兽-黑龙费尔默 奥术射击 布雷斯塔-逐风者 Hit -192 (Arcane)", -- [16]
				"风蛇 肉搏 布雷斯塔-逐风者 Hit -111 (Physical)", -- [17]
				"布雷斯塔-逐风者 荆棘术 风蛇 Hit -18 (Nature)", -- [18]
				"风蛇 闪电吐息 布雷斯塔-逐风者 Hit -100 (Nature)", -- [19]
				"爱恨情仇-黑龙费尔默 毒蛇钉刺 (伤害/跳) 布雷斯塔-逐风者 Tick -106 (Nature)", -- [20]
				"猎蝶兽兽-黑龙费尔默 毒蛇钉刺 (伤害/跳) 布雷斯塔-逐风者 Tick -103 (Nature)", -- [21]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [22]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [23]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [24]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [25]
			},
			["Name"] = "布雷斯塔-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
			},
			["LastEventTimes"] = {
				16899.012, -- [1]
				16900.462, -- [2]
				16900.479, -- [3]
				16900.595, -- [4]
				16901.179, -- [5]
				16901.179, -- [6]
				16901.212, -- [7]
				16901.212, -- [8]
				16901.895, -- [9]
				16902.712, -- [10]
				16902.729, -- [11]
				16903.179, -- [12]
				16903.195, -- [13]
				16903.479, -- [14]
				16903.612, -- [15]
				16905.012, -- [16]
				16905.179, -- [17]
				16905.196, -- [18]
				16906.029, -- [19]
				16908.729, -- [20]
				16909.546, -- [21]
				17122.842, -- [22]
				17125.842, -- [23]
				17128.825, -- [24]
				17131.842, -- [25]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 12,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 6,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 948,
								},
							},
							["amount"] = 948,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 237,
									["min"] = 237,
									["count"] = 4,
									["amount"] = 948,
								},
							},
							["count"] = 4,
							["amount"] = 948,
						},
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 6,
					["Healing"] = 948,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
						["回春术"] = {
							["Details"] = {
								["Zhwxd-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["布雷斯塔-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 3,
								},
								["治疗之触"] = {
									["count"] = 1.3,
								},
							},
							["amount"] = 4.3,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["打你屁屁"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 1.53,
								},
							},
							["amount"] = 1.53,
						},
						["布雷斯塔-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 3,
								},
								["治疗之触"] = {
									["count"] = 1.3,
								},
							},
							["amount"] = 4.3,
						},
						["风蛇"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 3.47,
								},
							},
							["amount"] = 3.47,
						},
					},
					["DamageTaken"] = 1541,
					["ElementTakenResist"] = {
						["Arcane"] = 55,
					},
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["25% 抵抗"] = {
									["max"] = 55,
									["min"] = 55,
									["count"] = 1,
									["amount"] = 55,
								},
							},
							["count"] = 55,
							["amount"] = 2,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 15.3,
					["ElementTaken"] = {
						["Nature"] = 521,
						["Melee"] = 443,
						["Arcane"] = 577,
					},
					["HOTs"] = {
						["回春术"] = {
							["Details"] = {
								["布雷斯塔-逐风者"] = {
									["count"] = 6,
								},
								["Zhwxd-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 18,
						},
					},
					["Damage"] = 90,
					["Heals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 237,
									["min"] = 232,
									["count"] = 6,
									["amount"] = 1412,
								},
							},
							["count"] = 6,
							["amount"] = 1412,
						},
						["治疗之触"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 2073,
									["min"] = 2073,
									["count"] = 1,
									["amount"] = 2073,
								},
							},
							["count"] = 1,
							["amount"] = 2073,
						},
					},
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["WhoHealed"] = {
						["布雷斯塔-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 464,
								},
								["治疗之触"] = {
									["count"] = 2073,
								},
							},
							["amount"] = 2537,
						},
					},
					["ElementDone"] = {
						["Nature"] = 90,
					},
					["Healing"] = 3485,
					["HealedWho"] = {
						["布雷斯塔-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 464,
								},
								["治疗之触"] = {
									["count"] = 2073,
								},
							},
							["amount"] = 2537,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 948,
								},
							},
							["amount"] = 948,
						},
					},
					["TimeDamaging"] = {
						["打你屁屁"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 1.53,
								},
							},
							["amount"] = 1.53,
						},
						["风蛇"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 3.47,
								},
							},
							["amount"] = 3.47,
						},
					},
					["Attacks"] = {
						["荆棘术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 18,
									["min"] = 18,
									["count"] = 5,
									["amount"] = 90,
								},
							},
							["count"] = 5,
							["amount"] = 90,
						},
					},
					["HealingTaken"] = 2537,
					["DamagedWho"] = {
						["打你屁屁"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 36,
								},
							},
							["amount"] = 36,
						},
						["风蛇"] = {
							["Details"] = {
								["荆棘术"] = {
									["count"] = 54,
								},
							},
							["amount"] = 54,
						},
					},
					["TimeDamage"] = 5,
					["WhoDamaged"] = {
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 318,
								},
							},
							["amount"] = 318,
						},
						["风蛇"] = {
							["Details"] = {
								["闪电吐息"] = {
									["count"] = 100,
								},
								["肉搏"] = {
									["count"] = 326,
								},
							},
							["amount"] = 426,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 103,
								},
								["奥术射击"] = {
									["count"] = 192,
								},
							},
							["amount"] = 295,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 385,
								},
							},
							["amount"] = 385,
						},
						["打你屁屁"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 117,
								},
							},
							["amount"] = 117,
						},
					},
					["TimeHeal"] = 10.3,
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["HOT_Time"] = 18,
				},
			},
			["UnitLockout"] = 16898.295,
			["LastActive"] = 17131.292,
		},
		["总是那么无奈"] = {
			["GUID"] = "Player-5458-02F22EBE",
			["LastEventHealth"] = {
				3071, -- [1]
				3135, -- [2]
				3135, -- [3]
				3135, -- [4]
				3135, -- [5]
				3137, -- [6]
				3201, -- [7]
				3265, -- [8]
				3265, -- [9]
				3283, -- [10]
				3302, -- [11]
				3302, -- [12]
				2543, -- [13]
				2481, -- [14]
				2481, -- [15]
				2481, -- [16]
				2210, -- [17]
				2210, -- [18]
				2210, -- [19]
				2210, -- [20]
				2246, -- [21]
				2246, -- [22]
				2182, -- [23]
				2122, -- [24]
				2122, -- [25]
				2064, -- [26]
				2006, -- [27]
				1947, -- [28]
				1887, -- [29]
				1887, -- [30]
				1887, -- [31]
				1887, -- [32]
				1530, -- [33]
				1425, -- [34]
				1319, -- [35]
				1319, -- [36]
				1005, -- [37]
				59, -- [38]
				0, -- [39]
				2803, -- [40]
				2829, -- [41]
				1, -- [42]
				3590, -- [43]
				3592, -- [44]
				3592, -- [45]
				3656, -- [46]
				3005, -- [47]
				3005, -- [48]
				3005, -- [49]
				3007, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"HEAL", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"MISC", -- [24]
				"MISC", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"MISC", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"MISC", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					13.5, -- [1]
				},
				["Dispelled"] = {
					3, -- [1]
				},
				["Healing"] = {
					558, -- [1]
				},
				["DamageTaken"] = {
					4797, -- [1]
				},
				["HealingTaken"] = {
					558, -- [1]
				},
				["Overhealing"] = {
					269, -- [1]
				},
				["TimeDamage"] = {
					77.46, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					90.95999999999998, -- [1]
				},
				["DOT_Time"] = {
					351, -- [1]
				},
				["Damage"] = {
					12640, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
					},
					["Messages"] = {
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -61 (Shadow)", -- [1]
						"总是那么无奈 痛苦诅咒 (伤害/跳) Chop Tick -125 (Shadow)", -- [2]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 总是那么无奈 Tick -147 (Shadow)", -- [3]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -61 (Shadow)", -- [4]
						"攻速一点二 肉搏 总是那么无奈 Hit -65 (Physical)", -- [5]
						"攻速一点二 爪击 总是那么无奈 Hit -27 (Physical)", -- [6]
						"总是那么无奈 腐蚀术 (伤害/跳) Chop Tick -175 (Shadow)", -- [7]
						"总是那么无奈 生命虹吸 (伤害/跳) Chop Tick -63 (Shadow)", -- [8]
						"总是那么无奈 生命虹吸 总是那么无奈 Hit +63", -- [9]
						"总是那么无奈 痛苦诅咒 (伤害/跳) Chop Tick -125 (Shadow)", -- [10]
						"攻速一点二 肉搏 总是那么无奈 Hit -65 (Physical)", -- [11]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -60 (Shadow)", -- [12]
						"蒜头妹妹 dispels 总是那么无奈 蝰蛇钉刺 (清洁术)", -- [13]
						"蒜头妹妹 dispels 总是那么无奈 腐蚀术 (清洁术)", -- [14]
						"攻速一点二 肉搏 总是那么无奈 Hit -58 (Physical)", -- [15]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -61 (Shadow)", -- [16]
						"攻速一点二 肉搏 总是那么无奈 Hit -60 (Physical)", -- [17]
						"攻速一点二 爪击 总是那么无奈 Hit -37 (Physical)", -- [18]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [19]
						"攻速一点二 肉搏 总是那么无奈 Hit -60 (Physical)", -- [20]
						"打架-黑龙费尔默 驱散射击 总是那么无奈 Hit -156 (Physical)", -- [21]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [22]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [23]
						"蒜头妹妹 dispels 总是那么无奈 蝰蛇钉刺 (清洁术)", -- [24]
						"打架-黑龙费尔默 自动射击 总是那么无奈 Hit -316 (Physical)", -- [25]
						"打架-黑龙费尔默 多重射击 总是那么无奈 Crit -946 (Physical)", -- [26]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [27]
						"总是那么无奈死亡。", -- [28]
					},
					["DeathAt"] = 16856.293,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
					},
					["MessageTimes"] = {
						-14.01900000000023, -- [1]
						-13.10299999999916, -- [2]
						-12.01900000000023, -- [3]
						-12.01900000000023, -- [4]
						-11.78600000000006, -- [5]
						-11.70200000000114, -- [6]
						-11.60199999999895, -- [7]
						-11.58599999999933, -- [8]
						-11.58599999999933, -- [9]
						-11.10199999999895, -- [10]
						-10.56899999999951, -- [11]
						-10.01900000000023, -- [12]
						-9.419000000001688, -- [13]
						-9.419000000001688, -- [14]
						-8.169000000001688, -- [15]
						-8.019000000000233, -- [16]
						-6.96900000000096, -- [17]
						-6.034999999999855, -- [18]
						-6.019000000000233, -- [19]
						-5.752000000000408, -- [20]
						-5.669000000001688, -- [21]
						-4.034999999999855, -- [22]
						-2.034999999999855, -- [23]
						-1.885000000002037, -- [24]
						-1.735000000000582, -- [25]
						-0.8850000000020373, -- [26]
						-0.0180000000000291, -- [27]
						0, -- [28]
					},
					["HealthMax"] = {
						4044, -- [1]
						4044, -- [2]
						4044, -- [3]
						4044, -- [4]
						4044, -- [5]
						4044, -- [6]
						4044, -- [7]
						4044, -- [8]
						4044, -- [9]
						4044, -- [10]
						4044, -- [11]
						4044, -- [12]
						4044, -- [13]
						4044, -- [14]
						4044, -- [15]
						4044, -- [16]
						4044, -- [17]
						4044, -- [18]
						4044, -- [19]
						4044, -- [20]
						4044, -- [21]
						4044, -- [22]
						4044, -- [23]
						4044, -- [24]
						4044, -- [25]
						4044, -- [26]
						4044, -- [27]
						4044, -- [28]
					},
					["Health"] = {
						2602, -- [1]
						2543, -- [2]
						2481, -- [3]
						2481, -- [4]
						2481, -- [5]
						2210, -- [6]
						2210, -- [7]
						2210, -- [8]
						2210, -- [9]
						2246, -- [10]
						2246, -- [11]
						2182, -- [12]
						2122, -- [13]
						2122, -- [14]
						2064, -- [15]
						2006, -- [16]
						1947, -- [17]
						1887, -- [18]
						1887, -- [19]
						1887, -- [20]
						1887, -- [21]
						1530, -- [22]
						1425, -- [23]
						1319, -- [24]
						1319, -- [25]
						1005, -- [26]
						59, -- [27]
						0, -- [28]
					},
					["KilledBy"] = "残缺一梦-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"HEAL", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"MISC", -- [13]
						"MISC", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"MISC", -- [28]
					},
				}, -- [1]
			},
			["LastDamageTaken"] = 106,
			["level"] = 60,
			["LastDamageAbility"] = "痛苦诅咒 (伤害/跳)",
			["LastFightIn"] = 4,
			["LastHealTime"] = 16843.025,
			["type"] = "Grouped",
			["TimeLast"] = {
				["TimeHeal"] = 16842.292,
				["Dispelled"] = 16852.292,
				["OVERALL"] = 17154.293,
				["DamageTaken"] = 16854.293,
				["DeathCount"] = 16854.293,
				["HealingTaken"] = 16842.292,
				["Overhealing"] = 16818.29,
				["TimeDamage"] = 17154.293,
				["Healing"] = 16842.292,
				["ActiveTime"] = 17154.293,
				["DOT_Time"] = 17154.293,
				["Damage"] = 17154.293,
			},
			["GuardianReverseGUIDs"] = {
				["里恩文"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "Pet-0-5427-489-24822-1863-01011A973D",
					},
				},
			},
			["LastEventHealthMax"] = {
				4044, -- [1]
				4044, -- [2]
				4044, -- [3]
				4044, -- [4]
				4044, -- [5]
				4044, -- [6]
				4044, -- [7]
				4044, -- [8]
				4044, -- [9]
				4044, -- [10]
				4044, -- [11]
				4044, -- [12]
				4044, -- [13]
				4044, -- [14]
				4044, -- [15]
				4044, -- [16]
				4044, -- [17]
				4044, -- [18]
				4044, -- [19]
				4044, -- [20]
				4044, -- [21]
				4044, -- [22]
				4044, -- [23]
				4044, -- [24]
				4044, -- [25]
				4044, -- [26]
				4044, -- [27]
				4044, -- [28]
				4044, -- [29]
				4044, -- [30]
				4044, -- [31]
				4044, -- [32]
				4044, -- [33]
				4044, -- [34]
				4044, -- [35]
				4044, -- [36]
				4044, -- [37]
				4044, -- [38]
				4044, -- [39]
				4044, -- [40]
				4044, -- [41]
				4044, -- [42]
				4044, -- [43]
				4044, -- [44]
				4044, -- [45]
				4044, -- [46]
				4044, -- [47]
				4044, -- [48]
				4044, -- [49]
				4044, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"里恩文 <总是那么无奈>", -- [1]
			},
			["NextEventNum"] = 13,
			["LastDamageTime"] = 17154.327,
			["LastEvents"] = {
				"总是那么无奈 生命虹吸 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -64 (Shadow)", -- [1]
				"总是那么无奈 献祭 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -125 (Fire)", -- [2]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -175 (Shadow)", -- [3]
				"总是那么无奈 腐蚀术 (伤害/跳) 冰箱里的肉 Tick -174 (Shadow)", -- [4]
				"总是那么无奈 腐蚀术 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -175 (Shadow)", -- [5]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 冰箱里的肉 Tick -56 (19 被抵抗) (Shadow)", -- [6]
				"总是那么无奈 生命虹吸 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -64 (Shadow)", -- [7]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -175 (Shadow)", -- [8]
				"总是那么无奈 献祭 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -125 (Fire)", -- [9]
				"总是那么无奈 腐蚀术 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -175 (Shadow)", -- [10]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 冰箱里的肉 Tick -125 (Shadow)", -- [11]
				"总是那么无奈 生命虹吸 (伤害/跳) 冰箱里的肉 Tick -63 (Shadow)", -- [12]
				"总是那么无奈 痛苦诅咒 (伤害/跳) Chop Tick -125 (Shadow)", -- [13]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 总是那么无奈 Tick -147 (Shadow)", -- [14]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -61 (Shadow)", -- [15]
				"攻速一点二 肉搏 总是那么无奈 Hit -65 (Physical)", -- [16]
				"攻速一点二 爪击 总是那么无奈 Hit -27 (Physical)", -- [17]
				"总是那么无奈 腐蚀术 (伤害/跳) Chop Tick -175 (Shadow)", -- [18]
				"总是那么无奈 生命虹吸 (伤害/跳) Chop Tick -63 (Shadow)", -- [19]
				"总是那么无奈 生命虹吸 总是那么无奈 Hit +63", -- [20]
				"总是那么无奈 痛苦诅咒 (伤害/跳) Chop Tick -125 (Shadow)", -- [21]
				"攻速一点二 肉搏 总是那么无奈 Hit -65 (Physical)", -- [22]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -60 (Shadow)", -- [23]
				"蒜头妹妹 dispels 总是那么无奈 蝰蛇钉刺 (清洁术)", -- [24]
				"蒜头妹妹 dispels 总是那么无奈 腐蚀术 (清洁术)", -- [25]
				"攻速一点二 肉搏 总是那么无奈 Hit -58 (Physical)", -- [26]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -61 (Shadow)", -- [27]
				"攻速一点二 肉搏 总是那么无奈 Hit -60 (Physical)", -- [28]
				"攻速一点二 爪击 总是那么无奈 Hit -37 (Physical)", -- [29]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [30]
				"攻速一点二 肉搏 总是那么无奈 Hit -60 (Physical)", -- [31]
				"打架-黑龙费尔默 驱散射击 总是那么无奈 Hit -156 (Physical)", -- [32]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [33]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [34]
				"蒜头妹妹 dispels 总是那么无奈 蝰蛇钉刺 (清洁术)", -- [35]
				"打架-黑龙费尔默 自动射击 总是那么无奈 Hit -316 (Physical)", -- [36]
				"打架-黑龙费尔默 多重射击 总是那么无奈 Crit -946 (Physical)", -- [37]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 总是那么无奈 Tick -106 (Shadow)", -- [38]
				"总是那么无奈死亡。", -- [39]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -75 (Shadow)", -- [40]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 打架-黑龙费尔默 Tick -74 (Shadow)", -- [41]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 打架-黑龙费尔默 Tick -125 (Shadow)", -- [42]
				"总是那么无奈 腐蚀术 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -175 (Shadow)", -- [43]
				"总是那么无奈 生命虹吸 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -64 (Shadow)", -- [44]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -124 (Shadow)", -- [45]
				"总是那么无奈 献祭 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -125 (Fire)", -- [46]
				"总是那么无奈 腐蚀术 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -174 (Shadow)", -- [47]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -125 (Shadow)", -- [48]
				"总是那么无奈 痛苦诅咒 (伤害/跳) 冰箱里的肉 Tick -74 (Shadow)", -- [49]
				"总是那么无奈 生命虹吸 (伤害/跳) 冰箱里的肉 Tick -64 (Shadow)", -- [50]
			},
			["Name"] = "总是那么无奈",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				17148.66, -- [1]
				17149.176, -- [2]
				17149.729, -- [3]
				17149.827, -- [4]
				17150.16, -- [5]
				17150.327, -- [6]
				17151.66, -- [7]
				17151.727, -- [8]
				17152.177, -- [9]
				17153.16, -- [10]
				17154.31, -- [11]
				17154.327, -- [12]
				16841.508, -- [13]
				16842.592, -- [14]
				16842.592, -- [15]
				16842.825, -- [16]
				16842.909, -- [17]
				16843.009, -- [18]
				16843.025, -- [19]
				16843.025, -- [20]
				16843.509, -- [21]
				16844.042, -- [22]
				16844.592, -- [23]
				16845.192, -- [24]
				16845.192, -- [25]
				16846.442, -- [26]
				16846.592, -- [27]
				16847.642, -- [28]
				16848.576, -- [29]
				16848.592, -- [30]
				16848.859, -- [31]
				16848.942, -- [32]
				16850.576, -- [33]
				16852.576, -- [34]
				16852.726, -- [35]
				16852.876, -- [36]
				16853.726, -- [37]
				16854.593, -- [38]
				16854.611, -- [39]
				17001.851, -- [40]
				17014.369, -- [41]
				17026.369, -- [42]
				17144.16, -- [43]
				17145.66, -- [44]
				17145.71, -- [45]
				17146.176, -- [46]
				17147.16, -- [47]
				17147.71, -- [48]
				17148.326, -- [49]
				17148.326, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 12,
								},
								["冰箱里的肉"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 9,
								},
								["冰箱里的肉"] = {
									["count"] = 6,
								},
							},
							["amount"] = 15,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 12,
								},
								["冰箱里的肉"] = {
									["count"] = 9,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 19,
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 17,
								},
							},
							["amount"] = 17,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 60,
					["Damage"] = 2421,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Fire"] = 375,
						["Shadow"] = 2046,
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 375,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 699,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 192,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 599,
								},
							},
							["amount"] = 1865,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 174,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 127,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 255,
								},
							},
							["amount"] = 556,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 1.44,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.79,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3.16,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.22,
								},
							},
							["amount"] = 9.61,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.1,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 2.06,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 11.67,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 125,
									["min"] = 125,
									["count"] = 3,
									["amount"] = 375,
								},
							},
							["count"] = 3,
							["amount"] = 375,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 174,
									["count"] = 5,
									["amount"] = 873,
								},
							},
							["count"] = 5,
							["amount"] = 873,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 64,
									["min"] = 63,
									["count"] = 5,
									["amount"] = 319,
								},
							},
							["count"] = 5,
							["amount"] = 319,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 175,
									["min"] = 56,
									["count"] = 7,
									["amount"] = 854,
								},
							},
							["count"] = 7,
							["amount"] = 854,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 11.67,
					["TimeDamaging"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 1.44,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.79,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3.16,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.22,
								},
							},
							["amount"] = 9.61,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.1,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 2.06,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["总是那么无奈"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
					},
					["DOTs"] = {
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 6,
								},
								["Chop"] = {
									["count"] = 3,
								},
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 30,
								},
								["冰箱里的肉"] = {
									["count"] = 6,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 12,
								},
								["锘一-逐风者"] = {
									["count"] = 9,
								},
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
							},
							["amount"] = 75,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 6,
								},
								["Chop"] = {
									["count"] = 3,
								},
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 33,
								},
								["冰箱里的肉"] = {
									["count"] = 3,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 12,
								},
								["锘一-逐风者"] = {
									["count"] = 9,
								},
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 78,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 12,
								},
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 39,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 18,
								},
								["锘一-逐风者"] = {
									["count"] = 18,
								},
								["Chop"] = {
									["count"] = 6,
								},
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 42,
								},
								["尼罗恩"] = {
									["count"] = 30,
								},
								["冰箱里的肉"] = {
									["count"] = 9,
								},
								["爱恨情仇-黑龙费尔默"] = {
									["count"] = 15,
								},
							},
							["amount"] = 189,
						},
					},
					["WhoDispelled"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 2,
								},
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDoneResist"] = {
						["Shadow"] = 169,
					},
					["TimeSpent"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.85,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.92,
								},
							},
							["amount"] = 8.77,
						},
						["总是那么无奈"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.77,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.82,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.19,
								},
							},
							["amount"] = 10.78,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.1,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3.49,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.319999999999999,
								},
							},
							["amount"] = 10.91,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.08,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.07,
								},
							},
							["amount"] = 10.65,
						},
						["Chop"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 3.5,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 1.44,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 6.47,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 7.91,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.64,
								},
							},
							["amount"] = 23.46,
						},
						["尼罗恩"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.67,
								},
							},
							["amount"] = 4.67,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.1,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 2.06,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2.66,
								},
							},
							["amount"] = 2.66,
						},
					},
					["HealedWho"] = {
						["总是那么无奈"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 558,
								},
							},
							["amount"] = 558,
						},
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 450,
					},
					["PartialResist"] = {
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 90.95999999999998,
					["Dispelled"] = 3,
					["ElementTaken"] = {
						["Physical"] = 3360,
						["Melee"] = 623,
						["Shadow"] = 814,
					},
					["DOT_Time"] = 351,
					["Damage"] = 12640,
					["OverHeals"] = {
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 70,
									["min"] = 2,
									["count"] = 5,
									["amount"] = 269,
								},
							},
							["count"] = 5,
							["amount"] = 269,
						},
					},
					["Heals"] = {
						["生命虹吸"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 69,
									["min"] = 44,
									["count"] = 9,
									["amount"] = 558,
								},
							},
							["count"] = 9,
							["amount"] = 558,
						},
					},
					["Overhealing"] = 269,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 9,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
					},
					["WhoDamaged"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 609,
								},
								["驱散射击"] = {
									["count"] = 156,
								},
								["多重射击"] = {
									["count"] = 946,
								},
							},
							["amount"] = 1711,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 147,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 667,
								},
							},
							["amount"] = 814,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 568,
								},
								["自动射击"] = {
									["count"] = 954,
								},
							},
							["amount"] = 1522,
						},
						["攻速一点二"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 63,
								},
								["爪击"] = {
									["count"] = 64,
								},
								["肉搏"] = {
									["count"] = 623,
								},
							},
							["amount"] = 750,
						},
					},
					["Healing"] = 558,
					["DamageTaken"] = 4797,
					["WhoHealed"] = {
						["总是那么无奈"] = {
							["Details"] = {
								["生命虹吸"] = {
									["count"] = 558,
								},
							},
							["amount"] = 558,
						},
					},
					["ElementDone"] = {
						["Fire"] = 375,
						["Shadow"] = 12265,
					},
					["HealingTaken"] = 558,
					["DamagedWho"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 128,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 349,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 347,
								},
							},
							["amount"] = 824,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 172,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 542,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 883,
								},
							},
							["amount"] = 1597,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 720,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 281,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 644,
								},
							},
							["amount"] = 1645,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 191,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 524,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 719,
								},
							},
							["amount"] = 1434,
						},
						["Chop"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 63,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 175,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 250,
								},
							},
							["amount"] = 488,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 375,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 638,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1920,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1643,
								},
							},
							["amount"] = 4576,
						},
						["尼罗恩"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1100,
								},
							},
							["amount"] = 1100,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 174,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 127,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 255,
								},
							},
							["amount"] = 556,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 420,
								},
							},
							["amount"] = 420,
						},
					},
					["TimeDamage"] = 77.46,
					["TimeDamaging"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.85,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.92,
								},
							},
							["amount"] = 8.77,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.77,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.82,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.19,
								},
							},
							["amount"] = 10.78,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 3.1,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 3.49,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.319999999999999,
								},
							},
							["amount"] = 10.91,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 1.08,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 2.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.07,
								},
							},
							["amount"] = 10.65,
						},
						["Chop"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 3.5,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 1.44,
								},
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 6.47,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 7.91,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 7.64,
								},
							},
							["amount"] = 23.46,
						},
						["尼罗恩"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 4.67,
								},
							},
							["amount"] = 4.67,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 0.02,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 0.1,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 1.94,
								},
							},
							["amount"] = 2.06,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2.66,
								},
							},
							["amount"] = 2.66,
						},
					},
					["TimeHeal"] = 13.5,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Tick"] = {
									["count"] = 109,
								},
							},
							["amount"] = 114,
						},
					},
					["Attacks"] = {
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 125,
									["min"] = 125,
									["count"] = 3,
									["amount"] = 375,
								},
							},
							["count"] = 3,
							["amount"] = 375,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 64,
									["min"] = 64,
									["count"] = 2,
									["amount"] = 128,
								},
								["Tick"] = {
									["max"] = 71,
									["min"] = 44,
									["count"] = 23,
									["amount"] = 1472,
								},
							},
							["count"] = 25,
							["amount"] = 1600,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 174,
									["min"] = 174,
									["count"] = 1,
									["amount"] = 174,
								},
								["Tick"] = {
									["max"] = 192,
									["min"] = 122,
									["count"] = 25,
									["amount"] = 4230,
								},
							},
							["count"] = 26,
							["amount"] = 4404,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 74,
									["min"] = 74,
									["count"] = 2,
									["amount"] = 148,
								},
								["Tick"] = {
									["max"] = 175,
									["min"] = 52,
									["count"] = 61,
									["amount"] = 6113,
								},
							},
							["count"] = 63,
							["amount"] = 6261,
						},
					},
				},
			},
			["UnitLockout"] = 16754.303,
			["LastActive"] = 17154.293,
		},
		["汉纳姆 <芋头妹妹>"] = {
			["GUID"] = "Pet-0-5427-489-24822-417-010120063F",
			["LastEventHealth"] = {
				1578, -- [1]
				1555, -- [2]
				1555, -- [3]
				1495, -- [4]
				1394, -- [5]
				1358, -- [6]
				1315, -- [7]
				1315, -- [8]
				1287, -- [9]
				1650, -- [10]
				1619, -- [11]
				1575, -- [12]
				1544, -- [13]
				1513, -- [14]
				1513, -- [15]
				1990, -- [16]
				1981, -- [17]
				1262, -- [18]
				1262, -- [19]
				1152, -- [20]
				1621, -- [21]
				2239, -- [22]
				2239, -- [23]
				2239, -- [24]
				2239, -- [25]
				2239, -- [26]
				2239, -- [27]
				2239, -- [28]
				2239, -- [29]
				2239, -- [30]
				2239, -- [31]
				2668, -- [32]
				2562, -- [33]
				2562, -- [34]
				2562, -- [35]
				2537, -- [36]
				2160, -- [37]
				2028, -- [38]
				2028, -- [39]
				1994, -- [40]
				2612, -- [41]
				2612, -- [42]
				2612, -- [43]
				2363, -- [44]
				2153, -- [45]
				2131, -- [46]
				2101, -- [47]
				2101, -- [48]
				2101, -- [49]
				1578, -- [50]
			},
			["LastAttackedBy"] = "Chop",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"MISC", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"MISC", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["Dispels"] = {
					6, -- [1]
				},
				["ActiveTime"] = {
					36, -- [1]
				},
				["TimeDamage"] = {
					36, -- [1]
				},
				["DamageTaken"] = {
					3406, -- [1]
				},
				["Damage"] = {
					1429, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "汉纳姆",
			["level"] = 1,
			["LastDamageAbility"] = "多重射击",
			["LastFightIn"] = 4,
			["type"] = "Pet",
			["ownerName"] = "芋头妹妹",
			["LastEventHealthMax"] = {
				2668, -- [1]
				2668, -- [2]
				2668, -- [3]
				2668, -- [4]
				2668, -- [5]
				2668, -- [6]
				2668, -- [7]
				2668, -- [8]
				2668, -- [9]
				2668, -- [10]
				2668, -- [11]
				2668, -- [12]
				2668, -- [13]
				2668, -- [14]
				2668, -- [15]
				2668, -- [16]
				2668, -- [17]
				2668, -- [18]
				2668, -- [19]
				2668, -- [20]
				2668, -- [21]
				2668, -- [22]
				2668, -- [23]
				2668, -- [24]
				2668, -- [25]
				2668, -- [26]
				2668, -- [27]
				2668, -- [28]
				2668, -- [29]
				2668, -- [30]
				2668, -- [31]
				2668, -- [32]
				2668, -- [33]
				2668, -- [34]
				2668, -- [35]
				2668, -- [36]
				2668, -- [37]
				2668, -- [38]
				2668, -- [39]
				2668, -- [40]
				2668, -- [41]
				2668, -- [42]
				2668, -- [43]
				2668, -- [44]
				2668, -- [45]
				2668, -- [46]
				2668, -- [47]
				2668, -- [48]
				2668, -- [49]
				2668, -- [50]
			},
			["LastDamageTaken"] = 377,
			["TimeLast"] = {
				["ActiveTime"] = 17070.289,
				["Dispels"] = 17064.305,
				["TimeDamage"] = 17070.289,
				["OVERALL"] = 17070.289,
				["DamageTaken"] = 17062.305,
				["Damage"] = 17070.289,
			},
			["NextEventNum"] = 16,
			["LastDamageTime"] = 17071.189,
			["LastEvents"] = {
				"汉纳姆 <芋头妹妹> 肉搏 Chop Hit -64 (Physical)", -- [1]
				"汉纳姆 <芋头妹妹> 肉搏 Chop Hit -65 (Physical)", -- [2]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -60 (Shadow)", -- [3]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -101 (Shadow)", -- [4]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -36 (Shadow)", -- [5]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -43 (Shadow)", -- [6]
				"汉纳姆 <芋头妹妹> 肉搏 Chop Hit -81 (Physical)", -- [7]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -28 (Shadow)", -- [8]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -129 (Shadow)", -- [9]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -31 (Shadow)", -- [10]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -44 (Shadow)", -- [11]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -31 (Shadow)", -- [12]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -31 (Shadow)", -- [13]
				"狐狸不吃鱼-黑龙费尔默 闪电之盾 汉纳姆 <芋头妹妹> Resist (Nature)", -- [14]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -44 (Shadow)", -- [15]
				"汉纳姆 <芋头妹妹> 肉搏 断水流-黑龙费尔默 Hit -74 (Physical)", -- [16]
				"打架-黑龙费尔默 多重射击 汉纳姆 <芋头妹妹> Crit -719 (Physical)", -- [17]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -101 (Shadow)", -- [18]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -9 (Shadow)", -- [19]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -72 (Shadow)", -- [20]
				"汉纳姆 <芋头妹妹> dispels 攻速一点二 坚韧祷言 (吞噬魔法)", -- [21]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Hit -67 (Physical)", -- [22]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Hit -73 (Physical)", -- [23]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Hit -74 (Physical)", -- [24]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Miss (1)", -- [25]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Hit -59 (Physical)", -- [26]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Crit -127 (Physical)", -- [27]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Hit -66 (Physical)", -- [28]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Miss (1)", -- [29]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Hit -61 (Physical)", -- [30]
				"汉纳姆 <芋头妹妹> 肉搏 攻速一点二 Hit -60 (Physical)", -- [31]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -106 (Shadow)", -- [32]
				"汉纳姆 <芋头妹妹> 肉搏 锘一-逐风者 Hit -85 (Physical)", -- [33]
				"汉纳姆 <芋头妹妹> 肉搏 锘一-逐风者 Hit -77 (Physical)", -- [34]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -25 (Shadow)", -- [35]
				"Chop 多重射击 汉纳姆 <芋头妹妹> Hit -377 (Physical)", -- [36]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -132 (Shadow)", -- [37]
				"地缚图腾 地缚术 汉纳姆 <芋头妹妹> Resist (Nature)", -- [38]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -34 (Shadow)", -- [39]
				"汉纳姆 <芋头妹妹> dispels 狐狸不吃鱼-黑龙费尔默 闪电之盾 (吞噬魔法)", -- [40]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -40 (Shadow)", -- [41]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -167 (Shadow)", -- [42]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -42 (Shadow)", -- [43]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -210 (Shadow)", -- [44]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -22 (Shadow)", -- [45]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -30 (Shadow)", -- [46]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -109 (Shadow)", -- [47]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -132 (Shadow)", -- [48]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -282 (Shadow)", -- [49]
				"芋头妹妹 灵魂链接 汉纳姆 <芋头妹妹> Split -23 (Shadow)", -- [50]
			},
			["Name"] = "汉纳姆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				false, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				17067.188, -- [1]
				17069.188, -- [2]
				17069.655, -- [3]
				17069.822, -- [4]
				17070.214, -- [5]
				17071.055, -- [6]
				17071.189, -- [7]
				17071.605, -- [8]
				17072.322, -- [9]
				17150.177, -- [10]
				17151.677, -- [11]
				17152.177, -- [12]
				17154.177, -- [13]
				17154.477, -- [14]
				17154.677, -- [15]
				16817.774, -- [16]
				16818.057, -- [17]
				16818.307, -- [18]
				16818.324, -- [19]
				16818.974, -- [20]
				16842.909, -- [21]
				16846.542, -- [22]
				16848.542, -- [23]
				16850.542, -- [24]
				16852.559, -- [25]
				16854.559, -- [26]
				16856.559, -- [27]
				16858.559, -- [28]
				16860.576, -- [29]
				16862.576, -- [30]
				16864.577, -- [31]
				17055.404, -- [32]
				17057.388, -- [33]
				17059.405, -- [34]
				17059.838, -- [35]
				17062.755, -- [36]
				17062.771, -- [37]
				17063.871, -- [38]
				17064.171, -- [39]
				17064.688, -- [40]
				17065.088, -- [41]
				17065.222, -- [42]
				17065.305, -- [43]
				17065.755, -- [44]
				17065.905, -- [45]
				17066.572, -- [46]
				17066.722, -- [47]
				17066.738, -- [48]
				17066.738, -- [49]
				17067.105, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["Chop"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["攻速一点二"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["豹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 3406,
					["PartialResist"] = {
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["低吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地缚术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["PartialAbsorb"] = {
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["生命虹吸 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["低吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地缚术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 36,
					["ElementTaken"] = {
						["Shadow"] = 99,
						["Melee"] = 418,
						["Physical"] = 2889,
					},
					["Damage"] = 1429,
					["Dispels"] = 6,
					["DamagedWho"] = {
						["Chop"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 210,
								},
							},
							["amount"] = 210,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 125,
								},
							},
							["amount"] = 125,
						},
						["攻速一点二"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 587,
								},
							},
							["amount"] = 587,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 74,
								},
							},
							["amount"] = 74,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 74,
								},
							},
							["amount"] = 74,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 243,
								},
							},
							["amount"] = 243,
						},
						["豹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 85,
									["min"] = 54,
									["count"] = 17,
									["amount"] = 1177,
								},
								["Crit"] = {
									["max"] = 127,
									["min"] = 125,
									["count"] = 2,
									["amount"] = 252,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 24,
							["amount"] = 1429,
						},
					},
					["ElementDone"] = {
						["Melee"] = 1429,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 17,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 24,
						},
					},
					["TimeDamage"] = 36,
					["WhoDamaged"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 719,
								},
							},
							["amount"] = 719,
						},
						["Chop"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 761,
								},
							},
							["amount"] = 761,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 828,
								},
							},
							["amount"] = 828,
						},
						["没啤气-逐风者"] = {
							["Details"] = {
								["生命虹吸 (伤害/跳)"] = {
									["count"] = 99,
								},
							},
							["amount"] = 99,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 161,
								},
								["肉搏"] = {
									["count"] = 418,
								},
							},
							["amount"] = 579,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 420,
								},
							},
							["amount"] = 420,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 9,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["TimeDamaging"] = {
						["Chop"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["攻速一点二"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 9,
								},
							},
							["amount"] = 9,
						},
						["豹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DispelledWho"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["闪电之盾 (吞噬魔法)"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["野性印记 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["攻速一点二"] = {
							["Details"] = {
								["坚韧祷言 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["尼罗恩"] = {
							["Details"] = {
								["坚韧祷言 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 16579.293,
			["LastActive"] = 17154.293,
		},
		["才等等-逐风者"] = {
			["GUID"] = "Player-5451-02FE541F",
			["TimeLast"] = {
				["Dispelled"] = 16846.292,
				["OVERALL"] = 17153.293,
				["DamageTaken"] = 17153.293,
				["ActiveTime"] = 17144.293,
				["RageGain"] = 17046.304,
				["DeathCount"] = 17049.304,
				["TimeDamage"] = 17144.293,
				["Healing"] = 17045.304,
				["HealingTaken"] = 16861.293,
				["DOT_Time"] = 17061.305,
				["Damage"] = 17061.305,
			},
			["LastAttackedBy"] = "Chop",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"MISC", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"MISC", -- [17]
				"HEAL", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"MISC", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["Dispelled"] = {
					2, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					4253, -- [1]
				},
				["HealingTaken"] = {
					2875, -- [1]
				},
				["RageGain"] = {
					20, -- [1]
				},
				["ActiveTime"] = {
					18.13, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["TimeDamage"] = {
					18.13, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["Damage"] = {
					2880, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						false, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
					},
					["Messages"] = {
						"尼罗恩 肉搏 才等等-逐风者 Hit -72 (Physical)", -- [1]
						"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 才等等-逐风者 Tick -137 (Fire)", -- [2]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -66 (Shadow)", -- [3]
						"才等等-逐风者 旋风斩 尼罗恩 Hit -371 (Physical)", -- [4]
						"才等等-逐风者 旋风斩 残缺一梦-火妖鲁西弗隆 Hit -292 (Physical)", -- [5]
						"锘一-逐风者 自动射击 才等等-逐风者 Hit -280 (Physical)", -- [6]
						"残缺一梦-火妖鲁西弗隆 暗影灼烧 才等等-逐风者 Hit -667 (Shadow)", -- [7]
						"尼罗恩 肉搏 才等等-逐风者 Hit -80 (Physical)", -- [8]
						"才等等-逐风者 肉搏 残缺一梦-火妖鲁西弗隆 Hit -277 (Physical)", -- [9]
						"才等等-逐风者 灼热武器 残缺一梦-火妖鲁西弗隆 Hit -28 (Fire)", -- [10]
						"才等等-逐风者 断筋 残缺一梦-火妖鲁西弗隆 Hit -27 (Physical)", -- [11]
						"才等等-逐风者 灼热武器 残缺一梦-火妖鲁西弗隆 Hit -28 (Fire)", -- [12]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -67 (Shadow)", -- [13]
						"豹 肉搏 才等等-逐风者 Hit -60 (Physical)", -- [14]
						"豹 爪击 才等等-逐风者 Hit -42 (Physical)", -- [15]
						"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 才等等-逐风者 Tick -138 (Fire)", -- [16]
						"尼罗恩 肉搏 才等等-逐风者 Hit -71 (Physical)", -- [17]
						"才等等-逐风者 致死打击 残缺一梦-火妖鲁西弗隆 Crit -867 (Physical)", -- [18]
						"豹 肉搏 才等等-逐风者 Hit -64 (Physical)", -- [19]
						"残缺一梦-火妖鲁西弗隆 吸取生命 (伤害/跳) 才等等-逐风者 Tick -101 (Shadow)", -- [20]
						"才等等-逐风者死亡。", -- [21]
					},
					["DeathAt"] = 17051.304,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
					},
					["MessageTimes"] = {
						-4.433999999997468, -- [1]
						-3.683999999997468, -- [2]
						-3.467000000000553, -- [3]
						-3.19999999999709, -- [4]
						-3.19999999999709, -- [5]
						-2.533999999999651, -- [6]
						-2.533999999999651, -- [7]
						-2.433999999997468, -- [8]
						-2.016999999999825, -- [9]
						-2.016999999999825, -- [10]
						-1.683999999997468, -- [11]
						-1.683999999997468, -- [12]
						-1.484000000000378, -- [13]
						-1.44999999999709, -- [14]
						-1.149999999997817, -- [15]
						-0.683999999997468, -- [16]
						-0.433999999997468, -- [17]
						-0.183999999997468, -- [18]
						-0.0499999999992724, -- [19]
						-0.01699999999982538, -- [20]
						0, -- [21]
					},
					["HealthMax"] = {
						5229, -- [1]
						5229, -- [2]
						5229, -- [3]
						5229, -- [4]
						5229, -- [5]
						5229, -- [6]
						5229, -- [7]
						5229, -- [8]
						5229, -- [9]
						5229, -- [10]
						5229, -- [11]
						5229, -- [12]
						5229, -- [13]
						5229, -- [14]
						5229, -- [15]
						5229, -- [16]
						5229, -- [17]
						5229, -- [18]
						5229, -- [19]
						5229, -- [20]
						5229, -- [21]
					},
					["Health"] = {
						1775, -- [1]
						1703, -- [2]
						1566, -- [3]
						1500, -- [4]
						1500, -- [5]
						1500, -- [6]
						1500, -- [7]
						1500, -- [8]
						473, -- [9]
						473, -- [10]
						473, -- [11]
						473, -- [12]
						473, -- [13]
						473, -- [14]
						346, -- [15]
						304, -- [16]
						166, -- [17]
						95, -- [18]
						95, -- [19]
						95, -- [20]
						0, -- [21]
					},
					["KilledBy"] = "残缺一梦-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"MISC", -- [21]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "毒蛇钉刺 (伤害/跳)",
			["LastFightIn"] = 4,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				5229, -- [1]
				5229, -- [2]
				5229, -- [3]
				5229, -- [4]
				5229, -- [5]
				5229, -- [6]
				5229, -- [7]
				5229, -- [8]
				5229, -- [9]
				5229, -- [10]
				5229, -- [11]
				5229, -- [12]
				5229, -- [13]
				5229, -- [14]
				5229, -- [15]
				5229, -- [16]
				5229, -- [17]
				5229, -- [18]
				5229, -- [19]
				5229, -- [20]
				5229, -- [21]
				5229, -- [22]
				5229, -- [23]
				5229, -- [24]
				5229, -- [25]
				5229, -- [26]
				5229, -- [27]
				5229, -- [28]
				5229, -- [29]
				5229, -- [30]
				5229, -- [31]
				5229, -- [32]
				5229, -- [33]
				5229, -- [34]
				5229, -- [35]
				5229, -- [36]
				5229, -- [37]
				5229, -- [38]
				5229, -- [39]
				5229, -- [40]
				5229, -- [41]
				5229, -- [42]
				5229, -- [43]
				5229, -- [44]
				5229, -- [45]
				5229, -- [46]
				5229, -- [47]
				5229, -- [48]
				5229, -- [49]
				5229, -- [50]
			},
			["LastDamageTaken"] = 91,
			["LastEventHealth"] = {
				924, -- [1]
				833, -- [2]
				652, -- [3]
				561, -- [4]
				2345, -- [5]
				2345, -- [6]
				2229, -- [7]
				1648, -- [8]
				1541, -- [9]
				1375, -- [10]
				3082, -- [11]
				3082, -- [12]
				3082, -- [13]
				3082, -- [14]
				3082, -- [15]
				2917, -- [16]
				2917, -- [17]
				2930, -- [18]
				3598, -- [19]
				1775, -- [20]
				1703, -- [21]
				1566, -- [22]
				1500, -- [23]
				1500, -- [24]
				1500, -- [25]
				1500, -- [26]
				1500, -- [27]
				473, -- [28]
				473, -- [29]
				473, -- [30]
				473, -- [31]
				473, -- [32]
				473, -- [33]
				346, -- [34]
				304, -- [35]
				166, -- [36]
				95, -- [37]
				95, -- [38]
				95, -- [39]
				0, -- [40]
				1, -- [41]
				1, -- [42]
				1, -- [43]
				1, -- [44]
				5229, -- [45]
				1442, -- [46]
				1442, -- [47]
				1442, -- [48]
				1015, -- [49]
				924, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"红衣火炮 <才等等-逐风者>", -- [1]
			},
			["NextEventNum"] = 5,
			["LastDamageTime"] = 17145.243,
			["LastEvents"] = {
				"Chop 毒蛇钉刺 (伤害/跳) 才等等-逐风者 Tick -91 (Nature)", -- [1]
				"打架-黑龙费尔默 自动射击 才等等-逐风者 Hit -181 (Physical)", -- [2]
				"Chop 毒蛇钉刺 (伤害/跳) 才等等-逐风者 Tick -91 (Nature)", -- [3]
				"Chop 毒蛇钉刺 (伤害/跳) 才等等-逐风者 Tick -91 (Nature)", -- [4]
				"原子弹 野猪冲锋 才等等-逐风者 Immune (Physical)", -- [5]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -116 (Shadow)", -- [6]
				"Chop 自动射击 才等等-逐风者 Crit -581 (Physical)", -- [7]
				"原子弹 肉搏 才等等-逐风者 Hit -107 (Physical)", -- [8]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -166 (Shadow)", -- [9]
				"蒜头妹妹 圣光术 才等等-逐风者 Hit +1707", -- [10]
				"才等等-逐风者 断筋 Chop Dodge (Physical)", -- [11]
				"才等等-逐风者 肉搏 Chop Dodge (1)", -- [12]
				"蒜头妹妹 dispels 才等等-逐风者 猎人印记 (清洁术)", -- [13]
				"才等等-逐风者 断筋 Chop Hit -31 (Physical)", -- [14]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -165 (Shadow)", -- [15]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -165 (Shadow)", -- [16]
				"Zhwxd-逐风者 dispels 才等等-逐风者 痛苦诅咒 (解除次级诅咒)", -- [17]
				"蒜头妹妹 圣光闪现 才等等-逐风者 Hit +579", -- [18]
				"蒜头妹妹 圣光闪现 才等等-逐风者 Hit +589", -- [19]
				"尼罗恩 肉搏 才等等-逐风者 Hit -72 (Physical)", -- [20]
				"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 才等等-逐风者 Tick -137 (Fire)", -- [21]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -66 (Shadow)", -- [22]
				"才等等-逐风者 旋风斩 尼罗恩 Hit -371 (Physical)", -- [23]
				"才等等-逐风者 旋风斩 残缺一梦-火妖鲁西弗隆 Hit -292 (Physical)", -- [24]
				"锘一-逐风者 自动射击 才等等-逐风者 Hit -280 (Physical)", -- [25]
				"残缺一梦-火妖鲁西弗隆 暗影灼烧 才等等-逐风者 Hit -667 (Shadow)", -- [26]
				"尼罗恩 肉搏 才等等-逐风者 Hit -80 (Physical)", -- [27]
				"才等等-逐风者 肉搏 残缺一梦-火妖鲁西弗隆 Hit -277 (Physical)", -- [28]
				"才等等-逐风者 灼热武器 残缺一梦-火妖鲁西弗隆 Hit -28 (Fire)", -- [29]
				"才等等-逐风者 断筋 残缺一梦-火妖鲁西弗隆 Hit -27 (Physical)", -- [30]
				"才等等-逐风者 灼热武器 残缺一梦-火妖鲁西弗隆 Hit -28 (Fire)", -- [31]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 才等等-逐风者 Tick -67 (Shadow)", -- [32]
				"豹 肉搏 才等等-逐风者 Hit -60 (Physical)", -- [33]
				"豹 爪击 才等等-逐风者 Hit -42 (Physical)", -- [34]
				"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 才等等-逐风者 Tick -138 (Fire)", -- [35]
				"尼罗恩 肉搏 才等等-逐风者 Hit -71 (Physical)", -- [36]
				"才等等-逐风者 致死打击 残缺一梦-火妖鲁西弗隆 Crit -867 (Physical)", -- [37]
				"豹 肉搏 才等等-逐风者 Hit -64 (Physical)", -- [38]
				"残缺一梦-火妖鲁西弗隆 吸取生命 (伤害/跳) 才等等-逐风者 Tick -101 (Shadow)", -- [39]
				"才等等-逐风者死亡。", -- [40]
				"才等等-逐风者 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -57 (Physical)", -- [41]
				"才等等-逐风者 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -57 (Physical)", -- [42]
				"才等等-逐风者 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -57 (Physical)", -- [43]
				"才等等-逐风者 重伤 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -57 (Physical)", -- [44]
				"Environment Falling 才等等-逐风者 Hit -136 (Physical)", -- [45]
				"帅哥祖师爷龙-逐风者 肉搏 才等等-逐风者 Hit -164 (Physical)", -- [46]
				"帅哥祖师爷龙-逐风者 出血 才等等-逐风者 Hit -155 (Physical)", -- [47]
				"帅哥祖师爷龙-逐风者 速效毒药 VI 才等等-逐风者 Hit -108 (Nature)", -- [48]
				"Chop 毒蛇钉刺 (伤害/跳) 才等等-逐风者 Tick -91 (Nature)", -- [49]
				"才等等-逐风者 肉搏 帅哥祖师爷龙-逐风者 Dodge (1)", -- [50]
			},
			["Name"] = "才等等-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				17147.993, -- [1]
				17149.277, -- [2]
				17151.01, -- [3]
				17153.993, -- [4]
				16840.075, -- [5]
				16840.442, -- [6]
				16840.525, -- [7]
				16841.392, -- [8]
				16842.442, -- [9]
				16842.509, -- [10]
				16842.925, -- [11]
				16842.925, -- [12]
				16843.342, -- [13]
				16844.425, -- [14]
				16844.459, -- [15]
				16846.459, -- [16]
				16846.475, -- [17]
				16858.643, -- [18]
				16862.043, -- [19]
				17045.187, -- [20]
				17045.937, -- [21]
				17046.154, -- [22]
				17046.421, -- [23]
				17046.421, -- [24]
				17047.087, -- [25]
				17047.087, -- [26]
				17047.187, -- [27]
				17047.604, -- [28]
				17047.604, -- [29]
				17047.937, -- [30]
				17047.937, -- [31]
				17048.137, -- [32]
				17048.171, -- [33]
				17048.471, -- [34]
				17048.937, -- [35]
				17049.187, -- [36]
				17049.437, -- [37]
				17049.571, -- [38]
				17049.604, -- [39]
				17049.621, -- [40]
				17052.454, -- [41]
				17055.454, -- [42]
				17058.455, -- [43]
				17061.455, -- [44]
				17087.723, -- [45]
				17144.893, -- [46]
				17144.893, -- [47]
				17144.893, -- [48]
				17144.993, -- [49]
				17145.243, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 972,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 336,
						["Melee"] = 164,
						["Nature"] = 472,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 108,
								},
								["出血"] = {
									["count"] = 155,
								},
								["肉搏"] = {
									["count"] = 164,
								},
							},
							["amount"] = 427,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 364,
								},
							},
							["amount"] = 364,
						},
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 181,
								},
							},
							["amount"] = 181,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 2,
					["ElementDoneResist"] = {
						["Nature"] = 150,
					},
					["TimeSpent"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Chop"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 0.06,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.56,
						},
						["风蛇"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 0.06,
								},
							},
							["amount"] = 0.06,
						},
						["尼罗恩"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["肉搏"] = {
									["count"] = 1.18,
								},
							},
							["amount"] = 9.01,
						},
					},
					["DamageTaken"] = 4253,
					["RageGainedFrom"] = {
						["才等等-逐风者"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 5,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 20,
						},
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["野猪冲锋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["吸取生命 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["野猪冲锋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 18.13,
					["ElementTaken"] = {
						["Physical"] = 1375,
						["Melee"] = 618,
						["Fire"] = 275,
						["Shadow"] = 1513,
						["Nature"] = 472,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["才等等-逐风者"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["冲锋"] = {
							["Details"] = {
								["才等等-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 2880,
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
					},
					["DOT_Time"] = 12,
					["HealingTaken"] = 2875,
					["WhoDispelled"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["猎人印记 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Healing"] = 0,
					["WhoHealed"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1168,
								},
								["圣光术"] = {
									["count"] = 1707,
								},
							},
							["amount"] = 2875,
						},
					},
					["WhoDamaged"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 181,
								},
							},
							["amount"] = 181,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 667,
								},
								["吸取生命 (伤害/跳)"] = {
									["count"] = 101,
								},
								["献祭 (伤害/跳)"] = {
									["count"] = 275,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 745,
								},
							},
							["amount"] = 1788,
						},
						["原子弹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 107,
								},
							},
							["amount"] = 107,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 280,
								},
							},
							["amount"] = 280,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["速效毒药 VI"] = {
									["count"] = 108,
								},
								["出血"] = {
									["count"] = 155,
								},
								["肉搏"] = {
									["count"] = 164,
								},
							},
							["amount"] = 427,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 364,
								},
								["自动射击"] = {
									["count"] = 581,
								},
							},
							["amount"] = 945,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 136,
								},
							},
							["amount"] = 136,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 223,
								},
							},
							["amount"] = 223,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 42,
								},
								["肉搏"] = {
									["count"] = 124,
								},
							},
							["amount"] = 166,
						},
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 867,
									["min"] = 867,
									["count"] = 1,
									["amount"] = 867,
								},
							},
							["count"] = 1,
							["amount"] = 867,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 57,
									["min"] = 57,
									["count"] = 4,
									["amount"] = 228,
								},
							},
							["count"] = 4,
							["amount"] = 228,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 292,
									["count"] = 2,
									["amount"] = 663,
								},
							},
							["count"] = 2,
							["amount"] = 663,
						},
						["灼热武器"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 2,
									["amount"] = 56,
								},
							},
							["count"] = 2,
							["amount"] = 56,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 31,
									["min"] = 27,
									["count"] = 2,
									["amount"] = 58,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 58,
						},
						["拉姆斯登的闪电钉"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 200,
									["min"] = 50,
									["count"] = 3,
									["amount"] = 450,
								},
							},
							["count"] = 3,
							["amount"] = 450,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 281,
									["min"] = 277,
									["count"] = 2,
									["amount"] = 558,
								},
							},
							["count"] = 4,
							["amount"] = 558,
						},
					},
					["RageGain"] = 20,
					["DamagedWho"] = {
						["Chop"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 31,
								},
							},
							["amount"] = 31,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 200,
								},
								["肉搏"] = {
									["count"] = 281,
								},
							},
							["amount"] = 481,
						},
						["风蛇"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 200,
								},
							},
							["amount"] = 200,
						},
						["尼罗恩"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 50,
								},
								["旋风斩"] = {
									["count"] = 371,
								},
							},
							["amount"] = 421,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 867,
								},
								["旋风斩"] = {
									["count"] = 292,
								},
								["灼热武器"] = {
									["count"] = 56,
								},
								["断筋"] = {
									["count"] = 27,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 228,
								},
								["肉搏"] = {
									["count"] = 277,
								},
							},
							["amount"] = 1747,
						},
					},
					["TimeDamage"] = 18.13,
					["TimeDamaging"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Chop"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 0.06,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.56,
						},
						["风蛇"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 0.06,
								},
							},
							["amount"] = 0.06,
						},
						["尼罗恩"] = {
							["Details"] = {
								["拉姆斯登的闪电钉"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.33,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["肉搏"] = {
									["count"] = 1.18,
								},
							},
							["amount"] = 9.01,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 7,
								},
							},
							["amount"] = 8,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 7,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementDone"] = {
						["Fire"] = 56,
						["Physical"] = 1816,
						["Melee"] = 558,
						["Nature"] = 450,
					},
				},
			},
			["UnitLockout"] = 16815.29,
			["LastActive"] = 17153.293,
		},
		["豹 <小猛哥-逐风者>"] = {
			["GUID"] = "Pet-0-5427-529-23739-7434-06013479B5",
			["LastEventHealth"] = {
				3868, -- [1]
				3868, -- [2]
				3868, -- [3]
				3247, -- [4]
				3247, -- [5]
				3247, -- [6]
				3217, -- [7]
				3103, -- [8]
				2780, -- [9]
				2780, -- [10]
				2780, -- [11]
				2666, -- [12]
				2666, -- [13]
				2707, -- [14]
				2707, -- [15]
				2592, -- [16]
				2229, -- [17]
				2115, -- [18]
				2078, -- [19]
				2118, -- [20]
				2081, -- [21]
				2044, -- [22]
				1727, -- [23]
				2318, -- [24]
				3868, -- [25]
				3868, -- [26]
				3868, -- [27]
				3868, -- [28]
				3868, -- [29]
				3868, -- [30]
				3868, -- [31]
				3868, -- [32]
				3868, -- [33]
				3868, -- [34]
				3868, -- [35]
				3868, -- [36]
				3868, -- [37]
				3868, -- [38]
				3868, -- [39]
				3868, -- [40]
				3868, -- [41]
				3868, -- [42]
				3630, -- [43]
				3630, -- [44]
				3707, -- [45]
				3707, -- [46]
			},
			["LastAttackedBy"] = "猎蝶兽兽-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					42.66, -- [1]
				},
				["Damage"] = {
					2049, -- [1]
				},
				["DamageTaken"] = {
					2245, -- [1]
				},
				["ActiveTime"] = {
					42.66, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "豹",
			["level"] = 1,
			["LastDamageAbility"] = "多重射击",
			["LastFightIn"] = 4,
			["type"] = "Pet",
			["ownerName"] = "小猛哥-逐风者",
			["LastDamageTaken"] = 238,
			["TimeLast"] = {
				["ActiveTime"] = 17143.293,
				["TimeDamage"] = 17143.293,
				["OVERALL"] = 17143.293,
				["DamageTaken"] = 17138.293,
				["Damage"] = 17143.293,
			},
			["LastEventHealthMax"] = {
				3868, -- [1]
				3868, -- [2]
				3868, -- [3]
				3868, -- [4]
				3868, -- [5]
				3868, -- [6]
				3868, -- [7]
				3868, -- [8]
				3868, -- [9]
				3868, -- [10]
				3868, -- [11]
				3868, -- [12]
				3868, -- [13]
				3868, -- [14]
				3868, -- [15]
				3868, -- [16]
				3868, -- [17]
				3868, -- [18]
				3868, -- [19]
				3868, -- [20]
				3868, -- [21]
				3868, -- [22]
				3868, -- [23]
				3868, -- [24]
				3868, -- [25]
				3868, -- [26]
				3868, -- [27]
				3868, -- [28]
				3868, -- [29]
				3868, -- [30]
				3868, -- [31]
				3868, -- [32]
				3868, -- [33]
				3868, -- [34]
				3868, -- [35]
				3868, -- [36]
				3868, -- [37]
				3868, -- [38]
				3868, -- [39]
				3868, -- [40]
				3868, -- [41]
				3868, -- [42]
				3868, -- [43]
				3868, -- [44]
				3868, -- [45]
				3868, -- [46]
			},
			["NextEventNum"] = 47,
			["LastDamageTime"] = 17143.576,
			["LastEvents"] = {
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Hit -70 (Physical)", -- [1]
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Miss (1)", -- [2]
				"断水流-黑龙费尔默 肉搏 豹 <小猛哥-逐风者> Crit -621 (Physical)", -- [3]
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Hit -71 (Physical)", -- [4]
				"断水流-黑龙费尔默 断筋 豹 <小猛哥-逐风者> Hit -30 (Physical)", -- [5]
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Dodge (1)", -- [6]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 豹 <小猛哥-逐风者> Tick -114 (Physical)", -- [7]
				"断水流-黑龙费尔默 肉搏 豹 <小猛哥-逐风者> Hit -323 (Physical)", -- [8]
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Hit -59 (Physical)", -- [9]
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Crit -128 (Physical)", -- [10]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 豹 <小猛哥-逐风者> Tick -114 (Physical)", -- [11]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 豹 <小猛哥-逐风者> Tick -37 (Physical)", -- [12]
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Hit -60 (Physical)", -- [13]
				"豹 <小猛哥-逐风者> 肉搏 断水流-黑龙费尔默 Hit -70 (Physical)", -- [14]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 豹 <小猛哥-逐风者> Tick -115 (Physical)", -- [15]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 豹 <小猛哥-逐风者> Tick -37 (Physical)", -- [16]
				"断水流-黑龙费尔默 重伤 (伤害/跳) 豹 <小猛哥-逐风者> Tick -114 (Physical)", -- [17]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 豹 <小猛哥-逐风者> Tick -37 (Physical)", -- [18]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 豹 <小猛哥-逐风者> Tick -37 (Physical)", -- [19]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 豹 <小猛哥-逐风者> Tick -37 (Physical)", -- [20]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 豹 <小猛哥-逐风者> Tick -37 (Physical)", -- [21]
				"爱恨情仇-黑龙费尔默 多重射击 豹 <小猛哥-逐风者> Hit -317 (Physical)", -- [22]
				"断水流-黑龙费尔默 撕裂 (伤害/跳) 豹 <小猛哥-逐风者> Tick -37 (Physical)", -- [23]
				"豹 <小猛哥-逐风者> 肉搏 爱恨情仇-黑龙费尔默 Hit -75 (Physical)", -- [24]
				"豹 <小猛哥-逐风者> 肉搏 猎蝶兽兽-黑龙费尔默 Hit -67 (Physical)", -- [25]
				"豹 <小猛哥-逐风者> 肉搏 猎蝶兽兽-黑龙费尔默 Crit -132 (Physical)", -- [26]
				"豹 <小猛哥-逐风者> 肉搏 猎蝶兽兽-黑龙费尔默 Crit -140 (Physical)", -- [27]
				"豹 <小猛哥-逐风者> 肉搏 猎蝶兽兽-黑龙费尔默 Hit -75 (Physical)", -- [28]
				"豹 <小猛哥-逐风者> 肉搏 打架-黑龙费尔默 Crit -148 (Physical)", -- [29]
				"豹 <小猛哥-逐风者> 肉搏 打架-黑龙费尔默 Dodge (1)", -- [30]
				"豹 <小猛哥-逐风者> 肉搏 打架-黑龙费尔默 Dodge (1)", -- [31]
				"豹 <小猛哥-逐风者> 肉搏 打架-黑龙费尔默 Dodge (1)", -- [32]
				"豹 <小猛哥-逐风者> 肉搏 残缺一梦-火妖鲁西弗隆 Miss (1)", -- [33]
				"豹 <小猛哥-逐风者> 肉搏 残缺一梦-火妖鲁西弗隆 Dodge (1)", -- [34]
				"豹 <小猛哥-逐风者> 肉搏 残缺一梦-火妖鲁西弗隆 Dodge (1)", -- [35]
				"豹 <小猛哥-逐风者> 肉搏 残缺一梦-火妖鲁西弗隆 Crit -106 (Physical)", -- [36]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Hit -77 (Physical)", -- [37]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Crit -176 (Physical)", -- [38]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Hit -80 (Physical)", -- [39]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Crit -175 (Physical)", -- [40]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Crit -170 (Physical)", -- [41]
				"猎蝶兽兽-黑龙费尔默 多重射击 豹 <小猛哥-逐风者> Hit -238 (Physical)", -- [42]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Dodge (1)", -- [43]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Dodge (1)", -- [44]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Hit -86 (Physical)", -- [45]
				"豹 <小猛哥-逐风者> 肉搏 帅哥祖师爷龙-逐风者 Hit -84 (Physical)", -- [46]
			},
			["Name"] = "豹",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
			},
			["LastEventTimes"] = {
				16692.467, -- [1]
				16693.967, -- [2]
				16694.233, -- [3]
				16695.467, -- [4]
				16696.95, -- [5]
				16696.984, -- [6]
				16697.25, -- [7]
				16697.667, -- [8]
				16698.483, -- [9]
				16699.984, -- [10]
				16700.25, -- [11]
				16701.45, -- [12]
				16701.5, -- [13]
				16702.984, -- [14]
				16703.25, -- [15]
				16704.45, -- [16]
				16706.251, -- [17]
				16707.451, -- [18]
				16710.451, -- [19]
				16713.451, -- [20]
				16716.451, -- [21]
				16718.751, -- [22]
				16719.451, -- [23]
				16730.835, -- [24]
				16808.24, -- [25]
				16809.757, -- [26]
				16811.257, -- [27]
				16812.757, -- [28]
				16860.01, -- [29]
				16861.16, -- [30]
				16862.326, -- [31]
				16863.476, -- [32]
				17050.187, -- [33]
				17051.687, -- [34]
				17053.204, -- [35]
				17054.721, -- [36]
				17131.975, -- [37]
				17133.476, -- [38]
				17134.626, -- [39]
				17136.809, -- [40]
				17137.943, -- [41]
				17138.576, -- [42]
				17139.626, -- [43]
				17140.776, -- [44]
				17142.059, -- [45]
				17143.576, -- [46]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 238,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Block"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 238,
					},
					["DOT_Time"] = 0,
					["Damage"] = 848,
					["ElementTakenBlock"] = {
						["Physical"] = 6,
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 848,
					},
					["PartialAbsorb"] = {
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 848,
								},
							},
							["amount"] = 848,
						},
					},
					["PartialBlock"] = {
						["多重射击"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 6,
									["min"] = 6,
									["count"] = 1,
									["amount"] = 6,
								},
							},
							["count"] = 1,
							["amount"] = 6,
						},
					},
					["WhoDamaged"] = {
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 238,
								},
							},
							["amount"] = 238,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 12.21,
								},
							},
							["amount"] = 12.21,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 12.21,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 176,
									["min"] = 170,
									["count"] = 3,
									["amount"] = 521,
								},
								["Hit"] = {
									["max"] = 86,
									["min"] = 77,
									["count"] = 4,
									["amount"] = 327,
								},
							},
							["count"] = 9,
							["amount"] = 848,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 12.21,
					["TimeDamaging"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 12.21,
								},
							},
							["amount"] = 12.21,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["PartialBlock"] = {
						["多重射击"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 6,
									["min"] = 6,
									["count"] = 1,
									["amount"] = 6,
								},
							},
							["count"] = 1,
							["amount"] = 6,
						},
					},
					["TimeSpent"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.97,
								},
							},
							["amount"] = 4.97,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 12.21,
								},
							},
							["amount"] = 12.21,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 11.98,
								},
							},
							["amount"] = 11.98,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 2245,
					["PartialResist"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["PartialAbsorb"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 42.66,
					["ElementTaken"] = {
						["Melee"] = 944,
						["Physical"] = 1301,
					},
					["Damage"] = 2049,
					["ElementTakenBlock"] = {
						["Physical"] = 6,
					},
					["ElementDone"] = {
						["Melee"] = 2049,
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Block"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 11,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
					},
					["DamagedWho"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 148,
								},
							},
							["amount"] = 148,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 414,
								},
							},
							["amount"] = 414,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 848,
								},
							},
							["amount"] = 848,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 458,
								},
							},
							["amount"] = 458,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 106,
								},
							},
							["amount"] = 106,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
					},
					["TimeDamage"] = 42.66,
					["TimeDamaging"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 4.97,
								},
							},
							["amount"] = 4.97,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 12.21,
								},
							},
							["amount"] = 12.21,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 11.98,
								},
							},
							["amount"] = 11.98,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Dodge"] = {
									["count"] = 8,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 176,
									["min"] = 106,
									["count"] = 8,
									["amount"] = 1175,
								},
								["Hit"] = {
									["max"] = 86,
									["min"] = 59,
									["count"] = 12,
									["amount"] = 874,
								},
							},
							["count"] = 30,
							["amount"] = 2049,
						},
					},
					["WhoDamaged"] = {
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 259,
								},
								["断筋"] = {
									["count"] = 30,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 457,
								},
								["肉搏"] = {
									["count"] = 944,
								},
							},
							["amount"] = 1690,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 317,
								},
							},
							["amount"] = 317,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 238,
								},
							},
							["amount"] = 238,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 8,
								},
								["Crit"] = {
									["count"] = 8,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 30,
						},
					},
				},
			},
			["UnitLockout"] = 16692.3,
			["LastActive"] = 17143.293,
		},
		["猛将兄-老马布兰契"] = {
			["GUID"] = "Player-5447-02EAD7F6",
			["TimeLast"] = {
				["RageGain"] = 16554.292,
				["DamageTaken"] = 16646.297,
				["OVERALL"] = 16646.297,
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					131, -- [1]
				},
				["RageGain"] = {
					10, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "猛将兄-老马布兰契",
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 0,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 131,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4979, -- [1]
			},
			["NextEventNum"] = 2,
			["LastEventHealth"] = {
				4979, -- [1]
			},
			["LastEvents"] = {
				"Environment Falling 猛将兄-老马布兰契 Hit -131 (Physical)", -- [1]
			},
			["Name"] = "猛将兄-老马布兰契",
			["LastEventIncoming"] = {
				true, -- [1]
			},
			["LastEventTimes"] = {
				16646.664, -- [1]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 131,
					["RageGainedFrom"] = {
						["猛将兄-老马布兰契"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["RageGain"] = 10,
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 131,
								},
							},
							["amount"] = 131,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 131,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["猛将兄-老马布兰契"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
				},
			},
			["UnitLockout"] = 16646.297,
			["LastActive"] = 16646.297,
		},
		["蒜头妹妹"] = {
			["GUID"] = "Player-5458-02EB4E50",
			["TimeLast"] = {
				["TimeHeal"] = 16861.293,
				["Dispelled"] = 16729.302,
				["Dispels"] = 16852.292,
				["OVERALL"] = 17134.292,
				["DamageTaken"] = 17023.302,
				["Healing"] = 16861.293,
				["HealingTaken"] = 16720.301,
				["Overhealing"] = 16851.292,
				["ActiveTime"] = 16861.293,
				["TimeDamage"] = 16719.301,
				["ManaGain"] = 17134.292,
				["DOT_Time"] = 16719.301,
				["Damage"] = 16719.301,
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"MISC", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"HEAL", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"HEAL", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"MISC", -- [21]
				"MISC", -- [22]
				"MISC", -- [23]
				"MISC", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"HEAL", -- [32]
				"MISC", -- [33]
				"MISC", -- [34]
				"MISC", -- [35]
				"HEAL", -- [36]
				"MISC", -- [37]
				"DAMAGE", -- [38]
				"HEAL", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"HEAL", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					18, -- [1]
				},
				["Dispelled"] = {
					4, -- [1]
				},
				["Dispels"] = {
					12, -- [1]
				},
				["Healing"] = {
					9734, -- [1]
				},
				["DamageTaken"] = {
					4042, -- [1]
				},
				["HealingTaken"] = {
					2007, -- [1]
				},
				["Overhealing"] = {
					103, -- [1]
				},
				["ActiveTime"] = {
					26, -- [1]
				},
				["TimeDamage"] = {
					8, -- [1]
				},
				["ManaGain"] = {
					1120, -- [1]
				},
				["DOT_Time"] = {
					33, -- [1]
				},
				["Damage"] = {
					614, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 4,
			["type"] = "Grouped",
			["LastEventHealth"] = {
				2114, -- [1]
				2114, -- [2]
				2114, -- [3]
				2114, -- [4]
				2979, -- [5]
				2932, -- [6]
				2932, -- [7]
				2932, -- [8]
				2897, -- [9]
				3455, -- [10]
				3411, -- [11]
				3378, -- [12]
				3305, -- [13]
				3142, -- [14]
				3142, -- [15]
				3106, -- [16]
				3022, -- [17]
				3022, -- [18]
				2985, -- [19]
				2950, -- [20]
				2849, -- [21]
				2849, -- [22]
				2849, -- [23]
				2849, -- [24]
				2849, -- [25]
				2812, -- [26]
				4074, -- [27]
				4019, -- [28]
				3996, -- [29]
				3996, -- [30]
				3920, -- [31]
				4276, -- [32]
				4276, -- [33]
				4276, -- [34]
				4276, -- [35]
				4276, -- [36]
				4276, -- [37]
				4276, -- [38]
				4080, -- [39]
				4112, -- [40]
				4112, -- [41]
				4161, -- [42]
				2420, -- [43]
				1635, -- [44]
				1635, -- [45]
				1635, -- [46]
				1635, -- [47]
				1585, -- [48]
				1585, -- [49]
				2169, -- [50]
			},
			["LastHealTime"] = 16862.043,
			["LastDamageTaken"] = 330,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4281, -- [1]
				4281, -- [2]
				4281, -- [3]
				4281, -- [4]
				4281, -- [5]
				4281, -- [6]
				4281, -- [7]
				4281, -- [8]
				4281, -- [9]
				4281, -- [10]
				4281, -- [11]
				4281, -- [12]
				4281, -- [13]
				4281, -- [14]
				4281, -- [15]
				4281, -- [16]
				4281, -- [17]
				4281, -- [18]
				4281, -- [19]
				4281, -- [20]
				4281, -- [21]
				4281, -- [22]
				4281, -- [23]
				4281, -- [24]
				4281, -- [25]
				4281, -- [26]
				4281, -- [27]
				4281, -- [28]
				4281, -- [29]
				4281, -- [30]
				4281, -- [31]
				4281, -- [32]
				4281, -- [33]
				4281, -- [34]
				4281, -- [35]
				4281, -- [36]
				4281, -- [37]
				4281, -- [38]
				4281, -- [39]
				4281, -- [40]
				4281, -- [41]
				4161, -- [42]
				4161, -- [43]
				4281, -- [44]
				4281, -- [45]
				4281, -- [46]
				4281, -- [47]
				4281, -- [48]
				4281, -- [49]
				4281, -- [50]
			},
			["NextEventNum"] = 44,
			["LastDamageTime"] = 16720.035,
			["LastEvents"] = {
				"尼罗恩 dispels 蒜头妹妹 奥术智慧 (吞噬魔法)", -- [1]
				"蒜头妹妹 奉献 (伤害/跳) 尼罗恩 Tick -53 (Holy)", -- [2]
				"蒜头妹妹 奉献 (伤害/跳) 尼罗恩 Tick -54 (Holy)", -- [3]
				"蒜头妹妹 圣光闪现 蒜头妹妹 Crit +865", -- [4]
				"尼罗恩 肉搏 蒜头妹妹 Hit -47 (Physical)", -- [5]
				"蒜头妹妹 奉献 (伤害/跳) 尼罗恩 Tick -54 (Holy)", -- [6]
				"蒜头妹妹 奉献 (伤害/跳) 尼罗恩 Tick -54 (Holy)", -- [7]
				"打你屁屁 肉搏 蒜头妹妹 Hit -35 (Physical)", -- [8]
				"蒜头妹妹 圣光闪现 蒜头妹妹 Hit +558", -- [9]
				"尼罗恩 肉搏 蒜头妹妹 Hit -44 (Physical)", -- [10]
				"打你屁屁 肉搏 蒜头妹妹 Hit -33 (Physical)", -- [11]
				"打你屁屁 肉搏 蒜头妹妹 Crit -73 (Physical)", -- [12]
				"Chop 自动射击 蒜头妹妹 Hit -163 (Physical)", -- [13]
				"打你屁屁 肉搏 蒜头妹妹 Hit -36 (Physical)", -- [14]
				"原子弹 肉搏 蒜头妹妹 Hit -38 (Physical)", -- [15]
				"打你屁屁 撕咬 蒜头妹妹 Hit -46 (Physical)", -- [16]
				"打你屁屁 肉搏 蒜头妹妹 Hit -37 (Physical)", -- [17]
				"残缺一梦-火妖鲁西弗隆 献祭 蒜头妹妹 Resist (Fire)", -- [18]
				"原子弹 肉搏 蒜头妹妹 Hit -35 (Physical)", -- [19]
				"Chop 毒蛇钉刺 (伤害/跳) 蒜头妹妹 Tick -101 (Nature)", -- [20]
				"蒜头妹妹 dispels 蒜头妹妹 毒蛇钉刺 (清洁术)", -- [21]
				"蒜头妹妹 dispels 蒜头妹妹 毒蛇钉刺 (清洁术)", -- [22]
				"蒜头妹妹 dispels 蒜头妹妹 腐蚀术 (清洁术)", -- [23]
				"蒜头妹妹 dispels 蒜头妹妹 腐蚀术 (清洁术)", -- [24]
				"打你屁屁 肉搏 蒜头妹妹 Hit -37 (Physical)", -- [25]
				"尼罗恩 肉搏 蒜头妹妹 Hit -40 (Physical)", -- [26]
				"芋头妹妹 牺牲祝福 蒜头妹妹 Split -55 (Holy)", -- [27]
				"芋头妹妹 牺牲祝福 蒜头妹妹 Split -23 (Holy)", -- [28]
				"芋头妹妹 牺牲祝福 蒜头妹妹 Split -55 (Holy)", -- [29]
				"芋头妹妹 牺牲祝福 蒜头妹妹 Split -21 (Holy)", -- [30]
				"芋头妹妹 牺牲祝福 蒜头妹妹 Split -55 (Holy)", -- [31]
				"蒜头妹妹 圣光术 才等等-逐风者 Hit +1707", -- [32]
				"蒜头妹妹 dispels 才等等-逐风者 猎人印记 (清洁术)", -- [33]
				"蒜头妹妹 dispels 总是那么无奈 蝰蛇钉刺 (清洁术)", -- [34]
				"蒜头妹妹 dispels 总是那么无奈 腐蚀术 (清洁术)", -- [35]
				"蒜头妹妹 圣光术 芋头妹妹 Hit +1804 (103 过量治疗)", -- [36]
				"蒜头妹妹 dispels 总是那么无奈 蝰蛇钉刺 (清洁术)", -- [37]
				"打架-黑龙费尔默 多重射击 蒜头妹妹 Hit -196 (Physical)", -- [38]
				"蒜头妹妹 圣光闪现 才等等-逐风者 Hit +579", -- [39]
				"蒜头妹妹 圣光闪现 特变电工 Crit +873", -- [40]
				"蒜头妹妹 圣光闪现 才等等-逐风者 Hit +589", -- [41]
				"Environment Falling 蒜头妹妹 Hit -330 (Physical)", -- [42]
				"断水流-黑龙费尔默 肉搏 蒜头妹妹 Immune (1)", -- [43]
				"蒜头妹妹 奉献 (伤害/跳) 尼罗恩 Tick -54 (Holy)", -- [44]
				"蒜头妹妹 奉献 (伤害/跳) 断水流-黑龙费尔默 Tick -65 (Holy)", -- [45]
				"蒜头妹妹 奉献 (伤害/跳) 攻速一点二 Tick -53 (Holy)", -- [46]
				"尼罗恩 肉搏 蒜头妹妹 Hit -50 (Physical)", -- [47]
				"蒜头妹妹 奉献 (伤害/跳) 尼罗恩 Tick -54 (Holy)", -- [48]
				"蒜头妹妹 圣光闪现 蒜头妹妹 Hit +584", -- [49]
				"尼罗恩 肉搏 蒜头妹妹 Hit -55 (Physical)", -- [50]
			},
			["Name"] = "蒜头妹妹",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				16716.934, -- [1]
				16717.035, -- [2]
				16718.035, -- [3]
				16718.151, -- [4]
				16718.935, -- [5]
				16719.035, -- [6]
				16720.035, -- [7]
				16720.318, -- [8]
				16720.451, -- [9]
				16720.935, -- [10]
				16722.818, -- [11]
				16724.318, -- [12]
				16725.068, -- [13]
				16725.835, -- [14]
				16725.985, -- [15]
				16725.985, -- [16]
				16727.368, -- [17]
				16727.519, -- [18]
				16727.985, -- [19]
				16728.068, -- [20]
				16729.419, -- [21]
				16729.419, -- [22]
				16729.419, -- [23]
				16729.419, -- [24]
				16730.852, -- [25]
				16731.235, -- [26]
				16817.274, -- [27]
				16817.657, -- [28]
				16818.307, -- [29]
				16818.324, -- [30]
				16818.974, -- [31]
				16842.509, -- [32]
				16843.342, -- [33]
				16845.192, -- [34]
				16845.192, -- [35]
				16851.976, -- [36]
				16852.726, -- [37]
				16853.626, -- [38]
				16858.643, -- [39]
				16860.143, -- [40]
				16862.043, -- [41]
				17023.552, -- [42]
				17120.275, -- [43]
				16714.034, -- [44]
				16714.051, -- [45]
				16714.051, -- [46]
				16714.634, -- [47]
				16715.034, -- [48]
				16716.068, -- [49]
				16716.651, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["智慧祝福"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
						["智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 120,
								},
							},
							["amount"] = 120,
						},
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 120,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["尼罗恩"] = {
									["count"] = 21,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 6,
								},
								["攻速一点二"] = {
									["count"] = 6,
								},
							},
							["amount"] = 33,
						},
					},
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["才等等-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
								["圣光术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["尼罗恩"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 7.98,
								},
							},
							["amount"] = 7.98,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 0.02,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 4042,
					["Overhealing"] = 103,
					["ElementTaken"] = {
						["Physical"] = 2078,
						["Melee"] = 1863,
						["Nature"] = 101,
					},
					["DOT_Time"] = 33,
					["Damage"] = 614,
					["TimeHeal"] = 18,
					["Dispels"] = 12,
					["ElementDone"] = {
						["Holy"] = 614,
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["智慧祝福"] = {
									["count"] = 240,
								},
								["启发"] = {
									["count"] = 280,
								},
								["强效智慧祝福"] = {
									["count"] = 600,
								},
							},
							["amount"] = 1120,
						},
					},
					["WhoDamaged"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 196,
								},
							},
							["amount"] = 196,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
								["自动射击"] = {
									["count"] = 163,
								},
							},
							["amount"] = 264,
						},
						["打你屁屁"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 107,
								},
								["肉搏"] = {
									["count"] = 287,
								},
							},
							["amount"] = 394,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 330,
								},
							},
							["amount"] = 330,
						},
						["原子弹"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 73,
								},
							},
							["amount"] = 73,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 326,
								},
								["拦截昏迷"] = {
									["count"] = 43,
								},
								["肉搏"] = {
									["count"] = 1267,
								},
							},
							["amount"] = 1636,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 236,
								},
							},
							["amount"] = 236,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 263,
								},
								["自动射击"] = {
									["count"] = 650,
								},
							},
							["amount"] = 913,
						},
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["才等等-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
								["圣光术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Dispelled"] = 4,
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["献祭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["腐蚀术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
					},
					["ManaGained"] = {
						["智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 240,
								},
							},
							["amount"] = 240,
						},
						["启发"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 280,
								},
							},
							["amount"] = 280,
						},
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 600,
								},
							},
							["amount"] = 600,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["献祭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["腐蚀术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 26,
					["WhoDispelled"] = {
						["尼罗恩"] = {
							["Details"] = {
								["奥术智慧 (吞噬魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
								["毒蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["Heals"] = {
						["圣光术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1707,
									["min"] = 1701,
									["count"] = 2,
									["amount"] = 3408,
								},
							},
							["count"] = 2,
							["amount"] = 3408,
						},
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 873,
									["min"] = 865,
									["count"] = 2,
									["amount"] = 1738,
								},
								["Hit"] = {
									["max"] = 589,
									["min"] = 556,
									["count"] = 8,
									["amount"] = 4588,
								},
							},
							["count"] = 10,
							["amount"] = 6326,
						},
					},
					["OverHeals"] = {
						["圣光术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 103,
									["min"] = 103,
									["count"] = 1,
									["amount"] = 103,
								},
							},
							["count"] = 1,
							["amount"] = 103,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1429,
								},
							},
							["amount"] = 1429,
						},
						["才等等-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1168,
								},
								["圣光术"] = {
									["count"] = 1707,
								},
							},
							["amount"] = 2875,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1701,
								},
								["圣光闪现"] = {
									["count"] = 1166,
								},
							},
							["amount"] = 2867,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2007,
								},
							},
							["amount"] = 2007,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 556,
								},
							},
							["amount"] = 556,
						},
					},
					["Healing"] = 9734,
					["WhoHealed"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2007,
								},
							},
							["amount"] = 2007,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 17,
								},
							},
							["amount"] = 19,
						},
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 65,
									["min"] = 53,
									["count"] = 11,
									["amount"] = 614,
								},
							},
							["count"] = 11,
							["amount"] = 614,
						},
					},
					["HealingTaken"] = 2007,
					["ElementHitsDone"] = {
						["Holy"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 11,
								},
							},
							["amount"] = 11,
						},
					},
					["TimeDamage"] = 8,
					["TimeDamaging"] = {
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 0.02,
						},
						["尼罗恩"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 7.98,
								},
							},
							["amount"] = 7.98,
						},
					},
					["ManaGain"] = 1120,
					["DamagedWho"] = {
						["尼罗恩"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 377,
								},
							},
							["amount"] = 377,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 130,
								},
							},
							["amount"] = 130,
						},
						["攻速一点二"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 107,
								},
							},
							["amount"] = 107,
						},
					},
					["DispelledWho"] = {
						["总是那么无奈"] = {
							["Details"] = {
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 2,
								},
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["才等等-逐风者"] = {
							["Details"] = {
								["猎人印记 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["猎人印记 (清洁术)"] = {
									["count"] = 1,
								},
								["翼龙钉刺 (清洁术)"] = {
									["count"] = 1,
								},
								["献祭 (清洁术)"] = {
									["count"] = 1,
								},
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["我是老毕-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["蒜头妹妹"] = {
							["Details"] = {
								["腐蚀术 (清洁术)"] = {
									["count"] = 1,
								},
								["蝰蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
								["毒蛇钉刺 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
				},
			},
			["UnitLockout"] = 16816.29,
			["LastActive"] = 17134.292,
		},
		["小猛哥-逐风者"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
					},
					["Messages"] = {
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Miss (1)", -- [1]
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Hit -46 (Physical)", -- [2]
						"Chop 毒蛇钉刺 (伤害/跳) 小猛哥-逐风者 Tick -101 (Nature)", -- [3]
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Miss (1)", -- [4]
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Crit -312 (Physical)", -- [5]
						"小猛哥-逐风者 肉搏 帅哥祖师爷龙-逐风者 Hit -234 (Physical)", -- [6]
						"猎蝶兽兽-黑龙费尔默 多重射击 小猛哥-逐风者 Crit -808 (Physical)", -- [7]
						"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -249 (Physical)", -- [8]
						"帅哥祖师爷龙-逐风者 邪恶攻击 小猛哥-逐风者 Hit -208 (Physical)", -- [9]
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Hit -54 (Physical)", -- [10]
						"猎蝶兽兽-黑龙费尔默 奥术射击 小猛哥-逐风者 Hit -189 (Arcane)", -- [11]
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Dodge (1)", -- [12]
						"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -232 (Physical)", -- [13]
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Crit -102 (Physical)", -- [14]
						"小猛哥-逐风者 猛禽一击 帅哥祖师爷龙-逐风者 Dodge (Physical)", -- [15]
						"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Hit -58 (Physical)", -- [16]
						"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -247 (Physical)", -- [17]
						"小猛哥-逐风者死亡。", -- [18]
					},
					["DeathAt"] = 17144.293,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
					},
					["MessageTimes"] = {
						-12.88400000000183, -- [1]
						-12.66800000000148, -- [2]
						-11.58400000000256, -- [3]
						-11.26699999999983, -- [4]
						-7.780000000002474, -- [5]
						-4.766999999999825, -- [6]
						-4.600000000002183, -- [7]
						-4.317000000002736, -- [8]
						-4.100000000002183, -- [9]
						-3.766999999999825, -- [10]
						-3.717000000000553, -- [11]
						-2.75, -- [12]
						-2.167000000001281, -- [13]
						-1.850000000002183, -- [14]
						-1.467000000000553, -- [15]
						-0.4500000000007276, -- [16]
						-0.01699999999982538, -- [17]
						0, -- [18]
					},
					["HealthMax"] = {
						3557, -- [1]
						3557, -- [2]
						3557, -- [3]
						3557, -- [4]
						3557, -- [5]
						3557, -- [6]
						3557, -- [7]
						3557, -- [8]
						3557, -- [9]
						3557, -- [10]
						3557, -- [11]
						3557, -- [12]
						3557, -- [13]
						3557, -- [14]
						3557, -- [15]
						3557, -- [16]
						3557, -- [17]
						3557, -- [18]
					},
					["Health"] = {
						2574, -- [1]
						2574, -- [2]
						2599, -- [3]
						2498, -- [4]
						2498, -- [5]
						1989, -- [6]
						1989, -- [7]
						1181, -- [8]
						932, -- [9]
						724, -- [10]
						724, -- [11]
						481, -- [12]
						552, -- [13]
						320, -- [14]
						320, -- [15]
						218, -- [16]
						160, -- [17]
						0, -- [18]
					},
					["KilledBy"] = "猎蝶兽兽-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"MISC", -- [18]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						false, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
					},
					["Messages"] = {
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -61 (Shadow)", -- [1]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -105 (Shadow)", -- [2]
						"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 小猛哥-逐风者 Tick -125 (Fire)", -- [3]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -147 (Shadow)", -- [4]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -106 (Shadow)", -- [5]
						"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 小猛哥-逐风者 Tick -125 (Fire)", -- [6]
						"小猛哥-逐风者 自动射击 锘一-逐风者 Hit -234 (Physical)", -- [7]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -147 (Shadow)", -- [8]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -105 (Shadow)", -- [9]
						"小猛哥-逐风者 奥术射击 残缺一梦-火妖鲁西弗隆 Hit -96 (46 被抵抗) (Arcane)", -- [10]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -106 (Shadow)", -- [11]
						"小猛哥-逐风者 自动射击 残缺一梦-火妖鲁西弗隆 Hit -177 (Physical)", -- [12]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -147 (Shadow)", -- [13]
						"小猛哥-逐风者 多重射击 残缺一梦-火妖鲁西弗隆 Hit -219 (Physical)", -- [14]
						"小猛哥-逐风者 多重射击 豹 Hit -214 (Physical)", -- [15]
						"小猛哥-逐风者 多重射击 尼罗恩 Hit -294 (Physical)", -- [16]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -150 (Shadow)", -- [17]
						"小猛哥-逐风者 自动射击 残缺一梦-火妖鲁西弗隆 Miss (Physical)", -- [18]
						"豹 肉搏 小猛哥-逐风者 Hit -69 (Physical)", -- [19]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -151 (Shadow)", -- [20]
						"豹 爪击 小猛哥-逐风者 Crit -106 (Physical)", -- [21]
						"小猛哥-逐风者死亡。", -- [22]
					},
					["DeathAt"] = 17057.304,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
					},
					["MessageTimes"] = {
						-12.20100000000093, -- [1]
						-10.20100000000093, -- [2]
						-10.11799999999857, -- [3]
						-9.701000000000931, -- [4]
						-8.201000000000931, -- [5]
						-7.11699999999837, -- [6]
						-6.917000000001281, -- [7]
						-6.701000000000931, -- [8]
						-6.184000000001106, -- [9]
						-4.701000000000931, -- [10]
						-4.201000000000931, -- [11]
						-4.167000000001281, -- [12]
						-3.700000000000728, -- [13]
						-2.583999999998923, -- [14]
						-2.549999999999272, -- [15]
						-2.5, -- [16]
						-2.200000000000728, -- [17]
						-1.033999999999651, -- [18]
						-0.3339999999989232, -- [19]
						-0.2000000000007276, -- [20]
						-0.01699999999982538, -- [21]
						0, -- [22]
					},
					["HealthMax"] = {
						3557, -- [1]
						3557, -- [2]
						3557, -- [3]
						3557, -- [4]
						3557, -- [5]
						3557, -- [6]
						3557, -- [7]
						3557, -- [8]
						3557, -- [9]
						3557, -- [10]
						3557, -- [11]
						3557, -- [12]
						3557, -- [13]
						3557, -- [14]
						3557, -- [15]
						3557, -- [16]
						3557, -- [17]
						3557, -- [18]
						3557, -- [19]
						3557, -- [20]
						3557, -- [21]
						3557, -- [22]
					},
					["Health"] = {
						1437, -- [1]
						1406, -- [2]
						1372, -- [3]
						1247, -- [4]
						1100, -- [5]
						994, -- [6]
						869, -- [7]
						869, -- [8]
						722, -- [9]
						617, -- [10]
						617, -- [11]
						511, -- [12]
						511, -- [13]
						364, -- [14]
						364, -- [15]
						364, -- [16]
						364, -- [17]
						214, -- [18]
						214, -- [19]
						216, -- [20]
						65, -- [21]
						0, -- [22]
					},
					["KilledBy"] = "豹",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"MISC", -- [22]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						false, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
					},
					["Messages"] = {
						"小猛哥-逐风者 奥术射击 猎蝶兽兽-黑龙费尔默 Hit -183 (Arcane)", -- [1]
						"猎蝶兽兽-黑龙费尔默 多重射击 小猛哥-逐风者 Crit -699 (Physical)", -- [2]
						"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -233 (Physical)", -- [3]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -146 (Shadow)", -- [4]
						"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -98 (Nature)", -- [5]
						"断水流-黑龙费尔默 肉搏 小猛哥-逐风者 Hit -345 (Physical)", -- [6]
						"断水流-黑龙费尔默 断筋 小猛哥-逐风者 Hit -29 (Physical)", -- [7]
						"猎蝶兽兽-黑龙费尔默 奥术射击 小猛哥-逐风者 Hit -189 (Arcane)", -- [8]
						"小猛哥-逐风者 自动射击 猎蝶兽兽-黑龙费尔默 Hit -187 (Physical)", -- [9]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -61 (Shadow)", -- [10]
						"小猛哥-逐风者 多重射击 风蛇 Hit -225 (Physical)", -- [11]
						"小猛哥-逐风者 多重射击 残缺一梦-火妖鲁西弗隆 Hit -247 (Physical)", -- [12]
						"尼罗恩 肉搏 小猛哥-逐风者 Hit -86 (Physical)", -- [13]
						"小猛哥-逐风者 多重射击 猎蝶兽兽-黑龙费尔默 Hit -265 (Physical)", -- [14]
						"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -253 (Physical)", -- [15]
						"锘一-逐风者 多重射击 小猛哥-逐风者 Hit -365 (Physical)", -- [16]
						"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -60 (Shadow)", -- [17]
						"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -146 (Shadow)", -- [18]
						"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -98 (Nature)", -- [19]
						"尼罗恩 肉搏 小猛哥-逐风者 Hit -88 (Physical)", -- [20]
						"断水流-黑龙费尔默 肉搏 小猛哥-逐风者 Hit -360 (Physical)", -- [21]
						"风蛇 闪电吐息 小猛哥-逐风者 Resist (Nature)", -- [22]
						"断水流-黑龙费尔默 斩杀 小猛哥-逐风者 Hit -637 (Physical)", -- [23]
						"小猛哥-逐风者死亡。", -- [24]
						"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 猎蝶兽兽-黑龙费尔默 Tick -98 (Nature)", -- [25]
					},
					["DeathAt"] = 16815.29,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
					},
					["MessageTimes"] = {
						-5.867999999998574, -- [1]
						-4.934000000001106, -- [2]
						-4.766999999999825, -- [3]
						-4.550999999999476, -- [4]
						-4.384000000001834, -- [5]
						-4.184000000001106, -- [6]
						-3.934000000001106, -- [7]
						-3.917000000001281, -- [8]
						-3.884000000001834, -- [9]
						-3.717000000000553, -- [10]
						-3.201000000000931, -- [11]
						-3.151000000001659, -- [12]
						-3.151000000001659, -- [13]
						-3.134000000001834, -- [14]
						-2.566999999999098, -- [15]
						-2.217000000000553, -- [16]
						-1.717000000000553, -- [17]
						-1.549999999999272, -- [18]
						-1.401000000001659, -- [19]
						-1.134000000001834, -- [20]
						-0.7510000000002037, -- [21]
						-0.6500000000014552, -- [22]
						-0.01699999999982538, -- [23]
						0, -- [24]
						1.615999999998167, -- [25]
					},
					["HealthMax"] = {
						3557, -- [1]
						3557, -- [2]
						3557, -- [3]
						3557, -- [4]
						3557, -- [5]
						3557, -- [6]
						3557, -- [7]
						3557, -- [8]
						3557, -- [9]
						3557, -- [10]
						3557, -- [11]
						3557, -- [12]
						3557, -- [13]
						3557, -- [14]
						3557, -- [15]
						3557, -- [16]
						3557, -- [17]
						3557, -- [18]
						3557, -- [19]
						3557, -- [20]
						3557, -- [21]
						3557, -- [22]
						3557, -- [23]
						3557, -- [24]
						3557, -- [25]
					},
					["Health"] = {
						3557, -- [1]
						3557, -- [2]
						2858, -- [3]
						2625, -- [4]
						2625, -- [5]
						2479, -- [6]
						2134, -- [7]
						2134, -- [8]
						1916, -- [9]
						1916, -- [10]
						1855, -- [11]
						1855, -- [12]
						1855, -- [13]
						1855, -- [14]
						1769, -- [15]
						1516, -- [16]
						1151, -- [17]
						1151, -- [18]
						945, -- [19]
						945, -- [20]
						857, -- [21]
						497, -- [22]
						497, -- [23]
						0, -- [24]
						1, -- [25]
					},
					["KilledBy"] = "断水流-黑龙费尔默",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"MISC", -- [24]
						"DAMAGE", -- [25]
					},
				}, -- [3]
			},
			["LastEventHealth"] = {
				3557, -- [1]
				3557, -- [2]
				3557, -- [3]
				3557, -- [4]
				3557, -- [5]
				1437, -- [6]
				1406, -- [7]
				1372, -- [8]
				1247, -- [9]
				1100, -- [10]
				994, -- [11]
				869, -- [12]
				869, -- [13]
				722, -- [14]
				617, -- [15]
				617, -- [16]
				511, -- [17]
				511, -- [18]
				364, -- [19]
				364, -- [20]
				364, -- [21]
				364, -- [22]
				214, -- [23]
				214, -- [24]
				216, -- [25]
				65, -- [26]
				0, -- [27]
				0, -- [28]
				0, -- [29]
				1, -- [30]
				1, -- [31]
				1, -- [32]
				2574, -- [33]
				2574, -- [34]
				2599, -- [35]
				2498, -- [36]
				2498, -- [37]
				1989, -- [38]
				1989, -- [39]
				1181, -- [40]
				932, -- [41]
				724, -- [42]
				724, -- [43]
				481, -- [44]
				552, -- [45]
				320, -- [46]
				320, -- [47]
				218, -- [48]
				160, -- [49]
				0, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"MISC", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"MISC", -- [50]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					8246, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["ActiveTime"] = {
					48.94, -- [1]
				},
				["TimeDamage"] = {
					48.94, -- [1]
				},
				["ManaGain"] = {
					360, -- [1]
				},
				["DOT_Time"] = {
					48, -- [1]
				},
				["Damage"] = {
					8404, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["LastDamageTaken"] = 247,
			["level"] = 60,
			["LastDamageAbility"] = "自动射击",
			["LastFightIn"] = 4,
			["GUID"] = "Player-5451-03127DC9",
			["type"] = "Grouped",
			["TimeLast"] = {
				["OVERALL"] = 17142.293,
				["DamageTaken"] = 17142.293,
				["DeathCount"] = 17142.293,
				["Healing"] = 16692.3,
				["ActiveTime"] = 17141.293,
				["TimeDamage"] = 17141.293,
				["ManaGain"] = 16730.302,
				["DOT_Time"] = 17070.289,
				["Damage"] = 17137.292,
			},
			["unit"] = true,
			["LastEventHealthMax"] = {
				3557, -- [1]
				3557, -- [2]
				3557, -- [3]
				3557, -- [4]
				3557, -- [5]
				3557, -- [6]
				3557, -- [7]
				3557, -- [8]
				3557, -- [9]
				3557, -- [10]
				3557, -- [11]
				3557, -- [12]
				3557, -- [13]
				3557, -- [14]
				3557, -- [15]
				3557, -- [16]
				3557, -- [17]
				3557, -- [18]
				3557, -- [19]
				3557, -- [20]
				3557, -- [21]
				3557, -- [22]
				3557, -- [23]
				3557, -- [24]
				3557, -- [25]
				3557, -- [26]
				3557, -- [27]
				3557, -- [28]
				3557, -- [29]
				3557, -- [30]
				3557, -- [31]
				3557, -- [32]
				3557, -- [33]
				3557, -- [34]
				3557, -- [35]
				3557, -- [36]
				3557, -- [37]
				3557, -- [38]
				3557, -- [39]
				3557, -- [40]
				3557, -- [41]
				3557, -- [42]
				3557, -- [43]
				3557, -- [44]
				3557, -- [45]
				3557, -- [46]
				3557, -- [47]
				3557, -- [48]
				3557, -- [49]
				3557, -- [50]
			},
			["Owner"] = false,
			["Pet"] = {
				"豹 <小猛哥-逐风者>", -- [1]
			},
			["NextEventNum"] = 1,
			["LastDamageTime"] = 17141.576,
			["LastEvents"] = {
				"小猛哥-逐风者 多重射击 打架-黑龙费尔默 Hit -287 (Physical)", -- [1]
				"小猛哥-逐风者 多重射击 攻速一点二 Miss (Physical)", -- [2]
				"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 打架-黑龙费尔默 Tick -98 (Nature)", -- [3]
				"小猛哥-逐风者 奥术射击 打架-黑龙费尔默 Hit -183 (Arcane)", -- [4]
				"小猛哥-逐风者 自动射击 打架-黑龙费尔默 Miss (Physical)", -- [5]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -61 (Shadow)", -- [6]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -105 (Shadow)", -- [7]
				"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 小猛哥-逐风者 Tick -125 (Fire)", -- [8]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -147 (Shadow)", -- [9]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -106 (Shadow)", -- [10]
				"残缺一梦-火妖鲁西弗隆 献祭 (伤害/跳) 小猛哥-逐风者 Tick -125 (Fire)", -- [11]
				"小猛哥-逐风者 自动射击 锘一-逐风者 Hit -234 (Physical)", -- [12]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -147 (Shadow)", -- [13]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -105 (Shadow)", -- [14]
				"小猛哥-逐风者 奥术射击 残缺一梦-火妖鲁西弗隆 Hit -96 (46 被抵抗) (Arcane)", -- [15]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -106 (Shadow)", -- [16]
				"小猛哥-逐风者 自动射击 残缺一梦-火妖鲁西弗隆 Hit -177 (Physical)", -- [17]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) 小猛哥-逐风者 Tick -147 (Shadow)", -- [18]
				"小猛哥-逐风者 多重射击 残缺一梦-火妖鲁西弗隆 Hit -219 (Physical)", -- [19]
				"小猛哥-逐风者 多重射击 豹 Hit -214 (Physical)", -- [20]
				"小猛哥-逐风者 多重射击 尼罗恩 Hit -294 (Physical)", -- [21]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -150 (Shadow)", -- [22]
				"小猛哥-逐风者 自动射击 残缺一梦-火妖鲁西弗隆 Miss (Physical)", -- [23]
				"豹 肉搏 小猛哥-逐风者 Hit -69 (Physical)", -- [24]
				"残缺一梦-火妖鲁西弗隆 痛苦诅咒 (伤害/跳) 小猛哥-逐风者 Tick -151 (Shadow)", -- [25]
				"豹 爪击 小猛哥-逐风者 Crit -106 (Physical)", -- [26]
				"小猛哥-逐风者死亡。", -- [27]
				"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -69 (Nature)", -- [28]
				"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -69 (Nature)", -- [29]
				"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -69 (Nature)", -- [30]
				"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -69 (Nature)", -- [31]
				"小猛哥-逐风者 毒蛇钉刺 (伤害/跳) 残缺一梦-火妖鲁西弗隆 Tick -69 (Nature)", -- [32]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Miss (1)", -- [33]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Hit -46 (Physical)", -- [34]
				"Chop 毒蛇钉刺 (伤害/跳) 小猛哥-逐风者 Tick -101 (Nature)", -- [35]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Miss (1)", -- [36]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Crit -312 (Physical)", -- [37]
				"小猛哥-逐风者 肉搏 帅哥祖师爷龙-逐风者 Hit -234 (Physical)", -- [38]
				"猎蝶兽兽-黑龙费尔默 多重射击 小猛哥-逐风者 Crit -808 (Physical)", -- [39]
				"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -249 (Physical)", -- [40]
				"帅哥祖师爷龙-逐风者 邪恶攻击 小猛哥-逐风者 Hit -208 (Physical)", -- [41]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Hit -54 (Physical)", -- [42]
				"猎蝶兽兽-黑龙费尔默 奥术射击 小猛哥-逐风者 Hit -189 (Arcane)", -- [43]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Dodge (1)", -- [44]
				"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -232 (Physical)", -- [45]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Crit -102 (Physical)", -- [46]
				"小猛哥-逐风者 猛禽一击 帅哥祖师爷龙-逐风者 Dodge (Physical)", -- [47]
				"帅哥祖师爷龙-逐风者 肉搏 小猛哥-逐风者 Hit -58 (Physical)", -- [48]
				"猎蝶兽兽-黑龙费尔默 自动射击 小猛哥-逐风者 Hit -247 (Physical)", -- [49]
				"小猛哥-逐风者死亡。", -- [50]
			},
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				false, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				false, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["Name"] = "小猛哥-逐风者",
			["LastEventTimes"] = {
				16861.426, -- [1]
				16861.743, -- [2]
				16862.16, -- [3]
				16862.61, -- [4]
				16863.86, -- [5]
				17043.587, -- [6]
				17045.587, -- [7]
				17045.67, -- [8]
				17046.087, -- [9]
				17047.587, -- [10]
				17048.671, -- [11]
				17048.871, -- [12]
				17049.087, -- [13]
				17049.604, -- [14]
				17051.087, -- [15]
				17051.587, -- [16]
				17051.621, -- [17]
				17052.088, -- [18]
				17053.204, -- [19]
				17053.238, -- [20]
				17053.288, -- [21]
				17053.588, -- [22]
				17054.754, -- [23]
				17055.454, -- [24]
				17055.588, -- [25]
				17055.771, -- [26]
				17055.788, -- [27]
				17058.471, -- [28]
				17061.455, -- [29]
				17064.472, -- [30]
				17067.455, -- [31]
				17070.455, -- [32]
				17130.159, -- [33]
				17130.375, -- [34]
				17131.459, -- [35]
				17131.776, -- [36]
				17135.263, -- [37]
				17138.276, -- [38]
				17138.443, -- [39]
				17138.726, -- [40]
				17138.943, -- [41]
				17139.276, -- [42]
				17139.326, -- [43]
				17140.293, -- [44]
				17140.876, -- [45]
				17141.193, -- [46]
				17141.576, -- [47]
				17142.593, -- [48]
				17143.026, -- [49]
				17143.043, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2606,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 8,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Arcane"] = 189,
						["Physical"] = 1744,
						["Melee"] = 572,
						["Nature"] = 101,
					},
					["DOT_Time"] = 0,
					["Damage"] = 234,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 234,
					},
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 234,
								},
							},
							["amount"] = 234,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 208,
								},
								["肉搏"] = {
									["count"] = 572,
								},
							},
							["amount"] = 780,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
							},
							["amount"] = 101,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 728,
								},
								["多重射击"] = {
									["count"] = 808,
								},
								["奥术射击"] = {
									["count"] = 189,
								},
							},
							["amount"] = 1725,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["猛禽一击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 234,
									["min"] = 234,
									["count"] = 1,
									["amount"] = 234,
								},
							},
							["count"] = 1,
							["amount"] = 234,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 3,
					["TimeDamaging"] = {
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["打架-黑龙费尔默"] = {
									["count"] = 3,
								},
								["断水流-黑龙费尔默"] = {
									["count"] = 18,
								},
								["猎蝶兽兽-黑龙费尔默"] = {
									["count"] = 12,
								},
								["残缺一梦-火妖鲁西弗隆"] = {
									["count"] = 15,
								},
							},
							["amount"] = 48,
						},
					},
					["ElementDoneResist"] = {
						["Arcane"] = 46,
						["Nature"] = 24,
					},
					["TimeSpent"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.42,
								},
								["自动射击"] = {
									["count"] = 2.75,
								},
								["多重射击"] = {
									["count"] = 1.2,
								},
								["奥术射击"] = {
									["count"] = 0.45,
								},
							},
							["amount"] = 4.82,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.55,
								},
								["自动射击"] = {
									["count"] = 2,
								},
							},
							["amount"] = 12.55,
						},
						["风蛇"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 0.68,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 9,
								},
								["奥术射击"] = {
									["count"] = 0.6,
								},
								["自动射击"] = {
									["count"] = 5.7,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
								["瞄准射击"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 15.84,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["打你屁屁"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 0.65,
						},
						["攻速一点二"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.32,
								},
							},
							["amount"] = 0.32,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["尼罗恩"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 0.05,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 0.03,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 5.98,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.02,
								},
								["自动射击"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 8,
						},
					},
					["DamageTaken"] = 8246,
					["PartialResist"] = {
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 360,
								},
							},
							["amount"] = 360,
						},
					},
					["PartialAbsorb"] = {
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电吐息"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["献祭 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 48.94,
					["ElementTaken"] = {
						["Physical"] = 4148,
						["Melee"] = 1731,
						["Arcane"] = 378,
						["Fire"] = 250,
						["Shadow"] = 1638,
						["Nature"] = 101,
					},
					["DOT_Time"] = 48,
					["Damage"] = 8404,
					["DeathCount"] = 3,
					["Healing"] = 0,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 13,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 12,
								},
							},
							["amount"] = 17,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 14,
								},
							},
							["amount"] = 14,
						},
						["Nature"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["WhoDamaged"] = {
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["献祭 (伤害/跳)"] = {
									["count"] = 250,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 733,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 905,
								},
							},
							["amount"] = 1888,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 29,
								},
								["斩杀"] = {
									["count"] = 637,
								},
								["肉搏"] = {
									["count"] = 705,
								},
							},
							["amount"] = 1371,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 365,
								},
							},
							["amount"] = 365,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 208,
								},
								["肉搏"] = {
									["count"] = 572,
								},
							},
							["amount"] = 780,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 101,
								},
							},
							["amount"] = 101,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1214,
								},
								["多重射击"] = {
									["count"] = 1507,
								},
								["奥术射击"] = {
									["count"] = 378,
								},
							},
							["amount"] = 3099,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 174,
								},
							},
							["amount"] = 174,
						},
						["豹"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 106,
								},
								["肉搏"] = {
									["count"] = 69,
								},
							},
							["amount"] = 175,
						},
						["打你屁屁"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 82,
								},
								["肉搏"] = {
									["count"] = 211,
								},
							},
							["amount"] = 293,
						},
					},
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 119,
									["min"] = 69,
									["count"] = 16,
									["amount"] = 1466,
								},
							},
							["count"] = 16,
							["amount"] = 1466,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 221,
									["min"] = 96,
									["count"] = 5,
									["amount"] = 884,
								},
							},
							["count"] = 5,
							["amount"] = 884,
						},
						["猛禽一击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 543,
									["min"] = 543,
									["count"] = 1,
									["amount"] = 543,
								},
							},
							["count"] = 1,
							["amount"] = 543,
						},
						["自动射击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 449,
									["min"] = 445,
									["count"] = 2,
									["amount"] = 894,
								},
								["Hit"] = {
									["max"] = 234,
									["min"] = 177,
									["count"] = 9,
									["amount"] = 1810,
								},
							},
							["count"] = 13,
							["amount"] = 2704,
						},
						["多重射击"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 599,
									["min"] = 599,
									["count"] = 1,
									["amount"] = 599,
								},
								["Hit"] = {
									["max"] = 294,
									["min"] = 214,
									["count"] = 8,
									["amount"] = 1974,
								},
							},
							["count"] = 10,
							["amount"] = 2573,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 234,
									["min"] = 234,
									["count"] = 1,
									["amount"] = 234,
								},
							},
							["count"] = 1,
							["amount"] = 234,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 18,
								},
							},
							["amount"] = 25,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 16,
								},
							},
							["amount"] = 16,
						},
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 360,
								},
							},
							["amount"] = 360,
						},
					},
					["TimeDamage"] = 48.94,
					["TimeDamaging"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 0.42,
								},
								["自动射击"] = {
									["count"] = 2.75,
								},
								["多重射击"] = {
									["count"] = 1.2,
								},
								["奥术射击"] = {
									["count"] = 0.45,
								},
							},
							["amount"] = 4.82,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.55,
								},
								["自动射击"] = {
									["count"] = 2,
								},
							},
							["amount"] = 12.55,
						},
						["风蛇"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.68,
								},
							},
							["amount"] = 0.68,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 9,
								},
								["奥术射击"] = {
									["count"] = 0.6,
								},
								["自动射击"] = {
									["count"] = 5.7,
								},
								["多重射击"] = {
									["count"] = 0.07,
								},
								["瞄准射击"] = {
									["count"] = 0.47,
								},
							},
							["amount"] = 15.84,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["猛禽一击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["打你屁屁"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.65,
								},
							},
							["amount"] = 0.65,
						},
						["攻速一点二"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.32,
								},
							},
							["amount"] = 0.32,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["尼罗恩"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.05,
								},
							},
							["amount"] = 0.05,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 0.03,
								},
							},
							["amount"] = 0.03,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 5.98,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 0.02,
								},
								["自动射击"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 8,
						},
					},
					["ManaGain"] = 360,
					["DamagedWho"] = {
						["打架-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 98,
								},
								["自动射击"] = {
									["count"] = 211,
								},
								["多重射击"] = {
									["count"] = 287,
								},
								["奥术射击"] = {
									["count"] = 183,
								},
							},
							["amount"] = 779,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 345,
								},
								["奥术射击"] = {
									["count"] = 96,
								},
								["多重射击"] = {
									["count"] = 466,
								},
								["自动射击"] = {
									["count"] = 177,
								},
							},
							["amount"] = 1084,
						},
						["风蛇"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 225,
								},
							},
							["amount"] = 225,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 631,
								},
								["奥术射击"] = {
									["count"] = 422,
								},
								["自动射击"] = {
									["count"] = 1693,
								},
								["多重射击"] = {
									["count"] = 599,
								},
								["瞄准射击"] = {
									["count"] = 543,
								},
							},
							["amount"] = 3888,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 234,
								},
							},
							["amount"] = 234,
						},
						["帅哥祖师爷龙-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 234,
								},
							},
							["amount"] = 234,
						},
						["打你屁屁"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 223,
								},
							},
							["amount"] = 223,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 392,
								},
								["奥术射击"] = {
									["count"] = 183,
								},
								["多重射击"] = {
									["count"] = 265,
								},
								["自动射击"] = {
									["count"] = 187,
								},
							},
							["amount"] = 1027,
						},
						["尼罗恩"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 294,
								},
							},
							["amount"] = 294,
						},
						["豹"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 214,
								},
							},
							["amount"] = 214,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 202,
								},
							},
							["amount"] = 202,
						},
					},
					["ElementDone"] = {
						["Arcane"] = 884,
						["Physical"] = 5820,
						["Melee"] = 234,
						["Nature"] = 1466,
					},
				},
			},
			["UnitLockout"] = 16807.29,
			["LastActive"] = 17142.293,
		},
		["Zhwxd-逐风者"] = {
			["GUID"] = "Player-5451-0309D2C0",
			["TimeLast"] = {
				["TimeHeal"] = 17121.292,
				["Dispelled"] = 16982.3,
				["Dispels"] = 16846.292,
				["OVERALL"] = 17131.292,
				["DamageTaken"] = 17121.292,
				["Absorbs"] = 17121.292,
				["HealingTaken"] = 17131.292,
				["ActiveTime"] = 17121.292,
				["ManaGain"] = 16727.302,
				["TimeDamage"] = 16984.3,
				["Damage"] = 16984.3,
			},
			["LastAttackedBy"] = "爱恨情仇-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"HEAL", -- [7]
				"HEAL", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"HEAL", -- [30]
				"MISC", -- [31]
				"DAMAGE", -- [32]
				"MISC", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"MISC", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"MISC", -- [48]
				"MISC", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					7.78, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["Dispels"] = {
					2, -- [1]
				},
				["DamageTaken"] = {
					5544, -- [1]
				},
				["Absorbs"] = {
					1718, -- [1]
				},
				["HealingTaken"] = {
					3222, -- [1]
				},
				["TimeDamage"] = {
					23.25, -- [1]
				},
				["ManaGain"] = {
					630, -- [1]
				},
				["ActiveTime"] = {
					31.03, -- [1]
				},
				["Damage"] = {
					5951, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "自动射击",
			["LastFightIn"] = 4,
			["type"] = "Grouped",
			["LastEventHealth"] = {
				1605, -- [1]
				582, -- [2]
				2630, -- [3]
				1709, -- [4]
				1709, -- [5]
				1451, -- [6]
				1142, -- [7]
				1410, -- [8]
				1663, -- [9]
				1931, -- [10]
				2750, -- [11]
				2750, -- [12]
				2750, -- [13]
				2750, -- [14]
				2699, -- [15]
				2699, -- [16]
				2598, -- [17]
				2598, -- [18]
				2598, -- [19]
				2598, -- [20]
				2598, -- [21]
				2598, -- [22]
				2326, -- [23]
				2178, -- [24]
				2031, -- [25]
				1953, -- [26]
				1852, -- [27]
				1852, -- [28]
				1852, -- [29]
				1852, -- [30]
				2408, -- [31]
				2630, -- [32]
				2630, -- [33]
				2630, -- [34]
				2630, -- [35]
				2630, -- [36]
				2630, -- [37]
				2630, -- [38]
				2630, -- [39]
				2630, -- [40]
				2630, -- [41]
				2630, -- [42]
				2630, -- [43]
				2091, -- [44]
				2091, -- [45]
				1872, -- [46]
				1543, -- [47]
				1605, -- [48]
				1605, -- [49]
				1605, -- [50]
			},
			["LastHealTime"] = 17121.308,
			["LastDamageTaken"] = 325,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				2630, -- [1]
				2630, -- [2]
				2630, -- [3]
				2630, -- [4]
				2630, -- [5]
				2630, -- [6]
				2630, -- [7]
				2630, -- [8]
				2630, -- [9]
				2630, -- [10]
				2750, -- [11]
				2750, -- [12]
				2750, -- [13]
				2750, -- [14]
				2750, -- [15]
				2750, -- [16]
				2750, -- [17]
				2750, -- [18]
				2750, -- [19]
				2750, -- [20]
				2750, -- [21]
				2750, -- [22]
				2750, -- [23]
				2750, -- [24]
				2750, -- [25]
				2750, -- [26]
				2750, -- [27]
				2750, -- [28]
				2750, -- [29]
				2750, -- [30]
				2750, -- [31]
				2630, -- [32]
				2630, -- [33]
				2630, -- [34]
				2630, -- [35]
				2630, -- [36]
				2630, -- [37]
				2630, -- [38]
				2630, -- [39]
				2630, -- [40]
				2630, -- [41]
				2630, -- [42]
				2630, -- [43]
				2630, -- [44]
				2630, -- [45]
				2630, -- [46]
				2630, -- [47]
				2630, -- [48]
				2630, -- [49]
				2630, -- [50]
			},
			["NextEventNum"] = 11,
			["LastDamageTime"] = 16984.9,
			["LastEvents"] = {
				"冰箱里的肉 火焰冲击 Zhwxd-逐风者 Hit -502 (Fire)", -- [1]
				"Zhwxd-逐风者 冰霜新星 狐狸不吃鱼-黑龙费尔默 Hit -27 (Frost)", -- [2]
				"Environment Falling Zhwxd-逐风者 Hit -181 (Physical)", -- [3]
				"爱恨情仇-黑龙费尔默 肉搏 Zhwxd-逐风者 Absorb -859 (1)", -- [4]
				"爱恨情仇-黑龙费尔默 多重射击 Zhwxd-逐风者 Crit -258 (859 被吸收) (Physical)", -- [5]
				"爱恨情仇-黑龙费尔默 自动射击 Zhwxd-逐风者 Hit -325 (Physical)", -- [6]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [7]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [8]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [9]
				"布雷斯塔-逐风者 回春术 Zhwxd-逐风者 Tick +237", -- [10]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) Zhwxd-逐风者 Absorb -146 (146 被吸收) (Shadow)", -- [11]
				"尼罗恩 肉搏 Zhwxd-逐风者 Absorb -115 (1)", -- [12]
				"尼罗恩 肉搏 Zhwxd-逐风者 Crit -51 (115 被吸收) (Physical)", -- [13]
				"Zhwxd-逐风者 冰冻 尼罗恩 Resist (Frost)", -- [14]
				"Zhwxd-逐风者 火焰冲击 Chop Hit -600 (Fire)", -- [15]
				"Chop 毒蛇钉刺 (伤害/跳) Zhwxd-逐风者 Tick -101 (Nature)", -- [16]
				"Zhwxd-逐风者 冰锥术 Chop Hit -534 (Frost)", -- [17]
				"攻速一点二 肉搏 Zhwxd-逐风者 Crit -115 (Physical)", -- [18]
				"Zhwxd-逐风者 冰冻 攻速一点二 Resist (Frost)", -- [19]
				"攻速一点二 撕咬 Zhwxd-逐风者 Hit -53 (Physical)", -- [20]
				"尼罗恩 肉搏 Zhwxd-逐风者 Hit -104 (Physical)", -- [21]
				"Zhwxd-逐风者 冰冻 尼罗恩 Resist (Frost)", -- [22]
				"Chop 驱散射击 Zhwxd-逐风者 Hit -148 (Physical)", -- [23]
				"残缺一梦-火妖鲁西弗隆 腐蚀术 (伤害/跳) Zhwxd-逐风者 Tick -147 (Shadow)", -- [24]
				"原子弹 肉搏 Zhwxd-逐风者 Hit -78 (Physical)", -- [25]
				"Chop 毒蛇钉刺 (伤害/跳) Zhwxd-逐风者 Tick -101 (Nature)", -- [26]
				"打架-黑龙费尔默 暗影箭 Zhwxd-逐风者 Immune (Shadow)", -- [27]
				"打架-黑龙费尔默 多重射击 Zhwxd-逐风者 Immune (Physical)", -- [28]
				"Zhwxd-逐风者 火焰冲击 锘一-逐风者 Hit -599 (Fire)", -- [29]
				"蒜头妹妹 圣光闪现 Zhwxd-逐风者 Hit +556", -- [30]
				"Zhwxd-逐风者 dispels 芋头妹妹 痛苦诅咒 (解除次级诅咒)", -- [31]
				"Zhwxd-逐风者 火焰冲击 残缺一梦-火妖鲁西弗隆 Hit -305 (145 被抵抗) (Fire)", -- [32]
				"Zhwxd-逐风者 dispels 才等等-逐风者 痛苦诅咒 (解除次级诅咒)", -- [33]
				"Zhwxd-逐风者 火焰冲击 冰箱里的肉 Hit -625 (Fire)", -- [34]
				"Zhwxd-逐风者 奥术飞弹 冰箱里的肉 Hit -264 (Arcane)", -- [35]
				"Zhwxd-逐风者 奥术飞弹 冰箱里的肉 Hit -264 (Arcane)", -- [36]
				"Zhwxd-逐风者 奥术飞弹 冰箱里的肉 Hit -264 (Arcane)", -- [37]
				"Zhwxd-逐风者 奥术飞弹 冰箱里的肉 Hit -264 (Arcane)", -- [38]
				"Zhwxd-逐风者 火焰冲击 冰箱里的肉 Absorb -577 (577 被吸收) (Fire)", -- [39]
				"Zhwxd-逐风者 寒冰箭 猎蝶兽兽-黑龙费尔默 Hit -77 (Frost)", -- [40]
				"Zhwxd-逐风者 寒冰箭 猎蝶兽兽-黑龙费尔默 Hit -763 (Frost)", -- [41]
				"Zhwxd-逐风者 寒冰箭 猎蝶兽兽-黑龙费尔默 Hit -756 (Frost)", -- [42]
				"冰箱里的肉 火焰冲击 Zhwxd-逐风者 Hit -539 (Fire)", -- [43]
				"冰箱里的肉 interrupts Zhwxd-逐风者 变形术 (法术反制)", -- [44]
				"冰箱里的肉 奥术飞弹 Zhwxd-逐风者 Hit -219 (Arcane)", -- [45]
				"冰箱里的肉 奥术飞弹 Zhwxd-逐风者 Crit -329 (Arcane)", -- [46]
				"冰箱里的肉 奥术飞弹 Zhwxd-逐风者 Immune (Arcane)", -- [47]
				"狐狸不吃鱼-黑龙费尔默 dispels Zhwxd-逐风者 冰甲术 (净化术)", -- [48]
				"狐狸不吃鱼-黑龙费尔默 dispels Zhwxd-逐风者 寒冰护体 (净化术)", -- [49]
				"狐狸不吃鱼-黑龙费尔默 冰霜震击 Zhwxd-逐风者 Hit -521 (Frost)", -- [50]
			},
			["Name"] = "Zhwxd-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				16983.85, -- [1]
				16984.9, -- [2]
				17021.619, -- [3]
				17121.308, -- [4]
				17121.308, -- [5]
				17121.658, -- [6]
				17122.842, -- [7]
				17125.842, -- [8]
				17128.825, -- [9]
				17131.842, -- [10]
				16688.366, -- [11]
				16688.4, -- [12]
				16688.4, -- [13]
				16688.4, -- [14]
				16688.916, -- [15]
				16689.183, -- [16]
				16690.416, -- [17]
				16690.75, -- [18]
				16690.75, -- [19]
				16690.75, -- [20]
				16690.9, -- [21]
				16690.9, -- [22]
				16691.3, -- [23]
				16691.35, -- [24]
				16692.05, -- [25]
				16692.183, -- [26]
				16693.25, -- [27]
				16694.367, -- [28]
				16698.367, -- [29]
				16698.483, -- [30]
				16703.784, -- [31]
				16840.842, -- [32]
				16846.475, -- [33]
				16930.214, -- [34]
				16935.147, -- [35]
				16936.364, -- [36]
				16937.397, -- [37]
				16938.731, -- [38]
				16943.131, -- [39]
				16954.848, -- [40]
				16958.015, -- [41]
				16960.865, -- [42]
				16964.182, -- [43]
				16964.582, -- [44]
				16968.433, -- [45]
				16969.433, -- [46]
				16970.466, -- [47]
				16982.317, -- [48]
				16982.317, -- [49]
				16983.833, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Zhwxd-逐风者"] = {
									["max"] = 859,
									["min"] = 859,
									["count"] = 1,
									["amount"] = 859,
								},
							},
							["count"] = 1,
							["amount"] = 859,
						},
					},
					["DOTs"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1442,
					["RageGainedFrom"] = {
					},
					["Absorbs"] = 859,
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
						["Physical"] = 859,
					},
					["ElementTaken"] = {
						["Melee"] = 859,
						["Physical"] = 583,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 1.5,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 859,
									["min"] = 859,
									["count"] = 1,
									["amount"] = 859,
								},
							},
							["count"] = 1,
							["amount"] = 859,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 325,
								},
								["多重射击"] = {
									["count"] = 258,
								},
								["肉搏"] = {
									["count"] = 859,
								},
							},
							["amount"] = 1442,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 859,
								},
							},
							["amount"] = 859,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 859,
									["min"] = 859,
									["count"] = 1,
									["amount"] = 859,
								},
							},
							["count"] = 1,
							["amount"] = 859,
						},
					},
					["WhoHealed"] = {
						["布雷斯塔-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 948,
								},
							},
							["amount"] = 948,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 859,
								},
							},
							["amount"] = 859,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 1807,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementDoneResist"] = {
						["Fire"] = 145,
					},
					["TimeSpent"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Chop"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.52,
								},
							},
							["amount"] = 2.02,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["攻速一点二"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 0.33,
						},
						["尼罗恩"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 3.15,
								},
								["冰霜新星"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 3.82,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 5.08,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8.08,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.78,
								},
							},
							["amount"] = 7.78,
						},
					},
					["HealedWho"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1718,
								},
							},
							["amount"] = 1718,
						},
					},
					["ElementDoneAbsorb"] = {
						["Fire"] = 577,
					},
					["Absorbs"] = 1718,
					["ElementTaken"] = {
						["Physical"] = 1096,
						["Melee"] = 1495,
						["Arcane"] = 548,
						["Frost"] = 521,
						["Fire"] = 1041,
						["Shadow"] = 439,
						["Nature"] = 404,
					},
					["Damage"] = 5951,
					["TimeHeal"] = 7.78,
					["Dispels"] = 2,
					["ElementDone"] = {
						["Frost"] = 2189,
						["Fire"] = 2706,
						["Arcane"] = 1056,
					},
					["ManaGainedFrom"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["强效智慧祝福"] = {
									["count"] = 630,
								},
							},
							["amount"] = 630,
						},
					},
					["WhoDamaged"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["冰霜震击"] = {
									["count"] = 521,
								},
							},
							["amount"] = 521,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 439,
								},
							},
							["amount"] = 439,
						},
						["原子弹"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 77,
								},
								["肉搏"] = {
									["count"] = 157,
								},
							},
							["amount"] = 234,
						},
						["Chop"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 404,
								},
								["驱散射击"] = {
									["count"] = 148,
								},
							},
							["amount"] = 552,
						},
						["攻速一点二"] = {
							["Details"] = {
								["撕咬"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 115,
								},
							},
							["amount"] = 168,
						},
						["爱恨情仇-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 325,
								},
								["多重射击"] = {
									["count"] = 258,
								},
								["肉搏"] = {
									["count"] = 859,
								},
							},
							["amount"] = 1442,
						},
						["尼罗恩"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 364,
								},
							},
							["amount"] = 364,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 548,
								},
								["火焰冲击"] = {
									["count"] = 1041,
								},
							},
							["amount"] = 1589,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 235,
								},
							},
							["amount"] = 235,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Zhwxd-逐风者"] = {
									["max"] = 859,
									["min"] = 77,
									["count"] = 9,
									["amount"] = 1718,
								},
							},
							["count"] = 9,
							["amount"] = 1718,
						},
					},
					["TimeHealing"] = {
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 7.78,
								},
							},
							["amount"] = 7.78,
						},
					},
					["Dispelled"] = 2,
					["PartialResist"] = {
						["奥术飞弹"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
					},
					["ManaGained"] = {
						["强效智慧祝福"] = {
							["Details"] = {
								["蒜头妹妹"] = {
									["count"] = 630,
								},
							},
							["amount"] = 630,
						},
					},
					["ElementTakenAbsorb"] = {
						["Shadow"] = 292,
						["Physical"] = 936,
						["Melee"] = 288,
						["Nature"] = 202,
					},
					["ActiveTime"] = 31.03,
					["WhoDispelled"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["寒冰护体 (净化术)"] = {
									["count"] = 1,
								},
								["冰甲术 (净化术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 859,
									["min"] = 77,
									["count"] = 9,
									["amount"] = 1718,
								},
							},
							["count"] = 9,
							["amount"] = 1718,
						},
					},
					["DamagedWho"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
						["Chop"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 534,
								},
								["火焰冲击"] = {
									["count"] = 600,
								},
							},
							["amount"] = 1134,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 305,
								},
							},
							["amount"] = 305,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1596,
								},
							},
							["amount"] = 1596,
						},
						["断水流-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 32,
								},
							},
							["amount"] = 32,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 599,
								},
							},
							["amount"] = 599,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 1056,
								},
								["火焰冲击"] = {
									["count"] = 1202,
								},
							},
							["amount"] = 2258,
						},
					},
					["WhoHealed"] = {
						["蒜头妹妹"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 556,
								},
							},
							["amount"] = 556,
						},
						["布雷斯塔-逐风者"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 948,
								},
							},
							["amount"] = 948,
						},
						["Zhwxd-逐风者"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 1718,
								},
							},
							["amount"] = 1718,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 8,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
					},
					["DamageTaken"] = 5544,
					["Attacks"] = {
						["冰冻"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 32,
									["min"] = 27,
									["count"] = 2,
									["amount"] = 59,
								},
							},
							["count"] = 3,
							["amount"] = 59,
						},
						["奥术飞弹"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 264,
									["min"] = 264,
									["count"] = 4,
									["amount"] = 1056,
								},
							},
							["count"] = 4,
							["amount"] = 1056,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 763,
									["min"] = 77,
									["count"] = 3,
									["amount"] = 1596,
								},
							},
							["count"] = 3,
							["amount"] = 1596,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 534,
									["min"] = 534,
									["count"] = 1,
									["amount"] = 534,
								},
							},
							["count"] = 1,
							["amount"] = 534,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 577,
									["min"] = 577,
									["count"] = 1,
									["amount"] = 577,
								},
								["Hit"] = {
									["max"] = 625,
									["min"] = 305,
									["count"] = 4,
									["amount"] = 2129,
								},
							},
							["count"] = 5,
							["amount"] = 2706,
						},
					},
					["HealingTaken"] = 3222,
					["PartialAbsorb"] = {
						["奥术飞弹"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 859,
									["min"] = 859,
									["count"] = 1,
									["amount"] = 859,
								},
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 859,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 101,
									["min"] = 101,
									["count"] = 2,
									["amount"] = 202,
								},
							},
							["count"] = 4,
							["amount"] = 202,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜震击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 77,
									["min"] = 77,
									["count"] = 1,
									["amount"] = 77,
								},
							},
							["count"] = 2,
							["amount"] = 77,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 146,
									["min"] = 146,
									["count"] = 2,
									["amount"] = 292,
								},
							},
							["count"] = 3,
							["amount"] = 292,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 115,
									["min"] = 79,
									["count"] = 3,
									["amount"] = 288,
								},
							},
							["count"] = 8,
							["amount"] = 288,
						},
					},
					["TimeDamage"] = 23.25,
					["TimeDamaging"] = {
						["狐狸不吃鱼-黑龙费尔默"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Chop"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.52,
								},
							},
							["amount"] = 2.02,
						},
						["残缺一梦-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["攻速一点二"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 0.33,
								},
							},
							["amount"] = 0.33,
						},
						["猎蝶兽兽-黑龙费尔默"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
						["尼罗恩"] = {
							["Details"] = {
								["冰冻"] = {
									["count"] = 3.15,
								},
								["冰霜新星"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 3.82,
						},
						["锘一-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["冰箱里的肉"] = {
							["Details"] = {
								["奥术飞弹"] = {
									["count"] = 5.08,
								},
								["火焰冲击"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8.08,
						},
					},
					["ManaGain"] = 630,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 11,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["DispelledWho"] = {
						["才等等-逐风者"] = {
							["Details"] = {
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["芋头妹妹"] = {
							["Details"] = {
								["痛苦诅咒 (解除次级诅咒)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 16840.292,
			["LastActive"] = 17131.292,
		},
	},
	["FightNum"] = 5,
	["CombatTimes"] = {
		{
			16680.299, -- [1]
			16772.295, -- [2]
			"17:28:55", -- [3]
			"17:30:26", -- [4]
			"Chop", -- [5]
		}, -- [1]
		{
			16779.305, -- [1]
			16783.305, -- [2]
			"17:30:33", -- [3]
			"17:30:37", -- [4]
			"Environment", -- [5]
		}, -- [2]
		{
			16799.289, -- [1]
			17017.302, -- [2]
			"17:30:53", -- [3]
			"17:34:31", -- [4]
			"Environment", -- [5]
		}, -- [3]
		{
			17023.302, -- [1]
			17079.296, -- [2]
			"17:34:37", -- [3]
			"17:35:33", -- [4]
			"Environment", -- [5]
		}, -- [4]
		{
			17119.291, -- [1]
			17162.294, -- [2]
			"17:36:14", -- [3]
			"17:36:56", -- [4]
			"爱恨情仇-黑龙费尔默", -- [5]
		}, -- [5]
	},
	["FoughtWho"] = {
	},
}
