
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["哔哔妹-老马布兰契"] = {
			["GUID"] = "Player-5447-02F2D270",
			["LastEventHealth"] = {
				959, -- [1]
				1734, -- [2]
				3001, -- [3]
				4479, -- [4]
				4479, -- [5]
				4479, -- [6]
				4479, -- [7]
				4479, -- [8]
				4479, -- [9]
				4156, -- [10]
				4156, -- [11]
				4156, -- [12]
				3938, -- [13]
				3938, -- [14]
				3646, -- [15]
				3646, -- [16]
				3412, -- [17]
				3330, -- [18]
				3045, -- [19]
				2549, -- [20]
				2549, -- [21]
				2461, -- [22]
				2461, -- [23]
				2461, -- [24]
			},
			["LastAttackedBy"] = "仙影袭归-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
			},
			["TimeWindows"] = {
				["Damage"] = {
					2802, -- [1]
				},
				["TimeDamage"] = {
					7.66, -- [1]
				},
				["DamageTaken"] = {
					2320, -- [1]
				},
				["ActiveTime"] = {
					7.66, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 0,
			["LastEventHealthMax"] = {
				4479, -- [1]
				4479, -- [2]
				4479, -- [3]
				4479, -- [4]
				4479, -- [5]
				4479, -- [6]
				4479, -- [7]
				4479, -- [8]
				4479, -- [9]
				4479, -- [10]
				4479, -- [11]
				4479, -- [12]
				4479, -- [13]
				4479, -- [14]
				4479, -- [15]
				4479, -- [16]
				4479, -- [17]
				4479, -- [18]
				4479, -- [19]
				4479, -- [20]
				4479, -- [21]
				4479, -- [22]
				4479, -- [23]
				4479, -- [24]
			},
			["type"] = "Grouped",
			["LastDamageTaken"] = 88,
			["GuardianReverseGUIDs"] = {
				["非洲大佬"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "Pet-0-5428-489-14913-5828-01012344EB",
					},
				},
			},
			["TimeLast"] = {
				["ActiveTime"] = 36980.939,
				["TimeDamage"] = 36980.939,
				["OVERALL"] = 36980.939,
				["DamageTaken"] = 36980.939,
				["Damage"] = 36980.939,
			},
			["Owner"] = false,
			["Pet"] = {
				"非洲大佬 <哔哔妹-老马布兰契>", -- [1]
			},
			["NextEventNum"] = 25,
			["LastDamageTime"] = 36981.422,
			["LastEvents"] = {
				"丨渣丶哥丨 毒蛇钉刺 (伤害/跳) 哔哔妹-老马布兰契 Tick -100 (Nature)", -- [1]
				"丨渣丶哥丨 毒蛇钉刺 (伤害/跳) 哔哔妹-老马布兰契 Tick -101 (Nature)", -- [2]
				"丨渣丶哥丨 毒蛇钉刺 (伤害/跳) 哔哔妹-老马布兰契 Tick -101 (Nature)", -- [3]
				"哔哔妹-老马布兰契 肉搏 大胸法神 Absorb -268 (1)", -- [4]
				"哔哔妹-老马布兰契 多重射击 大胸法神 Hit -356 (268 被吸收) (Physical)", -- [5]
				"哔哔妹-老马布兰契 自动射击 大胸法神 Hit -492 (Physical)", -- [6]
				"哔哔妹-老马布兰契 瞄准射击 大胸法神 Immune (Physical)", -- [7]
				"哔哔妹-老马布兰契 自动射击 牧老-火妖鲁西弗隆 Hit -402 (Physical)", -- [8]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Crit -323 (Physical)", -- [9]
				"哔哔妹-老马布兰契 多重射击 牧老-火妖鲁西弗隆 Hit -506 (Physical)", -- [10]
				"哔哔妹-老马布兰契 多重射击 大胸法神 Hit -603 (Physical)", -- [11]
				"牧老-火妖鲁西弗隆 暗影守卫 哔哔妹-老马布兰契 Hit -218 (Shadow)", -- [12]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Hit -76 (Physical)", -- [13]
				"仙影袭归-黑龙费尔默 邪恶攻击 哔哔妹-老马布兰契 Hit -216 (Physical)", -- [14]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Hit -83 (Physical)", -- [15]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Hit -151 (Physical)", -- [16]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Hit -82 (Physical)", -- [17]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Crit -285 (Physical)", -- [18]
				"仙影袭归-黑龙费尔默 邪恶攻击 哔哔妹-老马布兰契 Crit -496 (Physical)", -- [19]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Miss (1)", -- [20]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Hit -88 (Physical)", -- [21]
				"仙影袭归-黑龙费尔默 肉搏 哔哔妹-老马布兰契 Miss (1)", -- [22]
				"哔哔妹-老马布兰契 肉搏 仙影袭归-黑龙费尔默 Hit -138 (Physical)", -- [23]
				"哔哔妹-老马布兰契 摔绊 仙影袭归-黑龙费尔默 Hit -37 (Physical)", -- [24]
			},
			["Name"] = "哔哔妹-老马布兰契",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
			},
			["LastEventTimes"] = {
				36924.653, -- [1]
				36930.653, -- [2]
				36933.67, -- [3]
				36959.788, -- [4]
				36959.788, -- [5]
				36960.021, -- [6]
				36964.488, -- [7]
				36972.205, -- [8]
				36973.155, -- [9]
				36973.639, -- [10]
				36973.639, -- [11]
				36973.689, -- [12]
				36974.055, -- [13]
				36974.205, -- [14]
				36975.872, -- [15]
				36975.872, -- [16]
				36977.655, -- [17]
				36978.655, -- [18]
				36978.939, -- [19]
				36979.472, -- [20]
				36981.273, -- [21]
				36981.422, -- [22]
				36981.422, -- [23]
				36981.422, -- [24]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.23,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.23,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.43,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.93,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
					},
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 492,
								},
								["多重射击"] = {
									["count"] = 959,
								},
								["肉搏"] = {
									["count"] = 268,
								},
							},
							["amount"] = 1719,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 506,
								},
								["自动射击"] = {
									["count"] = 402,
								},
							},
							["amount"] = 908,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 37,
								},
								["肉搏"] = {
									["count"] = 138,
								},
							},
							["amount"] = 175,
						},
					},
					["ElementDone"] = {
						["Melee"] = 406,
						["Physical"] = 2396,
					},
					["Attacks"] = {
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 37,
									["min"] = 37,
									["count"] = 1,
									["amount"] = 37,
								},
							},
							["count"] = 1,
							["amount"] = 37,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 492,
									["min"] = 402,
									["count"] = 2,
									["amount"] = 894,
								},
							},
							["count"] = 2,
							["amount"] = 894,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 603,
									["min"] = 356,
									["count"] = 3,
									["amount"] = 1465,
								},
							},
							["count"] = 3,
							["amount"] = 1465,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 138,
									["min"] = 138,
									["count"] = 1,
									["amount"] = 138,
								},
								["Absorb"] = {
									["max"] = 268,
									["min"] = 268,
									["count"] = 1,
									["amount"] = 268,
								},
							},
							["count"] = 2,
							["amount"] = 406,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 2320,
					["ElementDoneAbsorb"] = {
						["Physical"] = 268,
					},
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.23,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.23,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.43,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.93,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 7.66,
					["WhoDamaged"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 712,
								},
								["肉搏"] = {
									["count"] = 1088,
								},
							},
							["amount"] = 1800,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 302,
								},
							},
							["amount"] = 302,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 712,
						["Shadow"] = 218,
						["Melee"] = 1088,
						["Nature"] = 302,
					},
					["TimeDamage"] = 7.66,
					["Damage"] = 2802,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.23,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.23,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.43,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.93,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7,
						},
					},
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 492,
								},
								["多重射击"] = {
									["count"] = 959,
								},
								["肉搏"] = {
									["count"] = 268,
								},
							},
							["amount"] = 1719,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 506,
								},
								["自动射击"] = {
									["count"] = 402,
								},
							},
							["amount"] = 908,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["摔绊"] = {
									["count"] = 37,
								},
								["肉搏"] = {
									["count"] = 138,
								},
							},
							["amount"] = 175,
						},
					},
					["ElementDone"] = {
						["Melee"] = 406,
						["Physical"] = 2396,
					},
					["Attacks"] = {
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 37,
									["min"] = 37,
									["count"] = 1,
									["amount"] = 37,
								},
							},
							["count"] = 1,
							["amount"] = 37,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 492,
									["min"] = 402,
									["count"] = 2,
									["amount"] = 894,
								},
							},
							["count"] = 2,
							["amount"] = 894,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 603,
									["min"] = 356,
									["count"] = 3,
									["amount"] = 1465,
								},
							},
							["count"] = 3,
							["amount"] = 1465,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 138,
									["min"] = 138,
									["count"] = 1,
									["amount"] = 138,
								},
								["Absorb"] = {
									["max"] = 268,
									["min"] = 268,
									["count"] = 1,
									["amount"] = 268,
								},
							},
							["count"] = 2,
							["amount"] = 406,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DamageTaken"] = 2320,
					["ElementDoneAbsorb"] = {
						["Physical"] = 268,
					},
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.23,
								},
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.23,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1.43,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.93,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 7.66,
					["WhoDamaged"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["邪恶攻击"] = {
									["count"] = 712,
								},
								["肉搏"] = {
									["count"] = 1088,
								},
							},
							["amount"] = 1800,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 302,
								},
							},
							["amount"] = 302,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 712,
						["Shadow"] = 218,
						["Melee"] = 1088,
						["Nature"] = 302,
					},
					["TimeDamage"] = 7.66,
					["Damage"] = 2802,
				},
			},
			["UnitLockout"] = 36976.939,
			["LastActive"] = 36980.939,
		},
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["LastEventHealth"] = {
				1880, -- [1]
				1695, -- [2]
				1510, -- [3]
				537, -- [4]
				835, -- [5]
				1085, -- [6]
				1384, -- [7]
				1634, -- [8]
				1932, -- [9]
				2182, -- [10]
				2480, -- [11]
				4490, -- [12]
				3896, -- [13]
				3896, -- [14]
				3896, -- [15]
				3738, -- [16]
				3489, -- [17]
				3489, -- [18]
				3509, -- [19]
				3509, -- [20]
				3819, -- [21]
				3819, -- [22]
				3819, -- [23]
				3819, -- [24]
				3839, -- [25]
				3839, -- [26]
				3859, -- [27]
				3859, -- [28]
				3859, -- [29]
				3879, -- [30]
				3879, -- [31]
				3899, -- [32]
				3475, -- [33]
				3448, -- [34]
				2511, -- [35]
				2511, -- [36]
				2511, -- [37]
				2531, -- [38]
				2217, -- [39]
				2217, -- [40]
				1663, -- [41]
				3667, -- [42]
				3667, -- [43]
				3440, -- [44]
				3282, -- [45]
				3282, -- [46]
				3282, -- [47]
				3055, -- [48]
				3055, -- [49]
				1880, -- [50]
			},
			["LastAttackedBy"] = "牧老-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"HEAL", -- [4]
				"HEAL", -- [5]
				"HEAL", -- [6]
				"HEAL", -- [7]
				"HEAL", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"HEAL", -- [18]
				"DAMAGE", -- [19]
				"HEAL", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"HEAL", -- [24]
				"DAMAGE", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"HEAL", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"HEAL", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					28.01, -- [1]
				},
				["Healing"] = {
					4660, -- [1]
				},
				["DamageTaken"] = {
					15909, -- [1]
				},
				["TimeDamage"] = {
					37.41, -- [1]
				},
				["RageGain"] = {
					77, -- [1]
				},
				["HOT_Time"] = {
					24, -- [1]
				},
				["ActiveTime"] = {
					65.41999999999999, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["HealingTaken"] = {
					4660, -- [1]
				},
				["DOT_Time"] = {
					6, -- [1]
				},
				["Damage"] = {
					14509, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
						false, -- [12]
						true, -- [13]
						false, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
						true, -- [21]
						false, -- [22]
						false, -- [23]
						true, -- [24]
						true, -- [25]
						true, -- [26]
						true, -- [27]
						true, -- [28]
						true, -- [29]
						false, -- [30]
						true, -- [31]
						false, -- [32]
						true, -- [33]
						true, -- [34]
						true, -- [35]
						true, -- [36]
						true, -- [37]
						true, -- [38]
						true, -- [39]
						true, -- [40]
						true, -- [41]
						true, -- [42]
						true, -- [43]
						true, -- [44]
					},
					["Messages"] = {
						"特变电工 断筋 帅气的老头 Hit -33 (Physical)", -- [1]
						"特变电工 肉搏 帅气的老头 Hit -449 (Physical)", -- [2]
						"丨渣丶哥丨 多重射击 特变电工 Hit -512 (Physical)", -- [3]
						"丨渣丶哥丨 自动射击 特变电工 Hit -382 (Physical)", -- [4]
						"特变电工 嗜血 帅气的老头 Hit -346 (Physical)", -- [5]
						"特变电工 嗜血 特变电工 Hit +20", -- [6]
						"特变电工 肉搏 帅气的老头 Hit -391 (Physical)", -- [7]
						"特变电工 嗜血 特变电工 Hit +20", -- [8]
						"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -210 (Shadow)", -- [9]
						"帅气的老头 地震术 特变电工 Hit -602 (Nature)", -- [10]
						"帅气的老头 肉搏 特变电工 Hit -175 (Physical)", -- [11]
						"特变电工 旋风斩 帅气的老头 Hit -409 (Physical)", -- [12]
						"特变电工 嗜血 特变电工 Hit +20", -- [13]
						"特变电工 肉搏 帅气的老头 Hit -452 (Physical)", -- [14]
						"特变电工 嗜血 特变电工 Hit +20", -- [15]
						"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -210 (Shadow)", -- [16]
						"丨渣丶哥丨 瞄准射击 特变电工 Hit -740 (Physical)", -- [17]
						"狼牙 肉搏 特变电工 Hit -93 (Physical)", -- [18]
						"狼牙 撕咬 特变电工 Dodge (Physical)", -- [19]
						"丨渣丶哥丨 自动射击 特变电工 Crit -935 (Physical)", -- [20]
						"跳跳 肉搏 特变电工 Hit -64 (Physical)", -- [21]
						"特变电工 拦截昏迷 Evilpsycho-逐风者 Hit -63 (Physical)", -- [22]
						"特变电工 断筋 Evilpsycho-逐风者 Hit -43 (Physical)", -- [23]
						"特变电工 嗜血 特变电工 Hit +20", -- [24]
						"南宫狸猫-火妖鲁西弗隆 自动射击 特变电工 Hit -511 (Physical)", -- [25]
						"狼牙 肉搏 特变电工 Hit -51 (Physical)", -- [26]
						"跳跳 肉搏 特变电工 Miss (1)", -- [27]
						"南宫狸猫-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 特变电工 Tick -145 (Nature)", -- [28]
						"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 特变电工 Tick -210 (Shadow)", -- [29]
						"特变电工 肉搏 Evilpsycho-逐风者 Hit -558 (Physical)", -- [30]
						"跳跳 爪击 特变电工 Dodge (Physical)", -- [31]
						"特变电工 嗜血 Evilpsycho-逐风者 Hit -534 (Physical)", -- [32]
						"特变电工 嗜血 特变电工 Hit +20", -- [33]
						"丨渣丶哥丨 自动射击 特变电工 Hit -367 (Physical)", -- [34]
						"特变电工 治疗药水 特变电工 Hit +1308", -- [35]
						"狼牙 肉搏 特变电工 Hit -58 (Physical)", -- [36]
						"大胸法神 火焰冲击 特变电工 Hit -617 (Fire)", -- [37]
						"Evilpsycho-逐风者 死亡缠绕 特变电工 Hit -706 (Shadow)", -- [38]
						"跳跳 爪击 特变电工 Hit -49 (Physical)", -- [39]
						"跳跳 肉搏 特变电工 Hit -58 (Physical)", -- [40]
						"狼牙 肉搏 特变电工 Hit -52 (Physical)", -- [41]
						"Evilpsycho-逐风者 暗影灼烧 特变电工 Hit -790 (Shadow)", -- [42]
						"大胸法神 冰锥术 特变电工 Hit -538 (Frost)", -- [43]
						"特变电工死亡。", -- [44]
					},
					["DeathAt"] = 36878.95,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
						0, -- [43]
						0, -- [44]
					},
					["MessageTimes"] = {
						-13.11799999999494, -- [1]
						-12.91899999999441, -- [2]
						-10.7019999999975, -- [3]
						-10.61799999999494, -- [4]
						-10.41799999999785, -- [5]
						-10.39799999999377, -- [6]
						-9.417999999997846, -- [7]
						-9.401999999994587, -- [8]
						-8.417999999997846, -- [9]
						-8.235000000000582, -- [10]
						-8.017999999996391, -- [11]
						-6.450999999993655, -- [12]
						-6.450999999993655, -- [13]
						-5.917999999997846, -- [14]
						-5.900999999998021, -- [15]
						-5.434999999997672, -- [16]
						-5.235000000000582, -- [17]
						-4.800999999999476, -- [18]
						-4.800999999999476, -- [19]
						-4.783999999999651, -- [20]
						-4.761999999995169, -- [21]
						-4.684999999997672, -- [22]
						-3.968000000000757, -- [23]
						-3.968000000000757, -- [24]
						-3.884999999994761, -- [25]
						-2.968000000000757, -- [26]
						-2.750999999996566, -- [27]
						-2.517999999996391, -- [28]
						-2.417999999997846, -- [29]
						-2.417999999997846, -- [30]
						-2.367999999994936, -- [31]
						-2.317999999999302, -- [32]
						-2.29599999999482, -- [33]
						-2.100999999995111, -- [34]
						-1.917999999997846, -- [35]
						-1.667999999997846, -- [36]
						-1.650999999998021, -- [37]
						-1.417999999997846, -- [38]
						-0.7509999999965657, -- [39]
						-0.7350000000005821, -- [40]
						-0.3679999999949359, -- [41]
						-0.05099999999947613, -- [42]
						-0.03399999999965075, -- [43]
						0, -- [44]
					},
					["HealthMax"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						6219, -- [4]
						6219, -- [5]
						6219, -- [6]
						6219, -- [7]
						6219, -- [8]
						6219, -- [9]
						6219, -- [10]
						6219, -- [11]
						6219, -- [12]
						6219, -- [13]
						6219, -- [14]
						6219, -- [15]
						6219, -- [16]
						6219, -- [17]
						6219, -- [18]
						6219, -- [19]
						6219, -- [20]
						6219, -- [21]
						6219, -- [22]
						6219, -- [23]
						6219, -- [24]
						6219, -- [25]
						6219, -- [26]
						6219, -- [27]
						6219, -- [28]
						6219, -- [29]
						6219, -- [30]
						6219, -- [31]
						6219, -- [32]
						6219, -- [33]
						6219, -- [34]
						6219, -- [35]
						6219, -- [36]
						6219, -- [37]
						6219, -- [38]
						6219, -- [39]
						6219, -- [40]
						6219, -- [41]
						6219, -- [42]
						6219, -- [43]
						6219, -- [44]
					},
					["Health"] = {
						6219, -- [1]
						6219, -- [2]
						6219, -- [3]
						5707, -- [4]
						5325, -- [5]
						5325, -- [6]
						5345, -- [7]
						5345, -- [8]
						5365, -- [9]
						5155, -- [10]
						4553, -- [11]
						4378, -- [12]
						4378, -- [13]
						4398, -- [14]
						4398, -- [15]
						4418, -- [16]
						4208, -- [17]
						3468, -- [18]
						3468, -- [19]
						3468, -- [20]
						2440, -- [21]
						2376, -- [22]
						2376, -- [23]
						2376, -- [24]
						2396, -- [25]
						1885, -- [26]
						1834, -- [27]
						1834, -- [28]
						1689, -- [29]
						1479, -- [30]
						1479, -- [31]
						1479, -- [32]
						1479, -- [33]
						1499, -- [34]
						1132, -- [35]
						2440, -- [36]
						2440, -- [37]
						1765, -- [38]
						1059, -- [39]
						1059, -- [40]
						952, -- [41]
						900, -- [42]
						900, -- [43]
						0, -- [44]
					},
					["KilledBy"] = "大胸法神",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"HEAL", -- [6]
						"DAMAGE", -- [7]
						"HEAL", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"HEAL", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"DAMAGE", -- [23]
						"HEAL", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"DAMAGE", -- [31]
						"DAMAGE", -- [32]
						"HEAL", -- [33]
						"DAMAGE", -- [34]
						"HEAL", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"DAMAGE", -- [42]
						"DAMAGE", -- [43]
						"MISC", -- [44]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 0,
			["type"] = "Self",
			["LastHealTime"] = 37004.824,
			["LastEventHealthMax"] = {
				7151, -- [1]
				7151, -- [2]
				7151, -- [3]
				6219, -- [4]
				6219, -- [5]
				6219, -- [6]
				6219, -- [7]
				6219, -- [8]
				6219, -- [9]
				6219, -- [10]
				6219, -- [11]
				6219, -- [12]
				6219, -- [13]
				6219, -- [14]
				6219, -- [15]
				6219, -- [16]
				6219, -- [17]
				6219, -- [18]
				6219, -- [19]
				6219, -- [20]
				6219, -- [21]
				6219, -- [22]
				6219, -- [23]
				6219, -- [24]
				6219, -- [25]
				6219, -- [26]
				6219, -- [27]
				6219, -- [28]
				6219, -- [29]
				6219, -- [30]
				6219, -- [31]
				6219, -- [32]
				6219, -- [33]
				6219, -- [34]
				6219, -- [35]
				6219, -- [36]
				6219, -- [37]
				6219, -- [38]
				6219, -- [39]
				6219, -- [40]
				6219, -- [41]
				7151, -- [42]
				7151, -- [43]
				7151, -- [44]
				7151, -- [45]
				7151, -- [46]
				7151, -- [47]
				7151, -- [48]
				7151, -- [49]
				7151, -- [50]
			},
			["LastDamageTaken"] = 186,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 37003.94,
				["OVERALL"] = 37003.94,
				["DamageTaken"] = 36990.94,
				["DeathCount"] = 36876.95,
				["ActiveTime"] = 37003.94,
				["RageGain"] = 36979.939,
				["HOT_Time"] = 37003.94,
				["TimeDamage"] = 36982.939,
				["HealingTaken"] = 37003.94,
				["Healing"] = 37003.94,
				["DOT_Time"] = 36950.937,
				["Damage"] = 36982.939,
			},
			["NextEventNum"] = 12,
			["LastDamageTime"] = 36983.589,
			["LastEvents"] = {
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -185 (Shadow)", -- [1]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -185 (Shadow)", -- [2]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -186 (Shadow)", -- [3]
				"特变电工 急救 特变电工 Tick +250", -- [4]
				"特变电工 急救 特变电工 Tick +250", -- [5]
				"特变电工 急救 特变电工 Tick +250", -- [6]
				"特变电工 急救 特变电工 Tick +250", -- [7]
				"特变电工 急救 特变电工 Tick +250", -- [8]
				"特变电工 急救 特变电工 Tick +250", -- [9]
				"特变电工 急救 特变电工 Tick +250", -- [10]
				"特变电工 急救 特变电工 Tick +250", -- [11]
				"帅气的老头 地震术 特变电工 Hit -594 (Nature)", -- [12]
				"特变电工 肉搏 帅气的老头 Dodge (1)", -- [13]
				"特变电工 重伤 (伤害/跳) 帅气的老头 Tick -93 (Physical)", -- [14]
				"帅气的老头 肉搏 特变电工 Hit -158 (Physical)", -- [15]
				"帅气的老头 闪电之盾 特变电工 Hit -249 (Nature)", -- [16]
				"特变电工 压制 帅气的老头 Crit -1241 (Physical)", -- [17]
				"特变电工 嗜血 特变电工 Hit +20", -- [18]
				"特变电工 肉搏 帅气的老头 Hit -583 (Physical)", -- [19]
				"特变电工 嗜血 特变电工 Hit +20", -- [20]
				"特变电工 断筋 丨渣丶哥丨 Crit -60 (Physical)", -- [21]
				"特变电工 肉搏 丨渣丶哥丨 Crit -773 (Physical)", -- [22]
				"特变电工 嗜血 丨渣丶哥丨 Crit -736 (Physical)", -- [23]
				"特变电工 嗜血 特变电工 Hit +20", -- [24]
				"特变电工 肉搏 丨渣丶哥丨 Hit -365 (Physical)", -- [25]
				"特变电工 嗜血 特变电工 Hit +20", -- [26]
				"特变电工 重伤 (伤害/跳) 丨渣丶哥丨 Tick -89 (Physical)", -- [27]
				"特变电工 肉搏 丨渣丶哥丨 Crit -651 (Physical)", -- [28]
				"特变电工 嗜血 特变电工 Hit +20", -- [29]
				"特变电工 斩杀 丨渣丶哥丨 Hit -688 (Physical)", -- [30]
				"特变电工 嗜血 特变电工 Hit +20", -- [31]
				"丨渣丶哥丨 驱散射击 特变电工 Crit -424 (Physical)", -- [32]
				"大胸法神 冰霜新星 特变电工 Hit -27 (Frost)", -- [33]
				"大胸法神 冰锥术 特变电工 Crit -937 (Frost)", -- [34]
				"特变电工 肉搏 部落军旗 Hit -688 (Physical)", -- [35]
				"特变电工 嗜血 部落军旗 Hit -689 (Physical)", -- [36]
				"特变电工 嗜血 特变电工 Hit +20", -- [37]
				"大胸法神 魔爆术 特变电工 Hit -314 (Arcane)", -- [38]
				"特变电工 拦截昏迷 牧老-火妖鲁西弗隆 Hit -53 (Physical)", -- [39]
				"大胸法神 冰锥术 特变电工 Hit -554 (Frost)", -- [40]
				"特变电工 生命赐福 特变电工 Hit +1072", -- [41]
				"特变电工 英勇打击 大胸法神 Hit -627 (Physical)", -- [42]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -227 (Shadow)", -- [43]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -206 (Shadow)", -- [44]
				"特变电工 冲锋击昏 牧老-火妖鲁西弗隆 Immune (Physical)", -- [45]
				"特变电工 断筋 牧老-火妖鲁西弗隆 Hit -30 (Physical)", -- [46]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 特变电工 Tick -227 (Shadow)", -- [47]
				"特变电工 肉搏 牧老-火妖鲁西弗隆 Hit -427 (Physical)", -- [48]
				"丨渣丶哥丨 多重射击 特变电工 Crit -1175 (Physical)", -- [49]
				"特变电工 斩杀 牧老-火妖鲁西弗隆 Hit -873 (Physical)", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				false, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				true, -- [43]
				true, -- [44]
				false, -- [45]
				false, -- [46]
				true, -- [47]
				false, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				36985.156, -- [1]
				36988.156, -- [2]
				36991.156, -- [3]
				36997.823, -- [4]
				36998.84, -- [5]
				36999.84, -- [6]
				37000.84, -- [7]
				37001.823, -- [8]
				37002.824, -- [9]
				37003.824, -- [10]
				37004.824, -- [11]
				36926.103, -- [12]
				36926.169, -- [13]
				36926.553, -- [14]
				36926.553, -- [15]
				36926.789, -- [16]
				36928.403, -- [17]
				36928.403, -- [18]
				36928.869, -- [19]
				36928.869, -- [20]
				36946.504, -- [21]
				36946.67, -- [22]
				36948.021, -- [23]
				36948.021, -- [24]
				36949.37, -- [25]
				36949.387, -- [26]
				36951.037, -- [27]
				36952.071, -- [28]
				36952.087, -- [29]
				36952.804, -- [30]
				36952.823, -- [31]
				36953.504, -- [32]
				36955.088, -- [33]
				36961.355, -- [34]
				36966.505, -- [35]
				36966.722, -- [36]
				36966.742, -- [37]
				36969.488, -- [38]
				36969.705, -- [39]
				36973.555, -- [40]
				36974.522, -- [41]
				36974.739, -- [42]
				36976.155, -- [43]
				36979.156, -- [44]
				36980.156, -- [45]
				36982.089, -- [46]
				36982.156, -- [47]
				36982.472, -- [48]
				36982.956, -- [49]
				36983.589, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 8.5,
								},
								["生命赐福"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 17.63,
								},
								["治疗药水"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 28.01,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["帅气的老头"] = {
									["count"] = 3,
								},
								["丨渣丶哥丨"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 14,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 13,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 11,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["DamageTaken"] = 15761,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 2,
								},
								["冲锋"] = {
									["count"] = 75,
								},
							},
							["amount"] = 77,
						},
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 65.41999999999999,
					["HOT_Time"] = 24,
					["ElementTaken"] = {
						["Physical"] = 5807,
						["Melee"] = 1804,
						["Arcane"] = 314,
						["Frost"] = 2056,
						["Fire"] = 617,
						["Shadow"] = 3342,
						["Nature"] = 1821,
					},
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
					},
					["Damage"] = 14509,
					["DOT_Time"] = 6,
					["TimeHeal"] = 28.01,
					["HealingTaken"] = 4660,
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 2000,
								},
								["生命赐福"] = {
									["count"] = 1072,
								},
								["嗜血"] = {
									["count"] = 280,
								},
								["治疗药水"] = {
									["count"] = 1308,
								},
							},
							["amount"] = 4660,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 2000,
								},
								["生命赐福"] = {
									["count"] = 1072,
								},
								["嗜血"] = {
									["count"] = 280,
								},
								["治疗药水"] = {
									["count"] = 1308,
								},
							},
							["amount"] = 4660,
						},
					},
					["Healing"] = 4660,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 8,
									["amount"] = 2000,
								},
							},
							["count"] = 8,
							["amount"] = 2000,
						},
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1072,
									["min"] = 1072,
									["count"] = 1,
									["amount"] = 1072,
								},
							},
							["count"] = 1,
							["amount"] = 1072,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 14,
									["amount"] = 280,
								},
							},
							["count"] = 14,
							["amount"] = 280,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1308,
									["min"] = 1308,
									["count"] = 1,
									["amount"] = 1308,
								},
							},
							["count"] = 1,
							["amount"] = 1308,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 22,
						},
					},
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 736,
									["min"] = 736,
									["count"] = 1,
									["amount"] = 736,
								},
								["Hit"] = {
									["max"] = 689,
									["min"] = 346,
									["count"] = 4,
									["amount"] = 2128,
								},
							},
							["count"] = 5,
							["amount"] = 2864,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 93,
									["min"] = 89,
									["count"] = 2,
									["amount"] = 182,
								},
							},
							["count"] = 2,
							["amount"] = 182,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 627,
									["min"] = 627,
									["count"] = 1,
									["amount"] = 627,
								},
							},
							["count"] = 1,
							["amount"] = 627,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1241,
									["min"] = 1241,
									["count"] = 1,
									["amount"] = 1241,
								},
							},
							["count"] = 1,
							["amount"] = 1241,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 409,
									["min"] = 409,
									["count"] = 1,
									["amount"] = 409,
								},
							},
							["count"] = 1,
							["amount"] = 409,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 63,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 116,
								},
							},
							["count"] = 2,
							["amount"] = 116,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 74,
									["min"] = 60,
									["count"] = 2,
									["amount"] = 134,
								},
								["Hit"] = {
									["max"] = 43,
									["min"] = 30,
									["count"] = 4,
									["amount"] = 138,
								},
							},
							["count"] = 6,
							["amount"] = 272,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 873,
									["min"] = 678,
									["count"] = 3,
									["amount"] = 2239,
								},
							},
							["count"] = 3,
							["amount"] = 2239,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 773,
									["min"] = 651,
									["count"] = 2,
									["amount"] = 1424,
								},
								["Hit"] = {
									["max"] = 688,
									["min"] = 365,
									["count"] = 11,
									["amount"] = 5135,
								},
							},
							["count"] = 14,
							["amount"] = 6559,
						},
					},
					["RageGain"] = 77,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 627,
								},
							},
							["amount"] = 627,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 30,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["斩杀"] = {
									["count"] = 873,
								},
								["肉搏"] = {
									["count"] = 427,
								},
							},
							["amount"] = 1383,
						},
						["帅气的老头"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 905,
								},
								["旋风斩"] = {
									["count"] = 409,
								},
								["压制"] = {
									["count"] = 1241,
								},
								["断筋"] = {
									["count"] = 107,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 93,
								},
								["肉搏"] = {
									["count"] = 2336,
								},
							},
							["amount"] = 5091,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 736,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 89,
								},
								["断筋"] = {
									["count"] = 60,
								},
								["斩杀"] = {
									["count"] = 688,
								},
								["肉搏"] = {
									["count"] = 1789,
								},
							},
							["amount"] = 3362,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 32,
								},
								["斩杀"] = {
									["count"] = 678,
								},
								["肉搏"] = {
									["count"] = 761,
								},
							},
							["amount"] = 1471,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 43,
								},
								["拦截昏迷"] = {
									["count"] = 63,
								},
								["嗜血"] = {
									["count"] = 534,
								},
								["肉搏"] = {
									["count"] = 558,
								},
							},
							["amount"] = 1198,
						},
						["部落军旗"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 689,
								},
								["肉搏"] = {
									["count"] = 688,
								},
							},
							["amount"] = 1377,
						},
					},
					["TimeDamage"] = 37.41,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 314,
								},
								["冰霜新星"] = {
									["count"] = 27,
								},
								["冰锥术"] = {
									["count"] = 2029,
								},
								["火焰冲击"] = {
									["count"] = 617,
								},
							},
							["amount"] = 2987,
						},
						["帅气的老头"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 148,
								},
								["地震术"] = {
									["count"] = 1196,
								},
								["闪电之盾"] = {
									["count"] = 480,
								},
								["肉搏"] = {
									["count"] = 1275,
								},
							},
							["amount"] = 3099,
						},
						["跳跳"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 122,
								},
							},
							["amount"] = 171,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 706,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 630,
								},
								["暗影灼烧"] = {
									["count"] = 790,
								},
							},
							["amount"] = 2126,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1216,
								},
							},
							["amount"] = 1216,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 519,
								},
							},
							["amount"] = 519,
						},
						["狼牙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 254,
								},
							},
							["amount"] = 254,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 45,
								},
								["肉搏"] = {
									["count"] = 153,
								},
							},
							["amount"] = 198,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 145,
								},
								["自动射击"] = {
									["count"] = 511,
								},
							},
							["amount"] = 656,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 424,
								},
								["自动射击"] = {
									["count"] = 1684,
								},
								["多重射击"] = {
									["count"] = 1687,
								},
								["瞄准射击"] = {
									["count"] = 740,
								},
							},
							["amount"] = 4535,
						},
					},
					["ElementDone"] = {
						["Melee"] = 6559,
						["Physical"] = 7950,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 8.5,
								},
								["生命赐福"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 17.63,
								},
								["治疗药水"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 28.01,
						},
						["帅气的老头"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 4.85,
								},
							},
							["amount"] = 12.81,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 6,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.75,
								},
							},
							["amount"] = 4.2,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.35,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 2.55,
								},
							},
							["amount"] = 7.630000000000001,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.72,
								},
								["拦截昏迷"] = {
									["count"] = 1.23,
								},
								["嗜血"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.55,
						},
						["部落军旗"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.72,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 6,
						},
						["帅气的老头"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 4.85,
								},
							},
							["amount"] = 12.81,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.35,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 2.55,
								},
							},
							["amount"] = 7.630000000000001,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.75,
								},
							},
							["amount"] = 4.2,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.72,
								},
								["拦截昏迷"] = {
									["count"] = 1.23,
								},
								["嗜血"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.55,
						},
						["部落军旗"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.72,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 8.5,
								},
								["生命赐福"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 17.63,
								},
								["治疗药水"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 28.01,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["帅气的老头"] = {
									["count"] = 3,
								},
								["丨渣丶哥丨"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
					},
					["HOTs"] = {
						["急救"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 15,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 13,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 11,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["DamageTaken"] = 15909,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 2,
								},
								["冲锋"] = {
									["count"] = 75,
								},
							},
							["amount"] = 77,
						},
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["地震术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕咬"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["凿击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 13,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["地震术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕咬"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["死亡缠绕"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["凿击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 13,
									["amount"] = 0,
								},
							},
							["count"] = 13,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 65.41999999999999,
					["HOT_Time"] = 24,
					["ElementTaken"] = {
						["Physical"] = 5955,
						["Melee"] = 1804,
						["Arcane"] = 314,
						["Frost"] = 2056,
						["Fire"] = 617,
						["Shadow"] = 3342,
						["Nature"] = 1821,
					},
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
					},
					["Damage"] = 14509,
					["DOT_Time"] = 6,
					["TimeHeal"] = 28.01,
					["HealingTaken"] = 4660,
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 2000,
								},
								["生命赐福"] = {
									["count"] = 1072,
								},
								["嗜血"] = {
									["count"] = 280,
								},
								["治疗药水"] = {
									["count"] = 1308,
								},
							},
							["amount"] = 4660,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 2000,
								},
								["生命赐福"] = {
									["count"] = 1072,
								},
								["嗜血"] = {
									["count"] = 280,
								},
								["治疗药水"] = {
									["count"] = 1308,
								},
							},
							["amount"] = 4660,
						},
					},
					["Healing"] = 4660,
					["Heals"] = {
						["急救"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 250,
									["min"] = 250,
									["count"] = 8,
									["amount"] = 2000,
								},
							},
							["count"] = 8,
							["amount"] = 2000,
						},
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1072,
									["min"] = 1072,
									["count"] = 1,
									["amount"] = 1072,
								},
							},
							["count"] = 1,
							["amount"] = 1072,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 14,
									["amount"] = 280,
								},
							},
							["count"] = 14,
							["amount"] = 280,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1308,
									["min"] = 1308,
									["count"] = 1,
									["amount"] = 1308,
								},
							},
							["count"] = 1,
							["amount"] = 1308,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 14,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 22,
						},
					},
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 736,
									["min"] = 736,
									["count"] = 1,
									["amount"] = 736,
								},
								["Hit"] = {
									["max"] = 689,
									["min"] = 346,
									["count"] = 4,
									["amount"] = 2128,
								},
							},
							["count"] = 5,
							["amount"] = 2864,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 93,
									["min"] = 89,
									["count"] = 2,
									["amount"] = 182,
								},
							},
							["count"] = 2,
							["amount"] = 182,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 627,
									["min"] = 627,
									["count"] = 1,
									["amount"] = 627,
								},
							},
							["count"] = 1,
							["amount"] = 627,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1241,
									["min"] = 1241,
									["count"] = 1,
									["amount"] = 1241,
								},
							},
							["count"] = 1,
							["amount"] = 1241,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 409,
									["min"] = 409,
									["count"] = 1,
									["amount"] = 409,
								},
							},
							["count"] = 1,
							["amount"] = 409,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 63,
									["min"] = 53,
									["count"] = 2,
									["amount"] = 116,
								},
							},
							["count"] = 2,
							["amount"] = 116,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 74,
									["min"] = 60,
									["count"] = 2,
									["amount"] = 134,
								},
								["Hit"] = {
									["max"] = 43,
									["min"] = 30,
									["count"] = 4,
									["amount"] = 138,
								},
							},
							["count"] = 6,
							["amount"] = 272,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 873,
									["min"] = 678,
									["count"] = 3,
									["amount"] = 2239,
								},
							},
							["count"] = 3,
							["amount"] = 2239,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 773,
									["min"] = 651,
									["count"] = 2,
									["amount"] = 1424,
								},
								["Hit"] = {
									["max"] = 688,
									["min"] = 365,
									["count"] = 11,
									["amount"] = 5135,
								},
							},
							["count"] = 14,
							["amount"] = 6559,
						},
					},
					["RageGain"] = 77,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 627,
								},
							},
							["amount"] = 627,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 30,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["斩杀"] = {
									["count"] = 873,
								},
								["肉搏"] = {
									["count"] = 427,
								},
							},
							["amount"] = 1383,
						},
						["帅气的老头"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 905,
								},
								["旋风斩"] = {
									["count"] = 409,
								},
								["压制"] = {
									["count"] = 1241,
								},
								["断筋"] = {
									["count"] = 107,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 93,
								},
								["肉搏"] = {
									["count"] = 2336,
								},
							},
							["amount"] = 5091,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 736,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 89,
								},
								["断筋"] = {
									["count"] = 60,
								},
								["斩杀"] = {
									["count"] = 688,
								},
								["肉搏"] = {
									["count"] = 1789,
								},
							},
							["amount"] = 3362,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 32,
								},
								["斩杀"] = {
									["count"] = 678,
								},
								["肉搏"] = {
									["count"] = 761,
								},
							},
							["amount"] = 1471,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 43,
								},
								["拦截昏迷"] = {
									["count"] = 63,
								},
								["嗜血"] = {
									["count"] = 534,
								},
								["肉搏"] = {
									["count"] = 558,
								},
							},
							["amount"] = 1198,
						},
						["部落军旗"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 689,
								},
								["肉搏"] = {
									["count"] = 688,
								},
							},
							["amount"] = 1377,
						},
					},
					["TimeDamage"] = 37.41,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 314,
								},
								["冰霜新星"] = {
									["count"] = 27,
								},
								["冰锥术"] = {
									["count"] = 2029,
								},
								["火焰冲击"] = {
									["count"] = 617,
								},
							},
							["amount"] = 2987,
						},
						["帅气的老头"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 148,
								},
								["地震术"] = {
									["count"] = 1196,
								},
								["闪电之盾"] = {
									["count"] = 480,
								},
								["肉搏"] = {
									["count"] = 1275,
								},
							},
							["amount"] = 3099,
						},
						["跳跳"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 49,
								},
								["肉搏"] = {
									["count"] = 122,
								},
							},
							["amount"] = 171,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 706,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 630,
								},
								["暗影灼烧"] = {
									["count"] = 790,
								},
							},
							["amount"] = 2126,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1216,
								},
							},
							["amount"] = 1216,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 667,
								},
							},
							["amount"] = 667,
						},
						["狼牙"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 254,
								},
							},
							["amount"] = 254,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["凿击"] = {
									["count"] = 45,
								},
								["肉搏"] = {
									["count"] = 153,
								},
							},
							["amount"] = 198,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 145,
								},
								["自动射击"] = {
									["count"] = 511,
								},
							},
							["amount"] = 656,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 424,
								},
								["自动射击"] = {
									["count"] = 1684,
								},
								["多重射击"] = {
									["count"] = 1687,
								},
								["瞄准射击"] = {
									["count"] = 740,
								},
							},
							["amount"] = 4535,
						},
					},
					["ElementDone"] = {
						["Melee"] = 6559,
						["Physical"] = 7950,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["急救"] = {
									["count"] = 8.5,
								},
								["生命赐福"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 17.63,
								},
								["治疗药水"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 28.01,
						},
						["帅气的老头"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 4.85,
								},
							},
							["amount"] = 12.81,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 6,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.75,
								},
							},
							["amount"] = 4.2,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.35,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 2.55,
								},
							},
							["amount"] = 7.630000000000001,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.72,
								},
								["拦截昏迷"] = {
									["count"] = 1.23,
								},
								["嗜血"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.55,
						},
						["部落军旗"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.72,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 6,
						},
						["帅气的老头"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.58,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 4.85,
								},
							},
							["amount"] = 12.81,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.35,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.73,
								},
								["肉搏"] = {
									["count"] = 2.55,
								},
							},
							["amount"] = 7.630000000000001,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.95,
								},
								["肉搏"] = {
									["count"] = 1.75,
								},
							},
							["amount"] = 4.2,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.72,
								},
								["拦截昏迷"] = {
									["count"] = 1.23,
								},
								["嗜血"] = {
									["count"] = 0.1,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.55,
						},
						["部落军旗"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.22,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.72,
						},
					},
				},
			},
			["UnitLockout"] = 36840.948,
			["LastActive"] = 37003.94,
		},
		["风拂面-黑龙费尔默"] = {
			["GUID"] = "Player-5450-03384C54",
			["LastEventHealth"] = {
				1925, -- [1]
				1925, -- [2]
				4308, -- [3]
				4308, -- [4]
				3977, -- [5]
				3980, -- [6]
				3775, -- [7]
				3775, -- [8]
				3778, -- [9]
				3568, -- [10]
				3568, -- [11]
				3568, -- [12]
				4539, -- [13]
				4475, -- [14]
				4475, -- [15]
				4479, -- [16]
				4308, -- [17]
				4238, -- [18]
				4216, -- [19]
				4216, -- [20]
				4219, -- [21]
				4223, -- [22]
				3346, -- [23]
				3391, -- [24]
				3032, -- [25]
				3080, -- [26]
				3125, -- [27]
				3135, -- [28]
				3138, -- [29]
				3145, -- [30]
				2808, -- [31]
				2811, -- [32]
				2814, -- [33]
				2814, -- [34]
				2769, -- [35]
				2817, -- [36]
				2817, -- [37]
				2817, -- [38]
				2865, -- [39]
				2911, -- [40]
				1938, -- [41]
				1987, -- [42]
				2037, -- [43]
				2136, -- [44]
				1858, -- [45]
				1640, -- [46]
				1646, -- [47]
				1650, -- [48]
				1758, -- [49]
				1813, -- [50]
			},
			["LastAttackedBy"] = "牧老-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"HEAL", -- [23]
				"DAMAGE", -- [24]
				"HEAL", -- [25]
				"HEAL", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"HEAL", -- [38]
				"HEAL", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"HEAL", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					13.5, -- [1]
				},
				["Healing"] = {
					408, -- [1]
				},
				["DamageTaken"] = {
					4236, -- [1]
				},
				["RageGain"] = {
					115, -- [1]
				},
				["HOT_Time"] = {
					27, -- [1]
				},
				["ActiveTime"] = {
					46.21999999999999, -- [1]
				},
				["TimeDamage"] = {
					32.71999999999999, -- [1]
				},
				["HealingTaken"] = {
					408, -- [1]
				},
				["DOT_Time"] = {
					18, -- [1]
				},
				["Damage"] = {
					7608, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "暗影守卫",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastHealTime"] = 36967.355,
			["LastEventHealthMax"] = {
				4539, -- [1]
				4539, -- [2]
				4539, -- [3]
				4539, -- [4]
				4539, -- [5]
				4539, -- [6]
				4539, -- [7]
				4539, -- [8]
				4539, -- [9]
				4539, -- [10]
				4539, -- [11]
				4539, -- [12]
				4539, -- [13]
				4539, -- [14]
				4539, -- [15]
				4539, -- [16]
				4539, -- [17]
				4539, -- [18]
				4539, -- [19]
				4539, -- [20]
				4539, -- [21]
				4539, -- [22]
				4539, -- [23]
				4539, -- [24]
				4539, -- [25]
				4539, -- [26]
				4539, -- [27]
				4539, -- [28]
				4539, -- [29]
				4539, -- [30]
				4539, -- [31]
				4539, -- [32]
				4539, -- [33]
				4539, -- [34]
				4539, -- [35]
				4539, -- [36]
				4539, -- [37]
				4539, -- [38]
				4539, -- [39]
				4539, -- [40]
				4539, -- [41]
				4539, -- [42]
				4539, -- [43]
				4539, -- [44]
				4539, -- [45]
				4539, -- [46]
				4539, -- [47]
				4539, -- [48]
				4539, -- [49]
				4539, -- [50]
			},
			["LastDamageTaken"] = 218,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 36966.938,
				["OVERALL"] = 36987.939,
				["DamageTaken"] = 36969.938,
				["ActiveTime"] = 36987.939,
				["RageGain"] = 36985.939,
				["HOT_Time"] = 36966.938,
				["TimeDamage"] = 36987.939,
				["HealingTaken"] = 36966.938,
				["Healing"] = 36966.938,
				["DOT_Time"] = 36982.939,
				["Damage"] = 36987.939,
			},
			["NextEventNum"] = 3,
			["LastDamageTime"] = 36988.423,
			["LastEvents"] = {
				"风拂面-黑龙费尔默 断筋 南宫狸猫-火妖鲁西弗隆 Hit -29 (Physical)", -- [1]
				"风拂面-黑龙费尔默 肉搏 南宫狸猫-火妖鲁西弗隆 Hit -332 (Physical)", -- [2]
				"风拂面-黑龙费尔默 断筋 帅气的老头 Hit -36 (Physical)", -- [3]
				"风拂面-黑龙费尔默 肉搏 帅气的老头 Hit -323 (Physical)", -- [4]
				"风拂面-黑龙费尔默 肉搏 帅气的老头 Crit -788 (Physical)", -- [5]
				"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 风拂面-黑龙费尔默 Tick -209 (Shadow)", -- [6]
				"风拂面-黑龙费尔默 拦截昏迷 南宫狸猫-火妖鲁西弗隆 Hit -43 (Physical)", -- [7]
				"风拂面-黑龙费尔默 肉搏 南宫狸猫-火妖鲁西弗隆 Hit -381 (Physical)", -- [8]
				"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 风拂面-黑龙费尔默 Tick -210 (Shadow)", -- [9]
				"风拂面-黑龙费尔默 旋风斩 南宫狸猫-火妖鲁西弗隆 Hit -349 (Physical)", -- [10]
				"风拂面-黑龙费尔默 旋风斩 大胸法神 Absorb -395 (395 被吸收) (Physical)", -- [11]
				"风拂面-黑龙费尔默 旋风斩 牧老-火妖鲁西弗隆 Hit -293 (Physical)", -- [12]
				"Environment Falling 风拂面-黑龙费尔默 Hit -336 (Physical)", -- [13]
				"风拂面-黑龙费尔默 断筋 仙影袭归-黑龙费尔默 Miss (Physical)", -- [14]
				"风拂面-黑龙费尔默 肉搏 仙影袭归-黑龙费尔默 Hit -345 (Physical)", -- [15]
				"仙影袭归-黑龙费尔默 邪恶攻击 风拂面-黑龙费尔默 Hit -174 (Physical)", -- [16]
				"仙影袭归-黑龙费尔默 肉搏 风拂面-黑龙费尔默 Hit -70 (Physical)", -- [17]
				"仙影袭归-黑龙费尔默 肉搏 风拂面-黑龙费尔默 Hit -147 (Physical)", -- [18]
				"风拂面-黑龙费尔默 断筋 帅气的老头 Hit -35 (Physical)", -- [19]
				"风拂面-黑龙费尔默 肉搏 帅气的老头 Dodge (1)", -- [20]
				"风拂面-黑龙费尔默 压制 帅气的老头 Crit -873 (Physical)", -- [21]
				"丨渣丶哥丨 自动射击 风拂面-黑龙费尔默 Crit -880 (Physical)", -- [22]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +45", -- [23]
				"丨渣丶哥丨 自动射击 风拂面-黑龙费尔默 Hit -362 (Physical)", -- [24]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +45", -- [25]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +45", -- [26]
				"风拂面-黑龙费尔默 拦截昏迷 丨渣丶哥丨 Hit -47 (Physical)", -- [27]
				"风拂面-黑龙费尔默 断筋 狼牙 Dodge (Physical)", -- [28]
				"风拂面-黑龙费尔默 肉搏 丨渣丶哥丨 Hit -340 (Physical)", -- [29]
				"风拂面-黑龙费尔默 英勇打击 丨渣丶哥丨 Crit -843 (Physical)", -- [30]
				"风拂面-黑龙费尔默 撕裂 (伤害/跳) 丨渣丶哥丨 Tick -28 (Physical)", -- [31]
				"风拂面-黑龙费尔默 重伤 (伤害/跳) 丨渣丶哥丨 Tick -78 (Physical)", -- [32]
				"风拂面-黑龙费尔默 英勇打击 丨渣丶哥丨 Crit -930 (Physical)", -- [33]
				"大胸法神 冰霜新星 风拂面-黑龙费尔默 Crit -49 (Frost)", -- [34]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +45", -- [35]
				"风拂面-黑龙费尔默 肉搏 大胸法神 Absorb -542 (542 被吸收) (1)", -- [36]
				"风拂面-黑龙费尔默 断筋 大胸法神 Absorb -45 (45 被吸收) (Physical)", -- [37]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +45", -- [38]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +46", -- [39]
				"大胸法神 冰锥术 风拂面-黑龙费尔默 Crit -976 (Frost)", -- [40]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +46", -- [41]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +46", -- [42]
				"风拂面-黑龙费尔默 血之狂热 风拂面-黑龙费尔默 Tick +45", -- [43]
				"大胸法神 魔爆术 风拂面-黑龙费尔默 Hit -281 (Arcane)", -- [44]
				"牧老-火妖鲁西弗隆 暗影守卫 风拂面-黑龙费尔默 Hit -218 (Shadow)", -- [45]
				"风拂面-黑龙费尔默 断筋 牧老-火妖鲁西弗隆 Crit -82 (Physical)", -- [46]
				"风拂面-黑龙费尔默 重伤 (伤害/跳) 牧老-火妖鲁西弗隆 Tick -113 (Physical)", -- [47]
				"风拂面-黑龙费尔默 重伤 (伤害/跳) 牧老-火妖鲁西弗隆 Absorb -112 (112 被吸收) (Physical)", -- [48]
				"风拂面-黑龙费尔默 重伤 (伤害/跳) 牧老-火妖鲁西弗隆 Tick -113 (Physical)", -- [49]
				"风拂面-黑龙费尔默 重伤 (伤害/跳) 牧老-火妖鲁西弗隆 Tick -113 (Physical)", -- [50]
			},
			["Name"] = "风拂面-黑龙费尔默",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				36988.189, -- [1]
				36988.423, -- [2]
				36867.733, -- [3]
				36867.899, -- [4]
				36871.7, -- [5]
				36873.983, -- [6]
				36875.083, -- [7]
				36876.04, -- [8]
				36876.983, -- [9]
				36877.567, -- [10]
				36877.567, -- [11]
				36877.567, -- [12]
				36900.468, -- [13]
				36910.835, -- [14]
				36911.102, -- [15]
				36912.385, -- [16]
				36914.635, -- [17]
				36914.802, -- [18]
				36928.203, -- [19]
				36928.619, -- [20]
				36929.736, -- [21]
				36931.953, -- [22]
				36933.97, -- [23]
				36934.92, -- [24]
				36935.953, -- [25]
				36937.97, -- [26]
				36939.387, -- [27]
				36943.57, -- [28]
				36946.154, -- [29]
				36949.971, -- [30]
				36951.371, -- [31]
				36953.004, -- [32]
				36953.771, -- [33]
				36955.088, -- [34]
				36957.088, -- [35]
				36958.071, -- [36]
				36958.454, -- [37]
				36959.088, -- [38]
				36961.088, -- [39]
				36961.355, -- [40]
				36963.355, -- [41]
				36965.355, -- [42]
				36967.355, -- [43]
				36969.488, -- [44]
				36970.072, -- [45]
				36971.105, -- [46]
				36974.139, -- [47]
				36977.139, -- [48]
				36980.122, -- [49]
				36983.139, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeHealing"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["丨渣丶哥丨"] = {
									["count"] = 3,
								},
								["牧老-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 15,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["丨渣丶哥丨"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DOT_Time"] = 18,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 4143,
					["RageGainedFrom"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 38,
								},
								["怒不可遏"] = {
									["count"] = 2,
								},
								["冲锋"] = {
									["count"] = 75,
								},
							},
							["amount"] = 115,
						},
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["HealingTaken"] = 408,
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 46.21999999999999,
					["WhoHealed"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 1752,
						["Melee"] = 217,
						["Arcane"] = 281,
						["Frost"] = 1025,
						["Shadow"] = 637,
						["Nature"] = 231,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 38,
								},
							},
							["amount"] = 38,
						},
						["怒不可遏"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["冲锋"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
					},
					["Damage"] = 7608,
					["HealedWho"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
					},
					["TimeHeal"] = 13.5,
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 46,
									["min"] = 45,
									["count"] = 9,
									["amount"] = 408,
								},
							},
							["count"] = 9,
							["amount"] = 408,
						},
					},
					["HOT_Time"] = 27,
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
					},
					["Healing"] = 408,
					["ElementDoneAbsorb"] = {
						["Melee"] = 542,
						["Physical"] = 552,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 21,
						},
					},
					["Attacks"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 112,
									["min"] = 112,
									["count"] = 1,
									["amount"] = 112,
								},
								["Tick"] = {
									["max"] = 113,
									["min"] = 78,
									["count"] = 4,
									["amount"] = 417,
								},
							},
							["count"] = 5,
							["amount"] = 529,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 873,
									["min"] = 873,
									["count"] = 1,
									["amount"] = 873,
								},
							},
							["count"] = 1,
							["amount"] = 873,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 395,
									["min"] = 395,
									["count"] = 1,
									["amount"] = 395,
								},
								["Hit"] = {
									["max"] = 349,
									["min"] = 293,
									["count"] = 2,
									["amount"] = 642,
								},
							},
							["count"] = 3,
							["amount"] = 1037,
						},
						["英勇打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 930,
									["min"] = 843,
									["count"] = 2,
									["amount"] = 1773,
								},
							},
							["count"] = 2,
							["amount"] = 1773,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 47,
									["min"] = 43,
									["count"] = 2,
									["amount"] = 90,
								},
							},
							["count"] = 2,
							["amount"] = 90,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 45,
									["min"] = 45,
									["count"] = 1,
									["amount"] = 45,
								},
								["Hit"] = {
									["max"] = 36,
									["min"] = 29,
									["count"] = 3,
									["amount"] = 100,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 82,
									["min"] = 82,
									["count"] = 1,
									["amount"] = 82,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 227,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 542,
									["min"] = 542,
									["count"] = 1,
									["amount"] = 542,
								},
								["Crit"] = {
									["max"] = 788,
									["min"] = 788,
									["count"] = 1,
									["amount"] = 788,
								},
								["Hit"] = {
									["max"] = 381,
									["min"] = 323,
									["count"] = 5,
									["amount"] = 1721,
								},
							},
							["count"] = 8,
							["amount"] = 3051,
						},
					},
					["RageGain"] = 115,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 45,
								},
								["肉搏"] = {
									["count"] = 542,
								},
								["旋风斩"] = {
									["count"] = 395,
								},
							},
							["amount"] = 982,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 82,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 451,
								},
								["旋风斩"] = {
									["count"] = 293,
								},
							},
							["amount"] = 826,
						},
						["帅气的老头"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 71,
								},
								["压制"] = {
									["count"] = 873,
								},
								["肉搏"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 2055,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 345,
								},
							},
							["amount"] = 345,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 29,
								},
								["拦截昏迷"] = {
									["count"] = 43,
								},
								["旋风斩"] = {
									["count"] = 349,
								},
								["肉搏"] = {
									["count"] = 713,
								},
							},
							["amount"] = 1134,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1773,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
								["拦截昏迷"] = {
									["count"] = 47,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 78,
								},
								["肉搏"] = {
									["count"] = 340,
								},
							},
							["amount"] = 2266,
						},
					},
					["TimeDamage"] = 32.71999999999999,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 281,
								},
								["冰锥术"] = {
									["count"] = 976,
								},
								["冰霜新星"] = {
									["count"] = 49,
								},
							},
							["amount"] = 1306,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["帅气的老头"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 231,
								},
							},
							["amount"] = 231,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 336,
								},
							},
							["amount"] = 336,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 217,
								},
								["邪恶攻击"] = {
									["count"] = 174,
								},
							},
							["amount"] = 391,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 419,
								},
							},
							["amount"] = 419,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1242,
								},
							},
							["amount"] = 1242,
						},
					},
					["ElementDone"] = {
						["Melee"] = 3051,
						["Physical"] = 4557,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.88,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
						["狼牙"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.77,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.19,
								},
							},
							["amount"] = 5.69,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 2.27,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.4,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.17,
						},
						["帅气的老头"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 2.09,
								},
							},
							["amount"] = 6.21,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.88,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["帅气的老头"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 2.09,
								},
							},
							["amount"] = 6.21,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 2.27,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.4,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.17,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.19,
								},
							},
							["amount"] = 5.69,
						},
						["狼牙"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.77,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["丨渣丶哥丨"] = {
									["count"] = 3,
								},
								["牧老-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 15,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["丨渣丶哥丨"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DOT_Time"] = 18,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 4236,
					["RageGainedFrom"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 38,
								},
								["怒不可遏"] = {
									["count"] = 2,
								},
								["冲锋"] = {
									["count"] = 75,
								},
							},
							["amount"] = 115,
						},
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["HealingTaken"] = 408,
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 46.21999999999999,
					["WhoHealed"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
					},
					["ElementTaken"] = {
						["Physical"] = 1845,
						["Melee"] = 217,
						["Arcane"] = 281,
						["Frost"] = 1025,
						["Shadow"] = 637,
						["Nature"] = 231,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 38,
								},
							},
							["amount"] = 38,
						},
						["怒不可遏"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["冲锋"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 75,
								},
							},
							["amount"] = 75,
						},
					},
					["Damage"] = 7608,
					["HealedWho"] = {
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 408,
								},
							},
							["amount"] = 408,
						},
					},
					["TimeHeal"] = 13.5,
					["Heals"] = {
						["血之狂热"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 46,
									["min"] = 45,
									["count"] = 9,
									["amount"] = 408,
								},
							},
							["count"] = 9,
							["amount"] = 408,
						},
					},
					["HOT_Time"] = 27,
					["HOTs"] = {
						["血之狂热"] = {
							["Details"] = {
								["风拂面-黑龙费尔默"] = {
									["count"] = 27,
								},
							},
							["amount"] = 27,
						},
					},
					["Healing"] = 408,
					["ElementDoneAbsorb"] = {
						["Melee"] = 542,
						["Physical"] = 552,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 8,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Tick"] = {
									["count"] = 5,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 21,
						},
					},
					["Attacks"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 112,
									["min"] = 112,
									["count"] = 1,
									["amount"] = 112,
								},
								["Tick"] = {
									["max"] = 113,
									["min"] = 78,
									["count"] = 4,
									["amount"] = 417,
								},
							},
							["count"] = 5,
							["amount"] = 529,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 873,
									["min"] = 873,
									["count"] = 1,
									["amount"] = 873,
								},
							},
							["count"] = 1,
							["amount"] = 873,
						},
						["旋风斩"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 395,
									["min"] = 395,
									["count"] = 1,
									["amount"] = 395,
								},
								["Hit"] = {
									["max"] = 349,
									["min"] = 293,
									["count"] = 2,
									["amount"] = 642,
								},
							},
							["count"] = 3,
							["amount"] = 1037,
						},
						["英勇打击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 930,
									["min"] = 843,
									["count"] = 2,
									["amount"] = 1773,
								},
							},
							["count"] = 2,
							["amount"] = 1773,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 47,
									["min"] = 43,
									["count"] = 2,
									["amount"] = 90,
								},
							},
							["count"] = 2,
							["amount"] = 90,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 45,
									["min"] = 45,
									["count"] = 1,
									["amount"] = 45,
								},
								["Hit"] = {
									["max"] = 36,
									["min"] = 29,
									["count"] = 3,
									["amount"] = 100,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 82,
									["min"] = 82,
									["count"] = 1,
									["amount"] = 82,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 227,
						},
						["肉搏"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 542,
									["min"] = 542,
									["count"] = 1,
									["amount"] = 542,
								},
								["Crit"] = {
									["max"] = 788,
									["min"] = 788,
									["count"] = 1,
									["amount"] = 788,
								},
								["Hit"] = {
									["max"] = 381,
									["min"] = 323,
									["count"] = 5,
									["amount"] = 1721,
								},
							},
							["count"] = 8,
							["amount"] = 3051,
						},
					},
					["RageGain"] = 115,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 45,
								},
								["肉搏"] = {
									["count"] = 542,
								},
								["旋风斩"] = {
									["count"] = 395,
								},
							},
							["amount"] = 982,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 82,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 451,
								},
								["旋风斩"] = {
									["count"] = 293,
								},
							},
							["amount"] = 826,
						},
						["帅气的老头"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 71,
								},
								["压制"] = {
									["count"] = 873,
								},
								["肉搏"] = {
									["count"] = 1111,
								},
							},
							["amount"] = 2055,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 345,
								},
							},
							["amount"] = 345,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 29,
								},
								["拦截昏迷"] = {
									["count"] = 43,
								},
								["旋风斩"] = {
									["count"] = 349,
								},
								["肉搏"] = {
									["count"] = 713,
								},
							},
							["amount"] = 1134,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1773,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
								["拦截昏迷"] = {
									["count"] = 47,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 78,
								},
								["肉搏"] = {
									["count"] = 340,
								},
							},
							["amount"] = 2266,
						},
					},
					["TimeDamage"] = 32.71999999999999,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 281,
								},
								["冰锥术"] = {
									["count"] = 976,
								},
								["冰霜新星"] = {
									["count"] = 49,
								},
							},
							["amount"] = 1306,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["帅气的老头"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 231,
								},
							},
							["amount"] = 231,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 429,
								},
							},
							["amount"] = 429,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 217,
								},
								["邪恶攻击"] = {
									["count"] = 174,
								},
							},
							["amount"] = 391,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 419,
								},
							},
							["amount"] = 419,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 1242,
								},
							},
							["amount"] = 1242,
						},
					},
					["ElementDone"] = {
						["Melee"] = 3051,
						["Physical"] = 4557,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.88,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["风拂面-黑龙费尔默"] = {
							["Details"] = {
								["血之狂热"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 13.5,
						},
						["狼牙"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.77,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.19,
								},
							},
							["amount"] = 5.69,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 2.27,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.4,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.17,
						},
						["帅气的老头"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 2.09,
								},
							},
							["amount"] = 6.21,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 0.38,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.88,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 6,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 7.5,
						},
						["帅气的老头"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 3,
								},
								["压制"] = {
									["count"] = 1.12,
								},
								["肉搏"] = {
									["count"] = 2.09,
								},
							},
							["amount"] = 6.21,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 2.27,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.4,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8.17,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.19,
								},
							},
							["amount"] = 5.69,
						},
						["狼牙"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.27,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.77,
						},
					},
				},
			},
			["UnitLockout"] = 36976.939,
			["LastActive"] = 36987.939,
		},
		["小小蚁来了"] = {
			["GUID"] = "Player-5458-02ED442A",
			["LastEventHealth"] = {
				3254, -- [1]
				2392, -- [2]
				1950, -- [3]
				1776, -- [4]
				1244, -- [5]
				1078, -- [6]
				3403, -- [7]
				3403, -- [8]
				3403, -- [9]
				3403, -- [10]
				3188, -- [11]
				3188, -- [12]
				3188, -- [13]
				3188, -- [14]
				3192, -- [15]
				1745, -- [16]
				645, -- [17]
				645, -- [18]
				645, -- [19]
				427, -- [20]
				430, -- [21]
				224, -- [22]
				0, -- [23]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"MISC", -- [23]
			},
			["TimeWindows"] = {
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					5.48, -- [1]
				},
				["TimeDamage"] = {
					5.48, -- [1]
				},
				["DamageTaken"] = {
					6571, -- [1]
				},
				["Damage"] = {
					1253, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						false, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
					},
					["Messages"] = {
						"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Absorb -255 (1)", -- [1]
						"小小蚁来了 伏击 牧老-火妖鲁西弗隆 Hit -380 (255 被吸收) (Physical)", -- [2]
						"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Miss (1)", -- [3]
						"牧老-火妖鲁西弗隆 暗影守卫 小小蚁来了 Hit -218 (Shadow)", -- [4]
						"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Hit -52 (Physical)", -- [5]
						"牧老-火妖鲁西弗隆 铁皮手雷 小小蚁来了 Resist (Fire)", -- [6]
						"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Miss (1)", -- [7]
						"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Hit -54 (Physical)", -- [8]
						"丨渣丶哥丨 多重射击 小小蚁来了 Crit -1447 (Physical)", -- [9]
						"丨渣丶哥丨 自动射击 小小蚁来了 Crit -1100 (Physical)", -- [10]
						"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Hit -133 (Physical)", -- [11]
						"牧老-火妖鲁西弗隆 暗影守卫 小小蚁来了 Hit -218 (Shadow)", -- [12]
						"小小蚁来了 刺骨 牧老-火妖鲁西弗隆 Crit -379 (Physical)", -- [13]
						"跳跳 肉搏 小小蚁来了 Dodge (1)", -- [14]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 小小蚁来了 Tick -206 (Shadow)", -- [15]
						"丨渣丶哥丨 自动射击 小小蚁来了 Crit -1020 (Physical)", -- [16]
						"小小蚁来了死亡。", -- [17]
					},
					["DeathAt"] = 36986.939,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
					},
					["MessageTimes"] = {
						-6.184000000001106, -- [1]
						-6.184000000001106, -- [2]
						-6.149999999994179, -- [3]
						-5.883999999998196, -- [4]
						-5.23399999999674, -- [5]
						-5.19999999999709, -- [6]
						-4.333999999995285, -- [7]
						-3.434000000001106, -- [8]
						-3.23399999999674, -- [9]
						-3.049999999995634, -- [10]
						-2.533999999999651, -- [11]
						-2.283999999999651, -- [12]
						-2.19999999999709, -- [13]
						-1.649999999994179, -- [14]
						-0.4830000000001746, -- [15]
						-0.01699999999982538, -- [16]
						0, -- [17]
					},
					["HealthMax"] = {
						3403, -- [1]
						3403, -- [2]
						3403, -- [3]
						3403, -- [4]
						3403, -- [5]
						3403, -- [6]
						3403, -- [7]
						3403, -- [8]
						3403, -- [9]
						3403, -- [10]
						3403, -- [11]
						3403, -- [12]
						3403, -- [13]
						3403, -- [14]
						3403, -- [15]
						3403, -- [16]
						3403, -- [17]
					},
					["Health"] = {
						3403, -- [1]
						3403, -- [2]
						3403, -- [3]
						3403, -- [4]
						3188, -- [5]
						3188, -- [6]
						3188, -- [7]
						3188, -- [8]
						3192, -- [9]
						1745, -- [10]
						645, -- [11]
						645, -- [12]
						645, -- [13]
						427, -- [14]
						430, -- [15]
						224, -- [16]
						0, -- [17]
					},
					["KilledBy"] = "丨渣丶哥丨",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"MISC", -- [17]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "自动射击",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				3403, -- [1]
				3403, -- [2]
				3403, -- [3]
				3403, -- [4]
				3403, -- [5]
				3403, -- [6]
				3403, -- [7]
				3403, -- [8]
				3403, -- [9]
				3403, -- [10]
				3403, -- [11]
				3403, -- [12]
				3403, -- [13]
				3403, -- [14]
				3403, -- [15]
				3403, -- [16]
				3403, -- [17]
				3403, -- [18]
				3403, -- [19]
				3403, -- [20]
				3403, -- [21]
				3403, -- [22]
				3403, -- [23]
			},
			["LastDamageTaken"] = 1020,
			["Owner"] = false,
			["TimeLast"] = {
				["DeathCount"] = 36984.939,
				["ActiveTime"] = 36982.939,
				["TimeDamage"] = 36982.939,
				["OVERALL"] = 36984.939,
				["DamageTaken"] = 36984.939,
				["Damage"] = 36982.939,
			},
			["NextEventNum"] = 24,
			["LastDamageTime"] = 36983.506,
			["LastEvents"] = {
				"南宫狸猫-火妖鲁西弗隆 瞄准射击 小小蚁来了 Hit -862 (Physical)", -- [1]
				"南宫狸猫-火妖鲁西弗隆 自动射击 小小蚁来了 Hit -445 (Physical)", -- [2]
				"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 小小蚁来了 Tick -174 (Shadow)", -- [3]
				"南宫狸猫-火妖鲁西弗隆 多重射击 小小蚁来了 Hit -535 (Physical)", -- [4]
				"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 小小蚁来了 Tick -173 (Shadow)", -- [5]
				"Evilpsycho-逐风者 腐蚀术 (伤害/跳) 小小蚁来了 Tick -173 (Shadow)", -- [6]
				"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Absorb -255 (1)", -- [7]
				"小小蚁来了 伏击 牧老-火妖鲁西弗隆 Hit -380 (255 被吸收) (Physical)", -- [8]
				"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Miss (1)", -- [9]
				"牧老-火妖鲁西弗隆 暗影守卫 小小蚁来了 Hit -218 (Shadow)", -- [10]
				"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Hit -52 (Physical)", -- [11]
				"牧老-火妖鲁西弗隆 铁皮手雷 小小蚁来了 Resist (Fire)", -- [12]
				"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Miss (1)", -- [13]
				"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Hit -54 (Physical)", -- [14]
				"丨渣丶哥丨 多重射击 小小蚁来了 Crit -1447 (Physical)", -- [15]
				"丨渣丶哥丨 自动射击 小小蚁来了 Crit -1100 (Physical)", -- [16]
				"小小蚁来了 肉搏 牧老-火妖鲁西弗隆 Hit -133 (Physical)", -- [17]
				"牧老-火妖鲁西弗隆 暗影守卫 小小蚁来了 Hit -218 (Shadow)", -- [18]
				"小小蚁来了 刺骨 牧老-火妖鲁西弗隆 Crit -379 (Physical)", -- [19]
				"跳跳 肉搏 小小蚁来了 Dodge (1)", -- [20]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 小小蚁来了 Tick -206 (Shadow)", -- [21]
				"丨渣丶哥丨 自动射击 小小蚁来了 Crit -1020 (Physical)", -- [22]
				"小小蚁来了死亡。", -- [23]
			},
			["Name"] = "小小蚁来了",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				false, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
			},
			["LastEventTimes"] = {
				36922.619, -- [1]
				36923.186, -- [2]
				36923.886, -- [3]
				36925.303, -- [4]
				36926.903, -- [5]
				36929.886, -- [6]
				36979.522, -- [7]
				36979.522, -- [8]
				36979.556, -- [9]
				36979.822, -- [10]
				36980.472, -- [11]
				36980.506, -- [12]
				36981.372, -- [13]
				36982.272, -- [14]
				36982.472, -- [15]
				36982.656, -- [16]
				36983.172, -- [17]
				36983.422, -- [18]
				36983.506, -- [19]
				36984.056, -- [20]
				36985.223, -- [21]
				36985.689, -- [22]
				36985.706, -- [23]
			},
			["Fights"] = {
				["LastFightData"] = {
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["DamageTaken"] = 6571,
					["ElementDoneAbsorb"] = {
						["Physical"] = 255,
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 5.48,
					["ElementTaken"] = {
						["Shadow"] = 1162,
						["Physical"] = 5409,
					},
					["Damage"] = 1253,
					["Attacks"] = {
						["刺骨"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 379,
									["min"] = 379,
									["count"] = 1,
									["amount"] = 379,
								},
							},
							["count"] = 1,
							["amount"] = 379,
						},
						["伏击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 380,
									["min"] = 380,
									["count"] = 1,
									["amount"] = 380,
								},
							},
							["count"] = 1,
							["amount"] = 380,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 255,
									["min"] = 255,
									["count"] = 1,
									["amount"] = 255,
								},
								["Hit"] = {
									["max"] = 133,
									["min"] = 52,
									["count"] = 3,
									["amount"] = 239,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 494,
						},
					},
					["TimeSpent"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 5.48,
						},
					},
					["DamagedWho"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 379,
								},
								["伏击"] = {
									["count"] = 380,
								},
								["肉搏"] = {
									["count"] = 494,
								},
							},
							["amount"] = 1253,
						},
					},
					["TimeDamage"] = 5.48,
					["WhoDamaged"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1447,
								},
								["自动射击"] = {
									["count"] = 2120,
								},
							},
							["amount"] = 3567,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 445,
								},
								["瞄准射击"] = {
									["count"] = 862,
								},
								["多重射击"] = {
									["count"] = 535,
								},
							},
							["amount"] = 1842,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 520,
								},
							},
							["amount"] = 520,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 206,
								},
								["暗影守卫"] = {
									["count"] = 436,
								},
							},
							["amount"] = 642,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDone"] = {
						["Melee"] = 494,
						["Physical"] = 759,
					},
					["TimeDamaging"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 5.48,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["DamageTaken"] = 6571,
					["ElementDoneAbsorb"] = {
						["Physical"] = 255,
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 5.48,
					["ElementTaken"] = {
						["Shadow"] = 1162,
						["Physical"] = 5409,
					},
					["Damage"] = 1253,
					["Attacks"] = {
						["刺骨"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 379,
									["min"] = 379,
									["count"] = 1,
									["amount"] = 379,
								},
							},
							["count"] = 1,
							["amount"] = 379,
						},
						["伏击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 380,
									["min"] = 380,
									["count"] = 1,
									["amount"] = 380,
								},
							},
							["count"] = 1,
							["amount"] = 380,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 255,
									["min"] = 255,
									["count"] = 1,
									["amount"] = 255,
								},
								["Hit"] = {
									["max"] = 133,
									["min"] = 52,
									["count"] = 3,
									["amount"] = 239,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 494,
						},
					},
					["TimeSpent"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 5.48,
						},
					},
					["DamagedWho"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 379,
								},
								["伏击"] = {
									["count"] = 380,
								},
								["肉搏"] = {
									["count"] = 494,
								},
							},
							["amount"] = 1253,
						},
					},
					["TimeDamage"] = 5.48,
					["WhoDamaged"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 1447,
								},
								["自动射击"] = {
									["count"] = 2120,
								},
							},
							["amount"] = 3567,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 445,
								},
								["瞄准射击"] = {
									["count"] = 862,
								},
								["多重射击"] = {
									["count"] = 535,
								},
							},
							["amount"] = 1842,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 520,
								},
							},
							["amount"] = 520,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 206,
								},
								["暗影守卫"] = {
									["count"] = 436,
								},
							},
							["amount"] = 642,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementDone"] = {
						["Melee"] = 494,
						["Physical"] = 759,
					},
					["TimeDamaging"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.33,
								},
								["肉搏"] = {
									["count"] = 5.15,
								},
							},
							["amount"] = 5.48,
						},
					},
				},
			},
			["UnitLockout"] = 36978.939,
			["LastActive"] = 36984.939,
		},
		["苏雅-逐风者"] = {
			["GUID"] = "Player-5451-032AE37B",
			["LastEventHealth"] = {
				4595, -- [1]
				4595, -- [2]
				4595, -- [3]
				4180, -- [4]
				4269, -- [5]
				4269, -- [6]
				4403, -- [7]
				4403, -- [8]
				4403, -- [9]
				4403, -- [10]
				4403, -- [11]
				4403, -- [12]
				4471, -- [13]
			},
			["LastAttackedBy"] = "Environment",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					15.5, -- [1]
				},
				["ActiveTime"] = {
					15.5, -- [1]
				},
				["DamageTaken"] = {
					415, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DOT_Time"] = {
					15, -- [1]
				},
				["Damage"] = {
					3114, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "Falling",
			["LastFightIn"] = 0,
			["LastDamageTaken"] = 415,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				4595, -- [1]
				4595, -- [2]
				4595, -- [3]
				4595, -- [4]
				4595, -- [5]
				4595, -- [6]
				4595, -- [7]
				4595, -- [8]
				4595, -- [9]
				4595, -- [10]
				4595, -- [11]
				4595, -- [12]
				4595, -- [13]
			},
			["GuardianReverseGUIDs"] = {
				["小可爱"] = {
					["LatestGuardian"] = 0,
					["GUIDs"] = {
						[0] = "Pet-0-5428-489-14913-731-02014BBA76",
					},
				},
			},
			["TimeLast"] = {
				["Healing"] = 36940.937,
				["DamageTaken"] = 36902.935,
				["ActiveTime"] = 36993.94,
				["TimeDamage"] = 36993.94,
				["OVERALL"] = 36993.94,
				["DOT_Time"] = 36979.939,
				["Damage"] = 36993.94,
			},
			["Owner"] = false,
			["Pet"] = {
				"小可爱 <苏雅-逐风者>", -- [1]
			},
			["NextEventNum"] = 14,
			["LastDamageTime"] = 36994.473,
			["LastEvents"] = {
				"苏雅-逐风者 毒蛇钉刺 (伤害/跳) 大胸法神 Tick -77 (Nature)", -- [1]
				"苏雅-逐风者 毒蛇钉刺 (伤害/跳) 大胸法神 Tick -77 (Nature)", -- [2]
				"Environment Falling 苏雅-逐风者 Hit -415 (Physical)", -- [3]
				"苏雅-逐风者 毒蛇钉刺 (伤害/跳) 大胸法神 Absorb -77 (77 被吸收) (Nature)", -- [4]
				"苏雅-逐风者 奥术射击 仙影袭归-黑龙费尔默 Hit -205 (Arcane)", -- [5]
				"苏雅-逐风者 多重射击 仙影袭归-黑龙费尔默 Hit -428 (Physical)", -- [6]
				"苏雅-逐风者 肉搏 大胸法神 Absorb -615 (1)", -- [7]
				"苏雅-逐风者 瞄准射击 大胸法神 Hit -191 (615 被吸收) (Physical)", -- [8]
				"苏雅-逐风者 自动射击 大胸法神 Hit -322 (Physical)", -- [9]
				"苏雅-逐风者 毒蛇钉刺 (伤害/跳) 大胸法神 Tick -77 (Nature)", -- [10]
				"苏雅-逐风者 自动射击 仙影袭归-黑龙费尔默 Crit -742 (Physical)", -- [11]
				"苏雅-逐风者 毒蛇钉刺 (伤害/跳) 仙影袭归-黑龙费尔默 Tick -104 (Nature)", -- [12]
				"苏雅-逐风者 奥术射击 部落军旗 Hit -199 (Arcane)", -- [13]
			},
			["Name"] = "苏雅-逐风者",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				false, -- [13]
			},
			["LastEventTimes"] = {
				36897.168, -- [1]
				36900.168, -- [2]
				36903.051, -- [3]
				36903.168, -- [4]
				36910.885, -- [5]
				36915.202, -- [6]
				36969.938, -- [7]
				36969.938, -- [8]
				36970.438, -- [9]
				36974.489, -- [10]
				36977.939, -- [11]
				36980.039, -- [12]
				36994.473, -- [13]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["大胸法神"] = {
									["count"] = 12,
								},
								["仙影袭归-黑龙费尔默"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
					},
					["TimeSpent"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["大胸法神"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6,
								},
								["自动射击"] = {
									["count"] = 0.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8,
						},
						["部落军旗"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 415,
					["ElementDoneAbsorb"] = {
						["Physical"] = 615,
						["Nature"] = 77,
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 15.5,
					["ElementTaken"] = {
						["Physical"] = 415,
					},
					["DOT_Time"] = 15,
					["Damage"] = 3114,
					["Healing"] = 0,
					["ElementDone"] = {
						["Arcane"] = 404,
						["Physical"] = 1683,
						["Melee"] = 615,
						["Nature"] = 412,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 104,
								},
								["奥术射击"] = {
									["count"] = 205,
								},
								["多重射击"] = {
									["count"] = 428,
								},
								["自动射击"] = {
									["count"] = 742,
								},
							},
							["amount"] = 1479,
						},
						["大胸法神"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 308,
								},
								["自动射击"] = {
									["count"] = 322,
								},
								["瞄准射击"] = {
									["count"] = 191,
								},
								["肉搏"] = {
									["count"] = 615,
								},
							},
							["amount"] = 1436,
						},
						["部落军旗"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 199,
								},
							},
							["amount"] = 199,
						},
					},
					["TimeDamage"] = 15.5,
					["TimeDamaging"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["大胸法神"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6,
								},
								["自动射击"] = {
									["count"] = 0.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8,
						},
						["部落军旗"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 415,
								},
							},
							["amount"] = 415,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 77,
									["min"] = 77,
									["count"] = 1,
									["amount"] = 77,
								},
								["Tick"] = {
									["max"] = 104,
									["min"] = 77,
									["count"] = 4,
									["amount"] = 335,
								},
							},
							["count"] = 5,
							["amount"] = 412,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 205,
									["min"] = 199,
									["count"] = 2,
									["amount"] = 404,
								},
							},
							["count"] = 2,
							["amount"] = 404,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 191,
									["min"] = 191,
									["count"] = 1,
									["amount"] = 191,
								},
							},
							["count"] = 1,
							["amount"] = 191,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 742,
									["min"] = 742,
									["count"] = 1,
									["amount"] = 742,
								},
								["Hit"] = {
									["max"] = 322,
									["min"] = 322,
									["count"] = 1,
									["amount"] = 322,
								},
							},
							["count"] = 2,
							["amount"] = 1064,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 428,
									["min"] = 428,
									["count"] = 1,
									["amount"] = 428,
								},
							},
							["count"] = 1,
							["amount"] = 428,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 615,
									["min"] = 615,
									["count"] = 1,
									["amount"] = 615,
								},
							},
							["count"] = 1,
							["amount"] = 615,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["大胸法神"] = {
									["count"] = 12,
								},
								["仙影袭归-黑龙费尔默"] = {
									["count"] = 3,
								},
							},
							["amount"] = 15,
						},
					},
					["TimeSpent"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["大胸法神"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6,
								},
								["自动射击"] = {
									["count"] = 0.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8,
						},
						["部落军旗"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 415,
					["ElementDoneAbsorb"] = {
						["Physical"] = 615,
						["Nature"] = 77,
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 15.5,
					["ElementTaken"] = {
						["Physical"] = 415,
					},
					["DOT_Time"] = 15,
					["Damage"] = 3114,
					["Healing"] = 0,
					["ElementDone"] = {
						["Arcane"] = 404,
						["Physical"] = 1683,
						["Melee"] = 615,
						["Nature"] = 412,
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 104,
								},
								["奥术射击"] = {
									["count"] = 205,
								},
								["多重射击"] = {
									["count"] = 428,
								},
								["自动射击"] = {
									["count"] = 742,
								},
							},
							["amount"] = 1479,
						},
						["大胸法神"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 308,
								},
								["自动射击"] = {
									["count"] = 322,
								},
								["瞄准射击"] = {
									["count"] = 191,
								},
								["肉搏"] = {
									["count"] = 615,
								},
							},
							["amount"] = 1436,
						},
						["部落军旗"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 199,
								},
							},
							["amount"] = 199,
						},
					},
					["TimeDamage"] = 15.5,
					["TimeDamaging"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6,
						},
						["大胸法神"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 6,
								},
								["自动射击"] = {
									["count"] = 0.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 8,
						},
						["部落军旗"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDamaged"] = {
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 415,
								},
							},
							["amount"] = 415,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
					},
					["Attacks"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 77,
									["min"] = 77,
									["count"] = 1,
									["amount"] = 77,
								},
								["Tick"] = {
									["max"] = 104,
									["min"] = 77,
									["count"] = 4,
									["amount"] = 335,
								},
							},
							["count"] = 5,
							["amount"] = 412,
						},
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 205,
									["min"] = 199,
									["count"] = 2,
									["amount"] = 404,
								},
							},
							["count"] = 2,
							["amount"] = 404,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 191,
									["min"] = 191,
									["count"] = 1,
									["amount"] = 191,
								},
							},
							["count"] = 1,
							["amount"] = 191,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 742,
									["min"] = 742,
									["count"] = 1,
									["amount"] = 742,
								},
								["Hit"] = {
									["max"] = 322,
									["min"] = 322,
									["count"] = 1,
									["amount"] = 322,
								},
							},
							["count"] = 2,
							["amount"] = 1064,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 428,
									["min"] = 428,
									["count"] = 1,
									["amount"] = 428,
								},
							},
							["count"] = 1,
							["amount"] = 428,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 615,
									["min"] = 615,
									["count"] = 1,
									["amount"] = 615,
								},
							},
							["count"] = 1,
							["amount"] = 615,
						},
					},
				},
			},
			["UnitLockout"] = 36976.939,
			["LastActive"] = 36993.94,
		},
		["妖术之颅"] = {
			["GUID"] = "Player-5458-035B9D17",
			["LastEventHealth"] = {
				2410, -- [1]
				2410, -- [2]
				2410, -- [3]
				2410, -- [4]
				2410, -- [5]
				2410, -- [6]
				2410, -- [7]
				2139, -- [8]
				1394, -- [9]
				798, -- [10]
				798, -- [11]
				798, -- [12]
				222, -- [13]
				222, -- [14]
				2410, -- [15]
				2410, -- [16]
				2410, -- [17]
				2410, -- [18]
				2410, -- [19]
				2410, -- [20]
				2410, -- [21]
				2410, -- [22]
				2133, -- [23]
				2133, -- [24]
				2133, -- [25]
				2133, -- [26]
				2133, -- [27]
				1915, -- [28]
				1839, -- [29]
				1785, -- [30]
				1785, -- [31]
				1320, -- [32]
				1320, -- [33]
				1244, -- [34]
				0, -- [35]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"MISC", -- [19]
				"MISC", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"MISC", -- [35]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					4.5, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["DamageTaken"] = {
					6453, -- [1]
				},
				["Absorbs"] = {
					836, -- [1]
				},
				["HealingTaken"] = {
					836, -- [1]
				},
				["TimeDamage"] = {
					16.01, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					20.51, -- [1]
				},
				["Damage"] = {
					4364, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						true, -- [2]
						false, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
					},
					["Messages"] = {
						"妖术之颅 寒冰箭 大胸法神 Absorb -442 (442 被吸收) (Frost)", -- [1]
						"大胸法神 魔爆术 妖术之颅 Hit -277 (Arcane)", -- [2]
						"妖术之颅 火焰冲击 大胸法神 Crit -648 (Fire)", -- [3]
						"妖术之颅 冰锥术 大胸法神 Hit -366 (Frost)", -- [4]
						"妖术之颅 魔爆术 跳跳 Hit -203 (68 被抵抗) (Arcane)", -- [5]
						"妖术之颅 魔爆术 牧老-火妖鲁西弗隆 Hit -254 (Arcane)", -- [6]
						"牧老-火妖鲁西弗隆 暗影守卫 妖术之颅 Hit -218 (Shadow)", -- [7]
						"跳跳 肉搏 妖术之颅 Hit -76 (Physical)", -- [8]
						"跳跳 爪击 妖术之颅 Hit -54 (Physical)", -- [9]
						"妖术之颅 火焰冲击 牧老-火妖鲁西弗隆 Absorb -713 (713 被吸收) (Fire)", -- [10]
						"南宫狸猫-火妖鲁西弗隆 自动射击 妖术之颅 Hit -465 (Physical)", -- [11]
						"跳跳 爪击 妖术之颅 Miss (Physical)", -- [12]
						"跳跳 肉搏 妖术之颅 Hit -76 (Physical)", -- [13]
						"南宫狸猫-火妖鲁西弗隆 瞄准射击 妖术之颅 Crit -2170 (Physical)", -- [14]
						"妖术之颅死亡。", -- [15]
					},
					["DeathAt"] = 36983.939,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
					},
					["MessageTimes"] = {
						-13.09999999999855, -- [1]
						-12.73400000000402, -- [2]
						-12.06700000000274, -- [3]
						-10.55000000000291, -- [4]
						-6.483000000000175, -- [5]
						-6.483000000000175, -- [6]
						-6.182999999997264, -- [7]
						-3.983000000000175, -- [8]
						-3.847000000001572, -- [9]
						-3.716000000000349, -- [10]
						-3.283000000003085, -- [11]
						-2.25, -- [12]
						-1.949000000000524, -- [13]
						-0.01600000000325963, -- [14]
						0, -- [15]
					},
					["HealthMax"] = {
						2410, -- [1]
						2410, -- [2]
						2410, -- [3]
						2410, -- [4]
						2410, -- [5]
						2410, -- [6]
						2410, -- [7]
						2410, -- [8]
						2410, -- [9]
						2410, -- [10]
						2410, -- [11]
						2410, -- [12]
						2410, -- [13]
						2410, -- [14]
						2410, -- [15]
					},
					["Health"] = {
						2410, -- [1]
						2410, -- [2]
						2133, -- [3]
						2133, -- [4]
						2133, -- [5]
						2133, -- [6]
						2133, -- [7]
						1915, -- [8]
						1839, -- [9]
						1785, -- [10]
						1785, -- [11]
						1320, -- [12]
						1320, -- [13]
						1244, -- [14]
						0, -- [15]
					},
					["KilledBy"] = "南宫狸猫-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"MISC", -- [15]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "瞄准射击",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				2410, -- [1]
				2410, -- [2]
				2410, -- [3]
				2410, -- [4]
				2410, -- [5]
				2410, -- [6]
				2410, -- [7]
				2410, -- [8]
				2410, -- [9]
				2410, -- [10]
				2410, -- [11]
				2410, -- [12]
				2410, -- [13]
				2410, -- [14]
				2410, -- [15]
				2410, -- [16]
				2410, -- [17]
				2410, -- [18]
				2410, -- [19]
				2410, -- [20]
				2410, -- [21]
				2410, -- [22]
				2410, -- [23]
				2410, -- [24]
				2410, -- [25]
				2410, -- [26]
				2410, -- [27]
				2410, -- [28]
				2410, -- [29]
				2410, -- [30]
				2410, -- [31]
				2410, -- [32]
				2410, -- [33]
				2410, -- [34]
				2410, -- [35]
			},
			["LastHealTime"] = 36867.033,
			["LastDamageTaken"] = 2170,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 36866.949,
				["Dispelled"] = 36966.938,
				["OVERALL"] = 36981.939,
				["DamageTaken"] = 36981.939,
				["Absorbs"] = 36866.949,
				["HealingTaken"] = 36866.949,
				["TimeDamage"] = 36977.939,
				["DeathCount"] = 36981.939,
				["ActiveTime"] = 36977.939,
				["Damage"] = 36977.939,
			},
			["NextEventNum"] = 36,
			["LastDamageTime"] = 36978.506,
			["LastEvents"] = {
				"Environment Falling 妖术之颅 Hit -93 (Physical)", -- [1]
				"帅气的老头 闪电之盾 妖术之颅 Absorb -207 (207 被吸收) (Nature)", -- [2]
				"妖术之颅 火焰冲击 帅气的老头 Hit -476 (Fire)", -- [3]
				"帅气的老头 风暴打击 妖术之颅 Absorb -234 (234 被吸收) (Physical)", -- [4]
				"妖术之颅 冰霜新星 帅气的老头 Crit -140 (Frost)", -- [5]
				"丨渣丶哥丨 肉搏 妖术之颅 Absorb -395 (1)", -- [6]
				"丨渣丶哥丨 多重射击 妖术之颅 Hit -271 (395 被吸收) (Physical)", -- [7]
				"南宫狸猫-火妖鲁西弗隆 多重射击 妖术之颅 Hit -745 (Physical)", -- [8]
				"南宫狸猫-火妖鲁西弗隆 自动射击 妖术之颅 Hit -596 (Physical)", -- [9]
				"跳跳 肉搏 妖术之颅 Miss (1)", -- [10]
				"跳跳 爪击 妖术之颅 Hit -56 (Physical)", -- [11]
				"南宫狸猫-火妖鲁西弗隆 奥术射击 妖术之颅 Crit -520 (Arcane)", -- [12]
				"跳跳 肉搏 妖术之颅 Immune (1)", -- [13]
				"南宫狸猫-火妖鲁西弗隆 自动射击 妖术之颅 Immune (Physical)", -- [14]
				"妖术之颅 火焰冲击 大胸法神 Hit -425 (Fire)", -- [15]
				"妖术之颅 冰锥术 大胸法神 Hit -371 (Frost)", -- [16]
				"妖术之颅 魔爆术 大胸法神 Hit -250 (Arcane)", -- [17]
				"妖术之颅 冰霜新星 大胸法神 Absorb -76 (76 被吸收) (Frost)", -- [18]
				"牧老-火妖鲁西弗隆 dispels 妖术之颅 魔法抑制 (驱散魔法)", -- [19]
				"牧老-火妖鲁西弗隆 dispels 妖术之颅 寒冰护体 (驱散魔法)", -- [20]
				"妖术之颅 寒冰箭 大胸法神 Absorb -442 (442 被吸收) (Frost)", -- [21]
				"大胸法神 魔爆术 妖术之颅 Hit -277 (Arcane)", -- [22]
				"妖术之颅 火焰冲击 大胸法神 Crit -648 (Fire)", -- [23]
				"妖术之颅 冰锥术 大胸法神 Hit -366 (Frost)", -- [24]
				"妖术之颅 魔爆术 跳跳 Hit -203 (68 被抵抗) (Arcane)", -- [25]
				"妖术之颅 魔爆术 牧老-火妖鲁西弗隆 Hit -254 (Arcane)", -- [26]
				"牧老-火妖鲁西弗隆 暗影守卫 妖术之颅 Hit -218 (Shadow)", -- [27]
				"跳跳 肉搏 妖术之颅 Hit -76 (Physical)", -- [28]
				"跳跳 爪击 妖术之颅 Hit -54 (Physical)", -- [29]
				"妖术之颅 火焰冲击 牧老-火妖鲁西弗隆 Absorb -713 (713 被吸收) (Fire)", -- [30]
				"南宫狸猫-火妖鲁西弗隆 自动射击 妖术之颅 Hit -465 (Physical)", -- [31]
				"跳跳 爪击 妖术之颅 Miss (Physical)", -- [32]
				"跳跳 肉搏 妖术之颅 Hit -76 (Physical)", -- [33]
				"南宫狸猫-火妖鲁西弗隆 瞄准射击 妖术之颅 Crit -2170 (Physical)", -- [34]
				"妖术之颅死亡。", -- [35]
			},
			["Name"] = "妖术之颅",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				true, -- [35]
			},
			["LastEventTimes"] = {
				36843.715, -- [1]
				36862.732, -- [2]
				36863.766, -- [3]
				36865.233, -- [4]
				36865.283, -- [5]
				36867.033, -- [6]
				36867.033, -- [7]
				36868.316, -- [8]
				36868.566, -- [9]
				36869.083, -- [10]
				36869.083, -- [11]
				36869.116, -- [12]
				36871.099, -- [13]
				36871.583, -- [14]
				36957.171, -- [15]
				36958.688, -- [16]
				36960.171, -- [17]
				36961.688, -- [18]
				36967.072, -- [19]
				36967.072, -- [20]
				36969.122, -- [21]
				36969.488, -- [22]
				36970.155, -- [23]
				36971.672, -- [24]
				36975.739, -- [25]
				36975.739, -- [26]
				36976.039, -- [27]
				36978.239, -- [28]
				36978.375, -- [29]
				36978.506, -- [30]
				36978.939, -- [31]
				36979.972, -- [32]
				36980.273, -- [33]
				36982.206, -- [34]
				36982.222, -- [35]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeHealing"] = {
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["Dispelled"] = 2,
					["ElementDoneResist"] = {
						["Arcane"] = 68,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.48,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 2.53,
								},
							},
							["amount"] = 10.01,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["帅气的老头"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["跳跳"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["DamageTaken"] = 6360,
					["ElementDoneAbsorb"] = {
						["Fire"] = 713,
						["Frost"] = 518,
					},
					["PartialResist"] = {
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["闪电之盾"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 207,
									["min"] = 207,
									["count"] = 1,
									["amount"] = 207,
								},
							},
							["count"] = 1,
							["amount"] = 207,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 234,
									["min"] = 234,
									["count"] = 1,
									["amount"] = 234,
								},
							},
							["count"] = 1,
							["amount"] = 234,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 395,
									["min"] = 395,
									["count"] = 1,
									["amount"] = 395,
								},
							},
							["count"] = 2,
							["amount"] = 395,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 20.51,
					["ElementTaken"] = {
						["Physical"] = 4591,
						["Melee"] = 547,
						["Arcane"] = 797,
						["Shadow"] = 218,
						["Nature"] = 207,
					},
					["WhoDispelled"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔法抑制 (驱散魔法)"] = {
									["count"] = 1,
								},
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Damage"] = 4364,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 395,
									["min"] = 207,
									["count"] = 3,
									["amount"] = 836,
								},
							},
							["count"] = 3,
							["amount"] = 836,
						},
					},
					["TimeHeal"] = 4.5,
					["ElementDone"] = {
						["Fire"] = 2262,
						["Frost"] = 1395,
						["Arcane"] = 707,
					},
					["WhoHealed"] = {
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 836,
								},
							},
							["amount"] = 836,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.48,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 2.53,
								},
							},
							["amount"] = 10.01,
						},
						["跳跳"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["帅气的老头"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Absorbs"] = 836,
					["ElementTakenAbsorb"] = {
						["Physical"] = 629,
						["Nature"] = 207,
					},
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 140,
									["min"] = 140,
									["count"] = 1,
									["amount"] = 140,
								},
								["Absorb"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
							},
							["count"] = 2,
							["amount"] = 216,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 254,
									["min"] = 203,
									["count"] = 3,
									["amount"] = 707,
								},
							},
							["count"] = 3,
							["amount"] = 707,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 442,
									["min"] = 442,
									["count"] = 1,
									["amount"] = 442,
								},
							},
							["count"] = 1,
							["amount"] = 442,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 366,
									["count"] = 2,
									["amount"] = 737,
								},
							},
							["count"] = 2,
							["amount"] = 737,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 713,
									["min"] = 713,
									["count"] = 1,
									["amount"] = 713,
								},
								["Crit"] = {
									["max"] = 648,
									["min"] = 648,
									["count"] = 1,
									["amount"] = 648,
								},
								["Hit"] = {
									["max"] = 476,
									["min"] = 425,
									["count"] = 2,
									["amount"] = 901,
								},
							},
							["count"] = 4,
							["amount"] = 2262,
						},
					},
					["HealingTaken"] = 836,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 76,
								},
								["魔爆术"] = {
									["count"] = 250,
								},
								["寒冰箭"] = {
									["count"] = 442,
								},
								["冰锥术"] = {
									["count"] = 737,
								},
								["火焰冲击"] = {
									["count"] = 1073,
								},
							},
							["amount"] = 2578,
						},
						["跳跳"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 203,
								},
							},
							["amount"] = 203,
						},
						["帅气的老头"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 140,
								},
								["火焰冲击"] = {
									["count"] = 476,
								},
							},
							["amount"] = 616,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 254,
								},
								["火焰冲击"] = {
									["count"] = 713,
								},
							},
							["amount"] = 967,
						},
					},
					["TimeDamage"] = 16.01,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 277,
								},
							},
							["amount"] = 277,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["帅气的老头"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 234,
								},
								["闪电之盾"] = {
									["count"] = 207,
								},
							},
							["amount"] = 441,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 271,
								},
								["肉搏"] = {
									["count"] = 395,
								},
							},
							["amount"] = 666,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 2170,
								},
								["自动射击"] = {
									["count"] = 1061,
								},
								["多重射击"] = {
									["count"] = 745,
								},
								["奥术射击"] = {
									["count"] = 520,
								},
							},
							["amount"] = 4496,
						},
						["跳跳"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 152,
								},
								["爪击"] = {
									["count"] = 110,
								},
							},
							["amount"] = 262,
						},
					},
					["HealedWho"] = {
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 836,
								},
							},
							["amount"] = 836,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 6,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 10,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["妖术之颅"] = {
									["max"] = 395,
									["min"] = 207,
									["count"] = 3,
									["amount"] = 836,
								},
							},
							["count"] = 3,
							["amount"] = 836,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["Dispelled"] = 2,
					["ElementDoneResist"] = {
						["Arcane"] = 68,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.48,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 2.53,
								},
							},
							["amount"] = 10.01,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["帅气的老头"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["跳跳"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["DamageTaken"] = 6453,
					["ElementDoneAbsorb"] = {
						["Fire"] = 713,
						["Frost"] = 518,
					},
					["PartialResist"] = {
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["风暴打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["闪电之盾"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 207,
									["min"] = 207,
									["count"] = 1,
									["amount"] = 207,
								},
							},
							["count"] = 1,
							["amount"] = 207,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["风暴打击"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 234,
									["min"] = 234,
									["count"] = 1,
									["amount"] = 234,
								},
							},
							["count"] = 1,
							["amount"] = 234,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["奥术射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影守卫"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 395,
									["min"] = 395,
									["count"] = 1,
									["amount"] = 395,
								},
							},
							["count"] = 2,
							["amount"] = 395,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 20.51,
					["ElementTaken"] = {
						["Physical"] = 4684,
						["Melee"] = 547,
						["Arcane"] = 797,
						["Shadow"] = 218,
						["Nature"] = 207,
					},
					["WhoDispelled"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔法抑制 (驱散魔法)"] = {
									["count"] = 1,
								},
								["寒冰护体 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Damage"] = 4364,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Frost"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 395,
									["min"] = 207,
									["count"] = 3,
									["amount"] = 836,
								},
							},
							["count"] = 3,
							["amount"] = 836,
						},
					},
					["TimeHeal"] = 4.5,
					["ElementDone"] = {
						["Fire"] = 2262,
						["Frost"] = 1395,
						["Arcane"] = 707,
					},
					["WhoHealed"] = {
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 836,
								},
							},
							["amount"] = 836,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["魔爆术"] = {
									["count"] = 1.48,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["冰锥术"] = {
									["count"] = 3,
								},
								["火焰冲击"] = {
									["count"] = 2.53,
								},
							},
							["amount"] = 10.01,
						},
						["跳跳"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["帅气的老头"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Absorbs"] = 836,
					["ElementTakenAbsorb"] = {
						["Physical"] = 629,
						["Nature"] = 207,
					},
					["Attacks"] = {
						["冰霜新星"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 140,
									["min"] = 140,
									["count"] = 1,
									["amount"] = 140,
								},
								["Absorb"] = {
									["max"] = 76,
									["min"] = 76,
									["count"] = 1,
									["amount"] = 76,
								},
							},
							["count"] = 2,
							["amount"] = 216,
						},
						["魔爆术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 254,
									["min"] = 203,
									["count"] = 3,
									["amount"] = 707,
								},
							},
							["count"] = 3,
							["amount"] = 707,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 442,
									["min"] = 442,
									["count"] = 1,
									["amount"] = 442,
								},
							},
							["count"] = 1,
							["amount"] = 442,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 371,
									["min"] = 366,
									["count"] = 2,
									["amount"] = 737,
								},
							},
							["count"] = 2,
							["amount"] = 737,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 713,
									["min"] = 713,
									["count"] = 1,
									["amount"] = 713,
								},
								["Crit"] = {
									["max"] = 648,
									["min"] = 648,
									["count"] = 1,
									["amount"] = 648,
								},
								["Hit"] = {
									["max"] = 476,
									["min"] = 425,
									["count"] = 2,
									["amount"] = 901,
								},
							},
							["count"] = 4,
							["amount"] = 2262,
						},
					},
					["HealingTaken"] = 836,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 76,
								},
								["魔爆术"] = {
									["count"] = 250,
								},
								["寒冰箭"] = {
									["count"] = 442,
								},
								["冰锥术"] = {
									["count"] = 737,
								},
								["火焰冲击"] = {
									["count"] = 1073,
								},
							},
							["amount"] = 2578,
						},
						["跳跳"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 203,
								},
							},
							["amount"] = 203,
						},
						["帅气的老头"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 140,
								},
								["火焰冲击"] = {
									["count"] = 476,
								},
							},
							["amount"] = 616,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 254,
								},
								["火焰冲击"] = {
									["count"] = 713,
								},
							},
							["amount"] = 967,
						},
					},
					["TimeDamage"] = 16.01,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["魔爆术"] = {
									["count"] = 277,
								},
							},
							["amount"] = 277,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗影守卫"] = {
									["count"] = 218,
								},
							},
							["amount"] = 218,
						},
						["帅气的老头"] = {
							["Details"] = {
								["风暴打击"] = {
									["count"] = 234,
								},
								["闪电之盾"] = {
									["count"] = 207,
								},
							},
							["amount"] = 441,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 271,
								},
								["肉搏"] = {
									["count"] = 395,
								},
							},
							["amount"] = 666,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 2170,
								},
								["自动射击"] = {
									["count"] = 1061,
								},
								["多重射击"] = {
									["count"] = 745,
								},
								["奥术射击"] = {
									["count"] = 520,
								},
							},
							["amount"] = 4496,
						},
						["跳跳"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 152,
								},
								["爪击"] = {
									["count"] = 110,
								},
							},
							["amount"] = 262,
						},
					},
					["HealedWho"] = {
						["妖术之颅"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 836,
								},
							},
							["amount"] = 836,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 11,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["妖术之颅"] = {
									["max"] = 395,
									["min"] = 207,
									["count"] = 3,
									["amount"] = 836,
								},
							},
							["count"] = 3,
							["amount"] = 836,
						},
					},
				},
			},
			["UnitLockout"] = 36977.939,
			["LastActive"] = 36981.939,
		},
		["小可爱 <苏雅-逐风者>"] = {
			["GUID"] = "Pet-0-5428-489-14913-731-02014BBA76",
			["LastEventHealth"] = {
				3383, -- [1]
				3383, -- [2]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
			},
			["TimeWindows"] = {
				["Damage"] = {
					89, -- [1]
				},
				["TimeDamage"] = {
					2.08, -- [1]
				},
				["ActiveTime"] = {
					2.08, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "小可爱",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["ownerName"] = "苏雅-逐风者",
			["LastFlags"] = 4648,
			["TimeLast"] = {
				["Damage"] = 36940.937,
				["OVERALL"] = 36940.937,
				["TimeDamage"] = 36940.937,
				["ActiveTime"] = 36940.937,
			},
			["LastEventHealthMax"] = {
				3383, -- [1]
				3383, -- [2]
			},
			["NextEventNum"] = 3,
			["LastDamageTime"] = 36941.703,
			["LastEvents"] = {
				"小可爱 <苏雅-逐风者> 爪击 丨渣丶哥丨 Hit -23 (Physical)", -- [1]
				"小可爱 <苏雅-逐风者> 肉搏 丨渣丶哥丨 Hit -66 (Physical)", -- [2]
			},
			["Name"] = "小可爱",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
			},
			["LastEventTimes"] = {
				36941.12, -- [1]
				36941.703, -- [2]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeSpent"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.58,
								},
								["爪击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.08,
						},
					},
					["ElementDone"] = {
						["Melee"] = 66,
						["Physical"] = 23,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 66,
								},
								["爪击"] = {
									["count"] = 23,
								},
							},
							["amount"] = 89,
						},
					},
					["TimeDamage"] = 2.08,
					["TimeDamaging"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.58,
								},
								["爪击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.08,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 66,
									["min"] = 66,
									["count"] = 1,
									["amount"] = 66,
								},
							},
							["count"] = 1,
							["amount"] = 66,
						},
						["爪击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 23,
									["min"] = 23,
									["count"] = 1,
									["amount"] = 23,
								},
							},
							["count"] = 1,
							["amount"] = 23,
						},
					},
					["ActiveTime"] = 2.08,
					["Damage"] = 89,
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.58,
								},
								["爪击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.08,
						},
					},
					["ElementDone"] = {
						["Melee"] = 66,
						["Physical"] = 23,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamagedWho"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 66,
								},
								["爪击"] = {
									["count"] = 23,
								},
							},
							["amount"] = 89,
						},
					},
					["TimeDamage"] = 2.08,
					["TimeDamaging"] = {
						["丨渣丶哥丨"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.58,
								},
								["爪击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.08,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 66,
									["min"] = 66,
									["count"] = 1,
									["amount"] = 66,
								},
							},
							["count"] = 1,
							["amount"] = 66,
						},
						["爪击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 23,
									["min"] = 23,
									["count"] = 1,
									["amount"] = 23,
								},
							},
							["count"] = 1,
							["amount"] = 23,
						},
					},
					["ActiveTime"] = 2.08,
					["Damage"] = 89,
				},
			},
			["UnitLockout"] = 36940.937,
			["LastActive"] = 36940.937,
		},
		["掉毛麻雀-逐风者"] = {
			["GUID"] = "Player-5451-034234B7",
			["TimeLast"] = {
				["TimeHeal"] = 36983.939,
				["OVERALL"] = 36990.94,
				["DamageTaken"] = 36990.94,
				["DeathCount"] = 36990.94,
				["RageGain"] = 36969.938,
				["ActiveTime"] = 36989.94,
				["TimeDamage"] = 36989.94,
				["HealingTaken"] = 36983.939,
				["Healing"] = 36983.939,
				["DOT_Time"] = 36989.94,
				["Damage"] = 36989.94,
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"HEAL", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"MISC", -- [31]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					3, -- [1]
				},
				["Healing"] = {
					40, -- [1]
				},
				["DamageTaken"] = {
					5498, -- [1]
				},
				["RageGain"] = {
					16, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					17.29, -- [1]
				},
				["TimeDamage"] = {
					14.29, -- [1]
				},
				["HealingTaken"] = {
					40, -- [1]
				},
				["DOT_Time"] = {
					6, -- [1]
				},
				["Damage"] = {
					4958, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						true, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
					},
					["Messages"] = {
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -227 (Shadow)", -- [1]
						"掉毛麻雀-逐风者 拦截昏迷 牧老-火妖鲁西弗隆 Absorb -53 (53 被吸收) (Physical)", -- [2]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [3]
						"掉毛麻雀-逐风者 断筋 牧老-火妖鲁西弗隆 Crit -82 (Physical)", -- [4]
						"掉毛麻雀-逐风者 肉搏 牧老-火妖鲁西弗隆 Hit -467 (Physical)", -- [5]
						"掉毛麻雀-逐风者 嗜血 牧老-火妖鲁西弗隆 Hit -483 (Physical)", -- [6]
						"掉毛麻雀-逐风者 嗜血 掉毛麻雀-逐风者 Hit +20", -- [7]
						"丨渣丶哥丨 多重射击 掉毛麻雀-逐风者 Hit -542 (Physical)", -- [8]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [9]
						"掉毛麻雀-逐风者 旋风斩 跳跳 Crit -881 (Physical)", -- [10]
						"掉毛麻雀-逐风者 嗜血 掉毛麻雀-逐风者 Hit +20", -- [11]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [12]
						"掉毛麻雀-逐风者 重伤 (伤害/跳) 跳跳 Tick -138 (Physical)", -- [13]
						"跳跳 肉搏 掉毛麻雀-逐风者 Hit -58 (Physical)", -- [14]
						"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [15]
						"南宫狸猫-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 掉毛麻雀-逐风者 Tick -112 (Nature)", -- [16]
						"掉毛麻雀-逐风者 重伤 (伤害/跳) 跳跳 Tick -137 (Physical)", -- [17]
						"丨渣丶哥丨 瞄准射击 掉毛麻雀-逐风者 Hit -732 (Physical)", -- [18]
						"丨渣丶哥丨 自动射击 掉毛麻雀-逐风者 Crit -951 (Physical)", -- [19]
						"掉毛麻雀-逐风者死亡。", -- [20]
					},
					["DeathAt"] = 36992.94,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
					},
					["MessageTimes"] = {
						-13.36800000000221, -- [1]
						-11.86699999999837, -- [2]
						-10.36699999999837, -- [3]
						-9.91700000000128, -- [4]
						-9.851000000002387, -- [5]
						-8.400999999998021, -- [6]
						-8.383999999998196, -- [7]
						-8.349999999998545, -- [8]
						-7.349999999998545, -- [9]
						-6.900000000001455, -- [10]
						-6.883999999998196, -- [11]
						-4.349999999998545, -- [12]
						-3.86699999999837, -- [13]
						-3.783999999999651, -- [14]
						-1.36699999999837, -- [15]
						-1.133999999998196, -- [16]
						-0.8669999999983702, -- [17]
						-0.4499999999970896, -- [18]
						0, -- [19]
						0, -- [20]
					},
					["HealthMax"] = {
						5509, -- [1]
						5509, -- [2]
						5509, -- [3]
						5509, -- [4]
						5509, -- [5]
						5509, -- [6]
						5509, -- [7]
						5509, -- [8]
						5509, -- [9]
						5509, -- [10]
						5509, -- [11]
						5509, -- [12]
						5509, -- [13]
						5509, -- [14]
						5509, -- [15]
						5509, -- [16]
						5509, -- [17]
						5509, -- [18]
						5509, -- [19]
						5509, -- [20]
					},
					["Health"] = {
						3273, -- [1]
						3046, -- [2]
						3046, -- [3]
						2820, -- [4]
						2820, -- [5]
						2820, -- [6]
						2820, -- [7]
						2820, -- [8]
						2298, -- [9]
						2072, -- [10]
						2072, -- [11]
						2092, -- [12]
						1866, -- [13]
						1866, -- [14]
						1808, -- [15]
						1582, -- [16]
						1470, -- [17]
						1470, -- [18]
						738, -- [19]
						0, -- [20]
					},
					["KilledBy"] = "丨渣丶哥丨",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"HEAL", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"HEAL", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"MISC", -- [20]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "自动射击",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastHealTime"] = 36984.139,
			["LastEventHealth"] = {
				5245, -- [1]
				4791, -- [2]
				4791, -- [3]
				4791, -- [4]
				4433, -- [5]
				4433, -- [6]
				4433, -- [7]
				4433, -- [8]
				3333, -- [9]
				3333, -- [10]
				3273, -- [11]
				3273, -- [12]
				3046, -- [13]
				3046, -- [14]
				2820, -- [15]
				2820, -- [16]
				2820, -- [17]
				2820, -- [18]
				2820, -- [19]
				2298, -- [20]
				2072, -- [21]
				2072, -- [22]
				2092, -- [23]
				1866, -- [24]
				1866, -- [25]
				1808, -- [26]
				1582, -- [27]
				1470, -- [28]
				1470, -- [29]
				738, -- [30]
				0, -- [31]
			},
			["LastDamageTaken"] = 951,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				5509, -- [1]
				5509, -- [2]
				5509, -- [3]
				5509, -- [4]
				5509, -- [5]
				5509, -- [6]
				5509, -- [7]
				5509, -- [8]
				5509, -- [9]
				5509, -- [10]
				5509, -- [11]
				5509, -- [12]
				5509, -- [13]
				5509, -- [14]
				5509, -- [15]
				5509, -- [16]
				5509, -- [17]
				5509, -- [18]
				5509, -- [19]
				5509, -- [20]
				5509, -- [21]
				5509, -- [22]
				5509, -- [23]
				5509, -- [24]
				5509, -- [25]
				5509, -- [26]
				5509, -- [27]
				5509, -- [28]
				5509, -- [29]
				5509, -- [30]
				5509, -- [31]
			},
			["NextEventNum"] = 32,
			["LastDamageTime"] = 36990.156,
			["LastEvents"] = {
				"南宫狸猫-火妖鲁西弗隆 多重射击 掉毛麻雀-逐风者 Hit -454 (Physical)", -- [1]
				"掉毛麻雀-逐风者 肉搏 牧老-火妖鲁西弗隆 Hit -473 (Physical)", -- [2]
				"掉毛麻雀-逐风者 断筋 牧老-火妖鲁西弗隆 Hit -36 (Physical)", -- [3]
				"南宫狸猫-火妖鲁西弗隆 自动射击 掉毛麻雀-逐风者 Hit -358 (Physical)", -- [4]
				"牧老-火妖鲁西弗隆 心灵尖啸 掉毛麻雀-逐风者 Immune (Shadow)", -- [5]
				"掉毛麻雀-逐风者 旋风斩 大胸法神 Hit -510 (Physical)", -- [6]
				"掉毛麻雀-逐风者 旋风斩 牧老-火妖鲁西弗隆 Hit -497 (Physical)", -- [7]
				"大胸法神 冰锥术 掉毛麻雀-逐风者 Crit -1100 (Frost)", -- [8]
				"掉毛麻雀-逐风者 断筋 大胸法神 Crit -98 (Physical)", -- [9]
				"跳跳 肉搏 掉毛麻雀-逐风者 Hit -60 (Physical)", -- [10]
				"掉毛麻雀-逐风者 肉搏 大胸法神 Crit -1103 (Physical)", -- [11]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -227 (Shadow)", -- [12]
				"掉毛麻雀-逐风者 拦截昏迷 牧老-火妖鲁西弗隆 Absorb -53 (53 被吸收) (Physical)", -- [13]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [14]
				"掉毛麻雀-逐风者 断筋 牧老-火妖鲁西弗隆 Crit -82 (Physical)", -- [15]
				"掉毛麻雀-逐风者 肉搏 牧老-火妖鲁西弗隆 Hit -467 (Physical)", -- [16]
				"掉毛麻雀-逐风者 嗜血 牧老-火妖鲁西弗隆 Hit -483 (Physical)", -- [17]
				"掉毛麻雀-逐风者 嗜血 掉毛麻雀-逐风者 Hit +20", -- [18]
				"丨渣丶哥丨 多重射击 掉毛麻雀-逐风者 Hit -542 (Physical)", -- [19]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [20]
				"掉毛麻雀-逐风者 旋风斩 跳跳 Crit -881 (Physical)", -- [21]
				"掉毛麻雀-逐风者 嗜血 掉毛麻雀-逐风者 Hit +20", -- [22]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [23]
				"掉毛麻雀-逐风者 重伤 (伤害/跳) 跳跳 Tick -138 (Physical)", -- [24]
				"跳跳 肉搏 掉毛麻雀-逐风者 Hit -58 (Physical)", -- [25]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 掉毛麻雀-逐风者 Tick -226 (Shadow)", -- [26]
				"南宫狸猫-火妖鲁西弗隆 毒蛇钉刺 (伤害/跳) 掉毛麻雀-逐风者 Tick -112 (Nature)", -- [27]
				"掉毛麻雀-逐风者 重伤 (伤害/跳) 跳跳 Tick -137 (Physical)", -- [28]
				"丨渣丶哥丨 瞄准射击 掉毛麻雀-逐风者 Hit -732 (Physical)", -- [29]
				"丨渣丶哥丨 自动射击 掉毛麻雀-逐风者 Crit -951 (Physical)", -- [30]
				"掉毛麻雀-逐风者死亡。", -- [31]
			},
			["Name"] = "掉毛麻雀-逐风者",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				false, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
			},
			["LastEventTimes"] = {
				36970.772, -- [1]
				36970.838, -- [2]
				36970.872, -- [3]
				36971.055, -- [4]
				36971.422, -- [5]
				36972.522, -- [6]
				36972.522, -- [7]
				36973.555, -- [8]
				36974.022, -- [9]
				36974.305, -- [10]
				36974.761, -- [11]
				36977.655, -- [12]
				36979.156, -- [13]
				36980.656, -- [14]
				36981.106, -- [15]
				36981.172, -- [16]
				36982.622, -- [17]
				36982.639, -- [18]
				36982.673, -- [19]
				36983.673, -- [20]
				36984.123, -- [21]
				36984.139, -- [22]
				36986.673, -- [23]
				36987.156, -- [24]
				36987.239, -- [25]
				36989.656, -- [26]
				36989.889, -- [27]
				36990.156, -- [28]
				36990.573, -- [29]
				36991.023, -- [30]
				36991.023, -- [31]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeHealing"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["跳跳"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 5498,
					["RageGainedFrom"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 1,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 16,
						},
					},
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 17.29,
					["DOT_Time"] = 6,
					["ElementTaken"] = {
						["Frost"] = 1100,
						["Melee"] = 118,
						["Physical"] = 3037,
						["Shadow"] = 1131,
						["Nature"] = 112,
					},
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["掉毛麻雀-逐风者"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["冲锋"] = {
							["Details"] = {
								["掉毛麻雀-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 4958,
					["HealingTaken"] = 40,
					["TimeHeal"] = 3,
					["WhoHealed"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
					},
					["HealedWho"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
					},
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 2,
									["amount"] = 40,
								},
							},
							["count"] = 2,
							["amount"] = 40,
						},
					},
					["Healing"] = 40,
					["ElementDoneAbsorb"] = {
						["Physical"] = 53,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
					},
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 483,
									["min"] = 483,
									["count"] = 1,
									["amount"] = 483,
								},
							},
							["count"] = 1,
							["amount"] = 483,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 881,
									["min"] = 881,
									["count"] = 1,
									["amount"] = 881,
								},
								["Hit"] = {
									["max"] = 510,
									["min"] = 497,
									["count"] = 2,
									["amount"] = 1007,
								},
							},
							["count"] = 3,
							["amount"] = 1888,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 138,
									["min"] = 137,
									["count"] = 2,
									["amount"] = 275,
								},
							},
							["count"] = 2,
							["amount"] = 275,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 98,
									["min"] = 82,
									["count"] = 2,
									["amount"] = 180,
								},
								["Hit"] = {
									["max"] = 36,
									["min"] = 36,
									["count"] = 1,
									["amount"] = 36,
								},
							},
							["count"] = 3,
							["amount"] = 216,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
							},
							["count"] = 1,
							["amount"] = 53,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1103,
									["min"] = 1103,
									["count"] = 1,
									["amount"] = 1103,
								},
								["Hit"] = {
									["max"] = 473,
									["min"] = 467,
									["count"] = 2,
									["amount"] = 940,
								},
							},
							["count"] = 3,
							["amount"] = 2043,
						},
					},
					["RageGain"] = 16,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 98,
								},
								["肉搏"] = {
									["count"] = 1103,
								},
								["旋风斩"] = {
									["count"] = 510,
								},
							},
							["amount"] = 1711,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 483,
								},
								["旋风斩"] = {
									["count"] = 497,
								},
								["断筋"] = {
									["count"] = 118,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 940,
								},
							},
							["amount"] = 2091,
						},
						["跳跳"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 275,
								},
								["旋风斩"] = {
									["count"] = 881,
								},
							},
							["amount"] = 1156,
						},
					},
					["TimeDamage"] = 14.29,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1100,
								},
							},
							["amount"] = 1100,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1131,
								},
							},
							["amount"] = 1131,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 951,
								},
								["瞄准射击"] = {
									["count"] = 732,
								},
								["多重射击"] = {
									["count"] = 542,
								},
							},
							["amount"] = 2225,
						},
						["跳跳"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 118,
								},
							},
							["amount"] = 118,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 112,
								},
								["自动射击"] = {
									["count"] = 358,
								},
								["多重射击"] = {
									["count"] = 454,
								},
							},
							["amount"] = 924,
						},
					},
					["ElementDone"] = {
						["Melee"] = 2043,
						["Physical"] = 2915,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.74,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.74,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.53,
								},
								["嗜血"] = {
									["count"] = 1.45,
								},
								["肉搏"] = {
									["count"] = 1.57,
								},
							},
							["amount"] = 6.050000000000001,
						},
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["跳跳"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.74,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.74,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.53,
								},
								["嗜血"] = {
									["count"] = 1.45,
								},
								["肉搏"] = {
									["count"] = 1.57,
								},
							},
							["amount"] = 6.050000000000001,
						},
						["跳跳"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["跳跳"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 5,
								},
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Frost"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Nature"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DamageTaken"] = 5498,
					["RageGainedFrom"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["怒不可遏"] = {
									["count"] = 1,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 16,
						},
					},
					["PartialResist"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["自动射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["多重射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["毒蛇钉刺 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["瞄准射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["多重射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 17.29,
					["DOT_Time"] = 6,
					["ElementTaken"] = {
						["Frost"] = 1100,
						["Melee"] = 118,
						["Physical"] = 3037,
						["Shadow"] = 1131,
						["Nature"] = 112,
					},
					["RageGained"] = {
						["怒不可遏"] = {
							["Details"] = {
								["掉毛麻雀-逐风者"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["冲锋"] = {
							["Details"] = {
								["掉毛麻雀-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 4958,
					["HealingTaken"] = 40,
					["TimeHeal"] = 3,
					["WhoHealed"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
					},
					["HealedWho"] = {
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
					},
					["Heals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 2,
									["amount"] = 40,
								},
							},
							["count"] = 2,
							["amount"] = 40,
						},
					},
					["Healing"] = 40,
					["ElementDoneAbsorb"] = {
						["Physical"] = 53,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 10,
						},
					},
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 483,
									["min"] = 483,
									["count"] = 1,
									["amount"] = 483,
								},
							},
							["count"] = 1,
							["amount"] = 483,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 881,
									["min"] = 881,
									["count"] = 1,
									["amount"] = 881,
								},
								["Hit"] = {
									["max"] = 510,
									["min"] = 497,
									["count"] = 2,
									["amount"] = 1007,
								},
							},
							["count"] = 3,
							["amount"] = 1888,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 138,
									["min"] = 137,
									["count"] = 2,
									["amount"] = 275,
								},
							},
							["count"] = 2,
							["amount"] = 275,
						},
						["断筋"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 98,
									["min"] = 82,
									["count"] = 2,
									["amount"] = 180,
								},
								["Hit"] = {
									["max"] = 36,
									["min"] = 36,
									["count"] = 1,
									["amount"] = 36,
								},
							},
							["count"] = 3,
							["amount"] = 216,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 53,
									["min"] = 53,
									["count"] = 1,
									["amount"] = 53,
								},
							},
							["count"] = 1,
							["amount"] = 53,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1103,
									["min"] = 1103,
									["count"] = 1,
									["amount"] = 1103,
								},
								["Hit"] = {
									["max"] = 473,
									["min"] = 467,
									["count"] = 2,
									["amount"] = 940,
								},
							},
							["count"] = 3,
							["amount"] = 2043,
						},
					},
					["RageGain"] = 16,
					["DamagedWho"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 98,
								},
								["肉搏"] = {
									["count"] = 1103,
								},
								["旋风斩"] = {
									["count"] = 510,
								},
							},
							["amount"] = 1711,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 483,
								},
								["旋风斩"] = {
									["count"] = 497,
								},
								["断筋"] = {
									["count"] = 118,
								},
								["拦截昏迷"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 940,
								},
							},
							["amount"] = 2091,
						},
						["跳跳"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 275,
								},
								["旋风斩"] = {
									["count"] = 881,
								},
							},
							["amount"] = 1156,
						},
					},
					["TimeDamage"] = 14.29,
					["WhoDamaged"] = {
						["大胸法神"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 1100,
								},
							},
							["amount"] = 1100,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1131,
								},
							},
							["amount"] = 1131,
						},
						["丨渣丶哥丨"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 951,
								},
								["瞄准射击"] = {
									["count"] = 732,
								},
								["多重射击"] = {
									["count"] = 542,
								},
							},
							["amount"] = 2225,
						},
						["跳跳"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 118,
								},
							},
							["amount"] = 118,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["毒蛇钉刺 (伤害/跳)"] = {
									["count"] = 112,
								},
								["自动射击"] = {
									["count"] = 358,
								},
								["多重射击"] = {
									["count"] = 454,
								},
							},
							["amount"] = 924,
						},
					},
					["ElementDone"] = {
						["Melee"] = 2043,
						["Physical"] = 2915,
					},
					["TimeSpent"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.74,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.74,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.53,
								},
								["嗜血"] = {
									["count"] = 1.45,
								},
								["肉搏"] = {
									["count"] = 1.57,
								},
							},
							["amount"] = 6.050000000000001,
						},
						["掉毛麻雀-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["跳跳"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
					["TimeDamaging"] = {
						["大胸法神"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.74,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.74,
						},
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.53,
								},
								["嗜血"] = {
									["count"] = 1.45,
								},
								["肉搏"] = {
									["count"] = 1.57,
								},
							},
							["amount"] = 6.050000000000001,
						},
						["跳跳"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 3,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
					},
				},
			},
			["UnitLockout"] = 36976.939,
			["LastActive"] = 36990.94,
		},
		["念着倒才猪-老马布兰契"] = {
			["GUID"] = "Player-5447-0357EA53",
			["LastEventHealth"] = {
				3929, -- [1]
				3929, -- [2]
				3698, -- [3]
				3815, -- [4]
				3539, -- [5]
				3715, -- [6]
				3715, -- [7]
				3715, -- [8]
				3717, -- [9]
				2482, -- [10]
				2412, -- [11]
				2359, -- [12]
				447, -- [13]
				378, -- [14]
				0, -- [15]
				0, -- [16]
				1, -- [17]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"MISC", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					1.5, -- [1]
				},
				["Healing"] = {
					116, -- [1]
				},
				["DamageTaken"] = {
					3335, -- [1]
				},
				["HealingTaken"] = {
					116, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					12.17, -- [1]
				},
				["RageGain"] = {
					15, -- [1]
				},
				["TimeDamage"] = {
					10.67, -- [1]
				},
				["DOT_Time"] = {
					12, -- [1]
				},
				["Damage"] = {
					931, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						true, -- [7]
						true, -- [8]
						true, -- [9]
						false, -- [10]
						false, -- [11]
					},
					["Messages"] = {
						"念着倒才猪-老马布兰契 肉搏 埃勒利萨 Miss (1)", -- [1]
						"念着倒才猪-老马布兰契 肉搏 埃勒利萨 Crit -439 (Physical)", -- [2]
						"念着倒才猪-老马布兰契 重伤 (伤害/跳) 埃勒利萨 Tick -50 (Physical)", -- [3]
						"跳跳 肉搏 念着倒才猪-老马布兰契 Hit -71 (Physical)", -- [4]
						"跳跳 爪击 念着倒才猪-老马布兰契 Hit -53 (Physical)", -- [5]
						"Evilpsycho-逐风者 暗影箭 念着倒才猪-老马布兰契 Crit -1912 (Shadow)", -- [6]
						"跳跳 肉搏 念着倒才猪-老马布兰契 Hit -69 (Physical)", -- [7]
						"Evilpsycho-逐风者 暗影灼烧 念着倒才猪-老马布兰契 Hit -999 (Shadow)", -- [8]
						"念着倒才猪-老马布兰契死亡。", -- [9]
						"念着倒才猪-老马布兰契 撕裂 (伤害/跳) 南宫狸猫-火妖鲁西弗隆 Tick -28 (Physical)", -- [10]
						"念着倒才猪-老马布兰契 重伤 (伤害/跳) 南宫狸猫-火妖鲁西弗隆 Tick -50 (Physical)", -- [11]
					},
					["DeathAt"] = 36937.936,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
					},
					["MessageTimes"] = {
						-14.43400000000111, -- [1]
						-14.15099999999802, -- [2]
						-11.12900000000082, -- [3]
						-1.549999999995634, -- [4]
						-0.716999999996915, -- [5]
						-0.6169999999983702, -- [6]
						-0.03399999999965075, -- [7]
						-0.01699999999982538, -- [8]
						0, -- [9]
						0.6000000000058208, -- [10]
						1.317000000002736, -- [11]
					},
					["HealthMax"] = {
						3929, -- [1]
						3929, -- [2]
						3929, -- [3]
						3929, -- [4]
						3929, -- [5]
						3929, -- [6]
						3929, -- [7]
						3929, -- [8]
						3929, -- [9]
						3929, -- [10]
						3929, -- [11]
					},
					["Health"] = {
						3715, -- [1]
						3715, -- [2]
						3717, -- [3]
						2482, -- [4]
						2412, -- [5]
						2359, -- [6]
						447, -- [7]
						378, -- [8]
						0, -- [9]
						0, -- [10]
						1, -- [11]
					},
					["KilledBy"] = "Evilpsycho-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"MISC", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暗影灼烧",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastHealTime"] = 36871.633,
			["LastDamageTaken"] = 999,
			["TimeLast"] = {
				["TimeHeal"] = 36870.949,
				["OVERALL"] = 36936.936,
				["DamageTaken"] = 36935.936,
				["DeathCount"] = 36935.936,
				["RageGain"] = 36870.949,
				["Healing"] = 36870.949,
				["TimeDamage"] = 36936.936,
				["ActiveTime"] = 36936.936,
				["HealingTaken"] = 36870.949,
				["DOT_Time"] = 36936.936,
				["Damage"] = 36936.936,
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				3929, -- [1]
				3929, -- [2]
				3929, -- [3]
				3929, -- [4]
				3929, -- [5]
				3929, -- [6]
				3929, -- [7]
				3929, -- [8]
				3929, -- [9]
				3929, -- [10]
				3929, -- [11]
				3929, -- [12]
				3929, -- [13]
				3929, -- [14]
				3929, -- [15]
				3929, -- [16]
				3929, -- [17]
			},
			["NextEventNum"] = 18,
			["LastDamageTime"] = 36937.487,
			["LastEvents"] = {
				"念着倒才猪-老马布兰契 冲锋击昏 帅气的老头 Resist (Physical)", -- [1]
				"帅气的老头 闪电之盾 念着倒才猪-老马布兰契 Hit -231 (Nature)", -- [2]
				"念着倒才猪-老马布兰契 神圣力量 念着倒才猪-老马布兰契 Hit +116", -- [3]
				"念着倒才猪-老马布兰契 肉搏 帅气的老头 Hit -268 (Physical)", -- [4]
				"念着倒才猪-老马布兰契 重伤 (伤害/跳) 仙影袭归-黑龙费尔默 Tick -50 (Physical)", -- [5]
				"念着倒才猪-老马布兰契 拦截昏迷 埃勒利萨 Hit -46 (Physical)", -- [6]
				"念着倒才猪-老马布兰契 肉搏 埃勒利萨 Miss (1)", -- [7]
				"念着倒才猪-老马布兰契 肉搏 埃勒利萨 Crit -439 (Physical)", -- [8]
				"念着倒才猪-老马布兰契 重伤 (伤害/跳) 埃勒利萨 Tick -50 (Physical)", -- [9]
				"跳跳 肉搏 念着倒才猪-老马布兰契 Hit -71 (Physical)", -- [10]
				"跳跳 爪击 念着倒才猪-老马布兰契 Hit -53 (Physical)", -- [11]
				"Evilpsycho-逐风者 暗影箭 念着倒才猪-老马布兰契 Crit -1912 (Shadow)", -- [12]
				"跳跳 肉搏 念着倒才猪-老马布兰契 Hit -69 (Physical)", -- [13]
				"Evilpsycho-逐风者 暗影灼烧 念着倒才猪-老马布兰契 Hit -999 (Shadow)", -- [14]
				"念着倒才猪-老马布兰契死亡。", -- [15]
				"念着倒才猪-老马布兰契 撕裂 (伤害/跳) 南宫狸猫-火妖鲁西弗隆 Tick -28 (Physical)", -- [16]
				"念着倒才猪-老马布兰契 重伤 (伤害/跳) 南宫狸猫-火妖鲁西弗隆 Tick -50 (Physical)", -- [17]
			},
			["Name"] = "念着倒才猪-老马布兰契",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				false, -- [17]
			},
			["LastEventTimes"] = {
				36871.066, -- [1]
				36871.099, -- [2]
				36871.633, -- [3]
				36872.083, -- [4]
				36908.485, -- [5]
				36920.586, -- [6]
				36921.736, -- [7]
				36922.019, -- [8]
				36925.041, -- [9]
				36934.62, -- [10]
				36935.453, -- [11]
				36935.553, -- [12]
				36936.136, -- [13]
				36936.153, -- [14]
				36936.17, -- [15]
				36936.77, -- [16]
				36937.487, -- [17]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeHealing"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["南宫狸猫-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["仙影袭归-黑龙费尔默"] = {
									["count"] = 3,
								},
								["埃勒利萨"] = {
									["count"] = 3,
								},
								["南宫狸猫-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeSpent"] = {
						["帅气的老头"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.52,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["埃勒利萨"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.43,
								},
							},
							["amount"] = 4.43,
						},
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.72,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.22,
						},
					},
					["DamageTaken"] = 3335,
					["RageGainedFrom"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 12.17,
					["ElementTaken"] = {
						["Shadow"] = 2911,
						["Physical"] = 53,
						["Melee"] = 140,
						["Nature"] = 231,
					},
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["念着倒才猪-老马布兰契"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 931,
					["DOT_Time"] = 12,
					["TimeHeal"] = 1.5,
					["DamagedWho"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
						["埃勒利萨"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 46,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 50,
								},
								["肉搏"] = {
									["count"] = 439,
								},
							},
							["amount"] = 535,
						},
						["帅气的老头"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 268,
								},
							},
							["amount"] = 268,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 50,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
							},
							["amount"] = 78,
						},
					},
					["ElementDone"] = {
						["Melee"] = 707,
						["Physical"] = 224,
					},
					["HealingTaken"] = 116,
					["Healing"] = 116,
					["WhoHealed"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
					},
					["HealedWho"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
					},
					["Attacks"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 3,
									["amount"] = 150,
								},
							},
							["count"] = 3,
							["amount"] = 150,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 46,
									["min"] = 46,
									["count"] = 1,
									["amount"] = 46,
								},
							},
							["count"] = 1,
							["amount"] = 46,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 439,
									["min"] = 439,
									["count"] = 1,
									["amount"] = 439,
								},
								["Hit"] = {
									["max"] = 268,
									["min"] = 268,
									["count"] = 1,
									["amount"] = 268,
								},
							},
							["count"] = 3,
							["amount"] = 707,
						},
					},
					["RageGain"] = 15,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeDamage"] = 10.67,
					["TimeDamaging"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["埃勒利萨"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.43,
								},
							},
							["amount"] = 4.43,
						},
						["帅气的老头"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.52,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.72,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.22,
						},
					},
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 116,
									["min"] = 116,
									["count"] = 1,
									["amount"] = 116,
								},
							},
							["count"] = 1,
							["amount"] = 116,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["跳跳"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 140,
								},
							},
							["amount"] = 193,
						},
						["帅气的老头"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 231,
								},
							},
							["amount"] = 231,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1912,
								},
								["暗影灼烧"] = {
									["count"] = 999,
								},
							},
							["amount"] = 2911,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DOTs"] = {
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["南宫狸猫-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["仙影袭归-黑龙费尔默"] = {
									["count"] = 3,
								},
								["埃勒利萨"] = {
									["count"] = 3,
								},
								["南宫狸猫-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeSpent"] = {
						["帅气的老头"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.52,
						},
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["埃勒利萨"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.43,
								},
							},
							["amount"] = 4.43,
						},
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.72,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.22,
						},
					},
					["DamageTaken"] = 3335,
					["RageGainedFrom"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["PartialResist"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["爪击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗影灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗影箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["闪电之盾"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["爪击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 12.17,
					["ElementTaken"] = {
						["Shadow"] = 2911,
						["Physical"] = 53,
						["Melee"] = 140,
						["Nature"] = 231,
					},
					["RageGained"] = {
						["冲锋"] = {
							["Details"] = {
								["念着倒才猪-老马布兰契"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["Damage"] = 931,
					["DOT_Time"] = 12,
					["TimeHeal"] = 1.5,
					["DamagedWho"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 50,
								},
							},
							["amount"] = 50,
						},
						["埃勒利萨"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 46,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 50,
								},
								["肉搏"] = {
									["count"] = 439,
								},
							},
							["amount"] = 535,
						},
						["帅气的老头"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 268,
								},
							},
							["amount"] = 268,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 50,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 28,
								},
							},
							["amount"] = 78,
						},
					},
					["ElementDone"] = {
						["Melee"] = 707,
						["Physical"] = 224,
					},
					["HealingTaken"] = 116,
					["Healing"] = 116,
					["WhoHealed"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
					},
					["HealedWho"] = {
						["念着倒才猪-老马布兰契"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 116,
								},
							},
							["amount"] = 116,
						},
					},
					["Attacks"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 3,
									["amount"] = 150,
								},
							},
							["count"] = 3,
							["amount"] = 150,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 28,
									["min"] = 28,
									["count"] = 1,
									["amount"] = 28,
								},
							},
							["count"] = 1,
							["amount"] = 28,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 46,
									["min"] = 46,
									["count"] = 1,
									["amount"] = 46,
								},
							},
							["count"] = 1,
							["amount"] = 46,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 439,
									["min"] = 439,
									["count"] = 1,
									["amount"] = 439,
								},
								["Hit"] = {
									["max"] = 268,
									["min"] = 268,
									["count"] = 1,
									["amount"] = 268,
								},
							},
							["count"] = 3,
							["amount"] = 707,
						},
					},
					["RageGain"] = 15,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
					},
					["TimeDamage"] = 10.67,
					["TimeDamaging"] = {
						["仙影袭归-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["埃勒利萨"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.43,
								},
							},
							["amount"] = 4.43,
						},
						["帅气的老头"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.02,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.52,
						},
						["南宫狸猫-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0.72,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.22,
						},
					},
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 116,
									["min"] = 116,
									["count"] = 1,
									["amount"] = 116,
								},
							},
							["count"] = 1,
							["amount"] = 116,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoDamaged"] = {
						["跳跳"] = {
							["Details"] = {
								["爪击"] = {
									["count"] = 53,
								},
								["肉搏"] = {
									["count"] = 140,
								},
							},
							["amount"] = 193,
						},
						["帅气的老头"] = {
							["Details"] = {
								["闪电之盾"] = {
									["count"] = 231,
								},
							},
							["amount"] = 231,
						},
						["Evilpsycho-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1912,
								},
								["暗影灼烧"] = {
									["count"] = 999,
								},
							},
							["amount"] = 2911,
						},
					},
				},
			},
			["UnitLockout"] = 36870.949,
			["LastActive"] = 36936.936,
		},
		["灬萨格"] = {
			["GUID"] = "Player-5458-02FD2CFB",
			["LastEventHealth"] = {
				3540, -- [1]
				1083, -- [2]
				1083, -- [3]
				1083, -- [4]
				1083, -- [5]
				1099, -- [6]
				1099, -- [7]
				968, -- [8]
				778, -- [9]
				572, -- [10]
			},
			["LastAttackedBy"] = "牧老-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
			},
			["TimeWindows"] = {
				["Absorbs"] = {
					857, -- [1]
				},
				["TimeHeal"] = {
					6.77, -- [1]
				},
				["ActiveTime"] = {
					8.27, -- [1]
				},
				["HealingTaken"] = {
					857, -- [1]
				},
				["TimeDamage"] = {
					1.5, -- [1]
				},
				["DamageTaken"] = {
					1688, -- [1]
				},
				["Damage"] = {
					67, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = "灬萨格",
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 0,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				3540, -- [1]
				3540, -- [2]
				3540, -- [3]
				3540, -- [4]
				3540, -- [5]
				3540, -- [6]
				3540, -- [7]
				3540, -- [8]
				3540, -- [9]
				3540, -- [10]
			},
			["LastHealTime"] = 36922.519,
			["LastDamageTaken"] = 206,
			["Owner"] = false,
			["TimeLast"] = {
				["Absorbs"] = 36921.937,
				["TimeHeal"] = 36921.937,
				["HealingTaken"] = 36921.937,
				["ActiveTime"] = 36928.936,
				["TimeDamage"] = 36928.936,
				["OVERALL"] = 36928.936,
				["DamageTaken"] = 36927.936,
				["Damage"] = 36928.936,
			},
			["NextEventNum"] = 11,
			["LastDamageTime"] = 36929.27,
			["LastEvents"] = {
				"Environment Falling 灬萨格 Hit -256 (Physical)", -- [1]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灬萨格 Absorb -205 (205 被吸收) (Shadow)", -- [2]
				"奇迹贼-火妖鲁西弗隆 铁皮手雷 灬萨格 Absorb -197 (197 被吸收) (Fire)", -- [3]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灬萨格 Absorb -206 (206 被吸收) (Shadow)", -- [4]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灬萨格 Absorb -206 (206 被吸收) (Shadow)", -- [5]
				"牧老-火妖鲁西弗隆 肉搏 灬萨格 Absorb -43 (1)", -- [6]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灬萨格 Tick -163 (43 被吸收) (Shadow)", -- [7]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灬萨格 Tick -206 (Shadow)", -- [8]
				"牧老-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 灬萨格 Tick -206 (Shadow)", -- [9]
				"灬萨格 寒冰箭 帅气的老头 Hit -67 (Frost)", -- [10]
			},
			["Name"] = "灬萨格",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				false, -- [10]
			},
			["LastEventTimes"] = {
				36842.198, -- [1]
				36913.519, -- [2]
				36914.285, -- [3]
				36916.519, -- [4]
				36919.536, -- [5]
				36922.519, -- [6]
				36922.519, -- [7]
				36925.519, -- [8]
				36928.519, -- [9]
				36929.27, -- [10]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeHealing"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6.77,
								},
							},
							["amount"] = 6.77,
						},
					},
					["TimeSpent"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6.77,
								},
							},
							["amount"] = 6.77,
						},
						["帅气的老头"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 1432,
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 197,
									["min"] = 197,
									["count"] = 1,
									["amount"] = 197,
								},
							},
							["count"] = 1,
							["amount"] = 197,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 206,
									["min"] = 43,
									["count"] = 4,
									["amount"] = 660,
								},
							},
							["count"] = 6,
							["amount"] = 660,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 8.27,
					["ElementTaken"] = {
						["Fire"] = 197,
						["Physical"] = 0,
						["Melee"] = 43,
						["Shadow"] = 1192,
					},
					["Damage"] = 67,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 206,
									["min"] = 43,
									["count"] = 5,
									["amount"] = 857,
								},
							},
							["count"] = 5,
							["amount"] = 857,
						},
					},
					["TimeHeal"] = 6.77,
					["ElementDone"] = {
						["Frost"] = 67,
					},
					["WhoHealed"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 857,
								},
							},
							["amount"] = 857,
						},
					},
					["TimeDamaging"] = {
						["帅气的老头"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Absorbs"] = 857,
					["ElementTakenAbsorb"] = {
						["Fire"] = 197,
						["Shadow"] = 660,
					},
					["Attacks"] = {
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 67,
									["min"] = 67,
									["count"] = 1,
									["amount"] = 67,
								},
							},
							["count"] = 1,
							["amount"] = 67,
						},
					},
					["HealingTaken"] = 857,
					["DamagedWho"] = {
						["帅气的老头"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 67,
								},
							},
							["amount"] = 67,
						},
					},
					["TimeDamage"] = 1.5,
					["WhoDamaged"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1192,
								},
								["肉搏"] = {
									["count"] = 43,
								},
							},
							["amount"] = 1235,
						},
						["奇迹贼-火妖鲁西弗隆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 197,
								},
							},
							["amount"] = 197,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["HealedWho"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 857,
								},
							},
							["amount"] = 857,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["灬萨格"] = {
									["max"] = 206,
									["min"] = 43,
									["count"] = 5,
									["amount"] = 857,
								},
							},
							["count"] = 5,
							["amount"] = 857,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6.77,
								},
							},
							["amount"] = 6.77,
						},
					},
					["TimeSpent"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 6.77,
								},
							},
							["amount"] = 6.77,
						},
						["帅气的老头"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 1688,
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["被吸收"] = {
									["max"] = 197,
									["min"] = 197,
									["count"] = 1,
									["amount"] = 197,
								},
							},
							["count"] = 1,
							["amount"] = 197,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
								["被吸收"] = {
									["max"] = 206,
									["min"] = 43,
									["count"] = 4,
									["amount"] = 660,
								},
							},
							["count"] = 6,
							["amount"] = 660,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 8.27,
					["ElementTaken"] = {
						["Fire"] = 197,
						["Physical"] = 256,
						["Melee"] = 43,
						["Shadow"] = 1192,
					},
					["Damage"] = 67,
					["ElementHitsDone"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["寒冰护体"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 206,
									["min"] = 43,
									["count"] = 5,
									["amount"] = 857,
								},
							},
							["count"] = 5,
							["amount"] = 857,
						},
					},
					["TimeHeal"] = 6.77,
					["ElementDone"] = {
						["Frost"] = 67,
					},
					["WhoHealed"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 857,
								},
							},
							["amount"] = 857,
						},
					},
					["TimeDamaging"] = {
						["帅气的老头"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["Absorbs"] = 857,
					["ElementTakenAbsorb"] = {
						["Fire"] = 197,
						["Shadow"] = 660,
					},
					["Attacks"] = {
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 67,
									["min"] = 67,
									["count"] = 1,
									["amount"] = 67,
								},
							},
							["count"] = 1,
							["amount"] = 67,
						},
					},
					["HealingTaken"] = 857,
					["DamagedWho"] = {
						["帅气的老头"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 67,
								},
							},
							["amount"] = 67,
						},
					},
					["TimeDamage"] = 1.5,
					["WhoDamaged"] = {
						["牧老-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1192,
								},
								["肉搏"] = {
									["count"] = 43,
								},
							},
							["amount"] = 1235,
						},
						["奇迹贼-火妖鲁西弗隆"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 197,
								},
							},
							["amount"] = 197,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 256,
								},
							},
							["amount"] = 256,
						},
					},
					["HealedWho"] = {
						["灬萨格"] = {
							["Details"] = {
								["寒冰护体"] = {
									["count"] = 857,
								},
							},
							["amount"] = 857,
						},
					},
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 6,
						},
					},
					["Absorbed"] = {
						["寒冰护体"] = {
							["Details"] = {
								["灬萨格"] = {
									["max"] = 206,
									["min"] = 43,
									["count"] = 5,
									["amount"] = 857,
								},
							},
							["count"] = 5,
							["amount"] = 857,
						},
					},
				},
			},
			["UnitLockout"] = 36841.948,
			["LastActive"] = 36928.936,
		},
	},
	["FightNum"] = 1,
	["CombatTimes"] = {
		{
			36861.949, -- [1]
			37013.941, -- [2]
			"20:12:45", -- [3]
			"20:15:17", -- [4]
			"帅气的老头", -- [5]
		}, -- [1]
	},
	["FoughtWho"] = {
	},
}
