
RecountPerCharDB = {
	["version"] = "1.3",
	["combatants"] = {
		["特变电工"] = {
			["GUID"] = "Player-5458-02F6D2A3",
			["LastEventHealth"] = {
				2547, -- [1]
				2466, -- [2]
				2162, -- [3]
				2087, -- [4]
				1741, -- [5]
				1741, -- [6]
				1761, -- [7]
				1761, -- [8]
				1781, -- [9]
				3786, -- [10]
				3786, -- [11]
				5344, -- [12]
				5344, -- [13]
				5344, -- [14]
				5364, -- [15]
				4048, -- [16]
				4048, -- [17]
				4068, -- [18]
				3976, -- [19]
				3976, -- [20]
				3996, -- [21]
				3829, -- [22]
				3400, -- [23]
				3400, -- [24]
				3232, -- [25]
				3232, -- [26]
				3232, -- [27]
				2823, -- [28]
				2823, -- [29]
				2301, -- [30]
				2301, -- [31]
				2133, -- [32]
				2133, -- [33]
				2133, -- [34]
				1243, -- [35]
				486, -- [36]
				318, -- [37]
				318, -- [38]
				1, -- [39]
				0, -- [40]
				6219, -- [41]
				6219, -- [42]
				6219, -- [43]
				6219, -- [44]
				6219, -- [45]
				6219, -- [46]
				6219, -- [47]
				6219, -- [48]
				6219, -- [49]
				2527, -- [50]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"HEAL", -- [6]
				"DAMAGE", -- [7]
				"HEAL", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"HEAL", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"HEAL", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"HEAL", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"MISC", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"HEAL", -- [44]
				"DAMAGE", -- [45]
				"HEAL", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					62.67999999999999, -- [1]
				},
				["Dispelled"] = {
					14, -- [1]
				},
				["Healing"] = {
					5750, -- [1]
				},
				["DamageTaken"] = {
					41857, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["HealingTaken"] = {
					30302, -- [1]
				},
				["Overhealing"] = {
					80, -- [1]
				},
				["TimeDamage"] = {
					183.81, -- [1]
				},
				["RageGain"] = {
					391, -- [1]
				},
				["ActiveTime"] = {
					246.49, -- [1]
				},
				["DOT_Time"] = {
					111, -- [1]
				},
				["Damage"] = {
					68108, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = "特变电工",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						false, -- [5]
						false, -- [6]
						true, -- [7]
						false, -- [8]
						true, -- [9]
						false, -- [10]
						true, -- [11]
						false, -- [12]
						false, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						false, -- [17]
						true, -- [18]
						true, -- [19]
						true, -- [20]
					},
					["Messages"] = {
						"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -167 (Physical)", -- [1]
						"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -92 (Physical)", -- [2]
						"特变电工 拦截昏迷 薯片儿-逐风者 Hit -48 (Physical)", -- [3]
						"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -168 (Physical)", -- [4]
						"特变电工 肉搏 薯片儿-逐风者 Crit -818 (Physical)", -- [5]
						"特变电工 断筋 薯片儿-逐风者 Hit -33 (Physical)", -- [6]
						"薯片儿-逐风者 肉搏 特变电工 Hit -409 (Physical)", -- [7]
						"特变电工 嗜血 薯片儿-逐风者 Parry (Physical)", -- [8]
						"薯片儿-逐风者 致死打击 特变电工 Hit -522 (Physical)", -- [9]
						"特变电工 肉搏 薯片儿-逐风者 Hit -451 (Physical)", -- [10]
						"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -168 (Physical)", -- [11]
						"特变电工 重伤 (伤害/跳) 薯片儿-逐风者 Tick -156 (Physical)", -- [12]
						"特变电工 断筋 薯片儿-逐风者 Crit -74 (Physical)", -- [13]
						"薯片儿-逐风者 肉搏 特变电工 Crit -890 (Physical)", -- [14]
						"薯片儿-逐风者 旋风斩 特变电工 Crit -757 (Physical)", -- [15]
						"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -168 (Physical)", -- [16]
						"特变电工 斩杀 薯片儿-逐风者 Hit -1292 (Physical)", -- [17]
						"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -108 (Physical)", -- [18]
						"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -108 (Physical)", -- [19]
						"特变电工死亡。", -- [20]
					},
					["DeathAt"] = 46077.542,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
					},
					["MessageTimes"] = {
						-14.92399999999907, -- [1]
						-13.75800000000163, -- [2]
						-13.49000000000524, -- [3]
						-11.92399999999907, -- [4]
						-11.65699999999924, -- [5]
						-11.4910000000018, -- [6]
						-9.474000000001979, -- [7]
						-9.290000000000873, -- [8]
						-9.057000000000698, -- [9]
						-8.957000000002154, -- [10]
						-8.921000000002095, -- [11]
						-8.624000000003434, -- [12]
						-7.774000000004889, -- [13]
						-6.656999999999243, -- [14]
						-6.057000000000699, -- [15]
						-5.923000000002503, -- [16]
						-5.474000000001979, -- [17]
						-3.023000000001048, -- [18]
						-0.02300000000104774, -- [19]
						0, -- [20]
					},
					["HealthMax"] = {
						7151, -- [1]
						7151, -- [2]
						7151, -- [3]
						7151, -- [4]
						7151, -- [5]
						7151, -- [6]
						7151, -- [7]
						7151, -- [8]
						7151, -- [9]
						7151, -- [10]
						7151, -- [11]
						7151, -- [12]
						7151, -- [13]
						7151, -- [14]
						7151, -- [15]
						7151, -- [16]
						7151, -- [17]
						7151, -- [18]
						6219, -- [19]
						6219, -- [20]
					},
					["Health"] = {
						3996, -- [1]
						3829, -- [2]
						3400, -- [3]
						3400, -- [4]
						3232, -- [5]
						3232, -- [6]
						3232, -- [7]
						2823, -- [8]
						2823, -- [9]
						2301, -- [10]
						2301, -- [11]
						2133, -- [12]
						2133, -- [13]
						2133, -- [14]
						1243, -- [15]
						486, -- [16]
						318, -- [17]
						318, -- [18]
						1, -- [19]
						0, -- [20]
					},
					["KilledBy"] = "薯片儿-逐风者",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"MISC", -- [20]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "重伤 (伤害/跳)",
			["LastFightIn"] = 4,
			["type"] = "Self",
			["LastHealTime"] = 46059.041,
			["LastEventHealthMax"] = {
				6219, -- [1]
				6219, -- [2]
				6219, -- [3]
				6219, -- [4]
				6219, -- [5]
				6219, -- [6]
				6219, -- [7]
				6219, -- [8]
				6219, -- [9]
				7151, -- [10]
				7151, -- [11]
				7151, -- [12]
				7151, -- [13]
				7151, -- [14]
				7151, -- [15]
				7151, -- [16]
				7151, -- [17]
				7151, -- [18]
				7151, -- [19]
				7151, -- [20]
				7151, -- [21]
				7151, -- [22]
				7151, -- [23]
				7151, -- [24]
				7151, -- [25]
				7151, -- [26]
				7151, -- [27]
				7151, -- [28]
				7151, -- [29]
				7151, -- [30]
				7151, -- [31]
				7151, -- [32]
				7151, -- [33]
				7151, -- [34]
				7151, -- [35]
				7151, -- [36]
				7151, -- [37]
				7151, -- [38]
				6219, -- [39]
				6219, -- [40]
				6219, -- [41]
				6219, -- [42]
				6219, -- [43]
				6219, -- [44]
				6219, -- [45]
				6219, -- [46]
				6219, -- [47]
				6219, -- [48]
				6219, -- [49]
				6219, -- [50]
			},
			["LastDamageTaken"] = 108,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 46058.541,
				["Dispelled"] = 45861.531,
				["OVERALL"] = 46100.549,
				["DamageTaken"] = 46075.542,
				["DeathCount"] = 46075.542,
				["Healing"] = 46058.541,
				["RageGain"] = 46090.543,
				["Overhealing"] = 46094.543,
				["TimeDamage"] = 46100.549,
				["HealingTaken"] = 46058.541,
				["ActiveTime"] = 46100.549,
				["DOT_Time"] = 46100.549,
				["Damage"] = 46094.543,
			},
			["NextEventNum"] = 50,
			["LastDamageTime"] = 46101.227,
			["LastEvents"] = {
				"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -81 (Physical)", -- [1]
				"因纳夏克-黑龙费尔默 旋风斩 特变电工 Hit -304 (Physical)", -- [2]
				"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -75 (Physical)", -- [3]
				"因纳夏克-黑龙费尔默 英勇打击 特变电工 Hit -346 (Physical)", -- [4]
				"特变电工 肉搏 因纳夏克-黑龙费尔默 Crit -921 (Physical)", -- [5]
				"特变电工 嗜血 特变电工 Hit +20", -- [6]
				"特变电工 嗜血 因纳夏克-黑龙费尔默 Hit -400 (Physical)", -- [7]
				"特变电工 嗜血 特变电工 Hit +20", -- [8]
				"特变电工 生命赐福 特变电工 Hit +1073", -- [9]
				"特变电工 治疗药水 特变电工 Hit +1633", -- [10]
				"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -75 (Physical)", -- [11]
				"特变电工 重伤 (伤害/跳) 因纳夏克-黑龙费尔默 Tick -127 (Physical)", -- [12]
				"特变电工 旋风斩 因纳夏克-黑龙费尔默 Hit -464 (Physical)", -- [13]
				"特变电工 嗜血 特变电工 Hit +20", -- [14]
				"因纳夏克-黑龙费尔默 英勇打击 特变电工 Crit -1316 (Physical)", -- [15]
				"特变电工 肉搏 因纳夏克-黑龙费尔默 Crit -990 (Physical)", -- [16]
				"特变电工 嗜血 特变电工 Hit +20", -- [17]
				"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -92 (Physical)", -- [18]
				"特变电工 斩杀 因纳夏克-黑龙费尔默 Hit -898 (Physical)", -- [19]
				"特变电工 嗜血 特变电工 Hit +20", -- [20]
				"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -167 (Physical)", -- [21]
				"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -92 (Physical)", -- [22]
				"特变电工 拦截昏迷 薯片儿-逐风者 Hit -48 (Physical)", -- [23]
				"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -168 (Physical)", -- [24]
				"特变电工 肉搏 薯片儿-逐风者 Crit -818 (Physical)", -- [25]
				"特变电工 断筋 薯片儿-逐风者 Hit -33 (Physical)", -- [26]
				"薯片儿-逐风者 肉搏 特变电工 Hit -409 (Physical)", -- [27]
				"特变电工 嗜血 薯片儿-逐风者 Parry (Physical)", -- [28]
				"薯片儿-逐风者 致死打击 特变电工 Hit -522 (Physical)", -- [29]
				"特变电工 肉搏 薯片儿-逐风者 Hit -451 (Physical)", -- [30]
				"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -168 (Physical)", -- [31]
				"特变电工 重伤 (伤害/跳) 薯片儿-逐风者 Tick -156 (Physical)", -- [32]
				"特变电工 断筋 薯片儿-逐风者 Crit -74 (Physical)", -- [33]
				"薯片儿-逐风者 肉搏 特变电工 Crit -890 (Physical)", -- [34]
				"薯片儿-逐风者 旋风斩 特变电工 Crit -757 (Physical)", -- [35]
				"因纳夏克-黑龙费尔默 重伤 (伤害/跳) 特变电工 Tick -168 (Physical)", -- [36]
				"特变电工 斩杀 薯片儿-逐风者 Hit -1292 (Physical)", -- [37]
				"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -108 (Physical)", -- [38]
				"薯片儿-逐风者 重伤 (伤害/跳) 特变电工 Tick -108 (Physical)", -- [39]
				"特变电工死亡。", -- [40]
				"特变电工 断筋 骑大象找麻姑-逐风者 Hit -32 (Physical)", -- [41]
				"特变电工 肉搏 骑大象找麻姑-逐风者 Crit -825 (Physical)", -- [42]
				"特变电工 嗜血 骑大象找麻姑-逐风者 Hit -329 (Physical)", -- [43]
				"特变电工 嗜血 特变电工 Hit +20 (20 过量治疗)", -- [44]
				"特变电工 肉搏 骑大象找麻姑-逐风者 Hit -411 (Physical)", -- [45]
				"特变电工 嗜血 特变电工 Hit +20 (20 过量治疗)", -- [46]
				"特变电工 重伤 (伤害/跳) 骑大象找麻姑-逐风者 Tick -81 (Physical)", -- [47]
				"特变电工 重伤 (伤害/跳) 骑大象找麻姑-逐风者 Immune (Physical)", -- [48]
				"特变电工 重伤 (伤害/跳) 骑大象找麻姑-逐风者 Immune (Physical)", -- [49]
				"特变电工 嗜血 特变电工 Hit +20", -- [50]
			},
			["Name"] = "特变电工",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				false, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				false, -- [23]
				true, -- [24]
				false, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				false, -- [45]
				true, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				46051.274, -- [1]
				46052.408, -- [2]
				46052.991, -- [3]
				46053.358, -- [4]
				46053.675, -- [5]
				46053.708, -- [6]
				46053.80800000001, -- [7]
				46053.831, -- [8]
				46054.30800000001, -- [9]
				46055.658, -- [10]
				46055.975, -- [11]
				46056.725, -- [12]
				46057.132, -- [13]
				46057.132, -- [14]
				46057.80800000001, -- [15]
				46058.375, -- [16]
				46058.375, -- [17]
				46058.991, -- [18]
				46059.041, -- [19]
				46059.041, -- [20]
				46060.825, -- [21]
				46061.991, -- [22]
				46062.259, -- [23]
				46063.825, -- [24]
				46064.092, -- [25]
				46064.258, -- [26]
				46066.275, -- [27]
				46066.459, -- [28]
				46066.692, -- [29]
				46066.792, -- [30]
				46066.828, -- [31]
				46067.125, -- [32]
				46067.975, -- [33]
				46069.092, -- [34]
				46069.692, -- [35]
				46069.826, -- [36]
				46070.275, -- [37]
				46072.726, -- [38]
				46075.726, -- [39]
				46075.749, -- [40]
				46092.143, -- [41]
				46092.193, -- [42]
				46093.643, -- [43]
				46093.67, -- [44]
				46094.893, -- [45]
				46094.91, -- [46]
				46095.227, -- [47]
				46098.227, -- [48]
				46101.227, -- [49]
				46050.208, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["薯片儿-逐风者"] = {
									["count"] = 3,
								},
								["指吻礼物馆"] = {
									["count"] = 12,
								},
								["因纳夏克-黑龙费尔默"] = {
									["count"] = 3,
								},
								["骑大象找麻姑-逐风者"] = {
									["count"] = 6,
								},
							},
							["amount"] = 24,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 9915,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 40,
								},
								["怒不可遏"] = {
									["count"] = 1,
								},
								["冲锋"] = {
									["count"] = 45,
								},
							},
							["amount"] = 86,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 16,
								},
							},
							["amount"] = 28,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 1,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 13,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 12,
								},
								["Absorb"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 6,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 2,
								},
							},
							["amount"] = 26,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 6895,
						["Melee"] = 2909,
						["Frost"] = 111,
					},
					["DOT_Time"] = 24,
					["Damage"] = 12332,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 11.33,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 1427,
						["Physical"] = 117,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 7167,
						["Physical"] = 5165,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 156,
								},
								["拦截昏迷"] = {
									["count"] = 48,
								},
								["断筋"] = {
									["count"] = 107,
								},
								["斩杀"] = {
									["count"] = 1292,
								},
								["肉搏"] = {
									["count"] = 1639,
								},
							},
							["amount"] = 3242,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 63,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 294,
								},
								["肉搏"] = {
									["count"] = 1548,
								},
							},
							["amount"] = 1905,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1246,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 127,
								},
								["旋风斩"] = {
									["count"] = 464,
								},
								["断筋"] = {
									["count"] = 28,
								},
								["斩杀"] = {
									["count"] = 898,
								},
								["肉搏"] = {
									["count"] = 2744,
								},
							},
							["amount"] = 5507,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 81,
								},
								["断筋"] = {
									["count"] = 32,
								},
								["嗜血"] = {
									["count"] = 329,
								},
								["肉搏"] = {
									["count"] = 1236,
								},
							},
							["amount"] = 1678,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 2047,
								},
								["旋风斩"] = {
									["count"] = 566,
								},
								["断筋"] = {
									["count"] = 23,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 994,
								},
								["肉搏"] = {
									["count"] = 531,
								},
							},
							["amount"] = 4161,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 934,
								},
							},
							["amount"] = 934,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 111,
								},
							},
							["amount"] = 111,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 522,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 701,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["旋风斩"] = {
									["count"] = 1034,
								},
								["肉搏"] = {
									["count"] = 2378,
								},
							},
							["amount"] = 4709,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 16,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 16,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.48,
								},
								["嗜血"] = {
									["count"] = 9.5,
								},
								["治疗药水"] = {
									["count"] = 1.35,
								},
							},
							["amount"] = 11.33,
						},
					},
					["OverHeals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 2,
									["amount"] = 40,
								},
							},
							["count"] = 2,
							["amount"] = 40,
						},
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 40,
								},
							},
							["amount"] = 40,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
					},
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 160,
								},
								["治疗药水"] = {
									["count"] = 1633,
								},
							},
							["amount"] = 2866,
						},
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 40,
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.48,
								},
								["嗜血"] = {
									["count"] = 9.5,
								},
								["治疗药水"] = {
									["count"] = 1.35,
								},
							},
							["amount"] = 11.33,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["挫志怒吼"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.41,
								},
								["嗜血"] = {
									["count"] = 1.09,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.67,
								},
								["肉搏"] = {
									["count"] = 7.24,
								},
							},
							["amount"] = 14.01,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 5.35,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.7,
								},
								["肉搏"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 9.1,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["断筋"] = {
									["count"] = 1.02,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.33,
								},
							},
							["amount"] = 9.18,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.45,
								},
								["肉搏"] = {
									["count"] = 1.3,
								},
							},
							["amount"] = 6.08,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1073,
									["count"] = 1,
									["amount"] = 1073,
								},
							},
							["count"] = 1,
							["amount"] = 1073,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 8,
									["amount"] = 160,
								},
							},
							["count"] = 8,
							["amount"] = 160,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1633,
									["min"] = 1633,
									["count"] = 1,
									["amount"] = 1633,
								},
							},
							["count"] = 1,
							["amount"] = 1633,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 160,
								},
								["治疗药水"] = {
									["count"] = 1633,
								},
							},
							["amount"] = 2866,
						},
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 49.7,
					["Healing"] = 2866,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 446,
									["min"] = 329,
									["count"] = 4,
									["amount"] = 1575,
								},
							},
							["count"] = 5,
							["amount"] = 1575,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 73,
									["min"] = 73,
									["count"] = 1,
									["amount"] = 73,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Tick"] = {
									["max"] = 156,
									["min"] = 73,
									["count"] = 6,
									["amount"] = 585,
								},
							},
							["count"] = 8,
							["amount"] = 658,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 48,
									["min"] = 48,
									["count"] = 1,
									["amount"] = 48,
								},
							},
							["count"] = 1,
							["amount"] = 48,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
								["Crit"] = {
									["max"] = 74,
									["min"] = 74,
									["count"] = 1,
									["amount"] = 74,
								},
								["Hit"] = {
									["max"] = 33,
									["min"] = 19,
									["count"] = 4,
									["amount"] = 112,
								},
							},
							["count"] = 6,
							["amount"] = 230,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 464,
									["min"] = 464,
									["count"] = 1,
									["amount"] = 464,
								},
							},
							["count"] = 1,
							["amount"] = 464,
						},
						["缴械"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["挫志怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1292,
									["min"] = 898,
									["count"] = 2,
									["amount"] = 2190,
								},
							},
							["count"] = 2,
							["amount"] = 2190,
						},
						["肉搏"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 921,
									["min"] = 506,
									["count"] = 2,
									["amount"] = 1427,
								},
								["Crit"] = {
									["max"] = 990,
									["min"] = 121,
									["count"] = 5,
									["amount"] = 3675,
								},
								["Hit"] = {
									["max"] = 463,
									["min"] = 370,
									["count"] = 5,
									["amount"] = 2065,
								},
							},
							["count"] = 13,
							["amount"] = 7167,
						},
					},
					["HealingTaken"] = 2866,
					["RageGain"] = 86,
					["TimeDamage"] = 38.36999999999999,
					["TimeDamaging"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["断筋"] = {
									["count"] = 1.02,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.33,
								},
							},
							["amount"] = 9.18,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 5.35,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.7,
								},
								["肉搏"] = {
									["count"] = 0.55,
								},
							},
							["amount"] = 9.1,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["挫志怒吼"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 0.41,
								},
								["嗜血"] = {
									["count"] = 1.09,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 0.67,
								},
								["肉搏"] = {
									["count"] = 7.24,
								},
							},
							["amount"] = 14.01,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.45,
								},
								["肉搏"] = {
									["count"] = 1.3,
								},
							},
							["amount"] = 6.08,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["骑大象找麻姑-逐风者"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 0,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 0,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 0,
								},
							},
							["amount"] = 0,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 12,
								},
								["因纳夏克-黑龙费尔默"] = {
									["count"] = 18,
								},
								["法神飞舞醉酒-逐风者"] = {
									["count"] = 15,
								},
								["薯片儿-逐风者"] = {
									["count"] = 3,
								},
								["指吻礼物馆"] = {
									["count"] = 33,
								},
								["渣二哥-黑龙费尔默"] = {
									["count"] = 21,
								},
								["骑大象找麻姑-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 111,
						},
					},
					["TimeSpent"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 0.5,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 6.02,
						},
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.48,
								},
								["嗜血"] = {
									["count"] = 58.16,
								},
								["治疗药水"] = {
									["count"] = 4.04,
								},
							},
							["amount"] = 62.67999999999999,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 2.19,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.5,
								},
								["拳击"] = {
									["count"] = 0.2,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.07,
								},
								["拦截昏迷"] = {
									["count"] = 2.12,
								},
								["断筋"] = {
									["count"] = 7.88,
								},
								["斩杀"] = {
									["count"] = 0.17,
								},
								["肉搏"] = {
									["count"] = 12.93,
								},
							},
							["amount"] = 41.56,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 0.98,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.74,
								},
								["断筋"] = {
									["count"] = 1.65,
								},
								["斩杀"] = {
									["count"] = 1.92,
								},
								["肉搏"] = {
									["count"] = 13.4,
								},
							},
							["amount"] = 27.19,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.53,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.33,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.3,
								},
							},
							["amount"] = 11.16,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 0.42,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.34,
								},
								["旋风斩"] = {
									["count"] = 0.41,
								},
								["挫志怒吼"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.39,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 2.97,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 3.52,
								},
								["肉搏"] = {
									["count"] = 17.89,
								},
							},
							["amount"] = 34.04,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["断筋"] = {
									["count"] = 0.61,
								},
								["拦截昏迷"] = {
									["count"] = 2.33,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.94,
								},
							},
							["amount"] = 24.88,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.9,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.55,
								},
							},
							["amount"] = 11.78,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.63,
								},
								["断筋"] = {
									["count"] = 1.72,
								},
								["斩杀"] = {
									["count"] = 3.75,
								},
								["肉搏"] = {
									["count"] = 7.07,
								},
							},
							["amount"] = 13.17,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.25,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.94,
								},
								["断筋"] = {
									["count"] = 1.18,
								},
								["拦截昏迷"] = {
									["count"] = 1.4,
								},
								["斩杀"] = {
									["count"] = 1.27,
								},
								["肉搏"] = {
									["count"] = 5.82,
								},
							},
							["amount"] = 10.86,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.15,
						},
					},
					["WhoHealed"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 850,
								},
								["治疗药水"] = {
									["count"] = 3827,
								},
							},
							["amount"] = 5750,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 13980,
								},
							},
							["amount"] = 13980,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 6776,
								},
								["圣光闪现"] = {
									["count"] = 3796,
								},
							},
							["amount"] = 10572,
						},
					},
					["ElementDoneAbsorb"] = {
						["Physical"] = 4261,
						["Melee"] = 5423,
						["Fire"] = 142,
					},
					["DeathCount"] = 1,
					["Overhealing"] = 80,
					["ElementTaken"] = {
						["Frost"] = 5078,
						["Melee"] = 10378,
						["Arcane"] = 1240,
						["Fire"] = 8190,
						["Shadow"] = 1345,
						["Physical"] = 15626,
					},
					["DOT_Time"] = 111,
					["Damage"] = 68108,
					["TimeHeal"] = 62.67999999999999,
					["ElementDone"] = {
						["Physical"] = 34307,
						["Melee"] = 33659,
						["Fire"] = 142,
					},
					["DamagedWho"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 764,
								},
								["断筋"] = {
									["count"] = 52,
								},
								["压制"] = {
									["count"] = 1196,
								},
								["肉搏"] = {
									["count"] = 1190,
								},
							},
							["amount"] = 3202,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1890,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 820,
								},
								["拳击"] = {
									["count"] = 49,
								},
								["铁皮手雷"] = {
									["count"] = 142,
								},
								["英勇打击"] = {
									["count"] = 647,
								},
								["旋风斩"] = {
									["count"] = 560,
								},
								["拦截昏迷"] = {
									["count"] = 64,
								},
								["断筋"] = {
									["count"] = 443,
								},
								["斩杀"] = {
									["count"] = 846,
								},
								["肉搏"] = {
									["count"] = 7217,
								},
							},
							["amount"] = 12678,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 463,
								},
								["嗜血"] = {
									["count"] = 1667,
								},
								["旋风斩"] = {
									["count"] = 424,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 556,
								},
								["断筋"] = {
									["count"] = 55,
								},
								["斩杀"] = {
									["count"] = 1661,
								},
								["肉搏"] = {
									["count"] = 5872,
								},
							},
							["amount"] = 10698,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 81,
								},
								["断筋"] = {
									["count"] = 32,
								},
								["嗜血"] = {
									["count"] = 721,
								},
								["肉搏"] = {
									["count"] = 2847,
								},
							},
							["amount"] = 3681,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 464,
								},
								["英勇打击"] = {
									["count"] = 557,
								},
								["嗜血"] = {
									["count"] = 2673,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 427,
								},
								["压制"] = {
									["count"] = 719,
								},
								["断筋"] = {
									["count"] = 28,
								},
								["斩杀"] = {
									["count"] = 2319,
								},
								["肉搏"] = {
									["count"] = 5901,
								},
							},
							["amount"] = 13088,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 257,
								},
								["旋风斩"] = {
									["count"] = 502,
								},
								["嗜血"] = {
									["count"] = 1232,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 605,
								},
								["断筋"] = {
									["count"] = 79,
								},
								["拳击"] = {
									["count"] = 49,
								},
								["斩杀"] = {
									["count"] = 1235,
								},
								["肉搏"] = {
									["count"] = 3978,
								},
							},
							["amount"] = 7937,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 156,
								},
								["断筋"] = {
									["count"] = 122,
								},
								["拦截昏迷"] = {
									["count"] = 48,
								},
								["斩杀"] = {
									["count"] = 1292,
								},
								["肉搏"] = {
									["count"] = 1639,
								},
							},
							["amount"] = 3257,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 772,
								},
								["旋风斩"] = {
									["count"] = 347,
								},
								["断筋"] = {
									["count"] = 33,
								},
								["斩杀"] = {
									["count"] = 1789,
								},
								["肉搏"] = {
									["count"] = 1892,
								},
							},
							["amount"] = 4833,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 362,
								},
								["嗜血"] = {
									["count"] = 820,
								},
								["旋风斩"] = {
									["count"] = 1642,
								},
								["断筋"] = {
									["count"] = 37,
								},
								["拦截昏迷"] = {
									["count"] = 44,
								},
								["斩杀"] = {
									["count"] = 919,
								},
								["肉搏"] = {
									["count"] = 2328,
								},
							},
							["amount"] = 6152,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1024,
								},
								["嗜血"] = {
									["count"] = 763,
								},
								["肉搏"] = {
									["count"] = 795,
								},
							},
							["amount"] = 2582,
						},
					},
					["WhoDamaged"] = {
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 717,
								},
								["冰霜新星"] = {
									["count"] = 63,
								},
								["寒冰箭"] = {
									["count"] = 68,
								},
								["冲击波"] = {
									["count"] = 609,
								},
								["铁皮手雷"] = {
									["count"] = 364,
								},
								["火焰冲击"] = {
									["count"] = 3891,
								},
							},
							["amount"] = 5712,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 522,
								},
								["压制"] = {
									["count"] = 583,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 995,
								},
								["断筋"] = {
									["count"] = 74,
								},
								["旋风斩"] = {
									["count"] = 1034,
								},
								["肉搏"] = {
									["count"] = 2697,
								},
							},
							["amount"] = 5905,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 23,
								},
								["英勇打击"] = {
									["count"] = 2047,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2434,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 208,
								},
								["拦截昏迷"] = {
									["count"] = 36,
								},
								["旋风斩"] = {
									["count"] = 1486,
								},
								["肉搏"] = {
									["count"] = 3519,
								},
							},
							["amount"] = 9753,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 1116,
								},
							},
							["amount"] = 1116,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1225,
								},
								["旋风斩"] = {
									["count"] = 298,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 680,
								},
								["断筋"] = {
									["count"] = 168,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 609,
								},
								["肉搏"] = {
									["count"] = 2531,
								},
							},
							["amount"] = 5511,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["冰锥术"] = {
									["count"] = 2559,
								},
								["灼烧"] = {
									["count"] = 516,
								},
								["冰霜新星"] = {
									["count"] = 753,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 407,
								},
								["寒冰箭"] = {
									["count"] = 918,
								},
								["魔爆术"] = {
									["count"] = 1240,
								},
								["火焰冲击"] = {
									["count"] = 2403,
								},
							},
							["amount"] = 8796,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["虚弱之触"] = {
									["count"] = 303,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 633,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 409,
								},
							},
							["amount"] = 1345,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 846,
								},
								["顺劈斩"] = {
									["count"] = 278,
								},
								["旋风斩"] = {
									["count"] = 259,
								},
								["断筋"] = {
									["count"] = 99,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 606,
								},
								["肉搏"] = {
									["count"] = 1631,
								},
							},
							["amount"] = 3719,
						},
					},
					["TimeHealing"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 0.48,
								},
								["嗜血"] = {
									["count"] = 58.16,
								},
								["治疗药水"] = {
									["count"] = 4.04,
								},
							},
							["amount"] = 62.67999999999999,
						},
					},
					["Dispelled"] = 14,
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 42,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 22,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["灼烧"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["强化断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 28,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["顺劈斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 25,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 10,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 42,
									["amount"] = 0,
								},
							},
							["count"] = 42,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 22,
									["amount"] = 0,
								},
							},
							["count"] = 22,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["霜寒刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["灼烧"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["强化断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 28,
									["amount"] = 0,
								},
							},
							["count"] = 28,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["顺劈斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 25,
									["amount"] = 0,
								},
							},
							["count"] = 25,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 10,
									["amount"] = 0,
								},
							},
							["count"] = 10,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 246.49,
					["WhoDispelled"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰冻 (清洁术)"] = {
									["count"] = 2,
								},
								["点燃 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["暗影易伤 (清洁术)"] = {
									["count"] = 2,
								},
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
								["冰锥术 (清洁术)"] = {
									["count"] = 1,
								},
								["冰霜新星 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["野性印记 (驱散魔法)"] = {
									["count"] = 1,
								},
								["强效力量祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
								["自由行动 (驱散魔法)"] = {
									["count"] = 1,
								},
								["自由祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 4,
						},
					},
					["Heals"] = {
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1073,
									["min"] = 1073,
									["count"] = 1,
									["amount"] = 1073,
								},
							},
							["count"] = 1,
							["amount"] = 1073,
						},
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 10,
									["count"] = 45,
									["amount"] = 850,
								},
							},
							["count"] = 45,
							["amount"] = 850,
						},
						["治疗药水"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1633,
									["min"] = 726,
									["count"] = 3,
									["amount"] = 3827,
								},
							},
							["count"] = 3,
							["amount"] = 3827,
						},
					},
					["OverHeals"] = {
						["嗜血"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 20,
									["min"] = 20,
									["count"] = 4,
									["amount"] = 80,
								},
							},
							["count"] = 4,
							["amount"] = 80,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 26,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 41,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 10,
								},
								["Hit"] = {
									["count"] = 15,
								},
							},
							["amount"] = 28,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 14,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 21,
								},
								["Tick"] = {
									["count"] = 64,
								},
								["Dodge"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 7,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 99,
						},
					},
					["Healing"] = 5750,
					["DamageTaken"] = 41857,
					["RageGainedFrom"] = {
						["特变电工"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 137,
								},
								["怒不可遏"] = {
									["count"] = 14,
								},
								["冲锋"] = {
									["count"] = 240,
								},
							},
							["amount"] = 391,
						},
					},
					["Attacks"] = {
						["嗜血"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1232,
									["min"] = 621,
									["count"] = 7,
									["amount"] = 5879,
								},
								["Hit"] = {
									["max"] = 466,
									["min"] = 300,
									["count"] = 12,
									["amount"] = 4659,
								},
							},
							["count"] = 20,
							["amount"] = 10538,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 142,
									["min"] = 62,
									["count"] = 9,
									["amount"] = 797,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Tick"] = {
									["max"] = 156,
									["min"] = 51,
									["count"] = 26,
									["amount"] = 2210,
								},
							},
							["count"] = 37,
							["amount"] = 3007,
						},
						["挫志怒吼"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["拳击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 49,
									["min"] = 49,
									["count"] = 2,
									["amount"] = 98,
								},
							},
							["count"] = 2,
							["amount"] = 98,
						},
						["缴械"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 142,
									["min"] = 142,
									["count"] = 1,
									["amount"] = 142,
								},
							},
							["count"] = 1,
							["amount"] = 142,
						},
						["压制"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1196,
									["min"] = 257,
									["count"] = 3,
									["amount"] = 2172,
								},
							},
							["count"] = 3,
							["amount"] = 2172,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
								["Hit"] = {
									["max"] = 64,
									["min"] = 48,
									["count"] = 2,
									["amount"] = 112,
								},
							},
							["count"] = 6,
							["amount"] = 156,
						},
						["旋风斩"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 884,
									["min"] = 758,
									["count"] = 2,
									["amount"] = 1642,
								},
								["Hit"] = {
									["max"] = 560,
									["min"] = 347,
									["count"] = 5,
									["amount"] = 2297,
								},
							},
							["count"] = 7,
							["amount"] = 3939,
						},
						["英勇打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 647,
									["min"] = 647,
									["count"] = 1,
									["amount"] = 647,
								},
								["Hit"] = {
									["max"] = 557,
									["min"] = 463,
									["count"] = 2,
									["amount"] = 1020,
								},
							},
							["count"] = 3,
							["amount"] = 1667,
						},
						["断筋"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 78,
									["min"] = 36,
									["count"] = 6,
									["amount"] = 282,
								},
								["Crit"] = {
									["max"] = 97,
									["min"] = 30,
									["count"] = 5,
									["amount"] = 290,
								},
								["Hit"] = {
									["max"] = 45,
									["min"] = 14,
									["count"] = 12,
									["amount"] = 309,
								},
							},
							["count"] = 24,
							["amount"] = 881,
						},
						["斩杀"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 846,
									["min"] = 846,
									["count"] = 1,
									["amount"] = 846,
								},
								["Hit"] = {
									["max"] = 1292,
									["min"] = 472,
									["count"] = 7,
									["amount"] = 5182,
								},
								["Miss"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1140,
									["min"] = 837,
									["count"] = 6,
									["amount"] = 5821,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 16,
							["amount"] = 11849,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 921,
									["min"] = 13,
									["count"] = 15,
									["amount"] = 7068,
								},
								["Hit"] = {
									["max"] = 620,
									["min"] = 258,
									["count"] = 27,
									["amount"] = 11480,
								},
								["Dodge"] = {
									["count"] = 7,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 1095,
									["min"] = 121,
									["count"] = 20,
									["amount"] = 15111,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 70,
							["amount"] = 33659,
						},
					},
					["RageGain"] = 391,
					["HealedWho"] = {
						["特变电工"] = {
							["Details"] = {
								["生命赐福"] = {
									["count"] = 1073,
								},
								["嗜血"] = {
									["count"] = 850,
								},
								["治疗药水"] = {
									["count"] = 3827,
								},
							},
							["amount"] = 5750,
						},
					},
					["TimeDamage"] = 183.81,
					["TimeDamaging"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["压制"] = {
									["count"] = 0.5,
								},
								["肉搏"] = {
									["count"] = 2.52,
								},
							},
							["amount"] = 6.02,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 2.19,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 10.5,
								},
								["拳击"] = {
									["count"] = 0.2,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["旋风斩"] = {
									["count"] = 1.07,
								},
								["拦截昏迷"] = {
									["count"] = 2.12,
								},
								["断筋"] = {
									["count"] = 7.88,
								},
								["斩杀"] = {
									["count"] = 0.17,
								},
								["肉搏"] = {
									["count"] = 12.93,
								},
							},
							["amount"] = 41.56,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 0.98,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.74,
								},
								["断筋"] = {
									["count"] = 1.65,
								},
								["斩杀"] = {
									["count"] = 1.92,
								},
								["肉搏"] = {
									["count"] = 13.4,
								},
							},
							["amount"] = 27.19,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 1.53,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 3.33,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.3,
								},
							},
							["amount"] = 11.16,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["压制"] = {
									["count"] = 0.42,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 4.34,
								},
								["旋风斩"] = {
									["count"] = 0.41,
								},
								["挫志怒吼"] = {
									["count"] = 1.5,
								},
								["英勇打击"] = {
									["count"] = 1.39,
								},
								["缴械"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 2.97,
								},
								["断筋"] = {
									["count"] = 0.1,
								},
								["斩杀"] = {
									["count"] = 3.52,
								},
								["肉搏"] = {
									["count"] = 17.89,
								},
							},
							["amount"] = 34.04,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.5,
								},
								["断筋"] = {
									["count"] = 0.61,
								},
								["拦截昏迷"] = {
									["count"] = 2.33,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 9.94,
								},
							},
							["amount"] = 24.88,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.33,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.9,
								},
								["斩杀"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.55,
								},
							},
							["amount"] = 11.78,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.63,
								},
								["断筋"] = {
									["count"] = 1.72,
								},
								["斩杀"] = {
									["count"] = 3.75,
								},
								["肉搏"] = {
									["count"] = 7.07,
								},
							},
							["amount"] = 13.17,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["嗜血"] = {
									["count"] = 0.25,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 0.94,
								},
								["断筋"] = {
									["count"] = 1.18,
								},
								["拦截昏迷"] = {
									["count"] = 1.4,
								},
								["斩杀"] = {
									["count"] = 1.27,
								},
								["肉搏"] = {
									["count"] = 5.82,
								},
							},
							["amount"] = 10.86,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["斩杀"] = {
									["count"] = 1.5,
								},
								["嗜血"] = {
									["count"] = 0.15,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.15,
						},
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 137,
								},
							},
							["amount"] = 137,
						},
						["怒不可遏"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 14,
								},
							},
							["amount"] = 14,
						},
						["冲锋"] = {
							["Details"] = {
								["特变电工"] = {
									["count"] = 240,
								},
							},
							["amount"] = 240,
						},
					},
					["HealingTaken"] = 30302,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 18,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 2,
								},
								["Resist"] = {
									["count"] = 4,
								},
								["Immune"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 26,
								},
								["Hit"] = {
									["count"] = 42,
								},
								["Crit"] = {
									["count"] = 23,
								},
								["Dodge"] = {
									["count"] = 2,
								},
							},
							["amount"] = 124,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 15,
								},
								["Hit"] = {
									["count"] = 27,
								},
								["Dodge"] = {
									["count"] = 7,
								},
								["Crit"] = {
									["count"] = 20,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 70,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 45434.541,
			["LastActive"] = 46100.549,
		},
		["卡特文 <一罗伊一>"] = {
			["GUID"] = "Pet-0-5427-529-1685-1863-01014B6F3F",
			["LastEventHealth"] = {
				1709, -- [1]
				1709, -- [2]
				1709, -- [3]
				1709, -- [4]
				1709, -- [5]
				1709, -- [6]
				1709, -- [7]
				1709, -- [8]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
			},
			["TimeWindows"] = {
				["Damage"] = {
					378, -- [1]
				},
				["TimeDamage"] = {
					7.88, -- [1]
				},
				["ActiveTime"] = {
					7.88, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "卡特文",
			["level"] = 1,
			["LastFightIn"] = 0,
			["type"] = "Pet",
			["ownerName"] = "一罗伊一",
			["TimeLast"] = {
				["Damage"] = 45606.534,
				["OVERALL"] = 45608.534,
				["TimeDamage"] = 45608.534,
				["ActiveTime"] = 45608.534,
			},
			["LastEventHealthMax"] = {
				1709, -- [1]
				1709, -- [2]
				1709, -- [3]
				1709, -- [4]
				1709, -- [5]
				1709, -- [6]
				1709, -- [7]
				1709, -- [8]
			},
			["NextEventNum"] = 9,
			["LastDamageTime"] = 45608.767,
			["LastEvents"] = {
				"卡特文 <一罗伊一> 肉搏 Yang-逐风者 Parry (1)", -- [1]
				"卡特文 <一罗伊一> 剧痛鞭笞 Yang-逐风者 Resist (Shadow)", -- [2]
				"卡特文 <一罗伊一> 肉搏 大叔不熬夜-黑龙费尔默 Miss (1)", -- [3]
				"卡特文 <一罗伊一> 剧痛鞭笞 大叔不熬夜-黑龙费尔默 Hit -99 (Shadow)", -- [4]
				"卡特文 <一罗伊一> 肉搏 薯片儿-逐风者 Hit -95 (Physical)", -- [5]
				"卡特文 <一罗伊一> 剧痛鞭笞 薯片儿-逐风者 Hit -109 (Shadow)", -- [6]
				"卡特文 <一罗伊一> 肉搏 薯片儿-逐风者 Hit -75 (Physical)", -- [7]
				"卡特文 <一罗伊一> 肉搏 薯片儿-逐风者 Miss (1)", -- [8]
			},
			["Name"] = "卡特文",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
			},
			["LastEventTimes"] = {
				45467.976, -- [1]
				45468.277, -- [2]
				45511.162, -- [3]
				45511.195, -- [4]
				45604.25, -- [5]
				45606.7, -- [6]
				45606.75, -- [7]
				45608.767, -- [8]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.53,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.05,
								},
							},
							["amount"] = 4.55,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 0.3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.8,
						},
					},
					["ElementDone"] = {
						["Melee"] = 170,
						["Shadow"] = 208,
					},
					["DamagedWho"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 109,
								},
								["肉搏"] = {
									["count"] = 170,
								},
							},
							["amount"] = 279,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 99,
								},
							},
							["amount"] = 99,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
					},
					["TimeDamage"] = 7.88,
					["TimeDamaging"] = {
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.53,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.05,
								},
							},
							["amount"] = 4.55,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["剧痛鞭笞"] = {
									["count"] = 0.3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.8,
						},
					},
					["Attacks"] = {
						["剧痛鞭笞"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 109,
									["min"] = 99,
									["count"] = 2,
									["amount"] = 208,
								},
							},
							["count"] = 3,
							["amount"] = 208,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 95,
									["min"] = 75,
									["count"] = 2,
									["amount"] = 170,
								},
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 170,
						},
					},
					["ActiveTime"] = 7.88,
					["Damage"] = 378,
				},
			},
			["UnitLockout"] = 45467.543,
			["LastActive"] = 45608.534,
		},
		["原味小汤圆"] = {
			["GUID"] = "Player-5458-0354F9B9",
			["LastEventHealth"] = {
				3736, -- [1]
				3736, -- [2]
				3736, -- [3]
				3736, -- [4]
				3764, -- [5]
				4293, -- [6]
				4213, -- [7]
				4213, -- [8]
				5416, -- [9]
				5416, -- [10]
				5227, -- [11]
				5099, -- [12]
				5099, -- [13]
				4463, -- [14]
				4463, -- [15]
				3758, -- [16]
				3563, -- [17]
				3435, -- [18]
				3235, -- [19]
				3133, -- [20]
				3160, -- [21]
				2096, -- [22]
				1318, -- [23]
				707, -- [24]
				1369, -- [25]
				1185, -- [26]
				1185, -- [27]
				1834, -- [28]
				1834, -- [29]
				3410, -- [30]
				4213, -- [31]
				4213, -- [32]
				4213, -- [33]
				4213, -- [34]
				4213, -- [35]
				4213, -- [36]
				4213, -- [37]
				4213, -- [38]
				4213, -- [39]
				4213, -- [40]
				4213, -- [41]
				4383, -- [42]
				4383, -- [43]
				4383, -- [44]
				4383, -- [45]
				4383, -- [46]
				4383, -- [47]
				4383, -- [48]
				3736, -- [49]
				3736, -- [50]
			},
			["LastAttackedBy"] = "因纳夏克-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"HEAL", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"HEAL", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"HEAL", -- [30]
				"HEAL", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"HEAL", -- [34]
				"HEAL", -- [35]
				"DAMAGE", -- [36]
				"HEAL", -- [37]
				"HEAL", -- [38]
				"HEAL", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					2, -- [1]
				},
				["Healing"] = {
					885, -- [1]
				},
				["DamageTaken"] = {
					7653, -- [1]
				},
				["RageGain"] = {
					10, -- [1]
				},
				["EnergyGain"] = {
					80, -- [1]
				},
				["HealingTaken"] = {
					4965, -- [1]
				},
				["HOT_Time"] = {
					45, -- [1]
				},
				["TimeDamage"] = {
					104.24, -- [1]
				},
				["Overhealing"] = {
					5421, -- [1]
				},
				["ActiveTime"] = {
					106.24, -- [1]
				},
				["DOT_Time"] = {
					156, -- [1]
				},
				["Damage"] = {
					30529, -- [1]
				},
			},
			["enClass"] = "DRUID",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "旋风斩",
			["LastFightIn"] = 3,
			["type"] = "Grouped",
			["LastHealTime"] = 45835.846,
			["LastEventHealthMax"] = {
				4383, -- [1]
				4383, -- [2]
				4383, -- [3]
				4383, -- [4]
				4383, -- [5]
				4293, -- [6]
				4213, -- [7]
				4213, -- [8]
				5453, -- [9]
				5453, -- [10]
				5453, -- [11]
				5453, -- [12]
				5453, -- [13]
				5453, -- [14]
				5453, -- [15]
				5453, -- [16]
				5453, -- [17]
				5453, -- [18]
				5453, -- [19]
				5453, -- [20]
				5453, -- [21]
				4213, -- [22]
				4213, -- [23]
				4213, -- [24]
				4213, -- [25]
				4213, -- [26]
				4213, -- [27]
				4213, -- [28]
				4213, -- [29]
				4213, -- [30]
				4213, -- [31]
				4213, -- [32]
				4213, -- [33]
				4213, -- [34]
				4213, -- [35]
				4213, -- [36]
				4213, -- [37]
				4213, -- [38]
				4213, -- [39]
				4213, -- [40]
				4213, -- [41]
				4383, -- [42]
				4383, -- [43]
				4383, -- [44]
				4383, -- [45]
				4383, -- [46]
				4383, -- [47]
				4383, -- [48]
				4383, -- [49]
				4383, -- [50]
			},
			["LastDamageTaken"] = 483,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 45835.546,
				["Overhealing"] = 45911.533,
				["OVERALL"] = 46039.54,
				["DamageTaken"] = 46039.54,
				["RageGain"] = 45871.531,
				["EnergyGain"] = 46036.54,
				["HealingTaken"] = 45896.533,
				["HOT_Time"] = 45911.533,
				["ActiveTime"] = 46011.539,
				["Healing"] = 45835.546,
				["TimeDamage"] = 46011.539,
				["DOT_Time"] = 46011.539,
				["Damage"] = 46011.539,
			},
			["NextEventNum"] = 7,
			["LastDamageTime"] = 46012.256,
			["LastEvents"] = {
				"原味小汤圆 愤怒 指吻礼物馆 Hit -449 (Nature)", -- [1]
				"原味小汤圆 愤怒 指吻礼物馆 Hit -453 (Nature)", -- [2]
				"原味小汤圆 月火术 (伤害/跳) 指吻礼物馆 Tick -159 (Arcane)", -- [3]
				"原味小汤圆 月火术 (伤害/跳) 指吻礼物馆 Tick -159 (Arcane)", -- [4]
				"原味小汤圆 月火术 (伤害/跳) 指吻礼物馆 Tick -159 (Arcane)", -- [5]
				"因纳夏克-黑龙费尔默 旋风斩 原味小汤圆 Hit -483 (Physical)", -- [6]
				"原味小汤圆 愤怒 清风徐自来-火妖鲁西弗隆 Hit -506 (Nature)", -- [7]
				"法神飞舞醉酒-逐风者 冰霜新星 原味小汤圆 Hit -28 (Frost)", -- [8]
				"原味小汤圆 月火术 (伤害/跳) 指吻礼物馆 Tick -160 (Arcane)", -- [9]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 原味小汤圆 Tick -189 (Shadow)", -- [10]
				"清风徐自来-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 原味小汤圆 Tick -128 (Shadow)", -- [11]
				"原味小汤圆 月火术 (伤害/跳) 指吻礼物馆 Tick -159 (Arcane)", -- [12]
				"清风徐自来-火妖鲁西弗隆 心灵震爆 原味小汤圆 Hit -636 (Shadow)", -- [13]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 原味小汤圆 Tick -200 (Shadow)", -- [14]
				"法神飞舞醉酒-逐风者 冲击波 原味小汤圆 Hit -505 (Fire)", -- [15]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 原味小汤圆 Tick -195 (Shadow)", -- [16]
				"清风徐自来-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 原味小汤圆 Tick -128 (Shadow)", -- [17]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 原味小汤圆 Tick -200 (Shadow)", -- [18]
				"清风徐自来-火妖鲁西弗隆 噬灵瘟疫 (伤害/跳) 原味小汤圆 Tick -129 (Shadow)", -- [19]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 原味小汤圆 Tick -200 (Shadow)", -- [20]
				"法神飞舞醉酒-逐风者 寒冰箭 原味小汤圆 Hit -657 (Frost)", -- [21]
				"法神飞舞醉酒-逐风者 寒冰箭 原味小汤圆 Hit -673 (Frost)", -- [22]
				"法神飞舞醉酒-逐风者 寒冰箭 原味小汤圆 Hit -651 (Frost)", -- [23]
				"烬枫-火妖鲁西弗隆 圣光闪现 原味小汤圆 Hit +662", -- [24]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 原味小汤圆 Tick -184 (Shadow)", -- [25]
				"原味小汤圆 月火术 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -171 (Arcane)", -- [26]
				"烬枫-火妖鲁西弗隆 圣光闪现 原味小汤圆 Hit +649", -- [27]
				"原味小汤圆 纠缠根须 (伤害/跳) 因纳夏克-黑龙费尔默 Tick -47 (Nature)", -- [28]
				"蓝斯洛-火妖鲁西弗隆 圣光术 原味小汤圆 Hit +1576", -- [29]
				"烬枫-火妖鲁西弗隆 圣光闪现 原味小汤圆 Crit +1004 (201 过量治疗)", -- [30]
				"原味小汤圆 愈合 原味小汤圆 Crit +1761 (1761 过量治疗)", -- [31]
				"原味小汤圆 月火术 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -171 (Arcane)", -- [32]
				"原味小汤圆 纠缠根须 (伤害/跳) 因纳夏克-黑龙费尔默 Tick -47 (Nature)", -- [33]
				"原味小汤圆 愈合 原味小汤圆 Tick +183 (183 过量治疗)", -- [34]
				"原味小汤圆 回春术 原味小汤圆 Tick +276 (276 过量治疗)", -- [35]
				"原味小汤圆 月火术 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -171 (Arcane)", -- [36]
				"原味小汤圆 愈合 原味小汤圆 Tick +183 (183 过量治疗)", -- [37]
				"原味小汤圆 回春术 原味小汤圆 Tick +277 (277 过量治疗)", -- [38]
				"原味小汤圆 愈合 原味小汤圆 Tick +183 (183 过量治疗)", -- [39]
				"原味小汤圆 回春术 原味小汤圆 Tick +276 (276 过量治疗)", -- [40]
				"原味小汤圆 愈合 原味小汤圆 Tick +183 (183 过量治疗)", -- [41]
				"原味小汤圆 月火术 指吻礼物馆 Absorb -342 (342 被吸收) (Arcane)", -- [42]
				"原味小汤圆 月火术 (伤害/跳) 指吻礼物馆 Absorb -182 (182 被吸收) (Arcane)", -- [43]
				"原味小汤圆 虫群 (伤害/跳) 指吻礼物馆 Tick -129 (Nature)", -- [44]
				"原味小汤圆 月火术 指吻礼物馆 Hit -292 (Arcane)", -- [45]
				"原味小汤圆 虫群 (伤害/跳) 指吻礼物馆 Tick -129 (Nature)", -- [46]
				"原味小汤圆 月火术 指吻礼物馆 Hit -298 (Arcane)", -- [47]
				"Environment Falling 原味小汤圆 Hit -647 (Physical)", -- [48]
				"原味小汤圆 月火术 指吻礼物馆 Absorb -294 (294 被吸收) (Arcane)", -- [49]
				"原味小汤圆 月火术 (伤害/跳) 指吻礼物馆 Tick -159 (Arcane)", -- [50]
			},
			["Name"] = "原味小汤圆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				false, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				true, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				false, -- [26]
				true, -- [27]
				false, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				46004.188, -- [1]
				46005.988, -- [2]
				46006.255, -- [3]
				46009.672, -- [4]
				46012.256, -- [5]
				46040.44, -- [6]
				45870.181, -- [7]
				45871.398, -- [8]
				45871.848, -- [9]
				45873.265, -- [10]
				45874.782, -- [11]
				45874.848, -- [12]
				45875.215, -- [13]
				45876.265, -- [14]
				45876.282, -- [15]
				45876.382, -- [16]
				45877.782, -- [17]
				45879.282, -- [18]
				45880.782, -- [19]
				45882.265, -- [20]
				45884.982, -- [21]
				45887.582, -- [22]
				45890.582, -- [23]
				45893.382, -- [24]
				45894.282, -- [25]
				45894.932, -- [26]
				45895.066, -- [27]
				45895.599, -- [28]
				45896.599, -- [29]
				45896.93300000001, -- [30]
				45897.149, -- [31]
				45897.93300000001, -- [32]
				45898.599, -- [33]
				45900.166, -- [34]
				45900.166, -- [35]
				45900.93300000001, -- [36]
				45903.166, -- [37]
				45903.166, -- [38]
				45909.166, -- [39]
				45909.166, -- [40]
				45912.2, -- [41]
				45991.238, -- [42]
				45994.228, -- [43]
				45994.738, -- [44]
				45995.304, -- [45]
				45996.738, -- [46]
				45996.838, -- [47]
				45997.521, -- [48]
				46000.255, -- [49]
				46003.255, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["指吻礼物馆"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["指吻礼物馆"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 1130,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 2,
								},
							},
							["amount"] = 4,
						},
						["Arcane"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 4,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 9,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 1130,
					},
					["DOT_Time"] = 21,
					["Damage"] = 3204,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Arcane"] = 818,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Nature"] = 1160,
						["Arcane"] = 2044,
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 902,
								},
								["虫群 (伤害/跳)"] = {
									["count"] = 258,
								},
								["月火术"] = {
									["count"] = 1226,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 818,
								},
							},
							["amount"] = 3204,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 483,
								},
							},
							["amount"] = 483,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 647,
								},
							},
							["amount"] = 647,
						},
					},
					["EnergyGainedFrom"] = {
						["原味小汤圆"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 80,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 2.43,
								},
								["虫群 (伤害/跳)"] = {
									["count"] = 1.94,
								},
								["月火术"] = {
									["count"] = 3.67,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 6.27,
								},
							},
							["amount"] = 14.31,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
						["激怒"] = {
							["Details"] = {
								["原味小汤圆"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
					},
					["ActiveTime"] = 14.31,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["愤怒"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 453,
									["min"] = 449,
									["count"] = 2,
									["amount"] = 902,
								},
							},
							["count"] = 2,
							["amount"] = 902,
						},
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 129,
									["min"] = 129,
									["count"] = 2,
									["amount"] = 258,
								},
							},
							["count"] = 2,
							["amount"] = 258,
						},
						["月火术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 298,
									["min"] = 292,
									["count"] = 2,
									["amount"] = 590,
								},
								["Absorb"] = {
									["max"] = 342,
									["min"] = 294,
									["count"] = 2,
									["amount"] = 636,
								},
							},
							["count"] = 4,
							["amount"] = 1226,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 159,
									["min"] = 159,
									["count"] = 4,
									["amount"] = 636,
								},
								["Absorb"] = {
									["max"] = 182,
									["min"] = 182,
									["count"] = 1,
									["amount"] = 182,
								},
							},
							["count"] = 5,
							["amount"] = 818,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 14.31,
					["TimeDamaging"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 2.43,
								},
								["虫群 (伤害/跳)"] = {
									["count"] = 1.94,
								},
								["月火术"] = {
									["count"] = 3.67,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 6.27,
								},
							},
							["amount"] = 14.31,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["大叔不熬夜-黑龙费尔默"] = {
									["count"] = 3,
								},
								["因纳夏克-黑龙费尔默"] = {
									["count"] = 24,
								},
								["Yang-逐风者"] = {
									["count"] = 18,
								},
							},
							["amount"] = 45,
						},
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["指吻礼物馆"] = {
									["count"] = 12,
								},
							},
							["amount"] = 12,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 9,
								},
								["骑大象找麻姑-逐风者"] = {
									["count"] = 3,
								},
								["因纳夏克-黑龙费尔默"] = {
									["count"] = 15,
								},
								["薯片儿-逐风者"] = {
									["count"] = 6,
								},
								["Yang-逐风者"] = {
									["count"] = 9,
								},
								["指吻礼物馆"] = {
									["count"] = 30,
								},
								["渣二哥-黑龙费尔默"] = {
									["count"] = 21,
								},
								["大叔不熬夜-黑龙费尔默"] = {
									["count"] = 6,
								},
							},
							["amount"] = 99,
						},
					},
					["ElementDoneResist"] = {
						["Arcane"] = 116,
					},
					["TimeSpent"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 4.94,
								},
								["愤怒"] = {
									["count"] = 2.43,
								},
								["铁皮手雷"] = {
									["count"] = 0.38,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 11.98,
								},
								["月火术"] = {
									["count"] = 6.67,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 30.90000000000001,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 3.39,
								},
								["肉搏"] = {
									["count"] = 0.47,
								},
								["月火术"] = {
									["count"] = 4.32,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 8.360000000000001,
								},
							},
							["amount"] = 16.54,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 6.460000000000001,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.01,
								},
							},
							["amount"] = 10.97,
						},
						["风之利箭"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 1.5,
								},
								["愈合"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 8.77,
								},
								["月火术"] = {
									["count"] = 0.7000000000000001,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 2.36,
								},
							},
							["amount"] = 11.83,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 1.9,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 2.28,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 1.71,
								},
								["月火术"] = {
									["count"] = 1.62,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.83,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 0.98,
								},
								["月火术"] = {
									["count"] = 5.720000000000001,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 8.879999999999999,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["愤怒"] = {
									["count"] = 3.97,
								},
								["铁皮手雷"] = {
									["count"] = 1.45,
								},
								["月火术"] = {
									["count"] = 2.84,
								},
								["肉搏"] = {
									["count"] = 0.27,
								},
							},
							["amount"] = 13.03,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 4.98,
						},
					},
					["WhoHealed"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2306,
								},
							},
							["amount"] = 2306,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1576,
								},
								["圣光闪现"] = {
									["count"] = 1083,
								},
							},
							["amount"] = 2659,
						},
					},
					["ElementDoneAbsorb"] = {
						["Fire"] = 408,
						["Nature"] = 877,
						["Arcane"] = 3197,
					},
					["HOT_Time"] = 45,
					["ElementTaken"] = {
						["Frost"] = 2912,
						["Melee"] = 290,
						["Fire"] = 505,
						["Shadow"] = 2189,
						["Physical"] = 1757,
					},
					["HOTs"] = {
						["回春术"] = {
							["Details"] = {
								["原味小汤圆"] = {
									["count"] = 9,
								},
								["风之利箭"] = {
									["count"] = 12,
								},
							},
							["amount"] = 21,
						},
						["愈合"] = {
							["Details"] = {
								["原味小汤圆"] = {
									["count"] = 12,
								},
								["风之利箭"] = {
									["count"] = 12,
								},
							},
							["amount"] = 24,
						},
					},
					["Damage"] = 30529,
					["TimeHeal"] = 2,
					["ElementDone"] = {
						["Arcane"] = 18921,
						["Fire"] = 408,
						["Melee"] = 1224,
						["Nature"] = 9976,
					},
					["DamagedWho"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 461,
								},
								["愤怒"] = {
									["count"] = 902,
								},
								["铁皮手雷"] = {
									["count"] = 199,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1633,
								},
								["月火术"] = {
									["count"] = 2743,
								},
								["肉搏"] = {
									["count"] = 484,
								},
							},
							["amount"] = 6422,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 3359,
								},
								["肉搏"] = {
									["count"] = 57,
								},
								["月火术"] = {
									["count"] = 1830,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1752,
								},
							},
							["amount"] = 6998,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 303,
								},
								["月火术"] = {
									["count"] = 352,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 600,
								},
							},
							["amount"] = 1255,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 421,
								},
								["月火术"] = {
									["count"] = 872,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1352,
								},
							},
							["amount"] = 2645,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 1921,
								},
								["肉搏"] = {
									["count"] = 413,
								},
							},
							["amount"] = 2334,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 1548,
								},
								["月火术"] = {
									["count"] = 320,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 171,
								},
							},
							["amount"] = 2039,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 1078,
								},
								["月火术"] = {
									["count"] = 2329,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 342,
								},
							},
							["amount"] = 3749,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 513,
								},
								["愤怒"] = {
									["count"] = 1848,
								},
								["铁皮手雷"] = {
									["count"] = 209,
								},
								["月火术"] = {
									["count"] = 1339,
								},
								["肉搏"] = {
									["count"] = 270,
								},
							},
							["amount"] = 4179,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 56,
								},
								["月火术"] = {
									["count"] = 408,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 444,
								},
							},
							["amount"] = 908,
						},
					},
					["WhoDamaged"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 483,
								},
							},
							["amount"] = 483,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 782,
								},
							},
							["amount"] = 782,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 636,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 973,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 385,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 195,
								},
							},
							["amount"] = 2189,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 903,
								},
							},
							["amount"] = 903,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 68,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 424,
								},
								["肉搏"] = {
									["count"] = 290,
								},
							},
							["amount"] = 782,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["冲击波"] = {
									["count"] = 505,
								},
								["寒冰箭"] = {
									["count"] = 1981,
								},
								["冰霜新星"] = {
									["count"] = 28,
								},
							},
							["amount"] = 2514,
						},
					},
					["EnergyGainedFrom"] = {
						["原味小汤圆"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
					},
					["TimeHealing"] = {
						["风之利箭"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 1.5,
								},
								["愈合"] = {
									["count"] = 0.5,
								},
							},
							["amount"] = 2,
						},
					},
					["OverHeals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 277,
									["min"] = 276,
									["count"] = 6,
									["amount"] = 1658,
								},
							},
							["count"] = 6,
							["amount"] = 1658,
						},
						["愈合"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 183,
									["min"] = 183,
									["count"] = 8,
									["amount"] = 1464,
								},
								["Crit"] = {
									["max"] = 1761,
									["min"] = 1761,
									["count"] = 1,
									["amount"] = 1761,
								},
								["Hit"] = {
									["max"] = 538,
									["min"] = 538,
									["count"] = 1,
									["amount"] = 538,
								},
							},
							["count"] = 10,
							["amount"] = 3763,
						},
					},
					["PartialResist"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["变形术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["变形术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 106.24,
					["RageGained"] = {
						["激怒"] = {
							["Details"] = {
								["原味小汤圆"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
					["EnergyGain"] = 80,
					["Heals"] = {
						["回春术"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 276,
									["min"] = 276,
									["count"] = 1,
									["amount"] = 276,
								},
							},
							["count"] = 1,
							["amount"] = 276,
						},
						["愈合"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 609,
									["min"] = 609,
									["count"] = 1,
									["amount"] = 609,
								},
							},
							["count"] = 1,
							["amount"] = 609,
						},
					},
					["RageGainedFrom"] = {
						["原味小汤圆"] = {
							["Details"] = {
								["激怒"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
					},
					["EnergyGained"] = {
						["激怒"] = {
							["Details"] = {
								["原味小汤圆"] = {
									["count"] = 80,
								},
							},
							["amount"] = 80,
						},
					},
					["RageGain"] = 10,
					["Healing"] = 885,
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 9,
								},
							},
							["amount"] = 10,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["DamageTaken"] = 7653,
					["Attacks"] = {
						["虫群 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 129,
									["min"] = 129,
									["count"] = 2,
									["amount"] = 258,
								},
								["Absorb"] = {
									["max"] = 102,
									["min"] = 101,
									["count"] = 2,
									["amount"] = 203,
								},
							},
							["count"] = 4,
							["amount"] = 461,
						},
						["愤怒"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 674,
									["min"] = 674,
									["count"] = 1,
									["amount"] = 674,
								},
								["Crit"] = {
									["max"] = 1334,
									["min"] = 1049,
									["count"] = 2,
									["amount"] = 2383,
								},
								["Hit"] = {
									["max"] = 685,
									["min"] = 449,
									["count"] = 10,
									["amount"] = 5678,
								},
							},
							["count"] = 13,
							["amount"] = 8735,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 209,
									["min"] = 199,
									["count"] = 2,
									["amount"] = 408,
								},
							},
							["count"] = 2,
							["amount"] = 408,
						},
						["月火术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 277,
									["min"] = 182,
									["count"] = 3,
									["amount"] = 736,
								},
								["Tick"] = {
									["max"] = 277,
									["min"] = 16,
									["count"] = 30,
									["amount"] = 6071,
								},
							},
							["count"] = 33,
							["amount"] = 6807,
						},
						["纠缠根须 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 70,
									["min"] = 47,
									["count"] = 15,
									["amount"] = 780,
								},
							},
							["count"] = 15,
							["amount"] = 780,
						},
						["月火术"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 342,
									["min"] = 294,
									["count"] = 4,
									["amount"] = 1237,
								},
								["Crit"] = {
									["max"] = 1023,
									["min"] = 529,
									["count"] = 6,
									["amount"] = 4580,
								},
								["Hit"] = {
									["max"] = 481,
									["min"] = 120,
									["count"] = 18,
									["amount"] = 6297,
								},
							},
							["count"] = 31,
							["amount"] = 12114,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 413,
									["min"] = 29,
									["count"] = 6,
									["amount"] = 1224,
								},
							},
							["count"] = 6,
							["amount"] = 1224,
						},
					},
					["HealingTaken"] = 4965,
					["Overhealing"] = 5421,
					["TimeDamage"] = 104.24,
					["TimeDamaging"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["虫群 (伤害/跳)"] = {
									["count"] = 4.94,
								},
								["愤怒"] = {
									["count"] = 2.43,
								},
								["铁皮手雷"] = {
									["count"] = 0.38,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 11.98,
								},
								["月火术"] = {
									["count"] = 6.67,
								},
								["肉搏"] = {
									["count"] = 4.5,
								},
							},
							["amount"] = 30.90000000000001,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 3.39,
								},
								["肉搏"] = {
									["count"] = 0.47,
								},
								["月火术"] = {
									["count"] = 4.32,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 8.360000000000001,
								},
							},
							["amount"] = 16.54,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 6.460000000000001,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 3.01,
								},
							},
							["amount"] = 10.97,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 8.77,
								},
								["月火术"] = {
									["count"] = 0.7000000000000001,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 2.36,
								},
							},
							["amount"] = 11.83,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["月火术"] = {
									["count"] = 1.9,
								},
								["肉搏"] = {
									["count"] = 0.38,
								},
							},
							["amount"] = 2.28,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 1.71,
								},
								["月火术"] = {
									["count"] = 1.62,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.83,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["愤怒"] = {
									["count"] = 0.98,
								},
								["月火术"] = {
									["count"] = 5.720000000000001,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 2.18,
								},
							},
							["amount"] = 8.879999999999999,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["月火术 (伤害/跳)"] = {
									["count"] = 4.5,
								},
								["愤怒"] = {
									["count"] = 3.97,
								},
								["铁皮手雷"] = {
									["count"] = 1.45,
								},
								["月火术"] = {
									["count"] = 2.84,
								},
								["肉搏"] = {
									["count"] = 0.27,
								},
							},
							["amount"] = 13.03,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["纠缠根须 (伤害/跳)"] = {
									["count"] = 1.5,
								},
								["月火术"] = {
									["count"] = 1.5,
								},
								["月火术 (伤害/跳)"] = {
									["count"] = 1.98,
								},
							},
							["amount"] = 4.98,
						},
					},
					["DOT_Time"] = 156,
					["HealedWho"] = {
						["风之利箭"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 276,
								},
								["愈合"] = {
									["count"] = 609,
								},
							},
							["amount"] = 885,
						},
					},
					["ElementHitsDone"] = {
						["Arcane"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 3,
								},
								["Absorb"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 18,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Tick"] = {
									["count"] = 30,
								},
							},
							["amount"] = 64,
						},
						["Fire"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 10,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 17,
								},
							},
							["amount"] = 32,
						},
					},
				},
			},
			["UnitLockout"] = 45434.541,
			["LastActive"] = 46039.54,
		},
		["冬雷"] = {
			["GUID"] = "Player-5458-02EA654D",
			["LastEventHealth"] = {
				4210, -- [1]
				4210, -- [2]
				4210, -- [3]
				4210, -- [4]
				4117, -- [5]
				4117, -- [6]
				4080, -- [7]
				4080, -- [8]
				4080, -- [9]
				4080, -- [10]
				4080, -- [11]
				4080, -- [12]
				3820, -- [13]
				3637, -- [14]
				3453, -- [15]
				3453, -- [16]
				3453, -- [17]
				3361, -- [18]
				3361, -- [19]
				3361, -- [20]
				3361, -- [21]
				3322, -- [22]
				3139, -- [23]
				2731, -- [24]
				2731, -- [25]
				2565, -- [26]
				2382, -- [27]
				2435, -- [28]
				4080, -- [29]
				4080, -- [30]
			},
			["LastAttackedBy"] = "清风徐自来-火妖鲁西弗隆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"MISC", -- [5]
				"MISC", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"MISC", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"MISC", -- [15]
				"MISC", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"MISC", -- [27]
				"HEAL", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
			},
			["TimeWindows"] = {
				["HealingTaken"] = {
					688, -- [1]
				},
				["Dispelled"] = {
					6, -- [1]
				},
				["ActiveTime"] = {
					13.94, -- [1]
				},
				["TimeDamage"] = {
					13.94, -- [1]
				},
				["DamageTaken"] = {
					1676, -- [1]
				},
				["Damage"] = {
					9569, -- [1]
				},
			},
			["enClass"] = "MAGE",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 1,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				4210, -- [1]
				4210, -- [2]
				4210, -- [3]
				4210, -- [4]
				4210, -- [5]
				4210, -- [6]
				4080, -- [7]
				4080, -- [8]
				4080, -- [9]
				4080, -- [10]
				4080, -- [11]
				4080, -- [12]
				3820, -- [13]
				3820, -- [14]
				3820, -- [15]
				3820, -- [16]
				3820, -- [17]
				3820, -- [18]
				3820, -- [19]
				3820, -- [20]
				3820, -- [21]
				3820, -- [22]
				3820, -- [23]
				3820, -- [24]
				3820, -- [25]
				3820, -- [26]
				3820, -- [27]
				3820, -- [28]
				4080, -- [29]
				4080, -- [30]
			},
			["LastDamageTaken"] = 183,
			["Owner"] = false,
			["TimeLast"] = {
				["HealingTaken"] = 45737.541,
				["Dispelled"] = 45731.54,
				["ActiveTime"] = 45815.545,
				["TimeDamage"] = 45815.545,
				["OVERALL"] = 45815.545,
				["DamageTaken"] = 45730.54,
				["Damage"] = 45815.545,
			},
			["NextEventNum"] = 31,
			["LastDamageTime"] = 45816.395,
			["LastEvents"] = {
				"Environment Falling 冬雷 Hit -128 (Physical)", -- [1]
				"冬雷 火球术 骑大象找麻姑-逐风者 Crit -1944 (Fire)", -- [2]
				"冬雷 火焰冲击 骑大象找麻姑-逐风者 Crit -1153 (Fire)", -- [3]
				"指吻礼物馆 冰霜新星 冬雷 Hit -93 (Frost)", -- [4]
				"清风徐自来-火妖鲁西弗隆 dispels 冬雷 野性赐福 (驱散魔法)", -- [5]
				"清风徐自来-火妖鲁西弗隆 dispels 冬雷 奥术智慧 (驱散魔法)", -- [6]
				"冬雷 肉搏 指吻礼物馆 Absorb -111 (1)", -- [7]
				"冬雷 火焰冲击 指吻礼物馆 Hit -651 (111 被吸收) (Fire)", -- [8]
				"冬雷 冰锥术 Yang-逐风者 Hit -449 (Frost)", -- [9]
				"冬雷 寒冰箭 Yang-逐风者 Hit -1162 (Frost)", -- [10]
				"冬雷 火焰冲击 Yang-逐风者 Hit -826 (Fire)", -- [11]
				"清风徐自来-火妖鲁西弗隆 dispels 冬雷 强效王者祝福 (驱散魔法)", -- [12]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 冬雷 Tick -183 (Shadow)", -- [13]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 冬雷 Tick -184 (Shadow)", -- [14]
				"清风徐自来-火妖鲁西弗隆 dispels 冬雷 法力护盾 (驱散魔法)", -- [15]
				"清风徐自来-火妖鲁西弗隆 dispels 冬雷 诺格弗格药剂 (驱散魔法)", -- [16]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 冬雷 Tick -92 (92 被抵抗) (Shadow)", -- [17]
				"冬雷 寒冰箭 清风徐自来-火妖鲁西弗隆 Hit -1033 (Frost)", -- [18]
				"冬雷 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -277 (1)", -- [19]
				"冬雷 火焰冲击 清风徐自来-火妖鲁西弗隆 Hit -483 (277 被吸收) (Fire)", -- [20]
				"渣二哥-黑龙费尔默 断筋 冬雷 Hit -39 (Physical)", -- [21]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 冬雷 Tick -183 (Shadow)", -- [22]
				"渣二哥-黑龙费尔默 肉搏 冬雷 Hit -408 (Physical)", -- [23]
				"冬雷 冰霜新星 渣二哥-黑龙费尔默 Hit -103 (Frost)", -- [24]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 冬雷 Tick -183 (Shadow)", -- [25]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 冬雷 Tick -183 (Shadow)", -- [26]
				"烬枫-火妖鲁西弗隆 dispels 冬雷 暗言术：痛 (清洁术)", -- [27]
				"烬枫-火妖鲁西弗隆 圣光闪现 冬雷 Hit +688", -- [28]
				"冬雷 灼烧 渣二哥-黑龙费尔默 Hit -557 (Fire)", -- [29]
				"冬雷 灼烧 渣二哥-黑龙费尔默 Crit -820 (Fire)", -- [30]
			},
			["Name"] = "冬雷",
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
			},
			["LastEventTimes"] = {
				45435.908, -- [1]
				45542.48, -- [2]
				45543.297, -- [3]
				45545.847, -- [4]
				45546.83, -- [5]
				45546.83, -- [6]
				45555.181, -- [7]
				45555.181, -- [8]
				45559.831, -- [9]
				45565.131, -- [10]
				45565.331, -- [11]
				45711.273, -- [12]
				45715.79, -- [13]
				45718.79, -- [14]
				45721.34, -- [15]
				45721.34, -- [16]
				45721.79, -- [17]
				45722.79, -- [18]
				45723.707, -- [19]
				45723.707, -- [20]
				45724.523, -- [21]
				45724.79, -- [22]
				45725.04, -- [23]
				45725.224, -- [24]
				45727.79, -- [25]
				45730.79, -- [26]
				45732.474, -- [27]
				45737.974, -- [28]
				45814.762, -- [29]
				45816.395, -- [30]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 6,
					["TimeSpent"] = {
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.2,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.2,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.92,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.42,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.82,
								},
							},
							["amount"] = 2.32,
						},
					},
					["DamageTaken"] = 1676,
					["ElementDoneAbsorb"] = {
						["Fire"] = 388,
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 92,
							["amount"] = 6,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 13.94,
					["ElementTaken"] = {
						["Shadow"] = 1008,
						["Physical"] = 167,
						["Melee"] = 408,
						["Frost"] = 93,
					},
					["Damage"] = 9569,
					["DamagedWho"] = {
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 1377,
								},
								["冰霜新星"] = {
									["count"] = 103,
								},
							},
							["amount"] = 1480,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1162,
								},
								["火焰冲击"] = {
									["count"] = 826,
								},
								["冰锥术"] = {
									["count"] = 449,
								},
							},
							["amount"] = 2437,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 651,
								},
								["肉搏"] = {
									["count"] = 111,
								},
							},
							["amount"] = 762,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1033,
								},
								["火焰冲击"] = {
									["count"] = 483,
								},
								["肉搏"] = {
									["count"] = 277,
								},
							},
							["amount"] = 1793,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1944,
								},
								["火焰冲击"] = {
									["count"] = 1153,
								},
							},
							["amount"] = 3097,
						},
					},
					["WhoHealed"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 688,
								},
							},
							["amount"] = 688,
						},
					},
					["ElementTakenResist"] = {
						["Shadow"] = 92,
					},
					["WhoDispelled"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["法力护盾 (驱散魔法)"] = {
									["count"] = 1,
								},
								["野性赐福 (驱散魔法)"] = {
									["count"] = 1,
								},
								["奥术智慧 (驱散魔法)"] = {
									["count"] = 1,
								},
								["诺格弗格药剂 (驱散魔法)"] = {
									["count"] = 1,
								},
								["强效王者祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["灼烧"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 820,
									["min"] = 820,
									["count"] = 1,
									["amount"] = 820,
								},
								["Hit"] = {
									["max"] = 557,
									["min"] = 557,
									["count"] = 1,
									["amount"] = 557,
								},
							},
							["count"] = 2,
							["amount"] = 1377,
						},
						["冰锥术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 449,
									["min"] = 449,
									["count"] = 1,
									["amount"] = 449,
								},
							},
							["count"] = 1,
							["amount"] = 449,
						},
						["冰霜新星"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 103,
									["min"] = 103,
									["count"] = 1,
									["amount"] = 103,
								},
							},
							["count"] = 1,
							["amount"] = 103,
						},
						["火球术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1944,
									["min"] = 1944,
									["count"] = 1,
									["amount"] = 1944,
								},
							},
							["count"] = 1,
							["amount"] = 1944,
						},
						["寒冰箭"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1162,
									["min"] = 1033,
									["count"] = 2,
									["amount"] = 2195,
								},
							},
							["count"] = 2,
							["amount"] = 2195,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 277,
									["min"] = 111,
									["count"] = 2,
									["amount"] = 388,
								},
							},
							["count"] = 2,
							["amount"] = 388,
						},
						["火焰冲击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1153,
									["min"] = 1153,
									["count"] = 1,
									["amount"] = 1153,
								},
								["Hit"] = {
									["max"] = 826,
									["min"] = 483,
									["count"] = 3,
									["amount"] = 1960,
								},
							},
							["count"] = 4,
							["amount"] = 3113,
						},
					},
					["HealingTaken"] = 688,
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 7,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
					},
					["TimeDamage"] = 13.94,
					["WhoDamaged"] = {
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 408,
								},
								["断筋"] = {
									["count"] = 39,
								},
							},
							["amount"] = 447,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 93,
								},
							},
							["amount"] = 93,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1008,
								},
							},
							["amount"] = 1008,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 128,
								},
							},
							["amount"] = 128,
						},
					},
					["ElementDone"] = {
						["Fire"] = 6434,
						["Melee"] = 388,
						["Frost"] = 2747,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamaging"] = {
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["灼烧"] = {
									["count"] = 3,
								},
								["冰霜新星"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 4.5,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.2,
								},
								["冰锥术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.2,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.92,
								},
								["寒冰箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.42,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["火球术"] = {
									["count"] = 1.5,
								},
								["火焰冲击"] = {
									["count"] = 0.82,
								},
							},
							["amount"] = 2.32,
						},
					},
				},
			},
			["UnitLockout"] = 45435.541,
			["LastActive"] = 45815.545,
		},
		["拦截憨憨"] = {
			["GUID"] = "Player-5458-0379EA22",
			["TimeLast"] = {
				["HealingTaken"] = 45556.531,
				["RageGain"] = 46098.544,
				["Dispelled"] = 45550.531,
				["ActiveTime"] = 46098.544,
				["TimeDamage"] = 46098.544,
				["OVERALL"] = 46098.544,
				["DamageTaken"] = 46098.544,
				["Damage"] = 46088.543,
			},
			["LastAttackedBy"] = "骑大象找麻姑-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["RageGain"] = {
					79, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					31.13, -- [1]
				},
				["HealingTaken"] = {
					1773, -- [1]
				},
				["TimeDamage"] = {
					31.13, -- [1]
				},
				["DamageTaken"] = {
					4692, -- [1]
				},
				["Damage"] = {
					2756, -- [1]
				},
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "割裂 (伤害/跳)",
			["LastFightIn"] = 3,
			["type"] = "Grouped",
			["LastDamageTaken"] = 143,
			["LastEventHealth"] = {
				1988, -- [1]
				1988, -- [2]
				1988, -- [3]
				1633, -- [4]
				1491, -- [5]
				1003, -- [6]
				1003, -- [7]
				1003, -- [8]
				1003, -- [9]
				901, -- [10]
				759, -- [11]
				759, -- [12]
				724, -- [13]
				724, -- [14]
				582, -- [15]
				535, -- [16]
				446, -- [17]
				446, -- [18]
				446, -- [19]
				303, -- [20]
				4344, -- [21]
				4344, -- [22]
				4344, -- [23]
				4332, -- [24]
				4022, -- [25]
				3895, -- [26]
				3756, -- [27]
				3756, -- [28]
				3496, -- [29]
				3359, -- [30]
				3359, -- [31]
				3256, -- [32]
				3256, -- [33]
				3256, -- [34]
				3237, -- [35]
				3094, -- [36]
				2973, -- [37]
				2973, -- [38]
				2831, -- [39]
				2720, -- [40]
				2720, -- [41]
				2680, -- [42]
				2578, -- [43]
				2435, -- [44]
				2435, -- [45]
				2435, -- [46]
				2279, -- [47]
				2137, -- [48]
				2034, -- [49]
				1988, -- [50]
			},
			["Owner"] = false,
			["LastEventHealthMax"] = {
				4669, -- [1]
				4669, -- [2]
				4669, -- [3]
				4669, -- [4]
				4669, -- [5]
				4669, -- [6]
				4669, -- [7]
				4669, -- [8]
				4669, -- [9]
				4669, -- [10]
				4669, -- [11]
				4669, -- [12]
				4669, -- [13]
				4669, -- [14]
				4669, -- [15]
				4669, -- [16]
				4669, -- [17]
				4669, -- [18]
				4669, -- [19]
				4669, -- [20]
				4789, -- [21]
				4789, -- [22]
				4789, -- [23]
				4669, -- [24]
				4669, -- [25]
				4669, -- [26]
				4669, -- [27]
				4669, -- [28]
				4669, -- [29]
				4669, -- [30]
				4669, -- [31]
				4669, -- [32]
				4669, -- [33]
				4669, -- [34]
				4669, -- [35]
				4669, -- [36]
				4669, -- [37]
				4669, -- [38]
				4669, -- [39]
				4669, -- [40]
				4669, -- [41]
				4669, -- [42]
				4669, -- [43]
				4669, -- [44]
				4669, -- [45]
				4669, -- [46]
				4669, -- [47]
				4669, -- [48]
				4669, -- [49]
				4669, -- [50]
			},
			["NextEventNum"] = 21,
			["LastDamageTime"] = 46098.927,
			["LastEvents"] = {
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Dodge (1)", -- [1]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Crit -222 (Physical)", -- [2]
				"骑大象找麻姑-逐风者 速效毒药 VI 拦截憨憨 Hit -133 (Nature)", -- [3]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -142 (Physical)", -- [4]
				"骑大象找麻姑-逐风者 刺骨 拦截憨憨 Hit -488 (Physical)", -- [5]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Dodge (1)", -- [6]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Block (1)", -- [7]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Dodge (Physical)", -- [8]
				"骑大象找麻姑-逐风者 绞喉 (伤害/跳) 拦截憨憨 Tick -102 (Physical)", -- [9]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -142 (Physical)", -- [10]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Miss (1)", -- [11]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -35 (Physical)", -- [12]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Immune (1)", -- [13]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -142 (Physical)", -- [14]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Hit -47 (Physical)", -- [15]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Crit -89 (Physical)", -- [16]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Immune (1)", -- [17]
				"拦截憨憨 震荡猛击 骑大象找麻姑-逐风者 Immune (Physical)", -- [18]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -143 (Physical)", -- [19]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Block (1)", -- [20]
				"拦截憨憨 英勇打击 龍鳯大盗 Hit -309 (Physical)", -- [21]
				"拦截憨憨 拦截昏迷 清风徐自来-火妖鲁西弗隆 Absorb -44 (44 被吸收) (Physical)", -- [22]
				"拦截憨憨 肉搏 清风徐自来-火妖鲁西弗隆 Absorb -170 (170 被吸收) (1)", -- [23]
				"骑大象找麻姑-逐风者 速效毒药 VI 拦截憨憨 Hit -166 (Nature)", -- [24]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -127 (Physical)", -- [25]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -139 (Physical)", -- [26]
				"拦截憨憨 英勇打击 骑大象找麻姑-逐风者 Dodge (Physical)", -- [27]
				"骑大象找麻姑-逐风者 绞喉 (伤害/跳) 拦截憨憨 Tick -125 (Physical)", -- [28]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -137 (Physical)", -- [29]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Crit -303 (Physical)", -- [30]
				"骑大象找麻姑-逐风者 绞喉 (伤害/跳) 拦截憨憨 Tick -103 (Physical)", -- [31]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Dodge (1)", -- [32]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Hit -121 (Physical)", -- [33]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -19 (Physical)", -- [34]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -143 (Physical)", -- [35]
				"骑大象找麻姑-逐风者 绞喉 (伤害/跳) 拦截憨憨 Tick -102 (Physical)", -- [36]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Crit -259 (Physical)", -- [37]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -142 (Physical)", -- [38]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -111 (Physical)", -- [39]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -40 (Physical)", -- [40]
				"拦截憨憨 肉搏 骑大象找麻姑-逐风者 Crit -268 (Physical)", -- [41]
				"骑大象找麻姑-逐风者 绞喉 (伤害/跳) 拦截憨憨 Tick -102 (Physical)", -- [42]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -143 (Physical)", -- [43]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Miss (1)", -- [44]
				"骑大象找麻姑-逐风者 出血 拦截憨憨 Hit -114 (Physical)", -- [45]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Hit -42 (Physical)", -- [46]
				"骑大象找麻姑-逐风者 割裂 (伤害/跳) 拦截憨憨 Tick -142 (Physical)", -- [47]
				"骑大象找麻姑-逐风者 绞喉 (伤害/跳) 拦截憨憨 Tick -103 (Physical)", -- [48]
				"骑大象找麻姑-逐风者 肉搏 拦截憨憨 Hit -46 (Physical)", -- [49]
				"拦截憨憨 破甲攻击 骑大象找麻姑-逐风者 Parry (Physical)", -- [50]
			},
			["Name"] = "拦截憨憨",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				true, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				false, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				true, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				true, -- [34]
				true, -- [35]
				true, -- [36]
				false, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				46092.293, -- [1]
				46092.493, -- [2]
				46092.493, -- [3]
				46092.927, -- [4]
				46093.343, -- [5]
				46094.293, -- [6]
				46094.31, -- [7]
				46094.343, -- [8]
				46094.893, -- [9]
				46094.943, -- [10]
				46095.41, -- [11]
				46095.577, -- [12]
				46096.293, -- [13]
				46096.943, -- [14]
				46097.027, -- [15]
				46098.293, -- [16]
				46098.81, -- [17]
				46098.927, -- [18]
				46098.944, -- [19]
				46099.21, -- [20]
				45558.114, -- [21]
				45562.015, -- [22]
				45562.931, -- [23]
				46076.876, -- [24]
				46077.876, -- [25]
				46078.892, -- [26]
				46079.026, -- [27]
				46079.876, -- [28]
				46080.143, -- [29]
				46081.026, -- [30]
				46082.878, -- [31]
				46083.043, -- [32]
				46084.243, -- [33]
				46084.276, -- [34]
				46084.943, -- [35]
				46085.876, -- [36]
				46086.759, -- [37]
				46086.943, -- [38]
				46086.943, -- [39]
				46088.76, -- [40]
				46088.76, -- [41]
				46088.943, -- [42]
				46088.943, -- [43]
				46089.576, -- [44]
				46089.876, -- [45]
				46089.926, -- [46]
				46090.943, -- [47]
				46091.877, -- [48]
				46092.11, -- [49]
				46092.176, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 3731,
					["RageGainedFrom"] = {
						["拦截憨憨"] = {
							["Details"] = {
								["盾牌专精"] = {
									["count"] = 7,
								},
								["血性狂暴"] = {
									["count"] = 5,
								},
							},
							["amount"] = 12,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Block"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 14,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 27,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
								["Block"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Miss"] = {
									["count"] = 2,
								},
							},
							["amount"] = 11,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Dodge"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
						["Physical"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Physical"] = 2986,
						["Melee"] = 446,
						["Nature"] = 299,
					},
					["DOT_Time"] = 0,
					["Damage"] = 951,
					["ElementTakenBlock"] = {
						["Melee"] = 105,
						["Physical"] = 258,
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 951,
					},
					["PartialAbsorb"] = {
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 951,
								},
							},
							["amount"] = 951,
						},
					},
					["PartialBlock"] = {
						["出血"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 86,
									["min"] = 86,
									["count"] = 3,
									["amount"] = 258,
								},
							},
							["count"] = 3,
							["amount"] = 258,
						},
						["肉搏"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 54,
									["min"] = 51,
									["count"] = 2,
									["amount"] = 105,
								},
							},
							["count"] = 2,
							["amount"] = 105,
						},
					},
					["WhoDamaged"] = {
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["绞喉 (伤害/跳)"] = {
									["count"] = 637,
								},
								["刺骨"] = {
									["count"] = 488,
								},
								["割裂 (伤害/跳)"] = {
									["count"] = 1139,
								},
								["速效毒药 VI"] = {
									["count"] = 299,
								},
								["出血"] = {
									["count"] = 722,
								},
								["肉搏"] = {
									["count"] = 446,
								},
							},
							["amount"] = 3731,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["盾牌专精"] = {
							["Details"] = {
								["拦截憨憨"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["血性狂暴"] = {
							["Details"] = {
								["拦截憨憨"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["破甲攻击"] = {
									["count"] = 1.5,
								},
								["震荡猛击"] = {
									["count"] = 0.12,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.82,
								},
							},
							["amount"] = 14.94,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 14.94,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["破甲攻击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["震荡猛击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 121,
									["min"] = 121,
									["count"] = 1,
									["amount"] = 121,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 303,
									["min"] = 259,
									["count"] = 3,
									["amount"] = 830,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 951,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 12,
					["TimeDamage"] = 14.94,
					["TimeDamaging"] = {
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["破甲攻击"] = {
									["count"] = 1.5,
								},
								["震荡猛击"] = {
									["count"] = 0.12,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.82,
								},
							},
							["amount"] = 14.94,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 1,
					["TimeSpent"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["破甲攻击"] = {
									["count"] = 1.5,
								},
								["震荡猛击"] = {
									["count"] = 0.12,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.82,
								},
							},
							["amount"] = 14.94,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.27,
								},
							},
							["amount"] = 6.27,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.92,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.42,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["DamageTaken"] = 4692,
					["RageGainedFrom"] = {
						["拦截憨憨"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 30,
								},
								["盾牌专精"] = {
									["count"] = 7,
								},
								["冲锋"] = {
									["count"] = 42,
								},
							},
							["amount"] = 79,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["出血"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 12,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["速效毒药 VI"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["割裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["绞喉 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["出血"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 12,
									["amount"] = 0,
								},
							},
							["count"] = 12,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 31.13,
					["ElementTaken"] = {
						["Physical"] = 3349,
						["Melee"] = 1044,
						["Nature"] = 299,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["拦截憨憨"] = {
									["count"] = 30,
								},
							},
							["amount"] = 30,
						},
						["盾牌专精"] = {
							["Details"] = {
								["拦截憨憨"] = {
									["count"] = 7,
								},
							},
							["amount"] = 7,
						},
						["冲锋"] = {
							["Details"] = {
								["拦截憨憨"] = {
									["count"] = 42,
								},
							},
							["amount"] = 42,
						},
					},
					["Damage"] = 2756,
					["PartialBlock"] = {
						["出血"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 86,
									["min"] = 86,
									["count"] = 3,
									["amount"] = 258,
								},
							},
							["count"] = 3,
							["amount"] = 258,
						},
						["肉搏"] = {
							["Details"] = {
								["被格挡"] = {
									["max"] = 54,
									["min"] = 51,
									["count"] = 2,
									["amount"] = 105,
								},
							},
							["count"] = 2,
							["amount"] = 105,
						},
					},
					["ElementTakenBlock"] = {
						["Melee"] = 105,
						["Physical"] = 258,
					},
					["WhoDispelled"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 170,
						["Physical"] = 83,
					},
					["HealingTaken"] = 1773,
					["WhoHealed"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1251,
								},
							},
							["amount"] = 1251,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 522,
								},
							},
							["amount"] = 522,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Block"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 10,
								},
								["Tick"] = {
									["count"] = 16,
								},
							},
							["amount"] = 30,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Block"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 14,
						},
						["Nature"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["Attacks"] = {
						["拦截昏迷"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
							},
							["count"] = 1,
							["amount"] = 44,
						},
						["英勇打击"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 309,
									["min"] = 309,
									["count"] = 1,
									["amount"] = 309,
								},
							},
							["count"] = 2,
							["amount"] = 309,
						},
						["震荡猛击"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["破甲攻击"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 39,
									["min"] = 39,
									["count"] = 1,
									["amount"] = 39,
								},
							},
							["count"] = 1,
							["amount"] = 39,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 170,
									["min"] = 170,
									["count"] = 1,
									["amount"] = 170,
								},
								["Hit"] = {
									["max"] = 201,
									["min"] = 121,
									["count"] = 7,
									["amount"] = 1101,
								},
								["Immune"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 303,
									["min"] = 259,
									["count"] = 4,
									["amount"] = 1093,
								},
								["Dodge"] = {
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 2364,
						},
					},
					["RageGain"] = 79,
					["DamagedWho"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 309,
								},
							},
							["amount"] = 309,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 951,
								},
							},
							["amount"] = 951,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 578,
								},
								["断筋"] = {
									["count"] = 39,
								},
							},
							["amount"] = 617,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 170,
								},
								["拦截昏迷"] = {
									["count"] = 44,
								},
							},
							["amount"] = 214,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 665,
								},
							},
							["amount"] = 665,
						},
					},
					["TimeDamage"] = 31.13,
					["TimeDamaging"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["英勇打击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["破甲攻击"] = {
									["count"] = 1.5,
								},
								["震荡猛击"] = {
									["count"] = 0.12,
								},
								["英勇打击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 11.82,
								},
							},
							["amount"] = 14.94,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.27,
								},
							},
							["amount"] = 6.27,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.92,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 2.42,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["WhoDamaged"] = {
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["绞喉 (伤害/跳)"] = {
									["count"] = 637,
								},
								["刺骨"] = {
									["count"] = 488,
								},
								["割裂 (伤害/跳)"] = {
									["count"] = 1139,
								},
								["速效毒药 VI"] = {
									["count"] = 299,
								},
								["出血"] = {
									["count"] = 722,
								},
								["肉搏"] = {
									["count"] = 446,
								},
							},
							["amount"] = 3731,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 237,
								},
								["肉搏"] = {
									["count"] = 216,
								},
							},
							["amount"] = 453,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["重伤 (伤害/跳)"] = {
									["count"] = 126,
								},
							},
							["amount"] = 126,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 382,
								},
							},
							["amount"] = 382,
						},
					},
					["ElementDone"] = {
						["Melee"] = 2364,
						["Physical"] = 392,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 7,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 4,
								},
								["Dodge"] = {
									["count"] = 3,
								},
							},
							["amount"] = 17,
						},
						["Physical"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
					},
				},
			},
			["UnitLockout"] = 45505.545,
			["LastActive"] = 46098.544,
		},
		["一罗伊一"] = {
			["GUID"] = "Player-5458-03569A62",
			["LastEventHealth"] = {
				4704, -- [1]
				4704, -- [2]
				4704, -- [3]
				4157, -- [4]
				4232, -- [5]
				4242, -- [6]
				3937, -- [7]
				3958, -- [8]
				3969, -- [9]
				3969, -- [10]
				3980, -- [11]
				3980, -- [12]
				3991, -- [13]
				4543, -- [14]
				4565, -- [15]
				4565, -- [16]
				4119, -- [17]
				4184, -- [18]
				4195, -- [19]
				3904, -- [20]
				3926, -- [21]
				3926, -- [22]
				3937, -- [23]
				3948, -- [24]
				3948, -- [25]
				3959, -- [26]
				3959, -- [27]
				3989, -- [28]
				4000, -- [29]
				4022, -- [30]
				4033, -- [31]
				4044, -- [32]
				4044, -- [33]
				4075, -- [34]
				4075, -- [35]
				4105, -- [36]
				4135, -- [37]
				4135, -- [38]
				4166, -- [39]
				4166, -- [40]
				4196, -- [41]
				4227, -- [42]
				4227, -- [43]
				3374, -- [44]
				3296, -- [45]
				3309, -- [46]
				3292, -- [47]
				3285, -- [48]
			},
			["LastAttackedBy"] = "渣二哥-黑龙费尔默",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"HEAL", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"DAMAGE", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
			},
			["TimeWindows"] = {
				["DamageTaken"] = {
					495, -- [1]
				},
				["HealingTaken"] = {
					1245, -- [1]
				},
				["ManaGain"] = {
					2721, -- [1]
				},
				["ActiveTime"] = {
					43.02, -- [1]
				},
				["TimeDamage"] = {
					43.02, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DOT_Time"] = {
					96, -- [1]
				},
				["Damage"] = {
					10827, -- [1]
				},
			},
			["enClass"] = "WARLOCK",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "撕裂 (伤害/跳)",
			["LastFightIn"] = 0,
			["type"] = "Grouped",
			["LastDamageTaken"] = 29,
			["LastEventHealthMax"] = {
				4704, -- [1]
				4704, -- [2]
				4704, -- [3]
				4704, -- [4]
				4704, -- [5]
				4704, -- [6]
				4704, -- [7]
				4704, -- [8]
				4704, -- [9]
				4704, -- [10]
				4704, -- [11]
				4704, -- [12]
				4704, -- [13]
				4704, -- [14]
				4704, -- [15]
				4704, -- [16]
				4704, -- [17]
				4704, -- [18]
				4704, -- [19]
				4704, -- [20]
				4704, -- [21]
				4704, -- [22]
				4704, -- [23]
				4704, -- [24]
				4704, -- [25]
				4704, -- [26]
				4704, -- [27]
				4704, -- [28]
				4704, -- [29]
				4704, -- [30]
				4704, -- [31]
				4704, -- [32]
				4704, -- [33]
				4704, -- [34]
				4704, -- [35]
				4704, -- [36]
				4704, -- [37]
				4704, -- [38]
				4704, -- [39]
				4704, -- [40]
				4704, -- [41]
				4704, -- [42]
				4704, -- [43]
				4704, -- [44]
				4704, -- [45]
				4704, -- [46]
				4704, -- [47]
				4704, -- [48]
			},
			["TimeLast"] = {
				["OVERALL"] = 45713.539,
				["DamageTaken"] = 45713.539,
				["HealingTaken"] = 45621.534,
				["ActiveTime"] = 45647.536,
				["TimeDamage"] = 45647.536,
				["Healing"] = 45467.543,
				["ManaGain"] = 45621.534,
				["DOT_Time"] = 45647.536,
				["Damage"] = 45647.536,
			},
			["Owner"] = false,
			["Pet"] = {
				"卡特文 <一罗伊一>", -- [1]
			},
			["NextEventNum"] = 49,
			["LastDamageTime"] = 45647.886,
			["LastEvents"] = {
				"一罗伊一 痛苦诅咒 (伤害/跳) Yang-逐风者 Tick -107 (Shadow)", -- [1]
				"一罗伊一 痛苦诅咒 (伤害/跳) Yang-逐风者 Tick -107 (Shadow)", -- [2]
				"一罗伊一 腐蚀术 (伤害/跳) Yang-逐风者 Tick -198 (Shadow)", -- [3]
				"一罗伊一 腐蚀术 (伤害/跳) 清风徐自来-火妖鲁西弗隆 Tick -198 (Shadow)", -- [4]
				"一罗伊一 暗影灼烧 大叔不熬夜-黑龙费尔默 Hit -717 (Shadow)", -- [5]
				"一罗伊一 腐蚀术 (伤害/跳) 大叔不熬夜-黑龙费尔默 Tick -199 (Shadow)", -- [6]
				"一罗伊一 死亡缠绕 指吻礼物馆 Absorb -594 (594 被吸收) (Shadow)", -- [7]
				"一罗伊一 腐蚀术 (伤害/跳) 指吻礼物馆 Tick -183 (Shadow)", -- [8]
				"一罗伊一 痛苦诅咒 (伤害/跳) 指吻礼物馆 Tick -78 (Shadow)", -- [9]
				"一罗伊一 暗影灼烧 指吻礼物馆 Resist (Shadow)", -- [10]
				"一罗伊一 痛苦诅咒 (伤害/跳) 指吻礼物馆 Absorb -77 (77 被吸收) (Shadow)", -- [11]
				"一罗伊一 腐蚀术 (伤害/跳) 指吻礼物馆 Absorb -183 (183 被吸收) (Shadow)", -- [12]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 一罗伊一 Hit +541", -- [13]
				"一罗伊一 腐蚀术 (伤害/跳) 龍鳯大盗 Tick -198 (Shadow)", -- [14]
				"一罗伊一 暗影箭 龍鳯大盗 Hit -912 (Shadow)", -- [15]
				"一罗伊一 腐蚀术 (伤害/跳) 龍鳯大盗 Tick -198 (Shadow)", -- [16]
				"一罗伊一 暗影箭 因纳夏克-黑龙费尔默 Crit -1991 (Shadow)", -- [17]
				"一罗伊一 暗影箭 薯片儿-逐风者 Hit -1025 (Shadow)", -- [18]
				"Yang-逐风者 肉搏 一罗伊一 Hit -302 (Physical)", -- [19]
				"Yang-逐风者 破胆怒吼 一罗伊一 Resist (Physical)", -- [20]
				"一罗伊一 腐蚀术 (伤害/跳) Yang-逐风者 Tick -199 (Shadow)", -- [21]
				"一罗伊一 痛苦诅咒 (伤害/跳) Yang-逐风者 Tick -85 (Shadow)", -- [22]
				"一罗伊一 痛苦诅咒 (伤害/跳) Yang-逐风者 Tick -93 (Shadow)", -- [23]
				"一罗伊一 腐蚀术 (伤害/跳) Yang-逐风者 Tick -218 (Shadow)", -- [24]
				"一罗伊一 痛苦诅咒 (伤害/跳) Yang-逐风者 Tick -93 (Shadow)", -- [25]
				"一罗伊一 腐蚀术 (伤害/跳) Yang-逐风者 Tick -218 (Shadow)", -- [26]
				"一罗伊一 痛苦诅咒 (伤害/跳) Yang-逐风者 Tick -93 (Shadow)", -- [27]
				"一罗伊一 暗影灼烧 Yang-逐风者 Hit -791 (Shadow)", -- [28]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 一罗伊一 Crit +791 (87 过量治疗)", -- [29]
				"一罗伊一 腐蚀术 (伤害/跳) 渣二哥-黑龙费尔默 Tick -199 (Shadow)", -- [30]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -85 (Shadow)", -- [31]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -85 (Shadow)", -- [32]
				"一罗伊一 腐蚀术 (伤害/跳) 渣二哥-黑龙费尔默 Tick -198 (Shadow)", -- [33]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -85 (Shadow)", -- [34]
				"一罗伊一 腐蚀术 (伤害/跳) 渣二哥-黑龙费尔默 Tick -199 (Shadow)", -- [35]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -85 (Shadow)", -- [36]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -135 (Shadow)", -- [37]
				"一罗伊一 腐蚀术 (伤害/跳) 渣二哥-黑龙费尔默 Tick -199 (Shadow)", -- [38]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -135 (Shadow)", -- [39]
				"一罗伊一 腐蚀术 (伤害/跳) 渣二哥-黑龙费尔默 Tick -199 (Shadow)", -- [40]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -135 (Shadow)", -- [41]
				"一罗伊一 痛苦诅咒 (伤害/跳) 渣二哥-黑龙费尔默 Tick -135 (Shadow)", -- [42]
				"一罗伊一 腐蚀术 (伤害/跳) 渣二哥-黑龙费尔默 Tick -198 (Shadow)", -- [43]
				"渣二哥-黑龙费尔默 重伤 (伤害/跳) 一罗伊一 Tick -78 (Physical)", -- [44]
				"渣二哥-黑龙费尔默 撕裂 (伤害/跳) 一罗伊一 Tick -29 (Physical)", -- [45]
				"渣二哥-黑龙费尔默 撕裂 (伤害/跳) 一罗伊一 Tick -28 (Physical)", -- [46]
				"渣二哥-黑龙费尔默 撕裂 (伤害/跳) 一罗伊一 Tick -29 (Physical)", -- [47]
				"渣二哥-黑龙费尔默 撕裂 (伤害/跳) 一罗伊一 Tick -29 (Physical)", -- [48]
			},
			["Name"] = "一罗伊一",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				false, -- [11]
				false, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				false, -- [16]
				false, -- [17]
				false, -- [18]
				true, -- [19]
				true, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				true, -- [29]
				false, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
			},
			["LastEventTimes"] = {
				45465.393, -- [1]
				45467.393, -- [2]
				45467.91, -- [3]
				45498.844, -- [4]
				45509.012, -- [5]
				45510.178, -- [6]
				45547.914, -- [7]
				45552.014, -- [8]
				45552.714, -- [9]
				45553.181, -- [10]
				45554.697, -- [11]
				45555.031, -- [12]
				45556.231, -- [13]
				45560.048, -- [14]
				45562.965, -- [15]
				45563.048, -- [16]
				45591.2, -- [17]
				45602.767, -- [18]
				45605.317, -- [19]
				45607.95, -- [20]
				45611.967, -- [21]
				45612.467, -- [22]
				45614.467, -- [23]
				45614.984, -- [24]
				45616.468, -- [25]
				45617.968, -- [26]
				45618.468, -- [27]
				45619.368, -- [28]
				45622.201, -- [29]
				45632.885, -- [30]
				45633.468, -- [31]
				45635.452, -- [32]
				45635.885, -- [33]
				45637.469, -- [34]
				45638.885, -- [35]
				45639.469, -- [36]
				45641.469, -- [37]
				45641.885, -- [38]
				45643.469, -- [39]
				45644.886, -- [40]
				45645.469, -- [41]
				45647.469, -- [42]
				45647.886, -- [43]
				45704.256, -- [44]
				45705.439, -- [45]
				45708.439, -- [46]
				45711.439, -- [47]
				45714.456, -- [48]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["龍鳯大盗"] = {
									["count"] = 6,
								},
								["渣二哥-黑龙费尔默"] = {
									["count"] = 18,
								},
								["大叔不熬夜-黑龙费尔默"] = {
									["count"] = 3,
								},
								["指吻礼物馆"] = {
									["count"] = 6,
								},
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
								["Yang-逐风者"] = {
									["count"] = 12,
								},
							},
							["amount"] = 48,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["指吻礼物馆"] = {
									["count"] = 6,
								},
								["渣二哥-黑龙费尔默"] = {
									["count"] = 24,
								},
								["Yang-逐风者"] = {
									["count"] = 18,
								},
							},
							["amount"] = 48,
						},
					},
					["TimeSpent"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.58,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.08,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.609999999999999,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 9.24,
								},
							},
							["amount"] = 14.85,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.17,
								},
							},
							["amount"] = 2.67,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["暗影灼烧"] = {
									["count"] = 0.47,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2.2,
								},
							},
							["amount"] = 6,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 0.9,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.04,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.98,
								},
							},
							["amount"] = 11.92,
						},
					},
					["WhoHealed"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1245,
								},
							},
							["amount"] = 1245,
						},
					},
					["ElementDoneAbsorb"] = {
						["Shadow"] = 854,
					},
					["PartialResist"] = {
						["破胆怒吼"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["生命分流"] = {
							["Details"] = {
								["一罗伊一"] = {
									["count"] = 2721,
								},
							},
							["amount"] = 2721,
						},
					},
					["PartialAbsorb"] = {
						["破胆怒吼"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 43.02,
					["ElementTaken"] = {
						["Melee"] = 302,
						["Physical"] = 193,
					},
					["DOT_Time"] = 96,
					["Damage"] = 10827,
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
					},
					["WhoDamaged"] = {
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["撕裂 (伤害/跳)"] = {
									["count"] = 115,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 78,
								},
							},
							["amount"] = 193,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 302,
								},
							},
							["amount"] = 302,
						},
					},
					["Healing"] = 0,
					["DamageTaken"] = 495,
					["ElementHitsDone"] = {
						["Shadow"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 3,
								},
								["Tick"] = {
									["count"] = 30,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 39,
						},
					},
					["Attacks"] = {
						["死亡缠绕"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 594,
									["min"] = 594,
									["count"] = 1,
									["amount"] = 594,
								},
							},
							["count"] = 1,
							["amount"] = 594,
						},
						["暗影箭"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1991,
									["min"] = 1991,
									["count"] = 1,
									["amount"] = 1991,
								},
								["Hit"] = {
									["max"] = 1025,
									["min"] = 912,
									["count"] = 2,
									["amount"] = 1937,
								},
							},
							["count"] = 3,
							["amount"] = 3928,
						},
						["痛苦诅咒 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 77,
									["min"] = 77,
									["count"] = 1,
									["amount"] = 77,
								},
								["Tick"] = {
									["max"] = 135,
									["min"] = 78,
									["count"] = 15,
									["amount"] = 1536,
								},
							},
							["count"] = 16,
							["amount"] = 1613,
						},
						["腐蚀术 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 183,
									["min"] = 183,
									["count"] = 1,
									["amount"] = 183,
								},
								["Tick"] = {
									["max"] = 218,
									["min"] = 183,
									["count"] = 15,
									["amount"] = 3001,
								},
							},
							["count"] = 16,
							["amount"] = 3184,
						},
						["暗影灼烧"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Hit"] = {
									["max"] = 791,
									["min"] = 717,
									["count"] = 2,
									["amount"] = 1508,
								},
							},
							["count"] = 3,
							["amount"] = 1508,
						},
					},
					["HealingTaken"] = 1245,
					["DamagedWho"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 396,
								},
								["暗影箭"] = {
									["count"] = 912,
								},
							},
							["amount"] = 1308,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1192,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 880,
								},
							},
							["amount"] = 2072,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1991,
								},
							},
							["amount"] = 1991,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1025,
								},
							},
							["amount"] = 1025,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 717,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 199,
								},
							},
							["amount"] = 916,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 594,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 366,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 155,
								},
							},
							["amount"] = 1115,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 198,
								},
							},
							["amount"] = 198,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 791,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 833,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 578,
								},
							},
							["amount"] = 2202,
						},
					},
					["TimeDamage"] = 43.02,
					["TimeDamaging"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.58,
								},
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.08,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 5.609999999999999,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 9.24,
								},
							},
							["amount"] = 14.85,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["暗影箭"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 1.5,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.17,
								},
							},
							["amount"] = 2.67,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["死亡缠绕"] = {
									["count"] = 1.5,
								},
								["暗影灼烧"] = {
									["count"] = 0.47,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.83,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 2.2,
								},
							},
							["amount"] = 6,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["暗影灼烧"] = {
									["count"] = 0.9,
								},
								["腐蚀术 (伤害/跳)"] = {
									["count"] = 4.04,
								},
								["痛苦诅咒 (伤害/跳)"] = {
									["count"] = 6.98,
								},
							},
							["amount"] = 11.92,
						},
					},
					["ManaGain"] = 2721,
					["ManaGainedFrom"] = {
						["一罗伊一"] = {
							["Details"] = {
								["生命分流"] = {
									["count"] = 2721,
								},
							},
							["amount"] = 2721,
						},
					},
					["ElementDone"] = {
						["Shadow"] = 10827,
					},
				},
			},
			["UnitLockout"] = 45464.543,
			["LastActive"] = 45713.539,
		},
		["烬枫-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-0326525C",
			["LastEventHealth"] = {
				4001, -- [1]
				4001, -- [2]
				4001, -- [3]
				3515, -- [4]
				3515, -- [5]
				3201, -- [6]
				3201, -- [7]
				3271, -- [8]
				4001, -- [9]
				4001, -- [10]
				3690, -- [11]
				4001, -- [12]
				4001, -- [13]
				4001, -- [14]
				3974, -- [15]
				3974, -- [16]
				4001, -- [17]
				4001, -- [18]
				4001, -- [19]
				4001, -- [20]
				4001, -- [21]
				4001, -- [22]
				4001, -- [23]
				4001, -- [24]
				4001, -- [25]
				4001, -- [26]
				4001, -- [27]
				4001, -- [28]
				4001, -- [29]
				4001, -- [30]
				3608, -- [31]
				3608, -- [32]
				3608, -- [33]
				3608, -- [34]
				3608, -- [35]
				3608, -- [36]
				3608, -- [37]
				3608, -- [38]
				3608, -- [39]
				3608, -- [40]
				3608, -- [41]
				3608, -- [42]
				4001, -- [43]
				4001, -- [44]
				4001, -- [45]
				4001, -- [46]
				4001, -- [47]
				4001, -- [48]
				4001, -- [49]
				4001, -- [50]
			},
			["LastAttackedBy"] = "因纳夏克-黑龙费尔默",
			["LastEventType"] = {
				"MISC", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"MISC", -- [7]
				"HEAL", -- [8]
				"HEAL", -- [9]
				"HEAL", -- [10]
				"HEAL", -- [11]
				"HEAL", -- [12]
				"HEAL", -- [13]
				"DAMAGE", -- [14]
				"HEAL", -- [15]
				"DAMAGE", -- [16]
				"HEAL", -- [17]
				"HEAL", -- [18]
				"HEAL", -- [19]
				"HEAL", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"HEAL", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"DAMAGE", -- [39]
				"HEAL", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"MISC", -- [43]
				"HEAL", -- [44]
				"HEAL", -- [45]
				"HEAL", -- [46]
				"HEAL", -- [47]
				"HEAL", -- [48]
				"HEAL", -- [49]
				"HEAL", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					70.5, -- [1]
				},
				["Dispels"] = {
					16, -- [1]
				},
				["Healing"] = {
					29395, -- [1]
				},
				["DamageTaken"] = {
					1212, -- [1]
				},
				["HealingTaken"] = {
					979, -- [1]
				},
				["Overhealing"] = {
					2380, -- [1]
				},
				["ActiveTime"] = {
					89.14, -- [1]
				},
				["TimeDamage"] = {
					18.64, -- [1]
				},
				["ManaGain"] = {
					1680, -- [1]
				},
				["DOT_Time"] = {
					21, -- [1]
				},
				["Damage"] = {
					1598, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "旋风斩",
			["LastFightIn"] = 2,
			["type"] = "Grouped",
			["LastEventHealthMax"] = {
				4001, -- [1]
				4001, -- [2]
				4001, -- [3]
				4001, -- [4]
				4001, -- [5]
				4001, -- [6]
				4001, -- [7]
				4001, -- [8]
				4001, -- [9]
				4001, -- [10]
				4001, -- [11]
				4001, -- [12]
				4001, -- [13]
				4001, -- [14]
				4001, -- [15]
				4001, -- [16]
				4001, -- [17]
				4001, -- [18]
				4001, -- [19]
				4001, -- [20]
				4001, -- [21]
				4001, -- [22]
				4001, -- [23]
				4001, -- [24]
				4001, -- [25]
				4001, -- [26]
				4001, -- [27]
				4001, -- [28]
				4001, -- [29]
				4001, -- [30]
				4001, -- [31]
				4001, -- [32]
				4001, -- [33]
				4001, -- [34]
				4001, -- [35]
				4001, -- [36]
				4001, -- [37]
				4001, -- [38]
				4001, -- [39]
				4001, -- [40]
				4001, -- [41]
				4001, -- [42]
				4001, -- [43]
				4001, -- [44]
				4001, -- [45]
				4001, -- [46]
				4001, -- [47]
				4001, -- [48]
				4001, -- [49]
				4001, -- [50]
			},
			["LastHealTime"] = 45945.352,
			["LastDamageTaken"] = 393,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 45944.535,
				["Dispels"] = 45731.54,
				["Healing"] = 45944.535,
				["DamageTaken"] = 45930.534,
				["TimeDamage"] = 45938.535,
				["HealingTaken"] = 45885.532,
				["Overhealing"] = 45896.533,
				["ActiveTime"] = 45944.535,
				["OVERALL"] = 45944.535,
				["ManaGain"] = 45916.534,
				["DOT_Time"] = 45938.535,
				["Damage"] = 45938.535,
			},
			["NextEventNum"] = 43,
			["LastDamageTime"] = 45939.168,
			["LastEvents"] = {
				"烬枫-火妖鲁西弗隆 dispels 蓝斯洛-火妖鲁西弗隆 变形术 (清洁术)", -- [1]
				"烬枫-火妖鲁西弗隆 正义审判 薯片儿-逐风者 Hit -203 (Holy)", -- [2]
				"薯片儿-逐风者 肉搏 烬枫-火妖鲁西弗隆 Crit -486 (Physical)", -- [3]
				"烬枫-火妖鲁西弗隆 肉搏 薯片儿-逐风者 Hit -133 (Physical)", -- [4]
				"薯片儿-逐风者 断筋 烬枫-火妖鲁西弗隆 Hit -26 (Physical)", -- [5]
				"烬枫-火妖鲁西弗隆 制裁之锤 渣二哥-黑龙费尔默 Resist (Holy)", -- [6]
				"烬枫-火妖鲁西弗隆 dispels 冬雷 暗言术：痛 (清洁术)", -- [7]
				"烬枫-火妖鲁西弗隆 圣光闪现 冬雷 Hit +688", -- [8]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Hit +646", -- [9]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Crit +969 (388 过量治疗)", -- [10]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 烬枫-火妖鲁西弗隆 Hit +558 (247 过量治疗)", -- [11]
				"烬枫-火妖鲁西弗隆 圣光闪现 原味小汤圆 Hit +662", -- [12]
				"烬枫-火妖鲁西弗隆 圣光闪现 原味小汤圆 Hit +649", -- [13]
				"法神飞舞醉酒-逐风者 冰霜新星 烬枫-火妖鲁西弗隆 Hit -27 (Frost)", -- [14]
				"烬枫-火妖鲁西弗隆 圣光闪现 原味小汤圆 Crit +1004 (201 过量治疗)", -- [15]
				"法神飞舞醉酒-逐风者 铁皮手雷 烬枫-火妖鲁西弗隆 Hit -173 (Fire)", -- [16]
				"烬枫-火妖鲁西弗隆 圣光闪现 蓝斯洛-火妖鲁西弗隆 Hit +691", -- [17]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Hit +649", -- [18]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Crit +981", -- [19]
				"烬枫-火妖鲁西弗隆 圣光闪现 蓝斯洛-火妖鲁西弗隆 Hit +651", -- [20]
				"烬枫-火妖鲁西弗隆 正义审判 因纳夏克-黑龙费尔默 Hit -223 (Holy)", -- [21]
				"烬枫-火妖鲁西弗隆 肉搏 因纳夏克-黑龙费尔默 Hit -119 (Physical)", -- [22]
				"烬枫-火妖鲁西弗隆 肉搏 因纳夏克-黑龙费尔默 Hit -112 (Physical)", -- [23]
				"烬枫-火妖鲁西弗隆 正义圣印 因纳夏克-黑龙费尔默 Hit -50 (Holy)", -- [24]
				"因纳夏克-黑龙费尔默 战争践踏 烬枫-火妖鲁西弗隆 Resist (Physical)", -- [25]
				"烬枫-火妖鲁西弗隆 肉搏 因纳夏克-黑龙费尔默 Crit -219 (Physical)", -- [26]
				"烬枫-火妖鲁西弗隆 正义圣印 因纳夏克-黑龙费尔默 Hit -50 (Holy)", -- [27]
				"烬枫-火妖鲁西弗隆 肉搏 因纳夏克-黑龙费尔默 Hit -80 (Physical)", -- [28]
				"烬枫-火妖鲁西弗隆 正义圣印 因纳夏克-黑龙费尔默 Hit -50 (Holy)", -- [29]
				"因纳夏克-黑龙费尔默 旋风斩 烬枫-火妖鲁西弗隆 Hit -393 (Physical)", -- [30]
				"烬枫-火妖鲁西弗隆 奉献 Yang-逐风者 Resist (Holy)", -- [31]
				"烬枫-火妖鲁西弗隆 奉献 (伤害/跳) Yang-逐风者 Tick -50 (Holy)", -- [32]
				"烬枫-火妖鲁西弗隆 奉献 (伤害/跳) 因纳夏克-黑龙费尔默 Tick -56 (Holy)", -- [33]
				"烬枫-火妖鲁西弗隆 奉献 (伤害/跳) Yang-逐风者 Tick -50 (Holy)", -- [34]
				"烬枫-火妖鲁西弗隆 奉献 (伤害/跳) Yang-逐风者 Tick -50 (Holy)", -- [35]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Hit +335", -- [36]
				"烬枫-火妖鲁西弗隆 奉献 (伤害/跳) Yang-逐风者 Tick -51 (Holy)", -- [37]
				"烬枫-火妖鲁西弗隆 奉献 (伤害/跳) Yang-逐风者 Tick -51 (Holy)", -- [38]
				"烬枫-火妖鲁西弗隆 奉献 (伤害/跳) Yang-逐风者 Tick -51 (Holy)", -- [39]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Hit +329", -- [40]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Hit +328", -- [41]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Hit +324", -- [42]
				"烬枫-火妖鲁西弗隆 dispels 特变电工 冰锥术 (清洁术)", -- [43]
				"烬枫-火妖鲁西弗隆 圣光闪现 蓝斯洛-火妖鲁西弗隆 Hit +680", -- [44]
				"烬枫-火妖鲁西弗隆 圣光闪现 蓝斯洛-火妖鲁西弗隆 Hit +659", -- [45]
				"烬枫-火妖鲁西弗隆 圣光闪现 Romanx Hit +336", -- [46]
				"烬枫-火妖鲁西弗隆 圣光闪现 Romanx Hit +335", -- [47]
				"烬枫-火妖鲁西弗隆 圣光闪现 Romanx Crit +508", -- [48]
				"烬枫-火妖鲁西弗隆 圣光术 Romanx Hit +1876", -- [49]
				"烬枫-火妖鲁西弗隆 圣光闪现 特变电工 Crit +1019", -- [50]
			},
			["Name"] = "烬枫-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				false, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				false, -- [17]
				false, -- [18]
				false, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				true, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				true, -- [30]
				false, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				false, -- [38]
				false, -- [39]
				false, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				false, -- [45]
				false, -- [46]
				false, -- [47]
				false, -- [48]
				false, -- [49]
				false, -- [50]
			},
			["LastEventTimes"] = {
				45698.255, -- [1]
				45703.889, -- [2]
				45704.878, -- [3]
				45705.906, -- [4]
				45706.739, -- [5]
				45728.807, -- [6]
				45732.474, -- [7]
				45737.974, -- [8]
				45787.943, -- [9]
				45821.595, -- [10]
				45886.282, -- [11]
				45893.382, -- [12]
				45895.066, -- [13]
				45896.116, -- [14]
				45896.93300000001, -- [15]
				45899.161, -- [16]
				45905.716, -- [17]
				45907.217, -- [18]
				45916.517, -- [19]
				45920.418, -- [20]
				45922.534, -- [21]
				45922.817, -- [22]
				45925.218, -- [23]
				45925.251, -- [24]
				45927.534, -- [25]
				45927.618, -- [26]
				45927.651, -- [27]
				45930.034, -- [28]
				45930.051, -- [29]
				45930.851, -- [30]
				45931.334, -- [31]
				45932.334, -- [32]
				45932.334, -- [33]
				45933.335, -- [34]
				45934.335, -- [35]
				45936.901, -- [36]
				45937.168, -- [37]
				45938.168, -- [38]
				45939.168, -- [39]
				45940.668, -- [40]
				45942.702, -- [41]
				45945.352, -- [42]
				45679.538, -- [43]
				45683.221, -- [44]
				45686.955, -- [45]
				45688.721, -- [46]
				45690.338, -- [47]
				45691.888, -- [48]
				45694.372, -- [49]
				45697.622, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["原味小汤圆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 31.5,
								},
							},
							["amount"] = 31.5,
						},
						["Romanx"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 15,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["冬雷"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["风之利箭"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["拦截憨憨"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["OverHeals"] = {
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 568,
									["min"] = 100,
									["count"] = 4,
									["amount"] = 1257,
								},
								["Hit"] = {
									["max"] = 649,
									["min"] = 474,
									["count"] = 2,
									["amount"] = 1123,
								},
							},
							["count"] = 6,
							["amount"] = 2380,
						},
					},
					["DOTs"] = {
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["因纳夏克-黑龙费尔默"] = {
									["count"] = 3,
								},
								["Yang-逐风者"] = {
									["count"] = 18,
								},
							},
							["amount"] = 21,
						},
					},
					["ElementDone"] = {
						["Melee"] = 663,
						["Holy"] = 935,
					},
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 31.5,
								},
							},
							["amount"] = 31.5,
						},
						["风之利箭"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 6.5,
								},
								["奉献"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 7.78,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["正义圣印"] = {
									["count"] = 0.08,
								},
								["正义审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.78,
								},
							},
							["amount"] = 6.36,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["正义审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["Romanx"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 13.5,
								},
							},
							["amount"] = 15,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["冬雷"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
						["拦截憨憨"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["原味小汤圆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 6,
						},
					},
					["DamageTaken"] = 1212,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 5,
						},
						["Holy"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 7,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 14,
						},
					},
					["PartialResist"] = {
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["ManaGained"] = {
						["启发"] = {
							["Details"] = {
								["烬枫-火妖鲁西弗隆"] = {
									["count"] = 1680,
								},
							},
							["amount"] = 1680,
						},
					},
					["PartialAbsorb"] = {
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["战争践踏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 89.14,
					["DamagedWho"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["正义审判"] = {
									["count"] = 203,
								},
								["肉搏"] = {
									["count"] = 133,
								},
							},
							["amount"] = 336,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 56,
								},
								["正义圣印"] = {
									["count"] = 150,
								},
								["正义审判"] = {
									["count"] = 223,
								},
								["肉搏"] = {
									["count"] = 530,
								},
							},
							["amount"] = 959,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 303,
								},
							},
							["amount"] = 303,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 173,
						["Physical"] = 526,
						["Melee"] = 486,
						["Frost"] = 27,
					},
					["DOT_Time"] = 21,
					["Damage"] = 1598,
					["Overhealing"] = 2380,
					["Heals"] = {
						["圣光术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1876,
									["min"] = 1876,
									["count"] = 1,
									["amount"] = 1876,
								},
							},
							["count"] = 1,
							["amount"] = 1876,
						},
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1032,
									["min"] = 448,
									["count"] = 12,
									["amount"] = 9287,
								},
								["Hit"] = {
									["max"] = 692,
									["min"] = 192,
									["count"] = 34,
									["amount"] = 18232,
								},
							},
							["count"] = 46,
							["amount"] = 27519,
						},
					},
					["TimeDamaging"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["正义审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["正义圣印"] = {
									["count"] = 0.08,
								},
								["正义审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 4.78,
								},
							},
							["amount"] = 6.36,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["制裁之锤"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 6.5,
								},
								["奉献"] = {
									["count"] = 1.28,
								},
							},
							["amount"] = 7.78,
						},
					},
					["Dispels"] = 16,
					["TimeHeal"] = 70.5,
					["Healing"] = 29395,
					["ElementHitsTaken"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4,
						},
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["WhoHealed"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 668,
								},
							},
							["amount"] = 668,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 311,
								},
							},
							["amount"] = 311,
						},
					},
					["Attacks"] = {
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 56,
									["min"] = 50,
									["count"] = 7,
									["amount"] = 359,
								},
							},
							["count"] = 7,
							["amount"] = 359,
						},
						["奉献"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["制裁之锤"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["正义圣印"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 50,
									["min"] = 50,
									["count"] = 3,
									["amount"] = 150,
								},
							},
							["count"] = 3,
							["amount"] = 150,
						},
						["正义审判"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 223,
									["min"] = 203,
									["count"] = 2,
									["amount"] = 426,
								},
							},
							["count"] = 2,
							["amount"] = 426,
						},
						["肉搏"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 219,
									["min"] = 219,
									["count"] = 1,
									["amount"] = 219,
								},
								["Hit"] = {
									["max"] = 133,
									["min"] = 80,
									["count"] = 4,
									["amount"] = 444,
								},
							},
							["count"] = 5,
							["amount"] = 663,
						},
					},
					["HealingTaken"] = 979,
					["ManaGainedFrom"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["启发"] = {
									["count"] = 1680,
								},
							},
							["amount"] = 1680,
						},
					},
					["TimeDamage"] = 18.64,
					["WhoDamaged"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 393,
								},
							},
							["amount"] = 393,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["铁皮手雷"] = {
									["count"] = 173,
								},
								["冰霜新星"] = {
									["count"] = 27,
								},
							},
							["amount"] = 200,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 26,
								},
								["肉搏"] = {
									["count"] = 486,
								},
							},
							["amount"] = 512,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 107,
								},
							},
							["amount"] = 107,
						},
					},
					["ManaGain"] = 1680,
					["HealedWho"] = {
						["原味小汤圆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2306,
								},
							},
							["amount"] = 2306,
						},
						["特变电工"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 13980,
								},
							},
							["amount"] = 13980,
						},
						["Romanx"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1876,
								},
								["圣光闪现"] = {
									["count"] = 3819,
								},
							},
							["amount"] = 5695,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2681,
								},
							},
							["amount"] = 2681,
						},
						["冬雷"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 688,
								},
							},
							["amount"] = 688,
						},
						["风之利箭"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2126,
								},
							},
							["amount"] = 2126,
						},
						["拦截憨憨"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1251,
								},
							},
							["amount"] = 1251,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 668,
								},
							},
							["amount"] = 668,
						},
					},
					["DispelledWho"] = {
						["特变电工"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["暗影易伤 (清洁术)"] = {
									["count"] = 2,
								},
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
								["冰锥术 (清洁术)"] = {
									["count"] = 1,
								},
								["冰霜新星 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 7,
						},
						["Romanx"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["冰冻 (清洁术)"] = {
									["count"] = 2,
								},
								["噬灵瘟疫 (清洁术)"] = {
									["count"] = 1,
								},
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
								["寒冰箭 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
						["冬雷"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["拦截憨憨"] = {
							["Details"] = {
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
				},
			},
			["UnitLockout"] = 45436.541,
			["LastActive"] = 45944.535,
		},
		["卡鲁西"] = {
			["GUID"] = "Player-5458-037D1AFF",
			["LastEventHealth"] = {
				1907, -- [1]
				1737, -- [2]
				1542, -- [3]
				1542, -- [4]
				1446, -- [5]
				392, -- [6]
				213, -- [7]
				213, -- [8]
				213, -- [9]
				121, -- [10]
				0, -- [11]
			},
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"MISC", -- [11]
			},
			["TimeWindows"] = {
				["EnergyGain"] = {
					25, -- [1]
				},
				["DeathCount"] = {
					1, -- [1]
				},
				["ActiveTime"] = {
					3.08, -- [1]
				},
				["TimeDamage"] = {
					3.08, -- [1]
				},
				["DamageTaken"] = {
					1593, -- [1]
				},
				["Damage"] = {
					1512, -- [1]
				},
			},
			["enClass"] = "ROGUE",
			["unit"] = "卡鲁西",
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						false, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						true, -- [9]
						true, -- [10]
						true, -- [11]
					},
					["Messages"] = {
						"清风徐自来-火妖鲁西弗隆 铁皮手雷 卡鲁西 Hit -170 (Fire)", -- [1]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 卡鲁西 Tick -195 (Shadow)", -- [2]
						"卡鲁西 邪恶攻击 清风徐自来-火妖鲁西弗隆 Hit -235 (Physical)", -- [3]
						"清风徐自来-火妖鲁西弗隆 虚弱之触 卡鲁西 Hit -96 (Shadow)", -- [4]
						"清风徐自来-火妖鲁西弗隆 心灵震爆 卡鲁西 Hit -677 (Shadow)", -- [5]
						"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 卡鲁西 Tick -179 (Shadow)", -- [6]
						"卡鲁西 肉搏 清风徐自来-火妖鲁西弗隆 Hit -190 (Physical)", -- [7]
						"卡鲁西 刺骨 清风徐自来-火妖鲁西弗隆 Crit -1087 (Physical)", -- [8]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 卡鲁西 Tick -92 (92 被抵抗) (Shadow)", -- [9]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 卡鲁西 Tick -184 (Shadow)", -- [10]
						"卡鲁西死亡。", -- [11]
					},
					["DeathAt"] = 45991.538,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
					},
					["MessageTimes"] = {
						-14.5679999999993, -- [1]
						-13.80099999999948, -- [2]
						-12.30099999999948, -- [3]
						-12.28399999999965, -- [4]
						-12.21800000000076, -- [5]
						-3.851000000002387, -- [6]
						-3.601000000002387, -- [7]
						-3.516999999999825, -- [8]
						-3.016999999999825, -- [9]
						0, -- [10]
						0, -- [11]
					},
					["HealthMax"] = {
						3703, -- [1]
						3703, -- [2]
						3703, -- [3]
						3703, -- [4]
						3703, -- [5]
						3703, -- [6]
						3703, -- [7]
						3703, -- [8]
						3703, -- [9]
						3703, -- [10]
						3703, -- [11]
					},
					["Health"] = {
						1907, -- [1]
						1737, -- [2]
						1542, -- [3]
						1542, -- [4]
						1446, -- [5]
						392, -- [6]
						213, -- [7]
						213, -- [8]
						213, -- [9]
						121, -- [10]
						0, -- [11]
					},
					["KilledBy"] = "清风徐自来-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"MISC", -- [11]
					},
				}, -- [1]
			},
			["level"] = 60,
			["LastDamageAbility"] = "暗言术：痛 (伤害/跳)",
			["LastFightIn"] = 3,
			["type"] = "Ungrouped",
			["LastEventHealthMax"] = {
				3703, -- [1]
				3703, -- [2]
				3703, -- [3]
				3703, -- [4]
				3703, -- [5]
				3703, -- [6]
				3703, -- [7]
				3703, -- [8]
				3703, -- [9]
				3703, -- [10]
				3703, -- [11]
			},
			["LastDamageTaken"] = 184,
			["Owner"] = false,
			["TimeLast"] = {
				["EnergyGain"] = 45986.537,
				["DeathCount"] = 45989.538,
				["ActiveTime"] = 45986.537,
				["TimeDamage"] = 45986.537,
				["OVERALL"] = 45989.538,
				["DamageTaken"] = 45989.538,
				["Damage"] = 45986.537,
			},
			["NextEventNum"] = 12,
			["LastDamageTime"] = 45986.921,
			["LastEvents"] = {
				"清风徐自来-火妖鲁西弗隆 铁皮手雷 卡鲁西 Hit -170 (Fire)", -- [1]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 卡鲁西 Tick -195 (Shadow)", -- [2]
				"卡鲁西 邪恶攻击 清风徐自来-火妖鲁西弗隆 Hit -235 (Physical)", -- [3]
				"清风徐自来-火妖鲁西弗隆 虚弱之触 卡鲁西 Hit -96 (Shadow)", -- [4]
				"清风徐自来-火妖鲁西弗隆 心灵震爆 卡鲁西 Hit -677 (Shadow)", -- [5]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 卡鲁西 Tick -179 (Shadow)", -- [6]
				"卡鲁西 肉搏 清风徐自来-火妖鲁西弗隆 Hit -190 (Physical)", -- [7]
				"卡鲁西 刺骨 清风徐自来-火妖鲁西弗隆 Crit -1087 (Physical)", -- [8]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 卡鲁西 Tick -92 (92 被抵抗) (Shadow)", -- [9]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 卡鲁西 Tick -184 (Shadow)", -- [10]
				"卡鲁西死亡。", -- [11]
			},
			["Name"] = "卡鲁西",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				false, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
			},
			["LastEventTimes"] = {
				45975.87, -- [1]
				45976.637, -- [2]
				45978.137, -- [3]
				45978.154, -- [4]
				45978.22, -- [5]
				45986.587, -- [6]
				45986.837, -- [7]
				45986.921, -- [8]
				45987.421, -- [9]
				45990.438, -- [10]
				45990.438, -- [11]
			},
			["Fights"] = {
				["LastFightData"] = {
					["TimeSpent"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.08,
						},
					},
					["DamageTaken"] = 1593,
					["ElementTakenResist"] = {
						["Shadow"] = 92,
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 92,
							["amount"] = 3,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 3.08,
					["ElementTaken"] = {
						["Shadow"] = 1423,
						["Fire"] = 170,
					},
					["Damage"] = 1512,
					["EnergyGained"] = {
						["无情打击效果"] = {
							["Details"] = {
								["卡鲁西"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["ElementDone"] = {
						["Melee"] = 190,
						["Physical"] = 1322,
					},
					["EnergyGain"] = 25,
					["Attacks"] = {
						["刺骨"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1087,
									["min"] = 1087,
									["count"] = 1,
									["amount"] = 1087,
								},
							},
							["count"] = 1,
							["amount"] = 1087,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 190,
									["min"] = 190,
									["count"] = 1,
									["amount"] = 190,
								},
							},
							["count"] = 1,
							["amount"] = 190,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 235,
									["min"] = 235,
									["count"] = 1,
									["amount"] = 235,
								},
							},
							["count"] = 1,
							["amount"] = 235,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DamagedWho"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 1087,
								},
								["肉搏"] = {
									["count"] = 190,
								},
								["邪恶攻击"] = {
									["count"] = 235,
								},
							},
							["amount"] = 1512,
						},
					},
					["TimeDamage"] = 3.08,
					["WhoDamaged"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 471,
								},
								["心灵震爆"] = {
									["count"] = 677,
								},
								["虚弱之触"] = {
									["count"] = 96,
								},
								["铁皮手雷"] = {
									["count"] = 170,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 179,
								},
							},
							["amount"] = 1593,
						},
					},
					["EnergyGainedFrom"] = {
						["卡鲁西"] = {
							["Details"] = {
								["无情打击效果"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamaging"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.08,
						},
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeSpent"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.08,
						},
					},
					["DamageTaken"] = 1593,
					["ElementTakenResist"] = {
						["Shadow"] = 92,
					},
					["PartialResist"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["50% 抵抗"] = {
									["max"] = 92,
									["min"] = 92,
									["count"] = 1,
									["amount"] = 92,
								},
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 92,
							["amount"] = 3,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["DeathCount"] = 1,
					["PartialAbsorb"] = {
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["虚弱之触"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 3.08,
					["ElementTaken"] = {
						["Shadow"] = 1423,
						["Fire"] = 170,
					},
					["Damage"] = 1512,
					["EnergyGained"] = {
						["无情打击效果"] = {
							["Details"] = {
								["卡鲁西"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["ElementDone"] = {
						["Melee"] = 190,
						["Physical"] = 1322,
					},
					["EnergyGain"] = 25,
					["Attacks"] = {
						["刺骨"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1087,
									["min"] = 1087,
									["count"] = 1,
									["amount"] = 1087,
								},
							},
							["count"] = 1,
							["amount"] = 1087,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 190,
									["min"] = 190,
									["count"] = 1,
									["amount"] = 190,
								},
							},
							["count"] = 1,
							["amount"] = 190,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 235,
									["min"] = 235,
									["count"] = 1,
									["amount"] = 235,
								},
							},
							["count"] = 1,
							["amount"] = 235,
						},
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["DamagedWho"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 1087,
								},
								["肉搏"] = {
									["count"] = 190,
								},
								["邪恶攻击"] = {
									["count"] = 235,
								},
							},
							["amount"] = 1512,
						},
					},
					["TimeDamage"] = 3.08,
					["WhoDamaged"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 471,
								},
								["心灵震爆"] = {
									["count"] = 677,
								},
								["虚弱之触"] = {
									["count"] = 96,
								},
								["铁皮手雷"] = {
									["count"] = 170,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 179,
								},
							},
							["amount"] = 1593,
						},
					},
					["EnergyGainedFrom"] = {
						["卡鲁西"] = {
							["Details"] = {
								["无情打击效果"] = {
									["count"] = 25,
								},
							},
							["amount"] = 25,
						},
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 4,
								},
							},
							["amount"] = 6,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamaging"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["刺骨"] = {
									["count"] = 0.08,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
								["邪恶攻击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.08,
						},
					},
				},
			},
			["UnitLockout"] = 45975.537,
			["LastActive"] = 45989.538,
		},
		["Romanx"] = {
			["DeathLogs"] = {
				{
					["MessageIncoming"] = {
						true, -- [1]
						false, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
						false, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
					},
					["Messages"] = {
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -214 (Shadow)", -- [1]
						"Romanx 重伤 (伤害/跳) Yang-逐风者 Tick -95 (Physical)", -- [2]
						"蓝斯洛-火妖鲁西弗隆 圣光术 Romanx Crit +1183", -- [3]
						"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -122 (Physical)", -- [4]
						"Yang-逐风者 肉搏 Romanx Hit -262 (Physical)", -- [5]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -213 (Shadow)", -- [6]
						"Romanx 断筋 Yang-逐风者 Crit -73 (Physical)", -- [7]
						"Romanx 肉搏 Yang-逐风者 Crit -883 (Physical)", -- [8]
						"Romanx 斩杀 Yang-逐风者 Hit -1367 (Physical)", -- [9]
						"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -121 (Physical)", -- [10]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -202 (Shadow)", -- [11]
						"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -110 (Physical)", -- [12]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -184 (Shadow)", -- [13]
						"法神飞舞醉酒-逐风者 冲击波 Romanx Hit -543 (Fire)", -- [14]
						"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -110 (Physical)", -- [15]
						"法神飞舞醉酒-逐风者 魔爆术 Romanx Hit -321 (Arcane)", -- [16]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -202 (Shadow)", -- [17]
						"清风徐自来-火妖鲁西弗隆 肉搏 Romanx Miss (1)", -- [18]
						"指吻礼物馆 冰冻 Romanx Immune (Frost)", -- [19]
						"Romanx 致死打击 指吻礼物馆 Hit -635 (Physical)", -- [20]
						"法神飞舞醉酒-逐风者 魔爆术 Romanx Hit -327 (Arcane)", -- [21]
						"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) Romanx Tick -203 (Shadow)", -- [22]
						"Romanx死亡。", -- [23]
					},
					["DeathAt"] = 45882.532,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
					},
					["MessageTimes"] = {
						-14.33400000000256, -- [1]
						-13.78399999999965, -- [2]
						-12.98300000000018, -- [3]
						-12.08400000000256, -- [4]
						-11.40000000000146, -- [5]
						-11.34999999999855, -- [6]
						-11.08400000000256, -- [7]
						-11.05000000000291, -- [8]
						-9.567000000002736, -- [9]
						-9.084000000002561, -- [10]
						-8.349999999998545, -- [11]
						-6.082999999998719, -- [12]
						-5.349999999998545, -- [13]
						-4.26600000000326, -- [14]
						-3.082999999998719, -- [15]
						-2.75, -- [16]
						-2.349999999998545, -- [17]
						-1.483000000000175, -- [18]
						-1.30000000000291, -- [19]
						-1.30000000000291, -- [20]
						-1.26600000000326, -- [21]
						-0.03300000000308501, -- [22]
						0, -- [23]
					},
					["HealthMax"] = {
						6714, -- [1]
						6714, -- [2]
						6714, -- [3]
						6714, -- [4]
						6714, -- [5]
						6714, -- [6]
						6714, -- [7]
						6714, -- [8]
						6714, -- [9]
						6714, -- [10]
						6714, -- [11]
						6714, -- [12]
						6714, -- [13]
						6714, -- [14]
						6714, -- [15]
						6714, -- [16]
						6714, -- [17]
						6714, -- [18]
						6714, -- [19]
						6714, -- [20]
						6714, -- [21]
						6714, -- [22]
						5839, -- [23]
					},
					["Health"] = {
						1922, -- [1]
						1708, -- [2]
						1708, -- [3]
						2891, -- [4]
						2769, -- [5]
						2507, -- [6]
						2294, -- [7]
						2294, -- [8]
						2294, -- [9]
						2294, -- [10]
						2173, -- [11]
						1971, -- [12]
						1861, -- [13]
						1677, -- [14]
						1134, -- [15]
						1024, -- [16]
						703, -- [17]
						501, -- [18]
						501, -- [19]
						501, -- [20]
						501, -- [21]
						174, -- [22]
						0, -- [23]
					},
					["KilledBy"] = "清风徐自来-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"HEAL", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"DAMAGE", -- [22]
						"MISC", -- [23]
					},
				}, -- [1]
				{
					["MessageIncoming"] = {
						false, -- [1]
						false, -- [2]
						true, -- [3]
						false, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						true, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						false, -- [15]
						false, -- [16]
						true, -- [17]
						true, -- [18]
						true, -- [19]
					},
					["Messages"] = {
						"Romanx 断筋 法神飞舞醉酒-逐风者 Crit -82 (Physical)", -- [1]
						"Romanx 肉搏 法神飞舞醉酒-逐风者 Hit -457 (Physical)", -- [2]
						"法神飞舞醉酒-逐风者 冰锥术 Romanx Crit -824 (Frost)", -- [3]
						"Romanx 重伤 (伤害/跳) 法神飞舞醉酒-逐风者 Tick -88 (Physical)", -- [4]
						"薯片儿-逐风者 肉搏 Romanx Hit -271 (Physical)", -- [5]
						"法神飞舞醉酒-逐风者 冲击波 Romanx Hit -628 (Fire)", -- [6]
						"Romanx 致死打击 法神飞舞醉酒-逐风者 Hit -677 (Physical)", -- [7]
						"法神飞舞醉酒-逐风者 冰霜新星 Romanx Hit -31 (Frost)", -- [8]
						"Romanx 重伤 (伤害/跳) 法神飞舞醉酒-逐风者 Tick -89 (Physical)", -- [9]
						"法神飞舞醉酒-逐风者 冰锥术 Romanx Crit -830 (Frost)", -- [10]
						"薯片儿-逐风者 肉搏 Romanx Hit -277 (Physical)", -- [11]
						"薯片儿-逐风者 旋风斩 Romanx Hit -258 (Physical)", -- [12]
						"蓝斯洛-火妖鲁西弗隆 圣光闪现 Romanx Crit +792", -- [13]
						"指吻礼物馆 火焰冲击 Romanx Hit -806 (Fire)", -- [14]
						"Romanx 断筋 薯片儿-逐风者 Hit -35 (Physical)", -- [15]
						"Romanx 肉搏 薯片儿-逐风者 Hit -490 (Physical)", -- [16]
						"薯片儿-逐风者 肉搏 Romanx Hit -266 (Physical)", -- [17]
						"指吻礼物馆 寒冰箭 Romanx Hit -1186 (Frost)", -- [18]
						"Romanx死亡。", -- [19]
					},
					["DeathAt"] = 45603.533,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
					},
					["MessageTimes"] = {
						-13.26599999999598, -- [1]
						-13.21600000000035, -- [2]
						-11.86599999999453, -- [3]
						-10.23199999999633, -- [4]
						-9.448999999993248, -- [5]
						-9.415999999997439, -- [6]
						-8.531999999999243, -- [7]
						-7.915999999997439, -- [8]
						-7.231999999996333, -- [9]
						-6.315999999998894, -- [10]
						-4.115999999994529, -- [11]
						-3.748999999996158, -- [12]
						-1.764999999999418, -- [13]
						-0.6819999999934225, -- [14]
						-0.6649999999935972, -- [15]
						-0.5489999999990687, -- [16]
						-0.297999999995227, -- [17]
						-0.04899999999906868, -- [18]
						0, -- [19]
					},
					["HealthMax"] = {
						5839, -- [1]
						5839, -- [2]
						5839, -- [3]
						5839, -- [4]
						5839, -- [5]
						5839, -- [6]
						5839, -- [7]
						5839, -- [8]
						5839, -- [9]
						5839, -- [10]
						5839, -- [11]
						5839, -- [12]
						5839, -- [13]
						5839, -- [14]
						5839, -- [15]
						5839, -- [16]
						5839, -- [17]
						5839, -- [18]
						5839, -- [19]
					},
					["Health"] = {
						4536, -- [1]
						4536, -- [2]
						4536, -- [3]
						3712, -- [4]
						3712, -- [5]
						3441, -- [6]
						2813, -- [7]
						2813, -- [8]
						2782, -- [9]
						2782, -- [10]
						1952, -- [11]
						1675, -- [12]
						1417, -- [13]
						2209, -- [14]
						1403, -- [15]
						1403, -- [16]
						1403, -- [17]
						1137, -- [18]
						0, -- [19]
					},
					["KilledBy"] = "指吻礼物馆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"DAMAGE", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"HEAL", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"DAMAGE", -- [17]
						"DAMAGE", -- [18]
						"MISC", -- [19]
					},
				}, -- [2]
				{
					["MessageIncoming"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						true, -- [6]
						false, -- [7]
						false, -- [8]
						false, -- [9]
						true, -- [10]
						true, -- [11]
						true, -- [12]
						true, -- [13]
						true, -- [14]
						true, -- [15]
						true, -- [16]
						true, -- [17]
						true, -- [18]
						false, -- [19]
						true, -- [20]
						true, -- [21]
						true, -- [22]
						true, -- [23]
						true, -- [24]
						false, -- [25]
						true, -- [26]
						false, -- [27]
						true, -- [28]
						true, -- [29]
						true, -- [30]
						true, -- [31]
						true, -- [32]
						true, -- [33]
						false, -- [34]
						true, -- [35]
						true, -- [36]
						false, -- [37]
						true, -- [38]
						true, -- [39]
						false, -- [40]
						true, -- [41]
						true, -- [42]
					},
					["Messages"] = {
						"法神飞舞醉酒-逐风者 冲击波 Romanx Hit -777 (Fire)", -- [1]
						"清风徐自来-火妖鲁西弗隆 dispels Romanx 自由祝福 (驱散魔法)", -- [2]
						"指吻礼物馆 火焰冲击 Romanx Hit -756 (Fire)", -- [3]
						"渣二哥-黑龙费尔默 冲锋击昏 Romanx Resist (Physical)", -- [4]
						"渣二哥-黑龙费尔默 断筋 Romanx Parry (Physical)", -- [5]
						"渣二哥-黑龙费尔默 肉搏 Romanx Dodge (1)", -- [6]
						"Romanx 旋风斩 法神飞舞醉酒-逐风者 Hit -678 (Physical)", -- [7]
						"Romanx 旋风斩 渣二哥-黑龙费尔默 Hit -392 (Physical)", -- [8]
						"Romanx 旋风斩 (剑类武器专精) 法神飞舞醉酒-逐风者 Crit -1465 (Physical)", -- [9]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -204 (Shadow)", -- [10]
						"法神飞舞醉酒-逐风者 冰锥术 Romanx Hit -634 (Frost)", -- [11]
						"指吻礼物馆 冰锥术 Romanx Hit -641 (Frost)", -- [12]
						"清风徐自来-火妖鲁西弗隆 心灵震爆 Romanx Hit -688 (Shadow)", -- [13]
						"渣二哥-黑龙费尔默 压制 Romanx Hit -260 (Physical)", -- [14]
						"指吻礼物馆 冰霜新星 Romanx Hit -104 (Frost)", -- [15]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -216 (Shadow)", -- [16]
						"烬枫-火妖鲁西弗隆 圣光闪现 Romanx Hit +646", -- [17]
						"渣二哥-黑龙费尔默 肉搏 Romanx Hit -315 (Physical)", -- [18]
						"Romanx 致死打击 渣二哥-黑龙费尔默 Hit -573 (Physical)", -- [19]
						"指吻礼物馆 魔爆术 Romanx Hit -357 (Arcane)", -- [20]
						"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) Romanx Tick -212 (Shadow)", -- [21]
						"蓝斯洛-火妖鲁西弗隆 圣光闪现 Romanx Crit +829", -- [22]
						"Romanx 生命赐福 Romanx Hit +1007", -- [23]
						"渣二哥-黑龙费尔默 致死打击 Romanx Hit -465 (Physical)", -- [24]
						"Romanx 肉搏 渣二哥-黑龙费尔默 Crit -951 (Physical)", -- [25]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -217 (Shadow)", -- [26]
						"Romanx 断筋 渣二哥-黑龙费尔默 Dodge (Physical)", -- [27]
						"指吻礼物馆 魔爆术 Romanx Hit -359 (Arcane)", -- [28]
						"渣二哥-黑龙费尔默 英勇打击 Romanx Crit -982 (Physical)", -- [29]
						"渣二哥-黑龙费尔默 断筋 Romanx Hit -33 (Physical)", -- [30]
						"烬枫-火妖鲁西弗隆 圣光闪现 Romanx Hit +330", -- [31]
						"因纳夏克-黑龙费尔默 旋风斩 Romanx Hit -372 (Physical)", -- [32]
						"指吻礼物馆 魔爆术 Romanx Hit -371 (Arcane)", -- [33]
						"Romanx 重伤 (伤害/跳) 渣二哥-黑龙费尔默 Absorb -176 (176 被吸收) (Physical)", -- [34]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -217 (Shadow)", -- [35]
						"渣二哥-黑龙费尔默 斩杀 Romanx Hit -477 (Physical)", -- [36]
						"Romanx 致死打击 渣二哥-黑龙费尔默 Absorb -622 (622 被吸收) (Physical)", -- [37]
						"渣二哥-黑龙费尔默 重伤 (伤害/跳) Romanx Tick -134 (Physical)", -- [38]
						"渣二哥-黑龙费尔默 肉搏 Romanx Hit -363 (Physical)", -- [39]
						"Romanx 重伤 (伤害/跳) 渣二哥-黑龙费尔默 Tick -176 (Physical)", -- [40]
						"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -217 (Shadow)", -- [41]
						"Romanx死亡。", -- [42]
					},
					["DeathAt"] = 45482.544,
					["EventNum"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0, -- [4]
						0, -- [5]
						0, -- [6]
						0, -- [7]
						0, -- [8]
						0, -- [9]
						0, -- [10]
						0, -- [11]
						0, -- [12]
						0, -- [13]
						0, -- [14]
						0, -- [15]
						0, -- [16]
						0, -- [17]
						0, -- [18]
						0, -- [19]
						0, -- [20]
						0, -- [21]
						0, -- [22]
						0, -- [23]
						0, -- [24]
						0, -- [25]
						0, -- [26]
						0, -- [27]
						0, -- [28]
						0, -- [29]
						0, -- [30]
						0, -- [31]
						0, -- [32]
						0, -- [33]
						0, -- [34]
						0, -- [35]
						0, -- [36]
						0, -- [37]
						0, -- [38]
						0, -- [39]
						0, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["MessageTimes"] = {
						-13.66800000000512, -- [1]
						-13.51800000000367, -- [2]
						-12.95100000000093, -- [3]
						-12.63100000000122, -- [4]
						-12.1510000000053, -- [5]
						-12.11700000000565, -- [6]
						-12.10100000000239, -- [7]
						-12.10100000000239, -- [8]
						-12.10100000000239, -- [9]
						-12.01699999999983, -- [10]
						-11.6510000000053, -- [11]
						-11.45100000000093, -- [12]
						-10.51699999999983, -- [13]
						-10.11700000000565, -- [14]
						-9.934000000001106, -- [15]
						-9.016999999999825, -- [16]
						-8.984000000004016, -- [17]
						-8.684000000001106, -- [18]
						-8.550999999999476, -- [19]
						-8.434000000001106, -- [20]
						-8.184000000001106, -- [21]
						-7.984000000004016, -- [22]
						-6.75, -- [23]
						-6.584000000002561, -- [24]
						-6.117000000005646, -- [25]
						-6.016999999999825, -- [26]
						-5.766999999999825, -- [27]
						-4.934000000001106, -- [28]
						-4.80000000000291, -- [29]
						-4.533999999999651, -- [30]
						-3.783999999999651, -- [31]
						-3.584000000002561, -- [32]
						-3.315999999998894, -- [33]
						-3.084000000002561, -- [34]
						-3, -- [35]
						-2.834000000002561, -- [36]
						-2.55000000000291, -- [37]
						-1.766999999999825, -- [38]
						-0.3830000000016298, -- [39]
						-0.08300000000599539, -- [40]
						0, -- [41]
						0, -- [42]
					},
					["HealthMax"] = {
						5839, -- [1]
						5839, -- [2]
						5839, -- [3]
						5839, -- [4]
						5839, -- [5]
						5839, -- [6]
						5839, -- [7]
						5839, -- [8]
						5839, -- [9]
						5839, -- [10]
						5839, -- [11]
						5839, -- [12]
						5839, -- [13]
						5839, -- [14]
						5839, -- [15]
						5839, -- [16]
						5839, -- [17]
						5839, -- [18]
						5839, -- [19]
						5839, -- [20]
						5839, -- [21]
						5839, -- [22]
						5839, -- [23]
						6714, -- [24]
						6714, -- [25]
						6714, -- [26]
						6714, -- [27]
						6714, -- [28]
						6714, -- [29]
						6714, -- [30]
						6714, -- [31]
						6714, -- [32]
						6714, -- [33]
						6714, -- [34]
						6714, -- [35]
						6714, -- [36]
						6714, -- [37]
						6714, -- [38]
						6714, -- [39]
						6714, -- [40]
						6714, -- [41]
						5839, -- [42]
					},
					["Health"] = {
						5679, -- [1]
						4902, -- [2]
						4902, -- [3]
						4146, -- [4]
						4146, -- [5]
						4146, -- [6]
						4146, -- [7]
						4146, -- [8]
						4146, -- [9]
						4146, -- [10]
						3942, -- [11]
						3308, -- [12]
						2667, -- [13]
						1979, -- [14]
						1719, -- [15]
						1615, -- [16]
						1399, -- [17]
						2045, -- [18]
						1730, -- [19]
						1730, -- [20]
						1373, -- [21]
						1161, -- [22]
						1990, -- [23]
						3872, -- [24]
						3407, -- [25]
						3407, -- [26]
						3190, -- [27]
						3190, -- [28]
						2831, -- [29]
						1849, -- [30]
						1816, -- [31]
						2146, -- [32]
						1774, -- [33]
						1403, -- [34]
						1403, -- [35]
						1186, -- [36]
						709, -- [37]
						709, -- [38]
						575, -- [39]
						212, -- [40]
						212, -- [41]
						0, -- [42]
					},
					["KilledBy"] = "清风徐自来-火妖鲁西弗隆",
					["MessageType"] = {
						"DAMAGE", -- [1]
						"MISC", -- [2]
						"DAMAGE", -- [3]
						"DAMAGE", -- [4]
						"DAMAGE", -- [5]
						"DAMAGE", -- [6]
						"DAMAGE", -- [7]
						"DAMAGE", -- [8]
						"DAMAGE", -- [9]
						"DAMAGE", -- [10]
						"DAMAGE", -- [11]
						"DAMAGE", -- [12]
						"DAMAGE", -- [13]
						"DAMAGE", -- [14]
						"DAMAGE", -- [15]
						"DAMAGE", -- [16]
						"HEAL", -- [17]
						"DAMAGE", -- [18]
						"DAMAGE", -- [19]
						"DAMAGE", -- [20]
						"DAMAGE", -- [21]
						"HEAL", -- [22]
						"HEAL", -- [23]
						"DAMAGE", -- [24]
						"DAMAGE", -- [25]
						"DAMAGE", -- [26]
						"DAMAGE", -- [27]
						"DAMAGE", -- [28]
						"DAMAGE", -- [29]
						"DAMAGE", -- [30]
						"HEAL", -- [31]
						"DAMAGE", -- [32]
						"DAMAGE", -- [33]
						"DAMAGE", -- [34]
						"DAMAGE", -- [35]
						"DAMAGE", -- [36]
						"DAMAGE", -- [37]
						"DAMAGE", -- [38]
						"DAMAGE", -- [39]
						"DAMAGE", -- [40]
						"DAMAGE", -- [41]
						"MISC", -- [42]
					},
				}, -- [3]
			},
			["TimeLast"] = {
				["TimeHeal"] = 45941.535,
				["Dispelled"] = 45666.537,
				["OVERALL"] = 46019.539,
				["DamageTaken"] = 46001.535,
				["DeathCount"] = 45880.532,
				["RageGain"] = 46019.539,
				["ActiveTime"] = 46004.538,
				["TimeDamage"] = 46004.538,
				["Healing"] = 45941.535,
				["HealingTaken"] = 45941.535,
				["DOT_Time"] = 45940.535,
				["Damage"] = 46004.538,
			},
			["LastAttackedBy"] = "指吻礼物馆",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"DAMAGE", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"MISC", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"HEAL", -- [38]
				"DAMAGE", -- [39]
				"HEAL", -- [40]
				"DAMAGE", -- [41]
				"DAMAGE", -- [42]
				"DAMAGE", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"DAMAGE", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					7.5, -- [1]
				},
				["Dispelled"] = {
					12, -- [1]
				},
				["Healing"] = {
					1842, -- [1]
				},
				["DamageTaken"] = {
					32399, -- [1]
				},
				["HealingTaken"] = {
					12787, -- [1]
				},
				["DeathCount"] = {
					3, -- [1]
				},
				["TimeDamage"] = {
					97.72999999999999, -- [1]
				},
				["ActiveTime"] = {
					105.23, -- [1]
				},
				["RageGain"] = {
					145, -- [1]
				},
				["DOT_Time"] = {
					75, -- [1]
				},
				["Damage"] = {
					32819, -- [1]
				},
			},
			["LastHealTime"] = 45942.535,
			["LastDamageTaken"] = 103,
			["level"] = 60,
			["LastDamageAbility"] = "冰霜新星",
			["LastFightIn"] = 3,
			["GUID"] = "Player-5458-031E8F9D",
			["type"] = "Grouped",
			["LastEventHealth"] = {
				1922, -- [1]
				1708, -- [2]
				1708, -- [3]
				2891, -- [4]
				2769, -- [5]
				2507, -- [6]
				2294, -- [7]
				2294, -- [8]
				2294, -- [9]
				2294, -- [10]
				2173, -- [11]
				1971, -- [12]
				1861, -- [13]
				1677, -- [14]
				1134, -- [15]
				1024, -- [16]
				703, -- [17]
				501, -- [18]
				501, -- [19]
				501, -- [20]
				501, -- [21]
				174, -- [22]
				0, -- [23]
				5839, -- [24]
				5839, -- [25]
				5839, -- [26]
				5582, -- [27]
				5582, -- [28]
				5582, -- [29]
				5582, -- [30]
				5582, -- [31]
				5556, -- [32]
				5556, -- [33]
				5556, -- [34]
				5556, -- [35]
				5219, -- [36]
				5219, -- [37]
				5219, -- [38]
				5219, -- [39]
				5312, -- [40]
				5312, -- [41]
				5839, -- [42]
				5839, -- [43]
				5839, -- [44]
				5839, -- [45]
				5736, -- [46]
				3264, -- [47]
				3264, -- [48]
				2921, -- [49]
				2921, -- [50]
			},
			["enClass"] = "WARRIOR",
			["unit"] = true,
			["Owner"] = false,
			["LastEventHealthMax"] = {
				6714, -- [1]
				6714, -- [2]
				6714, -- [3]
				6714, -- [4]
				6714, -- [5]
				6714, -- [6]
				6714, -- [7]
				6714, -- [8]
				6714, -- [9]
				6714, -- [10]
				6714, -- [11]
				6714, -- [12]
				6714, -- [13]
				6714, -- [14]
				6714, -- [15]
				6714, -- [16]
				6714, -- [17]
				6714, -- [18]
				6714, -- [19]
				6714, -- [20]
				6714, -- [21]
				6714, -- [22]
				5839, -- [23]
				5839, -- [24]
				5839, -- [25]
				5839, -- [26]
				5839, -- [27]
				5839, -- [28]
				5839, -- [29]
				5839, -- [30]
				5839, -- [31]
				5839, -- [32]
				5839, -- [33]
				5839, -- [34]
				5839, -- [35]
				5839, -- [36]
				5839, -- [37]
				5839, -- [38]
				5839, -- [39]
				5839, -- [40]
				5839, -- [41]
				5839, -- [42]
				5839, -- [43]
				5839, -- [44]
				5839, -- [45]
				5839, -- [46]
				6714, -- [47]
				6714, -- [48]
				6714, -- [49]
				6714, -- [50]
			},
			["NextEventNum"] = 47,
			["LastDamageTime"] = 46004.972,
			["LastEvents"] = {
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -214 (Shadow)", -- [1]
				"Romanx 重伤 (伤害/跳) Yang-逐风者 Tick -95 (Physical)", -- [2]
				"蓝斯洛-火妖鲁西弗隆 圣光术 Romanx Crit +1183", -- [3]
				"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -122 (Physical)", -- [4]
				"Yang-逐风者 肉搏 Romanx Hit -262 (Physical)", -- [5]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -213 (Shadow)", -- [6]
				"Romanx 断筋 Yang-逐风者 Crit -73 (Physical)", -- [7]
				"Romanx 肉搏 Yang-逐风者 Crit -883 (Physical)", -- [8]
				"Romanx 斩杀 Yang-逐风者 Hit -1367 (Physical)", -- [9]
				"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -121 (Physical)", -- [10]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -202 (Shadow)", -- [11]
				"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -110 (Physical)", -- [12]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -184 (Shadow)", -- [13]
				"法神飞舞醉酒-逐风者 冲击波 Romanx Hit -543 (Fire)", -- [14]
				"Yang-逐风者 重伤 (伤害/跳) Romanx Tick -110 (Physical)", -- [15]
				"法神飞舞醉酒-逐风者 魔爆术 Romanx Hit -321 (Arcane)", -- [16]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) Romanx Tick -202 (Shadow)", -- [17]
				"清风徐自来-火妖鲁西弗隆 肉搏 Romanx Miss (1)", -- [18]
				"指吻礼物馆 冰冻 Romanx Immune (Frost)", -- [19]
				"Romanx 致死打击 指吻礼物馆 Hit -635 (Physical)", -- [20]
				"法神飞舞醉酒-逐风者 魔爆术 Romanx Hit -327 (Arcane)", -- [21]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) Romanx Tick -203 (Shadow)", -- [22]
				"Romanx死亡。", -- [23]
				"Romanx 断筋 因纳夏克-黑龙费尔默 Hit -29 (Physical)", -- [24]
				"Romanx 肉搏 因纳夏克-黑龙费尔默 Hit -340 (Physical)", -- [25]
				"Yang-逐风者 肉搏 Romanx Hit -257 (Physical)", -- [26]
				"Romanx 肉搏 因纳夏克-黑龙费尔默 Hit -378 (Physical)", -- [27]
				"因纳夏克-黑龙费尔默 旋风斩 Romanx Dodge (Physical)", -- [28]
				"Romanx 旋风斩 Yang-逐风者 Hit -324 (Physical)", -- [29]
				"Romanx 旋风斩 因纳夏克-黑龙费尔默 Hit -367 (Physical)", -- [30]
				"Yang-逐风者 断筋 Romanx Hit -26 (Physical)", -- [31]
				"Romanx 断筋 Yang-逐风者 Crit -57 (Physical)", -- [32]
				"Romanx 断筋 (剑类武器专精) Yang-逐风者 Crit -720 (Physical)", -- [33]
				"Romanx 断筋 Yang-逐风者 Crit -58 (Physical)", -- [34]
				"Romanx 肉搏 Yang-逐风者 Hit -337 (Physical)", -- [35]
				"Romanx 重伤 (伤害/跳) Yang-逐风者 Tick -88 (Physical)", -- [36]
				"Romanx 重伤 (伤害/跳) Yang-逐风者 Tick -88 (Physical)", -- [37]
				"Romanx 神圣力量 Romanx Hit +93", -- [38]
				"Romanx 肉搏 Yang-逐风者 Hit -392 (Physical)", -- [39]
				"Romanx 神圣力量 Romanx Hit +117", -- [40]
				"Romanx 斩杀 Yang-逐风者 Crit -1396 (Physical)", -- [41]
				"Romanx 肉搏 指吻礼物馆 Absorb -31 (1)", -- [42]
				"Romanx 肉搏 指吻礼物馆 Hit -496 (31 被吸收) (Physical)", -- [43]
				"Romanx 致死打击 指吻礼物馆 Hit -655 (Physical)", -- [44]
				"指吻礼物馆 冰霜新星 Romanx Hit -103 (Frost)", -- [45]
				"Romanx 铁皮手雷 指吻礼物馆 Hit -152 (Fire)", -- [46]
				"Romanx 肉搏 Yang-逐风者 Hit -419 (Physical)", -- [47]
				"Yang-逐风者 肉搏 Romanx Hit -343 (Physical)", -- [48]
				"Romanx 致死打击 Yang-逐风者 Hit -557 (Physical)", -- [49]
				"Yang-逐风者 致死打击 Romanx Crit -999 (Physical)", -- [50]
			},
			["LastEventIncoming"] = {
				true, -- [1]
				false, -- [2]
				true, -- [3]
				true, -- [4]
				true, -- [5]
				true, -- [6]
				false, -- [7]
				false, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				true, -- [14]
				true, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				true, -- [21]
				true, -- [22]
				true, -- [23]
				false, -- [24]
				false, -- [25]
				true, -- [26]
				false, -- [27]
				true, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				false, -- [35]
				false, -- [36]
				false, -- [37]
				true, -- [38]
				false, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				false, -- [44]
				true, -- [45]
				false, -- [46]
				false, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["Name"] = "Romanx",
			["LastEventTimes"] = {
				45866.214, -- [1]
				45866.764, -- [2]
				45867.565, -- [3]
				45868.464, -- [4]
				45869.148, -- [5]
				45869.198, -- [6]
				45869.464, -- [7]
				45869.498, -- [8]
				45870.981, -- [9]
				45871.464, -- [10]
				45872.198, -- [11]
				45874.465, -- [12]
				45875.198, -- [13]
				45876.282, -- [14]
				45877.465, -- [15]
				45877.798, -- [16]
				45878.198, -- [17]
				45879.065, -- [18]
				45879.248, -- [19]
				45879.248, -- [20]
				45879.282, -- [21]
				45880.515, -- [22]
				45880.548, -- [23]
				45926.804, -- [24]
				45926.834, -- [25]
				45929.868, -- [26]
				45930.618, -- [27]
				45930.851, -- [28]
				45931.301, -- [29]
				45931.301, -- [30]
				45931.43, -- [31]
				45933.285, -- [32]
				45933.301, -- [33]
				45934.801, -- [34]
				45937.101, -- [35]
				45937.818, -- [36]
				45940.835, -- [37]
				45940.918, -- [38]
				45940.918, -- [39]
				45942.535, -- [40]
				45942.553, -- [41]
				46001.672, -- [42]
				46001.672, -- [43]
				46001.855, -- [44]
				46002.022, -- [45]
				46004.972, -- [46]
				45865.314, -- [47]
				45865.348, -- [48]
				45865.381, -- [49]
				45865.448, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 103,
					["RageGainedFrom"] = {
						["Romanx"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 20,
								},
								["冲锋"] = {
									["count"] = 15,
								},
							},
							["amount"] = 35,
						},
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Frost"] = 103,
					},
					["DOT_Time"] = 0,
					["Damage"] = 1334,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 31,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 655,
						["Melee"] = 527,
						["Fire"] = 152,
					},
					["PartialAbsorb"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 655,
								},
								["铁皮手雷"] = {
									["count"] = 152,
								},
								["肉搏"] = {
									["count"] = 527,
								},
							},
							["amount"] = 1334,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 103,
								},
							},
							["amount"] = 103,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["Romanx"] = {
									["count"] = 20,
								},
							},
							["amount"] = 20,
						},
						["冲锋"] = {
							["Details"] = {
								["Romanx"] = {
									["count"] = 15,
								},
							},
							["amount"] = 15,
						},
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.18,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.18,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 3.18,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 655,
									["min"] = 655,
									["count"] = 1,
									["amount"] = 655,
								},
							},
							["count"] = 1,
							["amount"] = 655,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 152,
									["min"] = 152,
									["count"] = 1,
									["amount"] = 152,
								},
							},
							["count"] = 1,
							["amount"] = 152,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 496,
									["min"] = 496,
									["count"] = 1,
									["amount"] = 496,
								},
								["Absorb"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
							},
							["count"] = 2,
							["amount"] = 527,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 35,
					["TimeDamage"] = 3.18,
					["TimeDamaging"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 0.18,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.18,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["TimeHealing"] = {
						["Romanx"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 4.5,
								},
								["生命赐福"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
					},
					["Dispelled"] = 12,
					["DOTs"] = {
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["渣二哥-黑龙费尔默"] = {
									["count"] = 18,
								},
								["法神飞舞醉酒-逐风者"] = {
									["count"] = 6,
								},
								["薯片儿-逐风者"] = {
									["count"] = 12,
								},
								["指吻礼物馆"] = {
									["count"] = 18,
								},
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 6,
								},
								["Yang-逐风者"] = {
									["count"] = 15,
								},
							},
							["amount"] = 75,
						},
					},
					["ElementDoneAbsorb"] = {
						413, -- [1]
						["Melee"] = 1399,
						["Physical"] = 1497,
					},
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 23,
								},
							},
							["amount"] = 24,
						},
						["Melee"] = {
							["Details"] = {
								["Dodge"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 13,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 18,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
						["Frost"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 9,
								},
							},
							["amount"] = 12,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 16,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 22,
								},
								["Crit"] = {
									["count"] = 2,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 43,
						},
					},
					["DamageTaken"] = 32399,
					["RageGainedFrom"] = {
						["Romanx"] = {
							["Details"] = {
								["血性狂暴"] = {
									["count"] = 100,
								},
								["冲锋"] = {
									["count"] = 45,
								},
							},
							["amount"] = 145,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 15,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 5,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["斩杀"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["压制"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 7,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["Falling"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 18,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 17,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
					},
					["DeathCount"] = 3,
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 15,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 5,
									["amount"] = 0,
								},
							},
							["count"] = 5,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["斩杀"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["压制"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["撕裂 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 7,
									["amount"] = 0,
								},
							},
							["count"] = 7,
							["amount"] = 0,
						},
						["英勇打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["噬灵瘟疫 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["Falling"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 18,
									["amount"] = 0,
								},
							},
							["count"] = 18,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 17,
									["amount"] = 0,
								},
							},
							["count"] = 17,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 105.23,
					["DOT_Time"] = 75,
					["ElementTaken"] = {
						["Shadow"] = 5275,
						["Melee"] = 4653,
						["Arcane"] = 1735,
						["Fire"] = 6675,
						["Frost"] = 6314,
						["Physical"] = 7747,
					},
					["RageGained"] = {
						["血性狂暴"] = {
							["Details"] = {
								["Romanx"] = {
									["count"] = 100,
								},
							},
							["amount"] = 100,
						},
						["冲锋"] = {
							["Details"] = {
								["Romanx"] = {
									["count"] = 45,
								},
							},
							["amount"] = 45,
						},
					},
					["WhoDispelled"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["魔法抑制 (驱散魔法)"] = {
									["count"] = 1,
								},
								["强效力量祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
								["自由祝福 (驱散魔法)"] = {
									["count"] = 1,
								},
								["防护恐惧结界 (驱散魔法)"] = {
									["count"] = 1,
								},
								["野性赐福 (驱散魔法)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 5,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["冰冻 (清洁术)"] = {
									["count"] = 2,
								},
								["噬灵瘟疫 (清洁术)"] = {
									["count"] = 1,
								},
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
								["寒冰箭 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 6,
						},
					},
					["HealedWho"] = {
						["Romanx"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 332,
								},
								["生命赐福"] = {
									["count"] = 1510,
								},
							},
							["amount"] = 1842,
						},
					},
					["TimeHeal"] = 7.5,
					["Heals"] = {
						["神圣力量"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 122,
									["min"] = 93,
									["count"] = 3,
									["amount"] = 332,
								},
							},
							["count"] = 3,
							["amount"] = 332,
						},
						["生命赐福"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1007,
									["min"] = 503,
									["count"] = 2,
									["amount"] = 1510,
								},
							},
							["count"] = 2,
							["amount"] = 1510,
						},
					},
					["WhoHealed"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 3629,
								},
								["圣光闪现"] = {
									["count"] = 1621,
								},
							},
							["amount"] = 5250,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1876,
								},
								["圣光闪现"] = {
									["count"] = 3819,
								},
							},
							["amount"] = 5695,
						},
						["Romanx"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 332,
								},
								["生命赐福"] = {
									["count"] = 1510,
								},
							},
							["amount"] = 1842,
						},
					},
					["HealingTaken"] = 12787,
					["Healing"] = 1842,
					["DamagedWho"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 545,
								},
								["肉搏 (剑类武器专精)"] = {
									["count"] = 413,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 185,
								},
								["拳击"] = {
									["count"] = 71,
								},
								["断筋"] = {
									["count"] = 33,
								},
								["斩杀"] = {
									["count"] = 1075,
								},
								["肉搏"] = {
									["count"] = 2419,
								},
							},
							["amount"] = 4741,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 29,
								},
								["旋风斩"] = {
									["count"] = 367,
								},
								["肉搏"] = {
									["count"] = 718,
								},
							},
							["amount"] = 1114,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 677,
								},
								["旋风斩"] = {
									["count"] = 678,
								},
								["旋风斩 (剑类武器专精)"] = {
									["count"] = 1465,
								},
								["断筋"] = {
									["count"] = 165,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 177,
								},
								["肉搏"] = {
									["count"] = 457,
								},
							},
							["amount"] = 3619,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 103,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 660,
								},
								["肉搏"] = {
									["count"] = 1449,
								},
							},
							["amount"] = 2212,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1290,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 544,
								},
								["拦截昏迷"] = {
									["count"] = 51,
								},
								["断筋"] = {
									["count"] = 82,
								},
								["铁皮手雷"] = {
									["count"] = 152,
								},
								["肉搏"] = {
									["count"] = 1878,
								},
							},
							["amount"] = 3997,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2245,
								},
								["旋风斩"] = {
									["count"] = 392,
								},
								["断筋"] = {
									["count"] = 57,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 919,
								},
								["肉搏"] = {
									["count"] = 1742,
								},
							},
							["amount"] = 5355,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2045,
								},
								["断筋 (剑类武器专精)"] = {
									["count"] = 720,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 461,
								},
								["旋风斩"] = {
									["count"] = 1196,
								},
								["旋风斩 (剑类武器专精)"] = {
									["count"] = 496,
								},
								["断筋"] = {
									["count"] = 221,
								},
								["斩杀"] = {
									["count"] = 3318,
								},
								["肉搏"] = {
									["count"] = 3324,
								},
							},
							["amount"] = 11781,
						},
					},
					["ElementDone"] = {
						413, -- [1]
						["Physical"] = 20267,
						["Melee"] = 11987,
						["Fire"] = 152,
					},
					["Attacks"] = {
						["致死打击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 622,
									["min"] = 622,
									["count"] = 1,
									["amount"] = 622,
								},
								["Crit"] = {
									["max"] = 1050,
									["min"] = 959,
									["count"] = 2,
									["amount"] = 2009,
								},
								["Hit"] = {
									["max"] = 677,
									["min"] = 529,
									["count"] = 7,
									["amount"] = 4171,
								},
							},
							["count"] = 10,
							["amount"] = 6802,
						},
						["肉搏 (剑类武器专精)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 413,
									["min"] = 413,
									["count"] = 1,
									["amount"] = 413,
								},
							},
							["count"] = 1,
							["amount"] = 413,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["Tick"] = {
									["max"] = 177,
									["min"] = 88,
									["count"] = 18,
									["amount"] = 2226,
								},
								["Absorb"] = {
									["max"] = 176,
									["min"] = 88,
									["count"] = 7,
									["amount"] = 720,
								},
							},
							["count"] = 25,
							["amount"] = 2946,
						},
						["旋风斩 (剑类武器专精)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1465,
									["min"] = 1465,
									["count"] = 1,
									["amount"] = 1465,
								},
								["Hit"] = {
									["max"] = 496,
									["min"] = 496,
									["count"] = 1,
									["amount"] = 496,
								},
							},
							["count"] = 2,
							["amount"] = 1961,
						},
						["拳击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 71,
									["min"] = 71,
									["count"] = 1,
									["amount"] = 71,
								},
							},
							["count"] = 1,
							["amount"] = 71,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 152,
									["min"] = 152,
									["count"] = 1,
									["amount"] = 152,
								},
							},
							["count"] = 1,
							["amount"] = 152,
						},
						["断筋 (剑类武器专精)"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 720,
									["min"] = 720,
									["count"] = 1,
									["amount"] = 720,
								},
							},
							["count"] = 1,
							["amount"] = 720,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 51,
									["min"] = 51,
									["count"] = 1,
									["amount"] = 51,
								},
							},
							["count"] = 2,
							["amount"] = 51,
						},
						["旋风斩"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 678,
									["min"] = 324,
									["count"] = 6,
									["amount"] = 2633,
								},
							},
							["count"] = 6,
							["amount"] = 2633,
						},
						["冲锋击昏"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 46,
									["min"] = 29,
									["count"] = 7,
									["amount"] = 248,
								},
								["Absorb"] = {
									["max"] = 33,
									["min"] = 33,
									["count"] = 1,
									["amount"] = 33,
								},
								["Crit"] = {
									["max"] = 82,
									["min"] = 57,
									["count"] = 6,
									["amount"] = 409,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 15,
							["amount"] = 690,
						},
						["斩杀"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 1396,
									["min"] = 1075,
									["count"] = 2,
									["amount"] = 2471,
								},
								["Hit"] = {
									["max"] = 1367,
									["min"] = 555,
									["count"] = 2,
									["amount"] = 1922,
								},
							},
							["count"] = 4,
							["amount"] = 4393,
						},
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 439,
									["min"] = 31,
									["count"] = 5,
									["amount"] = 1399,
								},
								["Hit"] = {
									["max"] = 496,
									["min"] = 337,
									["count"] = 16,
									["amount"] = 6558,
								},
								["Dodge"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Immune"] = {
									["count"] = 1,
									["amount"] = 0,
								},
								["Crit"] = {
									["max"] = 959,
									["min"] = 388,
									["count"] = 5,
									["amount"] = 4030,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 29,
							["amount"] = 11987,
						},
					},
					["RageGain"] = 145,
					["ElementHitsDone"] = {
						{
							["Details"] = {
								["Absorb"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						}, -- [1]
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 11,
								},
								["Hit"] = {
									["count"] = 23,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 18,
								},
								["Crit"] = {
									["count"] = 12,
								},
								["Dodge"] = {
									["count"] = 1,
								},
							},
							["amount"] = 67,
						},
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 16,
								},
								["Dodge"] = {
									["count"] = 1,
								},
								["Immune"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 29,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["TimeDamage"] = 97.72999999999999,
					["WhoDamaged"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 366,
								},
								["断筋"] = {
									["count"] = 24,
								},
								["旋风斩"] = {
									["count"] = 258,
								},
								["肉搏"] = {
									["count"] = 1042,
								},
							},
							["amount"] = 1690,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 951,
								},
								["火焰冲击"] = {
									["count"] = 1410,
								},
								["冰霜新星"] = {
									["count"] = 31,
								},
								["魔爆术"] = {
									["count"] = 648,
								},
								["冲击波"] = {
									["count"] = 1948,
								},
								["铁皮手雷"] = {
									["count"] = 221,
								},
								["冰锥术"] = {
									["count"] = 2288,
								},
							},
							["amount"] = 7497,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 372,
								},
							},
							["amount"] = 372,
						},
						["Environment"] = {
							["Details"] = {
								["Falling"] = {
									["count"] = 10,
								},
							},
							["amount"] = 10,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 465,
								},
								["撕裂 (伤害/跳)"] = {
									["count"] = 273,
								},
								["压制"] = {
									["count"] = 260,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 134,
								},
								["英勇打击"] = {
									["count"] = 982,
								},
								["断筋"] = {
									["count"] = 33,
								},
								["斩杀"] = {
									["count"] = 477,
								},
								["肉搏"] = {
									["count"] = 777,
								},
							},
							["amount"] = 3401,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["冰霜新星"] = {
									["count"] = 207,
								},
								["魔爆术"] = {
									["count"] = 1087,
								},
								["寒冰箭"] = {
									["count"] = 2196,
								},
								["冰锥术"] = {
									["count"] = 641,
								},
								["火焰冲击"] = {
									["count"] = 3096,
								},
							},
							["amount"] = 7227,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 688,
								},
								["噬灵瘟疫 (伤害/跳)"] = {
									["count"] = 278,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 3476,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 833,
								},
							},
							["amount"] = 5275,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2505,
								},
								["断筋"] = {
									["count"] = 87,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1501,
								},
								["肉搏"] = {
									["count"] = 2834,
								},
							},
							["amount"] = 6927,
						},
					},
					["Damage"] = 32819,
					["TimeSpent"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.53,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.03,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.58,
								},
								["肉搏"] = {
									["count"] = 5.58,
								},
							},
							["amount"] = 12.64,
						},
						["Romanx"] = {
							["Details"] = {
								["神圣力量"] = {
									["count"] = 4.5,
								},
								["生命赐福"] = {
									["count"] = 3,
								},
							},
							["amount"] = 7.5,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.18,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.8,
								},
								["断筋"] = {
									["count"] = 3.37,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.55,
								},
							},
							["amount"] = 13.4,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 4.3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.949999999999999,
								},
								["肉搏"] = {
									["count"] = 1.62,
								},
							},
							["amount"] = 11.87,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.68,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.7,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.75,
								},
							},
							["amount"] = 16.13,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.55,
								},
								["断筋"] = {
									["count"] = 0.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.6,
								},
								["肉搏"] = {
									["count"] = 5.1,
								},
							},
							["amount"] = 15.75,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.77,
								},
								["断筋 (剑类武器专精)"] = {
									["count"] = 0.02,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.319999999999999,
								},
								["旋风斩"] = {
									["count"] = 2.18,
								},
								["旋风斩 (剑类武器专精)"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 4.88,
								},
								["斩杀"] = {
									["count"] = 3.63,
								},
								["肉搏"] = {
									["count"] = 6.090000000000001,
								},
							},
							["amount"] = 24.91,
						},
					},
					["TimeDamaging"] = {
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 1.98,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
								["拳击"] = {
									["count"] = 1.5,
								},
								["斩杀"] = {
									["count"] = 0.58,
								},
								["肉搏"] = {
									["count"] = 5.58,
								},
							},
							["amount"] = 12.64,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.53,
								},
								["断筋"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.03,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.5,
								},
								["拦截昏迷"] = {
									["count"] = 1.18,
								},
								["旋风斩"] = {
									["count"] = 1.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 2.8,
								},
								["断筋"] = {
									["count"] = 3.37,
								},
								["冲锋击昏"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.55,
								},
							},
							["amount"] = 13.4,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["断筋"] = {
									["count"] = 4.3,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.949999999999999,
								},
								["肉搏"] = {
									["count"] = 1.62,
								},
							},
							["amount"] = 11.87,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 1.68,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.7,
								},
								["拦截昏迷"] = {
									["count"] = 1.5,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 3.75,
								},
							},
							["amount"] = 16.13,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.55,
								},
								["断筋"] = {
									["count"] = 0.5,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 7.6,
								},
								["肉搏"] = {
									["count"] = 5.1,
								},
							},
							["amount"] = 15.75,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 2.77,
								},
								["断筋 (剑类武器专精)"] = {
									["count"] = 0.02,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 5.319999999999999,
								},
								["旋风斩"] = {
									["count"] = 2.18,
								},
								["旋风斩 (剑类武器专精)"] = {
									["count"] = 0.02,
								},
								["断筋"] = {
									["count"] = 4.88,
								},
								["斩杀"] = {
									["count"] = 3.63,
								},
								["肉搏"] = {
									["count"] = 6.090000000000001,
								},
							},
							["amount"] = 24.91,
						},
					},
				},
			},
			["UnitLockout"] = 45432.541,
			["LastActive"] = 46019.539,
		},
		["风之利箭"] = {
			["GUID"] = "Player-5458-02F010A6",
			["LastEventHealth"] = {
				5180, -- [1]
				5153, -- [2]
				4788, -- [3]
				4488, -- [4]
				4488, -- [5]
				4488, -- [6]
				3860, -- [7]
				3444, -- [8]
				3384, -- [9]
				3384, -- [10]
				3336, -- [11]
				3252, -- [12]
				3252, -- [13]
				3252, -- [14]
				3169, -- [15]
				3169, -- [16]
				4983, -- [17]
				4913, -- [18]
				5467, -- [19]
				5915, -- [20]
				5915, -- [21]
				5915, -- [22]
				5915, -- [23]
				5915, -- [24]
				5915, -- [25]
				5915, -- [26]
				5915, -- [27]
				5784, -- [28]
				5784, -- [29]
				5169, -- [30]
				5169, -- [31]
				4477, -- [32]
				4477, -- [33]
				4477, -- [34]
				4477, -- [35]
				5030, -- [36]
				5306, -- [37]
				5915, -- [38]
				5915, -- [39]
				5915, -- [40]
				5915, -- [41]
				5915, -- [42]
				5915, -- [43]
				5915, -- [44]
				5915, -- [45]
				5915, -- [46]
				6223, -- [47]
				6223, -- [48]
				5486, -- [49]
				5522, -- [50]
			},
			["LastAttackedBy"] = "薯片儿-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"HEAL", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"DAMAGE", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"DAMAGE", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"DAMAGE", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"HEAL", -- [35]
				"HEAL", -- [36]
				"HEAL", -- [37]
				"HEAL", -- [38]
				"HEAL", -- [39]
				"MISC", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"HEAL", -- [43]
				"HEAL", -- [44]
				"HEAL", -- [45]
				"HEAL", -- [46]
				"HEAL", -- [47]
				"HEAL", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["HealingTaken"] = {
					6563, -- [1]
				},
				["Dispelled"] = {
					2, -- [1]
				},
				["ActiveTime"] = {
					38.21999999999999, -- [1]
				},
				["TimeDamage"] = {
					38.21999999999999, -- [1]
				},
				["Healing"] = {
					0, -- [1]
				},
				["DamageTaken"] = {
					8323, -- [1]
				},
				["Damage"] = {
					15725, -- [1]
				},
			},
			["enClass"] = "HUNTER",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "重伤 (伤害/跳)",
			["LastFightIn"] = 3,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 84,
			["LastEventHealthMax"] = {
				6223, -- [1]
				6223, -- [2]
				6223, -- [3]
				6223, -- [4]
				6223, -- [5]
				6223, -- [6]
				6223, -- [7]
				6223, -- [8]
				6223, -- [9]
				6223, -- [10]
				6223, -- [11]
				6223, -- [12]
				6223, -- [13]
				6223, -- [14]
				6223, -- [15]
				6223, -- [16]
				5915, -- [17]
				5915, -- [18]
				5915, -- [19]
				5915, -- [20]
				5915, -- [21]
				5915, -- [22]
				5915, -- [23]
				5915, -- [24]
				5915, -- [25]
				5915, -- [26]
				5915, -- [27]
				5915, -- [28]
				5915, -- [29]
				5915, -- [30]
				5915, -- [31]
				5915, -- [32]
				5915, -- [33]
				5915, -- [34]
				5915, -- [35]
				5915, -- [36]
				5915, -- [37]
				5915, -- [38]
				5915, -- [39]
				5915, -- [40]
				5915, -- [41]
				5915, -- [42]
				5915, -- [43]
				5915, -- [44]
				5915, -- [45]
				5915, -- [46]
				6223, -- [47]
				6223, -- [48]
				6223, -- [49]
				6223, -- [50]
			},
			["TimeLast"] = {
				["TimeDamage"] = 46069.542,
				["HealingTaken"] = 45835.546,
				["Dispelled"] = 45837.546,
				["ActiveTime"] = 46069.542,
				["Healing"] = 45496.544,
				["OVERALL"] = 46072.542,
				["DamageTaken"] = 46072.542,
				["Damage"] = 46069.542,
			},
			["Owner"] = false,
			["Pet"] = {
				"二零二二十倍 <风之利箭>", -- [1]
			},
			["NextEventNum"] = 17,
			["LastDamageTime"] = 46070.075,
			["LastEvents"] = {
				"薯片儿-逐风者 断筋 风之利箭 Hit -27 (Physical)", -- [1]
				"薯片儿-逐风者 致死打击 风之利箭 Hit -365 (Physical)", -- [2]
				"薯片儿-逐风者 肉搏 风之利箭 Hit -300 (Physical)", -- [3]
				"风之利箭 诱捕 薯片儿-逐风者 Resist (Physical)", -- [4]
				"风之利箭 摔绊 薯片儿-逐风者 Hit -31 (Physical)", -- [5]
				"薯片儿-逐风者 肉搏 风之利箭 Crit -628 (Physical)", -- [6]
				"薯片儿-逐风者 致死打击 风之利箭 Hit -416 (Physical)", -- [7]
				"薯片儿-逐风者 断筋 风之利箭 Crit -60 (Physical)", -- [8]
				"风之利箭 铁皮手雷 薯片儿-逐风者 Hit -247 (Fire)", -- [9]
				"薯片儿-逐风者 重伤 (伤害/跳) 风之利箭 Tick -84 (Physical)", -- [10]
				"薯片儿-逐风者 重伤 (伤害/跳) 风之利箭 Tick -84 (Physical)", -- [11]
				"风之利箭 多重射击 薯片儿-逐风者 Hit -548 (Physical)", -- [12]
				"风之利箭 自动射击 薯片儿-逐风者 Crit -886 (Physical)", -- [13]
				"薯片儿-逐风者 重伤 (伤害/跳) 风之利箭 Tick -83 (Physical)", -- [14]
				"风之利箭 奥术射击 薯片儿-逐风者 Hit -261 (Arcane)", -- [15]
				"薯片儿-逐风者 重伤 (伤害/跳) 风之利箭 Tick -84 (Physical)", -- [16]
				"渣二哥-黑龙费尔默 重伤 (伤害/跳) 风之利箭 Tick -70 (Physical)", -- [17]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 风之利箭 Hit +521", -- [18]
				"烬枫-火妖鲁西弗隆 圣光闪现 风之利箭 Crit +1016 (568 过量治疗)", -- [19]
				"风之利箭 多重射击 法神飞舞醉酒-逐风者 Crit -1263 (Physical)", -- [20]
				"风之利箭 自动射击 法神飞舞醉酒-逐风者 Hit -348 (Physical)", -- [21]
				"风之利箭 奥术射击 法神飞舞醉酒-逐风者 Hit -159 (Arcane)", -- [22]
				"风之利箭 多重射击 渣二哥-黑龙费尔默 Hit -402 (Physical)", -- [23]
				"风之利箭 自动射击 渣二哥-黑龙费尔默 Hit -269 (Physical)", -- [24]
				"风之利箭 驱散射击 Yang-逐风者 Hit -142 (Physical)", -- [25]
				"风之利箭 奥术射击 Yang-逐风者 Hit -217 (Arcane)", -- [26]
				"风之利箭 自动射击 Yang-逐风者 Hit -307 (Physical)", -- [27]
				"风之利箭 肉搏 骑大象找麻姑-逐风者 Absorb -390 (1)", -- [28]
				"风之利箭 驱散射击 骑大象找麻姑-逐风者 Crit -56 (390 被吸收) (Physical)", -- [29]
				"风之利箭 自动射击 法神飞舞醉酒-逐风者 Absorb -442 (442 被吸收) (Physical)", -- [30]
				"法神飞舞醉酒-逐风者 冲击波 风之利箭 Hit -692 (Fire)", -- [31]
				"风之利箭 肉搏 法神飞舞醉酒-逐风者 Absorb -356 (356 被吸收) (1)", -- [32]
				"风之利箭 摔绊 法神飞舞醉酒-逐风者 Absorb -44 (44 被吸收) (Physical)", -- [33]
				"风之利箭 肉搏 法神飞舞醉酒-逐风者 Miss (1)", -- [34]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 风之利箭 Hit +553", -- [35]
				"原味小汤圆 回春术 风之利箭 Tick +276", -- [36]
				"原味小汤圆 愈合 风之利箭 Hit +1147 (538 过量治疗)", -- [37]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 风之利箭 Hit +555 (555 过量治疗)", -- [38]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 风之利箭 Hit +562 (562 过量治疗)", -- [39]
				"蓝斯洛-火妖鲁西弗隆 dispels 风之利箭 冰冻 (清洁术)", -- [40]
				"原味小汤圆 回春术 风之利箭 Tick +277 (277 过量治疗)", -- [41]
				"原味小汤圆 愈合 风之利箭 Tick +183 (183 过量治疗)", -- [42]
				"原味小汤圆 回春术 风之利箭 Tick +276 (276 过量治疗)", -- [43]
				"原味小汤圆 愈合 风之利箭 Tick +183 (183 过量治疗)", -- [44]
				"原味小汤圆 回春术 风之利箭 Tick +276 (276 过量治疗)", -- [45]
				"原味小汤圆 愈合 风之利箭 Tick +183 (183 过量治疗)", -- [46]
				"原味小汤圆 愈合 风之利箭 Tick +183 (183 过量治疗)", -- [47]
				"原味小汤圆 愈合 风之利箭 Tick +183 (183 过量治疗)", -- [48]
				"风之利箭 驱散射击 因纳夏克-黑龙费尔默 Hit -157 (Physical)", -- [49]
				"薯片儿-逐风者 肉搏 风之利箭 Hit -342 (Physical)", -- [50]
			},
			["Name"] = "风之利箭",
			["LastEventIncoming"] = {
				true, -- [1]
				true, -- [2]
				true, -- [3]
				false, -- [4]
				false, -- [5]
				true, -- [6]
				true, -- [7]
				true, -- [8]
				false, -- [9]
				true, -- [10]
				true, -- [11]
				false, -- [12]
				false, -- [13]
				true, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				true, -- [19]
				false, -- [20]
				false, -- [21]
				false, -- [22]
				false, -- [23]
				false, -- [24]
				false, -- [25]
				false, -- [26]
				false, -- [27]
				false, -- [28]
				false, -- [29]
				false, -- [30]
				true, -- [31]
				false, -- [32]
				false, -- [33]
				false, -- [34]
				true, -- [35]
				true, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				true, -- [41]
				true, -- [42]
				true, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				false, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				46051.491, -- [1]
				46053.408, -- [2]
				46054.891, -- [3]
				46055.591, -- [4]
				46057.675, -- [5]
				46058.708, -- [6]
				46059.508, -- [7]
				46061.008, -- [8]
				46061.55800000001, -- [9]
				46064.042, -- [10]
				46067.042, -- [11]
				46069.292, -- [12]
				46069.525, -- [13]
				46070.042, -- [14]
				46070.075, -- [15]
				46073.025, -- [16]
				45576.132, -- [17]
				45576.815, -- [18]
				45577.132, -- [19]
				45596.666, -- [20]
				45596.833, -- [21]
				45597.516, -- [22]
				45612.901, -- [23]
				45613.117, -- [24]
				45613.984, -- [25]
				45618.718, -- [26]
				45619.201, -- [27]
				45716.006, -- [28]
				45716.006, -- [29]
				45830.896, -- [30]
				45831.246, -- [31]
				45831.546, -- [32]
				45831.546, -- [33]
				45832.496, -- [34]
				45833.846, -- [35]
				45835.346, -- [36]
				45835.846, -- [37]
				45836.079, -- [38]
				45837.663, -- [39]
				45838.146, -- [40]
				45838.329, -- [41]
				45838.846, -- [42]
				45841.33, -- [43]
				45841.846, -- [44]
				45844.346, -- [45]
				45844.847, -- [46]
				45853.847, -- [47]
				45856.847, -- [48]
				46048.207, -- [49]
				46051.091, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 2473,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 3,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Arcane"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 1270,
						["Physical"] = 1203,
					},
					["DOT_Time"] = 0,
					["Damage"] = 2130,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Physical"] = 1622,
						["Fire"] = 247,
						["Arcane"] = 261,
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 157,
								},
							},
							["amount"] = 157,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 261,
								},
								["摔绊"] = {
									["count"] = 31,
								},
								["自动射击"] = {
									["count"] = 886,
								},
								["铁皮手雷"] = {
									["count"] = 247,
								},
								["多重射击"] = {
									["count"] = 548,
								},
							},
							["amount"] = 1973,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 781,
								},
								["断筋"] = {
									["count"] = 87,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 335,
								},
								["肉搏"] = {
									["count"] = 1270,
								},
							},
							["amount"] = 2473,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 0.55,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
								["诱捕"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.78,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 8.280000000000001,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["奥术射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 261,
									["min"] = 261,
									["count"] = 1,
									["amount"] = 261,
								},
							},
							["count"] = 1,
							["amount"] = 261,
						},
						["多重射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 548,
									["min"] = 548,
									["count"] = 1,
									["amount"] = 548,
								},
							},
							["count"] = 1,
							["amount"] = 548,
						},
						["摔绊"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
							},
							["count"] = 1,
							["amount"] = 31,
						},
						["诱捕"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["自动射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 886,
									["min"] = 886,
									["count"] = 1,
									["amount"] = 886,
								},
							},
							["count"] = 1,
							["amount"] = 886,
						},
						["驱散射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 157,
									["min"] = 157,
									["count"] = 1,
									["amount"] = 157,
								},
							},
							["count"] = 1,
							["amount"] = 157,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 247,
									["min"] = 247,
									["count"] = 1,
									["amount"] = 247,
								},
							},
							["count"] = 1,
							["amount"] = 247,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 8.280000000000001,
					["TimeDamaging"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 0.55,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
								["诱捕"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.78,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["Dispelled"] = 2,
					["TimeSpent"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 0.55,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
								["诱捕"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.78,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.82,
								},
								["自动射击"] = {
									["count"] = 0.25,
								},
								["多重射击"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.57,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 0.68,
								},
								["自动射击"] = {
									["count"] = 1.67,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.6,
								},
							},
							["amount"] = 5.45,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 3,
								},
								["驱散射击"] = {
									["count"] = 0.87,
								},
								["自动射击"] = {
									["count"] = 0.8999999999999999,
								},
							},
							["amount"] = 4.77,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.07,
								},
								["自动射击"] = {
									["count"] = 0.22,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.290000000000001,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.9,
								},
								["多重射击"] = {
									["count"] = 1.55,
								},
								["奥术射击"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 7.62,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.17,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 2.24,
						},
					},
					["DamageTaken"] = 8323,
					["ElementDoneAbsorb"] = {
						["Physical"] = 2239,
						["Melee"] = 356,
						["Arcane"] = 354,
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 9,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 8,
						},
						["刺骨"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 19,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 9,
									["amount"] = 0,
								},
							},
							["count"] = 9,
							["amount"] = 0,
						},
						["邪恶攻击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 8,
									["amount"] = 0,
								},
							},
							["count"] = 8,
							["amount"] = 0,
						},
						["刺骨"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["灼热武器"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 19,
									["amount"] = 0,
								},
							},
							["count"] = 19,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 38.21999999999999,
					["ElementTaken"] = {
						["Shadow"] = 178,
						["Physical"] = 3356,
						["Melee"] = 4017,
						["Fire"] = 772,
					},
					["Damage"] = 15725,
					["WhoDispelled"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
					},
					["Healing"] = 0,
					["ElementHitsTaken"] = {
						["Shadow"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 9,
								},
								["Crit"] = {
									["count"] = 3,
								},
								["Hit"] = {
									["count"] = 14,
								},
							},
							["amount"] = 26,
						},
						["Melee"] = {
							["Details"] = {
								["Parry"] = {
									["count"] = 1,
								},
								["Miss"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 5,
								},
								["Hit"] = {
									["count"] = 11,
								},
							},
							["amount"] = 19,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["WhoHealed"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1672,
								},
								["圣光闪现"] = {
									["count"] = 1880,
								},
							},
							["amount"] = 3552,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2126,
								},
							},
							["amount"] = 2126,
						},
						["原味小汤圆"] = {
							["Details"] = {
								["回春术"] = {
									["count"] = 276,
								},
								["愈合"] = {
									["count"] = 609,
								},
							},
							["amount"] = 885,
						},
					},
					["ElementDone"] = {
						["Fire"] = 247,
						["Physical"] = 12513,
						["Melee"] = 1100,
						["Arcane"] = 1865,
					},
					["HealingTaken"] = 6563,
					["DamagedWho"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 261,
								},
								["摔绊"] = {
									["count"] = 31,
								},
								["自动射击"] = {
									["count"] = 886,
								},
								["铁皮手雷"] = {
									["count"] = 247,
								},
								["多重射击"] = {
									["count"] = 548,
								},
							},
							["amount"] = 1973,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 56,
								},
								["肉搏"] = {
									["count"] = 390,
								},
							},
							["amount"] = 446,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 163,
								},
								["驱散射击"] = {
									["count"] = 316,
								},
								["自动射击"] = {
									["count"] = 342,
								},
								["多重射击"] = {
									["count"] = 1578,
								},
								["肉搏"] = {
									["count"] = 354,
								},
							},
							["amount"] = 2753,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 159,
								},
								["摔绊"] = {
									["count"] = 44,
								},
								["自动射击"] = {
									["count"] = 790,
								},
								["多重射击"] = {
									["count"] = 1263,
								},
								["肉搏"] = {
									["count"] = 356,
								},
							},
							["amount"] = 2612,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["多重射击"] = {
									["count"] = 402,
								},
								["自动射击"] = {
									["count"] = 269,
								},
							},
							["amount"] = 671,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 415,
								},
								["驱散射击"] = {
									["count"] = 142,
								},
								["自动射击"] = {
									["count"] = 566,
								},
							},
							["amount"] = 1123,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 779,
								},
								["自动射击"] = {
									["count"] = 2771,
								},
								["多重射击"] = {
									["count"] = 945,
								},
								["奥术射击"] = {
									["count"] = 669,
								},
							},
							["amount"] = 5164,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 322,
								},
								["多重射击"] = {
									["count"] = 463,
								},
								["奥术射击"] = {
									["count"] = 198,
								},
							},
							["amount"] = 983,
						},
					},
					["TimeDamage"] = 38.21999999999999,
					["TimeDamaging"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 0.55,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
								["诱捕"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 0.23,
								},
								["铁皮手雷"] = {
									["count"] = 1.5,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.78,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["驱散射击"] = {
									["count"] = 1.82,
								},
								["自动射击"] = {
									["count"] = 0.25,
								},
								["多重射击"] = {
									["count"] = 3,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 6.57,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 0.68,
								},
								["自动射击"] = {
									["count"] = 1.67,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 1.6,
								},
							},
							["amount"] = 5.45,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奥术射击"] = {
									["count"] = 3,
								},
								["驱散射击"] = {
									["count"] = 0.87,
								},
								["自动射击"] = {
									["count"] = 0.8999999999999999,
								},
							},
							["amount"] = 4.77,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 0.07,
								},
								["自动射击"] = {
									["count"] = 0.22,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["摔绊"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 3.290000000000001,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["瞄准射击"] = {
									["count"] = 1.5,
								},
								["自动射击"] = {
									["count"] = 3.9,
								},
								["多重射击"] = {
									["count"] = 1.55,
								},
								["奥术射击"] = {
									["count"] = 0.67,
								},
							},
							["amount"] = 7.62,
						},
						["大叔不熬夜-黑龙费尔默"] = {
							["Details"] = {
								["自动射击"] = {
									["count"] = 0.17,
								},
								["多重射击"] = {
									["count"] = 1.5,
								},
								["奥术射击"] = {
									["count"] = 0.57,
								},
							},
							["amount"] = 2.24,
						},
					},
					["Attacks"] = {
						["摔绊"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 44,
									["min"] = 44,
									["count"] = 1,
									["amount"] = 44,
								},
								["Hit"] = {
									["max"] = 31,
									["min"] = 31,
									["count"] = 1,
									["amount"] = 31,
								},
								["Parry"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 75,
						},
						["自动射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 442,
									["min"] = 342,
									["count"] = 3,
									["amount"] = 1165,
								},
								["Crit"] = {
									["max"] = 886,
									["min"] = 815,
									["count"] = 3,
									["amount"] = 2548,
								},
								["Hit"] = {
									["max"] = 364,
									["min"] = 259,
									["count"] = 7,
									["amount"] = 2233,
								},
							},
							["count"] = 13,
							["amount"] = 5946,
						},
						["瞄准射击"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 779,
									["min"] = 779,
									["count"] = 1,
									["amount"] = 779,
								},
							},
							["count"] = 1,
							["amount"] = 779,
						},
						["奥术射击"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 471,
									["min"] = 163,
									["count"] = 2,
									["amount"] = 634,
								},
								["Hit"] = {
									["max"] = 261,
									["min"] = 159,
									["count"] = 6,
									["amount"] = 1231,
								},
							},
							["count"] = 8,
							["amount"] = 1865,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 247,
									["min"] = 247,
									["count"] = 1,
									["amount"] = 247,
								},
							},
							["count"] = 1,
							["amount"] = 247,
						},
						["诱捕"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["驱散射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 159,
									["min"] = 159,
									["count"] = 1,
									["amount"] = 159,
								},
								["Crit"] = {
									["max"] = 56,
									["min"] = 56,
									["count"] = 1,
									["amount"] = 56,
								},
								["Hit"] = {
									["max"] = 157,
									["min"] = 142,
									["count"] = 2,
									["amount"] = 299,
								},
							},
							["count"] = 4,
							["amount"] = 514,
						},
						["多重射击"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 481,
									["min"] = 481,
									["count"] = 1,
									["amount"] = 481,
								},
								["Crit"] = {
									["max"] = 1263,
									["min"] = 1113,
									["count"] = 2,
									["amount"] = 2376,
								},
								["Hit"] = {
									["max"] = 548,
									["min"] = 402,
									["count"] = 5,
									["amount"] = 2342,
								},
							},
							["count"] = 8,
							["amount"] = 5199,
						},
						["肉搏"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
									["amount"] = 0,
								},
								["Absorb"] = {
									["max"] = 390,
									["min"] = 354,
									["count"] = 3,
									["amount"] = 1100,
								},
							},
							["count"] = 5,
							["amount"] = 1100,
						},
					},
					["WhoDamaged"] = {
						["龍鳯大盗"] = {
							["Details"] = {
								["灼热武器"] = {
									["count"] = 80,
								},
								["刺骨"] = {
									["count"] = 453,
								},
								["邪恶攻击"] = {
									["count"] = 370,
								},
								["肉搏"] = {
									["count"] = 833,
								},
							},
							["amount"] = 1736,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["冲击波"] = {
									["count"] = 692,
								},
							},
							["amount"] = 692,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 781,
								},
								["断筋"] = {
									["count"] = 87,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 335,
								},
								["肉搏"] = {
									["count"] = 1270,
								},
							},
							["amount"] = 2473,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 178,
								},
							},
							["amount"] = 178,
						},
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 399,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 352,
								},
								["旋风斩"] = {
									["count"] = 271,
								},
								["断筋"] = {
									["count"] = 232,
								},
								["拦截昏迷"] = {
									["count"] = 38,
								},
								["肉搏"] = {
									["count"] = 1914,
								},
							},
							["amount"] = 3206,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["拦截昏迷"] = {
									["count"] = 38,
								},
							},
							["amount"] = 38,
						},
					},
					["ElementHitsDone"] = {
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
								["Absorb"] = {
									["count"] = 6,
								},
								["Hit"] = {
									["count"] = 16,
								},
								["Crit"] = {
									["count"] = 6,
								},
								["Parry"] = {
									["count"] = 1,
								},
							},
							["amount"] = 30,
						},
						["Melee"] = {
							["Details"] = {
								["Miss"] = {
									["count"] = 2,
								},
								["Absorb"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
						["Arcane"] = {
							["Details"] = {
								["Crit"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 6,
								},
							},
							["amount"] = 8,
						},
					},
				},
			},
			["UnitLockout"] = 45472.543,
			["LastActive"] = 46072.542,
		},
		["二零二二十倍 <风之利箭>"] = {
			["GUID"] = "Pet-0-5427-529-1685-7432-010128F7D1",
			["LastEventHealth"] = {
				4353, -- [1]
				4353, -- [2]
				4353, -- [3]
				4353, -- [4]
				4353, -- [5]
				4353, -- [6]
				4353, -- [7]
				4353, -- [8]
			},
			["LastAttackedBy"] = "法神飞舞醉酒-逐风者",
			["LastEventType"] = {
				"DAMAGE", -- [1]
				"DAMAGE", -- [2]
				"DAMAGE", -- [3]
				"DAMAGE", -- [4]
				"DAMAGE", -- [5]
				"DAMAGE", -- [6]
				"DAMAGE", -- [7]
				"DAMAGE", -- [8]
			},
			["TimeWindows"] = {
				["TimeDamage"] = {
					6, -- [1]
				},
				["Damage"] = {
					363, -- [1]
				},
				["DamageTaken"] = {
					941, -- [1]
				},
				["ActiveTime"] = {
					6, -- [1]
				},
			},
			["enClass"] = "PET",
			["unit"] = "二零二二十倍",
			["level"] = 1,
			["LastDamageAbility"] = "冲击波",
			["LastFightIn"] = 3,
			["type"] = "Pet",
			["ownerName"] = "风之利箭",
			["LastDamageTaken"] = 657,
			["TimeLast"] = {
				["ActiveTime"] = 46009.539,
				["TimeDamage"] = 46009.539,
				["OVERALL"] = 46009.539,
				["DamageTaken"] = 45830.546,
				["Damage"] = 46009.539,
			},
			["LastEventHealthMax"] = {
				4353, -- [1]
				4353, -- [2]
				4353, -- [3]
				4353, -- [4]
				4353, -- [5]
				4353, -- [6]
				4353, -- [7]
				4353, -- [8]
			},
			["NextEventNum"] = 9,
			["LastDamageTime"] = 46009.672,
			["LastEvents"] = {
				"二零二二十倍 <风之利箭> 肉搏 清风徐自来-火妖鲁西弗隆 Hit -73 (Physical)", -- [1]
				"二零二二十倍 <风之利箭> 肉搏 清风徐自来-火妖鲁西弗隆 Hit -64 (Physical)", -- [2]
				"渣二哥-黑龙费尔默 旋风斩 二零二二十倍 <风之利箭> Hit -284 (Physical)", -- [3]
				"二零二二十倍 <风之利箭> 肉搏 骑大象找麻姑-逐风者 Hit -68 (Physical)", -- [4]
				"法神飞舞醉酒-逐风者 冲击波 二零二二十倍 <风之利箭> Hit -657 (Fire)", -- [5]
				"二零二二十倍 <风之利箭> 肉搏 指吻礼物馆 Absorb -93 (93 被吸收) (1)", -- [6]
				"指吻礼物馆 冰冻 二零二二十倍 <风之利箭> Resist (Frost)", -- [7]
				"二零二二十倍 <风之利箭> 肉搏 指吻礼物馆 Absorb -65 (65 被吸收) (1)", -- [8]
			},
			["Name"] = "二零二二十倍",
			["LastEventIncoming"] = {
				false, -- [1]
				false, -- [2]
				true, -- [3]
				false, -- [4]
				true, -- [5]
				false, -- [6]
				true, -- [7]
				false, -- [8]
			},
			["LastEventTimes"] = {
				45497.395, -- [1]
				45498.894, -- [2]
				45567.482, -- [3]
				45720.857, -- [4]
				45831.246, -- [5]
				46009.672, -- [6]
				46009.672, -- [7]
				46009.672, -- [8]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 158,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
						["Melee"] = 158,
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
						["Melee"] = 158,
					},
					["PartialAbsorb"] = {
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 158,
								},
							},
							["amount"] = 158,
						},
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 1.5,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 93,
									["min"] = 65,
									["count"] = 2,
									["amount"] = 158,
								},
							},
							["count"] = 2,
							["amount"] = 158,
						},
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 1.5,
					["TimeDamaging"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["WhoDamaged"] = {
						["渣二哥-黑龙费尔默"] = {
							["Details"] = {
								["旋风斩"] = {
									["count"] = 284,
								},
							},
							["amount"] = 284,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["冲击波"] = {
									["count"] = 657,
								},
							},
							["amount"] = 657,
						},
					},
					["ElementHitsTaken"] = {
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Frost"] = {
							["Details"] = {
								["Resist"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Fire"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["PartialAbsorb"] = {
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["PartialResist"] = {
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["Attacks"] = {
						["肉搏"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 93,
									["min"] = 65,
									["count"] = 2,
									["amount"] = 158,
								},
								["Hit"] = {
									["max"] = 73,
									["min"] = 64,
									["count"] = 3,
									["amount"] = 205,
								},
							},
							["count"] = 5,
							["amount"] = 363,
						},
					},
					["TimeSpent"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["DamageTaken"] = 941,
					["ElementDoneAbsorb"] = {
						["Melee"] = 158,
					},
					["ElementDone"] = {
						["Melee"] = 363,
					},
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 5,
						},
					},
					["DamagedWho"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 158,
								},
							},
							["amount"] = 158,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 137,
								},
							},
							["amount"] = 137,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 68,
								},
							},
							["amount"] = 68,
						},
					},
					["TimeDamage"] = 6,
					["TimeDamaging"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["骑大象找麻姑-逐风者"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
					},
					["ElementTaken"] = {
						["Fire"] = 657,
						["Physical"] = 284,
					},
					["ActiveTime"] = 6,
					["Damage"] = 363,
				},
			},
			["UnitLockout"] = 45496.544,
			["LastActive"] = 46009.539,
		},
		["蓝斯洛-火妖鲁西弗隆"] = {
			["GUID"] = "Player-5445-02E88AAE",
			["LastEventHealth"] = {
				3846, -- [1]
				3846, -- [2]
				3676, -- [3]
				3676, -- [4]
				3676, -- [5]
				3676, -- [6]
				4193, -- [7]
				4193, -- [8]
				4193, -- [9]
				4166, -- [10]
				3710, -- [11]
				3710, -- [12]
				3710, -- [13]
				3710, -- [14]
				3710, -- [15]
				3710, -- [16]
				3710, -- [17]
				3710, -- [18]
				3710, -- [19]
				3710, -- [20]
				3155, -- [21]
				3128, -- [22]
				3128, -- [23]
				2489, -- [24]
				2303, -- [25]
				2173, -- [26]
				1978, -- [27]
				1784, -- [28]
				1594, -- [29]
				2285, -- [30]
				2095, -- [31]
				1905, -- [32]
				5101, -- [33]
				4571, -- [34]
				4439, -- [35]
				4439, -- [36]
				4439, -- [37]
				4256, -- [38]
				4023, -- [39]
				4674, -- [40]
				4491, -- [41]
				4491, -- [42]
				5101, -- [43]
				4863, -- [44]
				4582, -- [45]
				3546, -- [46]
				3389, -- [47]
				4169, -- [48]
				5101, -- [49]
				4015, -- [50]
			},
			["LastAttackedBy"] = "因纳夏克-黑龙费尔默",
			["LastEventType"] = {
				"HEAL", -- [1]
				"DAMAGE", -- [2]
				"HEAL", -- [3]
				"HEAL", -- [4]
				"MISC", -- [5]
				"MISC", -- [6]
				"HEAL", -- [7]
				"HEAL", -- [8]
				"DAMAGE", -- [9]
				"DAMAGE", -- [10]
				"DAMAGE", -- [11]
				"DAMAGE", -- [12]
				"DAMAGE", -- [13]
				"DAMAGE", -- [14]
				"DAMAGE", -- [15]
				"DAMAGE", -- [16]
				"DAMAGE", -- [17]
				"DAMAGE", -- [18]
				"HEAL", -- [19]
				"DAMAGE", -- [20]
				"DAMAGE", -- [21]
				"HEAL", -- [22]
				"DAMAGE", -- [23]
				"DAMAGE", -- [24]
				"DAMAGE", -- [25]
				"DAMAGE", -- [26]
				"DAMAGE", -- [27]
				"DAMAGE", -- [28]
				"HEAL", -- [29]
				"DAMAGE", -- [30]
				"DAMAGE", -- [31]
				"HEAL", -- [32]
				"DAMAGE", -- [33]
				"DAMAGE", -- [34]
				"DAMAGE", -- [35]
				"DAMAGE", -- [36]
				"DAMAGE", -- [37]
				"DAMAGE", -- [38]
				"HEAL", -- [39]
				"DAMAGE", -- [40]
				"HEAL", -- [41]
				"HEAL", -- [42]
				"HEAL", -- [43]
				"DAMAGE", -- [44]
				"DAMAGE", -- [45]
				"DAMAGE", -- [46]
				"DAMAGE", -- [47]
				"MISC", -- [48]
				"DAMAGE", -- [49]
				"DAMAGE", -- [50]
			},
			["TimeWindows"] = {
				["TimeHeal"] = {
					45, -- [1]
				},
				["Dispelled"] = {
					1, -- [1]
				},
				["Dispels"] = {
					6, -- [1]
				},
				["Healing"] = {
					27307, -- [1]
				},
				["DamageTaken"] = {
					9189, -- [1]
				},
				["HealingTaken"] = {
					5877, -- [1]
				},
				["Overhealing"] = {
					3894, -- [1]
				},
				["ActiveTime"] = {
					51.53000000000001, -- [1]
				},
				["TimeDamage"] = {
					6.53, -- [1]
				},
				["ManaGain"] = {
					3149, -- [1]
				},
				["DOT_Time"] = {
					21, -- [1]
				},
				["Damage"] = {
					431, -- [1]
				},
			},
			["enClass"] = "PALADIN",
			["unit"] = true,
			["level"] = 60,
			["LastDamageAbility"] = "肉搏",
			["LastFightIn"] = 3,
			["type"] = "Ungrouped",
			["LastDamageTaken"] = 237,
			["LastEventHealthMax"] = {
				5101, -- [1]
				5101, -- [2]
				5101, -- [3]
				5101, -- [4]
				5101, -- [5]
				5101, -- [6]
				5101, -- [7]
				5101, -- [8]
				5101, -- [9]
				5101, -- [10]
				5101, -- [11]
				5101, -- [12]
				5101, -- [13]
				5101, -- [14]
				5101, -- [15]
				5101, -- [16]
				5101, -- [17]
				5101, -- [18]
				5101, -- [19]
				5101, -- [20]
				5101, -- [21]
				5101, -- [22]
				5101, -- [23]
				5101, -- [24]
				5101, -- [25]
				5101, -- [26]
				5101, -- [27]
				5101, -- [28]
				5101, -- [29]
				5101, -- [30]
				5101, -- [31]
				5101, -- [32]
				5101, -- [33]
				5101, -- [34]
				5101, -- [35]
				5101, -- [36]
				5101, -- [37]
				5101, -- [38]
				5101, -- [39]
				5101, -- [40]
				5101, -- [41]
				5101, -- [42]
				5101, -- [43]
				5101, -- [44]
				5101, -- [45]
				5101, -- [46]
				5101, -- [47]
				5101, -- [48]
				5101, -- [49]
				5101, -- [50]
			},
			["LastHealTime"] = 45950.419,
			["Owner"] = false,
			["TimeLast"] = {
				["TimeHeal"] = 45949.535,
				["Dispelled"] = 45697.538,
				["Dispels"] = 45839.546,
				["Healing"] = 45949.535,
				["DamageTaken"] = 45991.538,
				["OVERALL"] = 45991.538,
				["HealingTaken"] = 45919.534,
				["Overhealing"] = 45906.533,
				["ActiveTime"] = 45949.535,
				["TimeDamage"] = 45918.534,
				["ManaGain"] = 45949.535,
				["DOT_Time"] = 45553.531,
				["Damage"] = 45918.534,
			},
			["NextEventNum"] = 46,
			["LastDamageTime"] = 45918.6,
			["LastEvents"] = {
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 风之利箭 Hit +553", -- [1]
				"法神飞舞醉酒-逐风者 点燃 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -170 (Fire)", -- [2]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 风之利箭 Hit +555 (555 过量治疗)", -- [3]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 风之利箭 Hit +562 (562 过量治疗)", -- [4]
				"蓝斯洛-火妖鲁西弗隆 dispels 风之利箭 冰冻 (清洁术)", -- [5]
				"蓝斯洛-火妖鲁西弗隆 dispels 特变电工 冰冻 (清洁术)", -- [6]
				"蓝斯洛-火妖鲁西弗隆 圣光术 Romanx Hit +797", -- [7]
				"蓝斯洛-火妖鲁西弗隆 圣光术 Romanx Crit +1183", -- [8]
				"法神飞舞醉酒-逐风者 冰霜新星 蓝斯洛-火妖鲁西弗隆 Hit -27 (Frost)", -- [9]
				"法神飞舞醉酒-逐风者 冰锥术 蓝斯洛-火妖鲁西弗隆 Hit -456 (Frost)", -- [10]
				"法神飞舞醉酒-逐风者 火焰冲击 蓝斯洛-火妖鲁西弗隆 Immune (Fire)", -- [11]
				"法神飞舞醉酒-逐风者 冲击波 蓝斯洛-火妖鲁西弗隆 Immune (Fire)", -- [12]
				"法神飞舞醉酒-逐风者 魔爆术 蓝斯洛-火妖鲁西弗隆 Immune (Arcane)", -- [13]
				"蓝斯洛-火妖鲁西弗隆 正义审判 指吻礼物馆 Hit -125 (Holy)", -- [14]
				"蓝斯洛-火妖鲁西弗隆 肉搏 指吻礼物馆 Hit -138 (Physical)", -- [15]
				"指吻礼物馆 冰冻 蓝斯洛-火妖鲁西弗隆 Immune (Frost)", -- [16]
				"法神飞舞醉酒-逐风者 魔爆术 蓝斯洛-火妖鲁西弗隆 Immune (Arcane)", -- [17]
				"清风徐自来-火妖鲁西弗隆 心灵尖啸 蓝斯洛-火妖鲁西弗隆 Immune (Shadow)", -- [18]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 烬枫-火妖鲁西弗隆 Hit +558 (247 过量治疗)", -- [19]
				"法神飞舞醉酒-逐风者 火焰冲击 蓝斯洛-火妖鲁西弗隆 Hit -555 (Fire)", -- [20]
				"法神飞舞醉酒-逐风者 冰霜新星 蓝斯洛-火妖鲁西弗隆 Hit -27 (Frost)", -- [21]
				"蓝斯洛-火妖鲁西弗隆 圣光术 原味小汤圆 Hit +1576", -- [22]
				"清风徐自来-火妖鲁西弗隆 心灵震爆 蓝斯洛-火妖鲁西弗隆 Hit -639 (Shadow)", -- [23]
				"法神飞舞醉酒-逐风者 铁皮手雷 蓝斯洛-火妖鲁西弗隆 Hit -186 (Fire)", -- [24]
				"清风徐自来-火妖鲁西弗隆 射击 蓝斯洛-火妖鲁西弗隆 Hit -130 (Shadow)", -- [25]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -195 (Shadow)", -- [26]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -194 (Shadow)", -- [27]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -190 (Shadow)", -- [28]
				"烬枫-火妖鲁西弗隆 圣光闪现 蓝斯洛-火妖鲁西弗隆 Hit +691", -- [29]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -190 (Shadow)", -- [30]
				"清风徐自来-火妖鲁西弗隆 精神鞭笞 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -190 (Shadow)", -- [31]
				"蓝斯洛-火妖鲁西弗隆 圣疗术 蓝斯洛-火妖鲁西弗隆 Hit +5101 (1905 过量治疗)", -- [32]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -194 (Shadow)", -- [33]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -183 (Shadow)", -- [34]
				"蓝斯洛-火妖鲁西弗隆 肉搏 因纳夏克-黑龙费尔默 Hit -89 (Physical)", -- [35]
				"蓝斯洛-火妖鲁西弗隆 正义圣印 因纳夏克-黑龙费尔默 Hit -35 (Holy)", -- [36]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -183 (Shadow)", -- [37]
				"因纳夏克-黑龙费尔默 旋风斩 蓝斯洛-火妖鲁西弗隆 Hit -233 (Physical)", -- [38]
				"烬枫-火妖鲁西弗隆 圣光闪现 蓝斯洛-火妖鲁西弗隆 Hit +651", -- [39]
				"清风徐自来-火妖鲁西弗隆 暗言术：痛 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -183 (Shadow)", -- [40]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 特变电工 Hit +552", -- [41]
				"蓝斯洛-火妖鲁西弗隆 圣光闪现 特变电工 Hit +558", -- [42]
				"蓝斯洛-火妖鲁西弗隆 圣光术 特变电工 Crit +2414", -- [43]
				"薯片儿-逐风者 致死打击 蓝斯洛-火妖鲁西弗隆 Hit -281 (Physical)", -- [44]
				"因纳夏克-黑龙费尔默 肉搏 蓝斯洛-火妖鲁西弗隆 Hit -237 (Physical)", -- [45]
				"法神飞舞醉酒-逐风者 铁皮手雷 蓝斯洛-火妖鲁西弗隆 Hit -157 (Fire)", -- [46]
				"薯片儿-逐风者 肉搏 蓝斯洛-火妖鲁西弗隆 Hit -240 (Physical)", -- [47]
				"烬枫-火妖鲁西弗隆 dispels 蓝斯洛-火妖鲁西弗隆 变形术 (清洁术)", -- [48]
				"法神飞舞醉酒-逐风者 冲击波 蓝斯洛-火妖鲁西弗隆 Crit -1086 (Fire)", -- [49]
				"法神飞舞醉酒-逐风者 点燃 (伤害/跳) 蓝斯洛-火妖鲁西弗隆 Tick -169 (Fire)", -- [50]
			},
			["Name"] = "蓝斯洛-火妖鲁西弗隆",
			["LastEventIncoming"] = {
				false, -- [1]
				true, -- [2]
				false, -- [3]
				false, -- [4]
				false, -- [5]
				false, -- [6]
				false, -- [7]
				false, -- [8]
				true, -- [9]
				true, -- [10]
				true, -- [11]
				true, -- [12]
				true, -- [13]
				false, -- [14]
				false, -- [15]
				true, -- [16]
				true, -- [17]
				true, -- [18]
				false, -- [19]
				true, -- [20]
				true, -- [21]
				false, -- [22]
				true, -- [23]
				true, -- [24]
				true, -- [25]
				true, -- [26]
				true, -- [27]
				true, -- [28]
				true, -- [29]
				true, -- [30]
				true, -- [31]
				true, -- [32]
				true, -- [33]
				true, -- [34]
				false, -- [35]
				false, -- [36]
				true, -- [37]
				true, -- [38]
				true, -- [39]
				true, -- [40]
				false, -- [41]
				false, -- [42]
				false, -- [43]
				true, -- [44]
				true, -- [45]
				true, -- [46]
				true, -- [47]
				true, -- [48]
				true, -- [49]
				true, -- [50]
			},
			["LastEventTimes"] = {
				45833.846, -- [1]
				45835.279, -- [2]
				45836.079, -- [3]
				45837.663, -- [4]
				45838.146, -- [5]
				45839.663, -- [6]
				45864.664, -- [7]
				45867.565, -- [8]
				45871.398, -- [9]
				45872.898, -- [10]
				45874.398, -- [11]
				45876.282, -- [12]
				45877.765, -- [13]
				45879.098, -- [14]
				45879.115, -- [15]
				45879.115, -- [16]
				45879.282, -- [17]
				45884.465, -- [18]
				45886.282, -- [19]
				45889.682, -- [20]
				45896.116, -- [21]
				45896.599, -- [22]
				45898.45, -- [23]
				45899.161, -- [24]
				45901.849, -- [25]
				45902.119, -- [26]
				45905.116, -- [27]
				45905.223, -- [28]
				45905.716, -- [29]
				45906.216, -- [30]
				45907.217, -- [31]
				45907.5, -- [32]
				45908.117, -- [33]
				45917.134, -- [34]
				45918.567, -- [35]
				45918.6, -- [36]
				45920.117, -- [37]
				45920.4, -- [38]
				45920.418, -- [39]
				45923.134, -- [40]
				45923.867, -- [41]
				45925.467, -- [42]
				45950.419, -- [43]
				45990.654, -- [44]
				45991.938, -- [45]
				45692.638, -- [46]
				45695.022, -- [47]
				45698.255, -- [48]
				45831.246, -- [49]
				45833.263, -- [50]
			},
			["Fights"] = {
				["LastFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 518,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["Physical"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
						["Melee"] = 237,
						["Physical"] = 281,
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
						["薯片儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 281,
								},
							},
							["amount"] = 281,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 237,
								},
							},
							["amount"] = 237,
						},
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["CurrentFightData"] = {
					["DOTs"] = {
					},
					["ElementDoneResist"] = {
					},
					["Ressed"] = 0,
					["DamageTaken"] = 0,
					["RageGainedFrom"] = {
					},
					["ElementHitsTaken"] = {
					},
					["DeathCount"] = 0,
					["HOT_Time"] = 0,
					["ElementHitsDone"] = {
					},
					["ElementTakenAbsorb"] = {
					},
					["ElementTaken"] = {
					},
					["DOT_Time"] = 0,
					["Damage"] = 0,
					["ElementTakenBlock"] = {
					},
					["TimeHeal"] = 0,
					["RessedWho"] = {
					},
					["Dispels"] = 0,
					["ElementTakenResist"] = {
					},
					["ElementDoneAbsorb"] = {
					},
					["FAttacks"] = {
					},
					["RunicPowerGainedFrom"] = {
					},
					["ElementDone"] = {
					},
					["PartialAbsorb"] = {
					},
					["DamagedWho"] = {
					},
					["PartialBlock"] = {
					},
					["WhoDamaged"] = {
					},
					["EnergyGainedFrom"] = {
					},
					["PartialResist"] = {
					},
					["CCBroken"] = {
					},
					["ElementDoneBlock"] = {
					},
					["TimeHealing"] = {
					},
					["OverHeals"] = {
					},
					["ManaGainedFrom"] = {
					},
					["RunicPowerGained"] = {
					},
					["CCBreak"] = 0,
					["RageGained"] = {
					},
					["HealedWho"] = {
					},
					["EnergyGain"] = 0,
					["ManaGained"] = {
					},
					["FDamage"] = 0,
					["Interrupts"] = 0,
					["Overhealing"] = 0,
					["TimeSpent"] = {
					},
					["WhoDispelled"] = {
					},
					["InterruptData"] = {
					},
					["RunicPowerGain"] = 0,
					["Heals"] = {
					},
					["WhoHealed"] = {
					},
					["EnergyGained"] = {
					},
					["ActiveTime"] = 0,
					["Healing"] = 0,
					["FDamagedWho"] = {
					},
					["Dispelled"] = 0,
					["Attacks"] = {
					},
					["HealingTaken"] = 0,
					["RageGain"] = 0,
					["TimeDamage"] = 0,
					["TimeDamaging"] = {
					},
					["ManaGain"] = 0,
					["HOTs"] = {
					},
					["DispelledWho"] = {
					},
				},
				["OverallData"] = {
					["DOTs"] = {
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["指吻礼物馆"] = {
									["count"] = 9,
								},
								["清风徐自来-火妖鲁西弗隆"] = {
									["count"] = 3,
								},
								["Yang-逐风者"] = {
									["count"] = 9,
								},
							},
							["amount"] = 21,
						},
					},
					["TimeSpent"] = {
						["特变电工"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 6,
								},
								["圣光闪现"] = {
									["count"] = 10.5,
								},
							},
							["amount"] = 16.5,
						},
						["一罗伊一"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 1,
								},
								["正义审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 2.52,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 2.48,
								},
							},
							["amount"] = 2.48,
						},
						["Romanx"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 6,
								},
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["正义圣印"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.53,
						},
						["原味小汤圆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣疗术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["拦截憨憨"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["风之利箭"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7.5,
						},
					},
					["DamageTaken"] = 9189,
					["ElementDoneAbsorb"] = {
						["Holy"] = 12,
					},
					["Overhealing"] = 3894,
					["ElementTaken"] = {
						["Frost"] = 2325,
						["Melee"] = 895,
						["Fire"] = 2323,
						["Shadow"] = 2471,
						["Physical"] = 1175,
					},
					["DOT_Time"] = 21,
					["Damage"] = 431,
					["TimeHeal"] = 45,
					["Dispels"] = 6,
					["ElementDone"] = {
						["Melee"] = 227,
						["Holy"] = 204,
					},
					["ManaGainedFrom"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣疗术"] = {
									["count"] = 550,
								},
								["恢复法力"] = {
									["count"] = 1159,
								},
								["启发"] = {
									["count"] = 1440,
								},
							},
							["amount"] = 3149,
						},
					},
					["WhoDamaged"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["肉搏"] = {
									["count"] = 237,
								},
								["旋风斩"] = {
									["count"] = 233,
								},
							},
							["amount"] = 470,
						},
						["法神飞舞醉酒-逐风者"] = {
							["Details"] = {
								["火焰冲击"] = {
									["count"] = 555,
								},
								["冰霜新星"] = {
									["count"] = 54,
								},
								["点燃 (伤害/跳)"] = {
									["count"] = 339,
								},
								["冲击波"] = {
									["count"] = 1086,
								},
								["铁皮手雷"] = {
									["count"] = 343,
								},
								["冰锥术"] = {
									["count"] = 456,
								},
							},
							["amount"] = 2833,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["寒冰箭"] = {
									["count"] = 1815,
								},
							},
							["amount"] = 1815,
						},
						["薯片儿-逐风者"] = {
							["Details"] = {
								["致死打击"] = {
									["count"] = 572,
								},
								["重伤 (伤害/跳)"] = {
									["count"] = 295,
								},
								["断筋"] = {
									["count"] = 46,
								},
								["拦截昏迷"] = {
									["count"] = 29,
								},
								["肉搏"] = {
									["count"] = 658,
								},
							},
							["amount"] = 1600,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["心灵震爆"] = {
									["count"] = 639,
								},
								["射击"] = {
									["count"] = 130,
								},
								["暗言术：痛 (伤害/跳)"] = {
									["count"] = 1132,
								},
								["精神鞭笞 (伤害/跳)"] = {
									["count"] = 570,
								},
							},
							["amount"] = 2471,
						},
					},
					["TimeHealing"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣疗术"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["特变电工"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 6,
								},
								["圣光闪现"] = {
									["count"] = 10.5,
								},
							},
							["amount"] = 16.5,
						},
						["Romanx"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 6,
								},
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 9,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["原味小汤圆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 4.5,
						},
						["风之利箭"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1.5,
								},
								["圣光闪现"] = {
									["count"] = 6,
								},
							},
							["amount"] = 7.5,
						},
						["拦截憨憨"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.5,
						},
						["一罗伊一"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 3,
								},
							},
							["amount"] = 3,
						},
					},
					["OverHeals"] = {
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 87,
									["min"] = 87,
									["count"] = 1,
									["amount"] = 87,
								},
								["Hit"] = {
									["max"] = 562,
									["min"] = 247,
									["count"] = 3,
									["amount"] = 1364,
								},
							},
							["count"] = 4,
							["amount"] = 1451,
						},
						["圣疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 1905,
									["min"] = 1905,
									["count"] = 1,
									["amount"] = 1905,
								},
							},
							["count"] = 1,
							["amount"] = 1905,
						},
						["圣光术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 478,
									["min"] = 60,
									["count"] = 2,
									["amount"] = 538,
								},
							},
							["count"] = 2,
							["amount"] = 538,
						},
					},
					["PartialResist"] = {
						["致死打击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 3,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 6,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["射击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冲击波"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["冰冻"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["断筋"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 1,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 2,
						},
						["肉搏"] = {
							["Details"] = {
								["未被抵抗"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 0,
							["amount"] = 4,
						},
					},
					["ManaGained"] = {
						["圣疗术"] = {
							["Details"] = {
								["蓝斯洛-火妖鲁西弗隆"] = {
									["count"] = 550,
								},
							},
							["amount"] = 550,
						},
						["恢复法力"] = {
							["Details"] = {
								["蓝斯洛-火妖鲁西弗隆"] = {
									["count"] = 1159,
								},
							},
							["amount"] = 1159,
						},
						["启发"] = {
							["Details"] = {
								["蓝斯洛-火妖鲁西弗隆"] = {
									["count"] = 1440,
								},
							},
							["amount"] = 1440,
						},
					},
					["PartialAbsorb"] = {
						["致死打击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["重伤 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
						["精神鞭笞 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 3,
									["amount"] = 0,
								},
							},
							["count"] = 3,
							["amount"] = 0,
						},
						["旋风斩"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["点燃 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["拦截昏迷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["暗言术：痛 (伤害/跳)"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 6,
									["amount"] = 0,
								},
							},
							["count"] = 6,
							["amount"] = 0,
						},
						["冰霜新星"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["心灵震爆"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["射击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冲击波"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["寒冰箭"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["魔爆术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["火焰冲击"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["冰冻"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["冰锥术"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["心灵尖啸"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["断筋"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 1,
									["amount"] = 0,
								},
							},
							["count"] = 1,
							["amount"] = 0,
						},
						["铁皮手雷"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 2,
									["amount"] = 0,
								},
							},
							["count"] = 2,
							["amount"] = 0,
						},
						["肉搏"] = {
							["Details"] = {
								["未被吸收"] = {
									["max"] = 0,
									["min"] = 0,
									["count"] = 4,
									["amount"] = 0,
								},
							},
							["count"] = 4,
							["amount"] = 0,
						},
					},
					["ActiveTime"] = 51.53000000000001,
					["WhoDispelled"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["变形术 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
					},
					["Heals"] = {
						["圣光术"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 2414,
									["min"] = 1183,
									["count"] = 2,
									["amount"] = 3597,
								},
								["Hit"] = {
									["max"] = 1672,
									["min"] = 797,
									["count"] = 8,
									["amount"] = 10056,
								},
							},
							["count"] = 10,
							["amount"] = 13653,
						},
						["圣疗术"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 3196,
									["min"] = 3196,
									["count"] = 1,
									["amount"] = 3196,
								},
							},
							["count"] = 1,
							["amount"] = 3196,
						},
						["圣光闪现"] = {
							["Details"] = {
								["Crit"] = {
									["max"] = 829,
									["min"] = 704,
									["count"] = 3,
									["amount"] = 2325,
								},
								["Hit"] = {
									["max"] = 561,
									["min"] = 277,
									["count"] = 16,
									["amount"] = 8133,
								},
							},
							["count"] = 19,
							["amount"] = 10458,
						},
					},
					["Dispelled"] = 1,
					["WhoHealed"] = {
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 2681,
								},
							},
							["amount"] = 2681,
						},
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣疗术"] = {
									["count"] = 3196,
								},
							},
							["amount"] = 3196,
						},
					},
					["Healing"] = 27307,
					["ElementHitsTaken"] = {
						["Frost"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 5,
								},
							},
							["amount"] = 6,
						},
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 4,
						},
						["Arcane"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Fire"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 2,
								},
								["Immune"] = {
									["count"] = 2,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 3,
								},
							},
							["amount"] = 8,
						},
						["Shadow"] = {
							["Details"] = {
								["Immune"] = {
									["count"] = 1,
								},
								["Tick"] = {
									["count"] = 9,
								},
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 12,
						},
						["Physical"] = {
							["Details"] = {
								["Tick"] = {
									["count"] = 4,
								},
								["Crit"] = {
									["count"] = 1,
								},
								["Hit"] = {
									["count"] = 4,
								},
							},
							["amount"] = 9,
						},
					},
					["HealedWho"] = {
						["蓝斯洛-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣疗术"] = {
									["count"] = 3196,
								},
							},
							["amount"] = 3196,
						},
						["特变电工"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 6776,
								},
								["圣光闪现"] = {
									["count"] = 3796,
								},
							},
							["amount"] = 10572,
						},
						["Romanx"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 3629,
								},
								["圣光闪现"] = {
									["count"] = 1621,
								},
							},
							["amount"] = 5250,
						},
						["烬枫-火妖鲁西弗隆"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 311,
								},
							},
							["amount"] = 311,
						},
						["原味小汤圆"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1576,
								},
								["圣光闪现"] = {
									["count"] = 1083,
								},
							},
							["amount"] = 2659,
						},
						["风之利箭"] = {
							["Details"] = {
								["圣光术"] = {
									["count"] = 1672,
								},
								["圣光闪现"] = {
									["count"] = 1880,
								},
							},
							["amount"] = 3552,
						},
						["拦截憨憨"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 522,
								},
							},
							["amount"] = 522,
						},
						["一罗伊一"] = {
							["Details"] = {
								["圣光闪现"] = {
									["count"] = 1245,
								},
							},
							["amount"] = 1245,
						},
					},
					["Attacks"] = {
						["正义圣印"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 35,
									["min"] = 35,
									["count"] = 1,
									["amount"] = 35,
								},
							},
							["count"] = 1,
							["amount"] = 35,
						},
						["奉献 (伤害/跳)"] = {
							["Details"] = {
								["Absorb"] = {
									["max"] = 8,
									["min"] = 4,
									["count"] = 2,
									["amount"] = 12,
								},
								["Tick"] = {
									["max"] = 8,
									["min"] = 4,
									["count"] = 5,
									["amount"] = 32,
								},
							},
							["count"] = 7,
							["amount"] = 44,
						},
						["正义审判"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 125,
									["min"] = 125,
									["count"] = 1,
									["amount"] = 125,
								},
							},
							["count"] = 1,
							["amount"] = 125,
						},
						["肉搏"] = {
							["Details"] = {
								["Hit"] = {
									["max"] = 138,
									["min"] = 89,
									["count"] = 2,
									["amount"] = 227,
								},
							},
							["count"] = 2,
							["amount"] = 227,
						},
					},
					["HealingTaken"] = 5877,
					["ElementHitsDone"] = {
						["Melee"] = {
							["Details"] = {
								["Hit"] = {
									["count"] = 2,
								},
							},
							["amount"] = 2,
						},
						["Holy"] = {
							["Details"] = {
								["Absorb"] = {
									["count"] = 2,
								},
								["Hit"] = {
									["count"] = 2,
								},
								["Tick"] = {
									["count"] = 5,
								},
							},
							["amount"] = 9,
						},
					},
					["TimeDamage"] = 6.53,
					["TimeDamaging"] = {
						["指吻礼物馆"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 1,
								},
								["正义审判"] = {
									["count"] = 1.5,
								},
								["肉搏"] = {
									["count"] = 0.02,
								},
							},
							["amount"] = 2.52,
						},
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["正义圣印"] = {
									["count"] = 0.03,
								},
								["肉搏"] = {
									["count"] = 1.5,
								},
							},
							["amount"] = 1.53,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 2.48,
								},
							},
							["amount"] = 2.48,
						},
					},
					["ManaGain"] = 3149,
					["DamagedWho"] = {
						["因纳夏克-黑龙费尔默"] = {
							["Details"] = {
								["正义圣印"] = {
									["count"] = 35,
								},
								["肉搏"] = {
									["count"] = 89,
								},
							},
							["amount"] = 124,
						},
						["指吻礼物馆"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 12,
								},
								["正义审判"] = {
									["count"] = 125,
								},
								["肉搏"] = {
									["count"] = 138,
								},
							},
							["amount"] = 275,
						},
						["清风徐自来-火妖鲁西弗隆"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 8,
								},
							},
							["amount"] = 8,
						},
						["Yang-逐风者"] = {
							["Details"] = {
								["奉献 (伤害/跳)"] = {
									["count"] = 24,
								},
							},
							["amount"] = 24,
						},
					},
					["DispelledWho"] = {
						["风之利箭"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
								["冰冻 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 2,
						},
						["Romanx"] = {
							["Details"] = {
								["暗言术：痛 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 1,
						},
						["特变电工"] = {
							["Details"] = {
								["冰冻 (清洁术)"] = {
									["count"] = 2,
								},
								["点燃 (清洁术)"] = {
									["count"] = 1,
								},
							},
							["amount"] = 3,
						},
					},
				},
			},
			["UnitLockout"] = 45456.542,
			["LastActive"] = 45991.538,
		},
	},
	["FightNum"] = 4,
	["CombatTimes"] = {
		{
			45451.542, -- [1]
			45756.542, -- [2]
			"01:37:38", -- [3]
			"01:42:42", -- [4]
			"清风徐自来-火妖鲁西弗隆", -- [5]
		}, -- [1]
		{
			45809.545, -- [1]
			45845.547, -- [2]
			"01:43:36", -- [3]
			"01:44:11", -- [4]
			"渣二哥-黑龙费尔默", -- [5]
		}, -- [2]
		{
			45854.547, -- [1]
			45952.536, -- [2]
			"01:44:21", -- [3]
			"01:45:58", -- [4]
			"指吻礼物馆", -- [5]
		}, -- [3]
		{
			45975.537, -- [1]
			46100.549, -- [2]
			"01:46:22", -- [3]
			"01:48:26", -- [4]
			"清风徐自来-火妖鲁西弗隆", -- [5]
		}, -- [4]
	},
	["FoughtWho"] = {
	},
}
