
weizPVPOptions = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["Options"] = {
				["Window"] = {
					["Pinned"] = true,
				},
				["Frames"] = {
					["Width"] = 204.33349609375,
					["Y"] = -204.1666870117188,
					["X"] = 207.4422607421875,
					["Header"] = {
						["Width"] = 204.33349609375,
						["Y"] = -143.6667175292969,
						["Height"] = 25.99999046325684,
						["X"] = 207.4421997070313,
					},
					["Height"] = 94.99998474121094,
				},
			},
		},
	},
}
