
PawnOptions = {
	["LastVersion"] = 2.0807,
	["LastPlayerFullName"] = "红杉沈南鹏-生命烈焰",
	["AutoSelectScales"] = false,
	["ItemLevels"] = {
		{
			["ID"] = 211857,
			["Level"] = 25,
			["Link"] = "|cff0070dd|Hitem:211857::::::::25:::::::::|h[坚韧的皮甲面具]|h|r",
		}, -- [1]
		{
			["ID"] = 20444,
			["Level"] = 23,
			["Link"] = "|cff0070dd|Hitem:20444::::::::25:::::::::|h[哨兵徽章]|h|r",
		}, -- [2]
		{
			["ID"] = 209692,
			["Level"] = 33,
			["Link"] = "|cff0070dd|Hitem:209692::::::::25:::::::::|h[哨兵肩甲]|h|r",
		}, -- [3]
		nil, -- [4]
		{
			["ID"] = 2041,
			["Level"] = 24,
			["Link"] = "|cff0070dd|Hitem:2041::::::::25:::::::::|h[西部荒野外套]|h|r",
		}, -- [5]
		{
			["ID"] = 10403,
			["Level"] = 22,
			["Link"] = "|cff1eff00|Hitem:10403::::::::25:::::::::|h[黑暗迪菲亚腰带]|h|r",
		}, -- [6]
		{
			["ID"] = 15202,
			["Level"] = 18,
			["Link"] = "|cff1eff00|Hitem:15202::::::::25:::::::::|h[自然守护者腿甲]|h|r",
		}, -- [7]
		{
			["ID"] = 9802,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:9802::::::593:180483584:25:::::::::|h[灵猴之超强长靴]|h|r",
		}, -- [8]
		{
			["ID"] = 15348,
			["Level"] = 26,
			["Link"] = "|cff1eff00|Hitem:15348::::::111:633545088:25:::::::::|h[敏捷之拓荒者护腕]|h|r",
		}, -- [9]
		{
			["ID"] = 10401,
			["Level"] = 18,
			["Link"] = "|cff1eff00|Hitem:10401::::::::25:::::::::|h[黑暗迪菲亚手套]|h|r",
		}, -- [10]
		{
			["ID"] = 12007,
			["Level"] = 25,
			["AlsoFitsIn"] = 12,
			["Link"] = "|cff1eff00|Hitem:12007::::::676:1854880000:25:::::::::|h[猛虎之牧场戒指]|h|r",
		}, -- [11]
		{
			["ID"] = 20439,
			["Level"] = 23,
			["AlsoFitsIn"] = 11,
			["Link"] = "|cff0070dd|Hitem:20439::::::::25:::::::::|h[保护者指环]|h|r",
		}, -- [12]
		{
			["ID"] = 211449,
			["Level"] = 33,
			["AlsoFitsIn"] = 14,
			["Link"] = "|cff0070dd|Hitem:211449::::::::25:::::::::|h[复仇者的虚空珍珠]|h|r",
		}, -- [13]
		{
			["ID"] = 21568,
			["Level"] = 25,
			["AlsoFitsIn"] = 13,
			["Link"] = "|cff0070dd|Hitem:21568::::::::25:::::::::|h[义务符文]|h|r",
		}, -- [14]
		{
			["ID"] = 5193,
			["Level"] = 25,
			["Link"] = "|cff0070dd|Hitem:5193::::::::25:::::::::|h[兄弟会斗篷]|h|r",
		}, -- [15]
		{
			["ID"] = 209525,
			["Level"] = 35,
			["Link"] = "|cff0070dd|Hitem:209525::::::::25:::::::::|h[磨利的黑水刀]|h|r",
		}, -- [16]
		{
			["ID"] = 209580,
			["Level"] = 33,
			["Link"] = "|cff0070dd|Hitem:209580::::::::25:::::::::|h[狂涌尘风]|h|r",
		}, -- [17]
		{
			["ID"] = 3039,
			["Level"] = 23,
			["Link"] = "|cff1eff00|Hitem:3039::::::::25:::::::::|h[灰木短弓]|h|r",
		}, -- [18]
	},
}
PawnMrRobotScaleProviderOptions = nil
PawnClassicScaleProviderOptions = {
	["LastClass"] = "ROGUE",
	["LastAdded"] = 3,
}
