
weizPVPOptions = {
	["profileKeys"] = {
		["特變電工 - 玉石礦坑"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["Options"] = {
				["Frames"] = {
					["Point"] = "BOTTOM",
					["Width"] = 188.222412109375,
					["Y"] = 229.6665344238281,
					["X"] = -469.4995727539063,
					["Header"] = {
						["Width"] = 188.222412109375,
						["Y"] = -281.3334503173828,
						["Height"] = 25.99999046325684,
						["X"] = -469.4995727539063,
					},
					["Height"] = 76.00000762939453,
				},
			},
		},
	},
}
