
ARKINVDB = {
	["global"] = {
		["player"] = {
			["data"] = {
				["特变电工 - 鱼人摩洛克"] = {
					["info"] = {
						["guid"] = "Player-5458-02F6D2A3",
						["class"] = "WARRIOR",
						["class_local"] = "战士",
						["race"] = "Human",
						["proj"] = 2,
						["realm"] = "鱼人摩洛克",
						["isplayer"] = true,
						["money"] = 7827996,
						["gender"] = 2,
						["itemlevel"] = 1,
						["name"] = "特变电工",
						["faction"] = "Alliance",
						["race_local"] = "人类",
						["level"] = 60,
						["player_id"] = "特变电工 - 鱼人摩洛克",
						["faction_local"] = "联盟",
					},
					["location"] = {
						{
							["bag"] = {
								{
									["q"] = 0,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 2,
											["age"] = 27322196,
											["h"] = "|cff1eff00|Hitem:17774::::::::60:::::::::|h[天选者印记]|h|r",
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 1,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [1]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:6948::::::::60:::::::::|h[炉石]|h|r",
											["slot_id"] = 2,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [2]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 1,
											["slot_id"] = 3,
											["sb"] = 0,
											["count"] = 167,
											["h"] = "|cffffffff|Hitem:11285::::::::60:::::::::|h[锯齿箭]|h|r",
											["age"] = 27322200,
										}, -- [3]
										{
											["q"] = 2,
											["age"] = 27330425,
											["h"] = "|cff1eff00|Hitem:9531::::::::60:::::::::|h[晶岩肩铠]|h|r",
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 4,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [4]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 5,
											["h"] = "|cffffffff|Hitem:8076::::::::60:::::::::|h[魔法甜面包]|h|r",
											["age"] = 27333480,
										}, -- [5]
										{
											["q"] = 1,
											["age"] = 27333688,
											["h"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
											["count"] = 2,
											["sb"] = 0,
											["slot_id"] = 6,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [6]
										{
											["q"] = 1,
											["age"] = 27330863,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 7,
											["h"] = "|cffffffff|Hitem:12264::::::::60:::::::::|h[座狼笼]|h|r",
											["bag_id"] = 1,
										}, -- [7]
										{
											["q"] = 1,
											["age"] = 27325044,
											["h"] = "|cffffffff|Hitem:14529::::::::60:::::::::|h[符文布绷带]|h|r",
											["count"] = 19,
											["sb"] = 0,
											["slot_id"] = 8,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [8]
										{
											["q"] = 1,
											["age"] = 27325044,
											["loc_id"] = 1,
											["slot_id"] = 9,
											["sb"] = 0,
											["count"] = 5,
											["h"] = "|cffffffff|Hitem:14529::::::::60:::::::::|h[符文布绷带]|h|r",
											["bag_id"] = 1,
										}, -- [9]
										{
											["q"] = 1,
											["age"] = 27333671,
											["loc_id"] = 1,
											["count"] = 2,
											["sb"] = 0,
											["slot_id"] = 10,
											["h"] = "|cffffffff|Hitem:13446::::::::60:::::::::|h[特效治疗药水]|h|r",
											["bag_id"] = 1,
										}, -- [10]
										{
											["q"] = 1,
											["age"] = 27330863,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 11,
											["h"] = "|cffffffff|Hitem:12411::::::::60:::::::::|h[第三块摩沙鲁石板]|h|r",
											["bag_id"] = 1,
										}, -- [11]
										{
											["q"] = 1,
											["age"] = 27320789,
											["h"] = "|cffffffff|Hitem:12529::::::::60:::::::::|h[烟网蜘蛛笼]|h|r",
											["slot_id"] = 12,
											["sb"] = 3,
											["count"] = 1,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [12]
										{
											["q"] = 1,
											["age"] = 27320202,
											["h"] = "|cffffffff|Hitem:8766::::::::60:::::::::|h[晨露酒]|h|r",
											["count"] = 3,
											["sb"] = 0,
											["slot_id"] = 13,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [13]
										{
											["q"] = 1,
											["age"] = 27326432,
											["h"] = "|cffffffff|Hitem:17310::::::::60:::::::::|h[海神之水]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 14,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [14]
										{
											["q"] = 1,
											["age"] = 27330419,
											["loc_id"] = 1,
											["count"] = 3,
											["sb"] = 3,
											["slot_id"] = 15,
											["h"] = "|cffffffff|Hitem:12938::::::::60:::::::::|h[英雄之血]|h|r",
											["bag_id"] = 1,
										}, -- [15]
										{
											["q"] = 1,
											["age"] = 27301446,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 16,
											["h"] = "|cffffffff|Hitem:3898::::::::60:::::::::|h[图书馆手稿]|h|r",
											["bag_id"] = 1,
										}, -- [16]
										{
											["q"] = 1,
											["age"] = 27330820,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 17,
											["h"] = "|cffffffff|Hitem:12284::::::::60:::::::::|h[龙灵采集器900型]|h|r",
											["bag_id"] = 1,
										}, -- [17]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:8545::::::::60:::::::::|h[厚魔纹绷带]|h|r",
											["count"] = 5,
											["sb"] = 0,
											["slot_id"] = 18,
											["loc_id"] = 1,
											["age"] = 27317737,
										}, -- [18]
										{
											["q"] = 1,
											["age"] = 27333688,
											["h"] = "|cffffffff|Hitem:18945::::::::60:::::::::|h[黑铁残油]|h|r",
											["loc_id"] = 1,
											["slot_id"] = 19,
											["sb"] = 0,
											["count"] = 6,
											["bag_id"] = 1,
										}, -- [19]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:13446::::::::60:::::::::|h[特效治疗药水]|h|r",
											["slot_id"] = 20,
											["sb"] = 0,
											["count"] = 5,
											["loc_id"] = 1,
											["age"] = 27333671,
										}, -- [20]
									},
									["bag_id"] = 1,
									["loc_id"] = 1,
									["count"] = 20,
									["status"] = -3,
									["texture"] = "Interface\\Icons\\INV_Misc_Bag_07_Green",
								}, -- [1]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 1,
											["bag_id"] = 2,
											["loc_id"] = 1,
											["count"] = 20,
											["sb"] = 0,
											["slot_id"] = 1,
											["h"] = "|cffffffff|Hitem:8076::::::::60:::::::::|h[魔法甜面包]|h|r",
											["age"] = 27333480,
										}, -- [1]
										{
											["q"] = 1,
											["bag_id"] = 2,
											["loc_id"] = 1,
											["count"] = 20,
											["sb"] = 0,
											["slot_id"] = 2,
											["h"] = "|cffffffff|Hitem:8076::::::::60:::::::::|h[魔法甜面包]|h|r",
											["age"] = 27333480,
										}, -- [2]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:22257::::::::60:::::::::|h[血块指环]|h|r",
											["slot_id"] = 3,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 2,
											["count"] = 1,
										}, -- [3]
										{
											["q"] = 1,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["h"] = "|cffffffff|Hitem:4623::::::::60:::::::::|h[次级石盾药水]|h|r",
											["bag_id"] = 2,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:9172::::::::60:::::::::|h[隐形药水]|h|r",
											["count"] = 3,
											["sb"] = 0,
											["loc_id"] = 1,
											["bag_id"] = 2,
											["slot_id"] = 5,
										}, -- [5]
										{
											["q"] = 1,
											["age"] = 27330863,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 6,
											["h"] = "|cffffffff|Hitem:12412::::::::60:::::::::|h[第四块摩沙鲁石板]|h|r",
											["bag_id"] = 2,
										}, -- [6]
										{
											["q"] = 3,
											["bag_id"] = 2,
											["age"] = 27333688,
											["h"] = "|cff0070dd|Hitem:11678::::::::60:::::::::|h[阿努希尔之壳]|h|r",
											["slot_id"] = 7,
											["sb"] = 3,
											["count"] = 1,
											["loc_id"] = 1,
										}, -- [7]
										{
											["q"] = 1,
											["bag_id"] = 2,
											["loc_id"] = 1,
											["slot_id"] = 8,
											["sb"] = 0,
											["count"] = 5,
											["h"] = "|cffffffff|Hitem:13446::::::::60:::::::::|h[特效治疗药水]|h|r",
											["age"] = 27333671,
										}, -- [8]
										{
											["q"] = 3,
											["bag_id"] = 2,
											["h"] = "|cff0070dd|Hitem:18357::::::::60:::::::::|h[防御宝典]|h|r",
											["slot_id"] = 9,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333741,
										}, -- [9]
										{
											["q"] = 1,
											["r"] = true,
											["age"] = 27330863,
											["loc_id"] = 1,
											["slot_id"] = 10,
											["sb"] = 3,
											["bag_id"] = 2,
											["count"] = 1,
											["h"] = "|cffffffff|Hitem:12730::::::::60:::::::::|h[瓦罗什的卷轴]|h|r",
										}, -- [10]
										{
											["q"] = 1,
											["bag_id"] = 2,
											["loc_id"] = 1,
											["slot_id"] = 11,
											["sb"] = 0,
											["count"] = 1,
											["h"] = "|cffffffff|Hitem:13289::::::::60:::::::::|h[埃根的冲击器]|h|r",
											["age"] = 27330820,
										}, -- [11]
										{
											["q"] = 3,
											["bag_id"] = 2,
											["h"] = "|cff0070dd|Hitem:16996::::::::60:::::::::|h[血木猎弓]|h|r",
											["slot_id"] = 12,
											["sb"] = 3,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333772,
										}, -- [12]
										{
											["q"] = 1,
											["bag_id"] = 2,
											["loc_id"] = 1,
											["slot_id"] = 13,
											["sb"] = 3,
											["count"] = 1,
											["h"] = "|cffffffff|Hitem:11474::::::::60:::::::::|h[精龙的蛋]|h|r",
											["age"] = 27320058,
										}, -- [13]
										{
											["q"] = 1,
											["bag_id"] = 2,
											["loc_id"] = 1,
											["count"] = 6,
											["sb"] = 0,
											["slot_id"] = 14,
											["h"] = "|cffffffff|Hitem:14530::::::::60:::::::::|h[厚符文布绷带]|h|r",
											["age"] = 27330820,
										}, -- [14]
									},
									["bag_id"] = 2,
									["h"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
									["count"] = 14,
									["status"] = -3,
									["loc_id"] = 1,
									["texture"] = 133652,
								}, -- [2]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 1,
											["bag_id"] = 3,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 1,
											["h"] = "|cffffffff|Hitem:12846::::::::60:::::::::|h[银色黎明委任徽章]|h|r",
											["age"] = 27330863,
										}, -- [1]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:17309::::::::60:::::::::|h[不谐护腕]|h|r",
											["count"] = 12,
											["sb"] = 0,
											["loc_id"] = 1,
											["bag_id"] = 3,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = 1,
											["age"] = 27323380,
											["loc_id"] = 1,
											["count"] = 19,
											["sb"] = 0,
											["slot_id"] = 3,
											["h"] = "|cffffffff|Hitem:8952::::::::60:::::::::|h[烤鹌鹑]|h|r",
											["bag_id"] = 3,
										}, -- [3]
										{
											["q"] = 3,
											["bag_id"] = 3,
											["h"] = "|cff0070dd|Hitem:16309::::::::60:::::::::|h[龙火护符]|h|r",
											["slot_id"] = 4,
											["sb"] = 3,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [4]
										{
											["q"] = 4,
											["age"] = 27332255,
											["h"] = "|cffa335ee|Hitem:18777::::::::60:::::::::|h[迅捷棕马]|h|r",
											["slot_id"] = 5,
											["sb"] = 3,
											["count"] = 1,
											["loc_id"] = 1,
											["bag_id"] = 3,
										}, -- [5]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:12534::::::::60:::::::::|h[欧莫克的头颅]|h|r",
											["slot_id"] = 6,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 3,
											["count"] = 1,
										}, -- [6]
										{
											["q"] = 2,
											["age"] = 27330783,
											["loc_id"] = 1,
											["slot_id"] = 7,
											["sb"] = 3,
											["count"] = 5,
											["h"] = "|cff1eff00|Hitem:20560::::::::60:::::::::|h[奥特兰克山谷荣誉奖章]|h|r",
											["bag_id"] = 3,
										}, -- [7]
										{
											["q"] = 1,
											["bag_id"] = 3,
											["h"] = "|cffffffff|Hitem:21928::::::::60:::::::::|h[冬泉谷血样]|h|r",
											["slot_id"] = 8,
											["sb"] = 0,
											["count"] = 15,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [8]
										{
											["q"] = 0,
											["bag_id"] = 3,
											["h"] = "|cff9d9d9d|Hitem:11408::::::::60:::::::::|h[熊的下颚]|h|r",
											["slot_id"] = 9,
											["sb"] = 0,
											["count"] = 6,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [9]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:13174::::::::60:::::::::|h[瘟疫肉块]|h|r",
											["count"] = 17,
											["sb"] = 0,
											["loc_id"] = 1,
											["bag_id"] = 3,
											["slot_id"] = 10,
										}, -- [10]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:12219::::::::60:::::::::|h[原始晋升印章]|h|r",
											["slot_id"] = 11,
											["sb"] = 0,
											["loc_id"] = 1,
											["bag_id"] = 3,
											["count"] = 1,
										}, -- [11]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:1490::::::::60:::::::::|h[守护之符]|h|r",
											["slot_id"] = 12,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 3,
											["count"] = 1,
										}, -- [12]
										{
											["q"] = 0,
											["bag_id"] = 3,
											["h"] = "|cff9d9d9d|Hitem:11409::::::::60:::::::::|h[熊腰肉]|h|r",
											["count"] = 6,
											["sb"] = 0,
											["slot_id"] = 13,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [13]
										{
											["q"] = 0,
											["bag_id"] = 3,
											["h"] = "|cff9d9d9d|Hitem:11411::::::::60:::::::::|h[粗壮的熊骨]|h|r",
											["slot_id"] = 14,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [14]
									},
									["bag_id"] = 3,
									["h"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
									["count"] = 14,
									["status"] = -3,
									["loc_id"] = 1,
									["texture"] = 133652,
								}, -- [3]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 3,
											["bag_id"] = 4,
											["h"] = "|cff0070dd|Hitem:12602:929:::::::60:::::::::|h[龙人之盾]|h|r",
											["slot_id"] = 1,
											["sb"] = 3,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27332120,
										}, -- [1]
										{
											["q"] = 2,
											["bag_id"] = 4,
											["loc_id"] = 1,
											["slot_id"] = 2,
											["sb"] = 0,
											["count"] = 2,
											["h"] = "|cff1eff00|Hitem:11754::::::::60:::::::::|h[黑钻石]|h|r",
											["age"] = 27325021,
										}, -- [2]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:12530::::::::60:::::::::|h[尖塔蜘蛛卵]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["loc_id"] = 1,
											["bag_id"] = 4,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:10243::::::1208:1787980928:60:::::::::|h[野熊之重型板层束带]|h|r",
											["count"] = 1,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 4,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["h"] = "|cff9d9d9d|Hitem:11411::::::::60:::::::::|h[粗壮的熊骨]|h|r",
											["slot_id"] = 5,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [5]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["h"] = "|cff9d9d9d|Hitem:11410::::::::60:::::::::|h[熊爪]|h|r",
											["slot_id"] = 6,
											["sb"] = 0,
											["count"] = 4,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [6]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["h"] = "|cff9d9d9d|Hitem:11411::::::::60:::::::::|h[粗壮的熊骨]|h|r",
											["slot_id"] = 7,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [7]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["h"] = "|cff9d9d9d|Hitem:11411::::::::60:::::::::|h[粗壮的熊骨]|h|r",
											["slot_id"] = 8,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [8]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:11086::::::::60:::::::::|h[保护者迦萨斯]|h|r",
											["slot_id"] = 9,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 4,
											["count"] = 1,
										}, -- [9]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["h"] = "|cff9d9d9d|Hitem:4580::::::::60:::::::::|h[虎牙]|h|r",
											["slot_id"] = 10,
											["sb"] = 0,
											["count"] = 3,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [10]
										{
											["q"] = 1,
											["bag_id"] = 4,
											["h"] = "|cffffffff|Hitem:12202::::::::60:::::::::|h[虎肉]|h|r",
											["count"] = 8,
											["sb"] = 0,
											["slot_id"] = 11,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [11]
										{
											["q"] = 3,
											["bag_id"] = 4,
											["h"] = "|cff0070dd|Hitem:13204::::::::60:::::::::|h[巴什古德之锤]|h|r",
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 12,
											["loc_id"] = 1,
											["age"] = 27332158,
										}, -- [12]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:12021::::::::60:::::::::|h[盾甲铁靴]|h|r",
											["count"] = 1,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 4,
											["slot_id"] = 13,
										}, -- [13]
										{
											["q"] = 1,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 3,
											["h"] = "|cffffffff|Hitem:7442::::::::60:::::::::|h[基尔卡克的钥匙]|h|r",
											["bag_id"] = 4,
											["slot_id"] = 14,
										}, -- [14]
									},
									["bag_id"] = 4,
									["h"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
									["count"] = 14,
									["status"] = -3,
									["loc_id"] = 1,
									["texture"] = 133652,
								}, -- [4]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:18718::::::::60:::::::::|h[大十字军的头盔]|h|r",
											["slot_id"] = 1,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 5,
											["count"] = 1,
										}, -- [1]
										{
											["q"] = 0,
											["bag_id"] = 5,
											["h"] = "|cff9d9d9d|Hitem:1688::::::::60:::::::::|h[柔软的尾巴]|h|r",
											["count"] = 5,
											["sb"] = 0,
											["slot_id"] = 2,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [2]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:12712::::::::60:::::::::|h[瓦罗什的魔精]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["loc_id"] = 1,
											["bag_id"] = 5,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 0,
											["bag_id"] = 5,
											["h"] = "|cff9d9d9d|Hitem:4581::::::::60:::::::::|h[小块的优质毛皮]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 4,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [4]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:11910::::::::60:::::::::|h[珠宝缀饰腿甲]|h|r",
											["slot_id"] = 5,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 5,
											["count"] = 1,
										}, -- [5]
										{
											["q"] = 1,
											["bag_id"] = 5,
											["h"] = "|cffffffff|Hitem:8146::::::::60:::::::::|h[邪恶之爪]|h|r",
											["slot_id"] = 6,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["age"] = 27333816,
										}, -- [6]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:13381::::::::60:::::::::|h[炮手长靴]|h|r",
											["slot_id"] = 7,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 5,
											["count"] = 1,
										}, -- [7]
										{
											["q"] = 0,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["age"] = 27333816,
											["h"] = "|cff9d9d9d|Hitem:1688::::::::60:::::::::|h[柔软的尾巴]|h|r",
											["bag_id"] = 5,
											["slot_id"] = 8,
										}, -- [8]
										{
											["q"] = 0,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 5,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:9410::::::1208:1184142464:60:::::::::|h[野熊之山壁之拳]|h|r",
											["slot_id"] = 10,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 5,
											["count"] = 1,
										}, -- [10]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:12345::::::::60:::::::::|h[比修的装置]|h|r",
											["slot_id"] = 11,
											["sb"] = 0,
											["loc_id"] = 1,
											["bag_id"] = 5,
											["count"] = 1,
										}, -- [11]
										{
											["q"] = 0,
											["loc_id"] = 1,
											["slot_id"] = 12,
											["sb"] = 0,
											["bag_id"] = 5,
											["count"] = 1,
										}, -- [12]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:13401::::::::60:::::::::|h[提米的手]|h|r",
											["count"] = 1,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 5,
											["slot_id"] = 13,
										}, -- [13]
										{
											["q"] = 0,
											["loc_id"] = 1,
											["slot_id"] = 14,
											["sb"] = 0,
											["bag_id"] = 5,
											["count"] = 1,
										}, -- [14]
									},
									["bag_id"] = 5,
									["h"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
									["count"] = 14,
									["status"] = -3,
									["empty"] = 3,
									["loc_id"] = 1,
									["texture"] = 133652,
								}, -- [5]
							},
							["slot_count"] = 76,
						}, -- [1]
						{
							["bag"] = {
								{
									["type"] = 3,
									["count"] = 32,
									["slot"] = {
										{
											["q"] = 1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 1,
											["bag_id"] = 1,
											["age"] = 27325021,
											["h"] = "|cffffffff|Hitem:11000::::::::60:::::::::|h[暗炉钥匙]|h|r",
										}, -- [1]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 5,
										}, -- [5]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 6,
										}, -- [6]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 7,
										}, -- [7]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 8,
										}, -- [8]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 10,
										}, -- [10]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 11,
										}, -- [11]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 12,
										}, -- [12]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 13,
										}, -- [13]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 14,
										}, -- [14]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 15,
										}, -- [15]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 16,
										}, -- [16]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 17,
										}, -- [17]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 18,
										}, -- [18]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 19,
										}, -- [19]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 20,
										}, -- [20]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 21,
										}, -- [21]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 22,
										}, -- [22]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 23,
										}, -- [23]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 24,
										}, -- [24]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 25,
										}, -- [25]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 26,
										}, -- [26]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 27,
										}, -- [27]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 28,
										}, -- [28]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 29,
										}, -- [29]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 30,
										}, -- [30]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 31,
										}, -- [31]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 32,
										}, -- [32]
									},
									["status"] = -3,
									["empty"] = 31,
									["bag_id"] = 1,
									["loc_id"] = 2,
								}, -- [1]
							},
							["slot_count"] = 32,
						}, -- [2]
						{
							["slot_count"] = 66,
							["bag"] = {
								{
									["q"] = 0,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:3655::::::::58:::::::::|h[抛光盾牌]|h|r",
											["slot_id"] = 1,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [1]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:9418::::::::58:::::::::|h[斩石者]|h|r",
											["slot_id"] = 2,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [2]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:10455::::::::58:::::::::|h[被禁锢的伊兰尼库斯精华]|h|r",
											["slot_id"] = 3,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [3]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:17746::::::::58:::::::::|h[诺克赛恩的镣铐]|h|r",
											["slot_id"] = 4,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [4]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:12065::::::::58:::::::::|h[元素屏障]|h|r",
											["slot_id"] = 5,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [5]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:9958::::::1200:687029632:58:::::::::|h[野熊之好战者的圆盾]|h|r",
											["slot_id"] = 6,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [6]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:19141::::::::58:::::::::|h[丝瓜]|h|r",
											["slot_id"] = 7,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [7]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:2820::::::::58:::::::::|h[灵巧秒表]|h|r",
											["slot_id"] = 8,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [8]
										{
											["q"] = 2,
											["loc_id"] = 3,
											["slot_id"] = 9,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["h"] = "|cff1eff00|Hitem:9240::::::::58:::::::::|h[祖尔法拉克之槌]|h|r",
										}, -- [9]
										{
											["q"] = 3,
											["loc_id"] = 3,
											["slot_id"] = 10,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["h"] = "|cff0070dd|Hitem:17191::::::::58:::::::::|h[塞雷布拉斯节杖]|h|r",
										}, -- [10]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:10740::::::::58:::::::::|h[百夫长腿甲]|h|r",
											["slot_id"] = 11,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [11]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:13443::::::::58:::::::::|h[超强法力药水]|h|r",
											["slot_id"] = 12,
											["sb"] = 0,
											["count"] = 2,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [12]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:3827::::::::58:::::::::|h[法力药水]|h|r",
											["slot_id"] = 13,
											["sb"] = 0,
											["count"] = 2,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [13]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:6149::::::::58:::::::::|h[强效法力药水]|h|r",
											["slot_id"] = 14,
											["sb"] = 0,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [14]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:4338::::::::58:::::::::|h[魔纹布]|h|r",
											["slot_id"] = 15,
											["sb"] = 0,
											["count"] = 17,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [15]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:11176::::::::58:::::::::|h[梦境之尘]|h|r",
											["slot_id"] = 16,
											["sb"] = 0,
											["count"] = 2,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [16]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:11137::::::::58:::::::::|h[幻象之尘]|h|r",
											["slot_id"] = 17,
											["sb"] = 0,
											["count"] = 8,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [17]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:16202::::::::58:::::::::|h[次级不灭精华]|h|r",
											["slot_id"] = 18,
											["sb"] = 0,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [18]
										{
											["q"] = 3,
											["h"] = "|cff0070dd|Hitem:14343::::::::58:::::::::|h[小块魔光碎片]|h|r",
											["slot_id"] = 19,
											["sb"] = 0,
											["count"] = 2,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [19]
										{
											["q"] = 2,
											["h"] = "|cff1eff00|Hitem:7910::::::::58:::::::::|h[红宝石]|h|r",
											["slot_id"] = 20,
											["sb"] = 0,
											["count"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [20]
										{
											["q"] = 2,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 21,
											["o"] = true,
											["bag_id"] = 1,
											["h"] = "|cff1eff00|Hitem:4638::::::::58:::::::::|h[强化钢质宝箱]|h|r",
										}, -- [21]
										{
											["q"] = 2,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 22,
											["o"] = true,
											["bag_id"] = 1,
											["h"] = "|cff1eff00|Hitem:4638::::::::58:::::::::|h[强化钢质宝箱]|h|r",
										}, -- [22]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:11078::::::::58:::::::::|h[遗物宝箱钥匙]|h|r",
											["slot_id"] = 23,
											["sb"] = 0,
											["count"] = 18,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [23]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:7068::::::::58:::::::::|h[元素火焰]|h|r",
											["slot_id"] = 24,
											["sb"] = 0,
											["count"] = 2,
											["bag_id"] = 1,
											["loc_id"] = 3,
										}, -- [24]
									},
									["bag_id"] = 1,
									["loc_id"] = 3,
									["count"] = 24,
									["status"] = -3,
									["texture"] = "Interface\\Icons\\INV_Box_02",
								}, -- [1]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 1,
										}, -- [1]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 5,
										}, -- [5]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 6,
										}, -- [6]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 7,
										}, -- [7]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 8,
										}, -- [8]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 10,
										}, -- [10]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 11,
										}, -- [11]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 12,
										}, -- [12]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 13,
										}, -- [13]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 2,
											["slot_id"] = 14,
										}, -- [14]
									},
									["bag_id"] = 2,
									["loc_id"] = 3,
									["count"] = 14,
									["status"] = -3,
									["empty"] = 14,
									["h"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
									["texture"] = 133652,
								}, -- [2]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 1,
										}, -- [1]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 5,
										}, -- [5]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 6,
										}, -- [6]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 7,
										}, -- [7]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 8,
										}, -- [8]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 10,
										}, -- [10]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 11,
										}, -- [11]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 12,
										}, -- [12]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 13,
										}, -- [13]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 3,
											["slot_id"] = 14,
										}, -- [14]
									},
									["bag_id"] = 3,
									["loc_id"] = 3,
									["count"] = 14,
									["status"] = -3,
									["empty"] = 14,
									["h"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
									["texture"] = 133652,
								}, -- [3]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 1,
										}, -- [1]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 5,
										}, -- [5]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 6,
										}, -- [6]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 7,
										}, -- [7]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 8,
										}, -- [8]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 10,
										}, -- [10]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 11,
										}, -- [11]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 12,
										}, -- [12]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 13,
										}, -- [13]
										{
											["q"] = 0,
											["loc_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 14,
										}, -- [14]
									},
									["bag_id"] = 4,
									["loc_id"] = 3,
									["count"] = 14,
									["status"] = -3,
									["empty"] = 14,
									["h"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
									["texture"] = 133652,
								}, -- [4]
								{
									["q"] = 0,
									["type"] = 1,
									["bag_id"] = 5,
									["loc_id"] = 3,
									["status"] = -5,
									["texture"] = "Interface\\PaperDoll\\UI-PaperDoll-Slot-Bag",
								}, -- [5]
								{
									["q"] = 0,
									["type"] = 1,
									["bag_id"] = 6,
									["loc_id"] = 3,
									["status"] = -5,
									["texture"] = "Interface\\PaperDoll\\UI-PaperDoll-Slot-Bag",
								}, -- [6]
								{
									["q"] = 0,
									["type"] = 1,
									["bag_id"] = 7,
									["loc_id"] = 3,
									["status"] = -5,
									["texture"] = "Interface\\PaperDoll\\UI-PaperDoll-Slot-Bag",
								}, -- [7]
							},
						}, -- [3]
						nil, -- [4]
						{
							["bag"] = {
								{
									["type"] = 15,
									["count"] = 1,
									["slot"] = {
										{
											["q"] = 0,
											["att_id"] = 1,
											["bag_id"] = 1,
											["msg_id"] = 2,
											["sb"] = 0,
											["loc_id"] = 5,
											["slot_id"] = 1,
										}, -- [1]
									},
									["status"] = -3,
									["empty"] = 1,
									["bag_id"] = 1,
									["loc_id"] = 5,
								}, -- [1]
								{
									["loc_id"] = 5,
									["status"] = -3,
									["bag_id"] = 2,
									["type"] = 15,
								}, -- [2]
							},
							["slot_count"] = 1,
						}, -- [5]
						{
							["bag"] = {
								{
									["type"] = 14,
									["count"] = 19,
									["slot"] = {
										{
											["q"] = 3,
											["loc_id"] = 6,
											["slot_id"] = 1,
											["sb"] = 3,
											["h"] = "|cff0070dd|Hitem:20521::::::::60:::::::::|h[怒火面甲]|h|r",
											["age"] = 27333733,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [1]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["h"] = "|cff0070dd|Hitem:15411::::::::60:::::::::|h[弗丁印记]|h|r",
											["age"] = 27332110,
											["bag_id"] = 1,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["h"] = "|cff0070dd|Hitem:12927::::::::60:::::::::|h[强击护肩]|h|r",
											["age"] = 27333733,
											["bag_id"] = 1,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["slot_id"] = 4,
											["sb"] = 3,
											["h"] = "|cff0070dd|Hitem:11930::::::::60:::::::::|h[皇帝的新斗篷]|h|r",
											["age"] = 27332110,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [4]
										{
											["q"] = 4,
											["loc_id"] = 6,
											["slot_id"] = 5,
											["sb"] = 3,
											["h"] = "|cffa335ee|Hitem:11726:1891:::::::60:::::::::|h[野蛮角斗士链甲]|h|r",
											["age"] = 27333733,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [5]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 6,
											["sb"] = 0,
											["h"] = "|cffffffff|Hitem:2575::::::::60:::::::::|h[红色亚麻衬衣]|h|r",
											["bag_id"] = 1,
											["age"] = 27332110,
											["count"] = 1,
										}, -- [6]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 7,
										}, -- [7]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["age"] = 27333733,
											["h"] = "|cff0070dd|Hitem:12936:1885:::::::60:::::::::|h[雷德的护腕]|h|r",
											["bag_id"] = 1,
											["slot_id"] = 8,
										}, -- [8]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["h"] = "|cff0070dd|Hitem:15063:927:::::::60:::::::::|h[魔暴龙皮手套]|h|r",
											["age"] = 27333733,
											["bag_id"] = 1,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["slot_id"] = 10,
											["sb"] = 3,
											["h"] = "|cff0070dd|Hitem:13142::::::::60:::::::::|h[黑龙束带]|h|r",
											["age"] = 27333733,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [10]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["age"] = 27333733,
											["h"] = "|cff0070dd|Hitem:15062:1506:::::::60:::::::::|h[魔暴龙皮护腿]|h|r",
											["bag_id"] = 1,
											["slot_id"] = 11,
										}, -- [11]
										{
											["q"] = 2,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["age"] = 27333733,
											["h"] = "|cff1eff00|Hitem:9637::::::::60:::::::::|h[断骨长靴]|h|r",
											["bag_id"] = 1,
											["slot_id"] = 12,
										}, -- [12]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 13,
											["bag_id"] = 1,
											["age"] = 27332110,
											["h"] = "|cff0070dd|Hitem:12548::::::::60:::::::::|h[麦格尼的意志]|h|r",
										}, -- [13]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 14,
											["bag_id"] = 1,
											["age"] = 27332110,
											["h"] = "|cff0070dd|Hitem:13098::::::::60:::::::::|h[痛苦指环]|h|r",
										}, -- [14]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["slot_id"] = 15,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["age"] = 27333733,
											["h"] = "|cff0070dd|Hitem:13965::::::::60:::::::::|h[黑手饰物]|h|r",
										}, -- [15]
										{
											["q"] = 2,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 16,
											["bag_id"] = 1,
											["age"] = 27333816,
											["h"] = "|cff1eff00|Hitem:11122::::::::60:::::::::|h[棍子上的胡萝卜]|h|r",
										}, -- [16]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["slot_id"] = 17,
											["sb"] = 3,
											["age"] = 27333733,
											["h"] = "|cff0070dd|Hitem:12940:1900:::::::60:::::::::|h[雷德的神圣控诉者]|h|r",
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [17]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["slot_id"] = 18,
											["sb"] = 3,
											["age"] = 27333733,
											["h"] = "|cff0070dd|Hitem:12939:1900:::::::60:::::::::|h[雷德的部族护卫者]|h|r",
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [18]
										{
											["q"] = 3,
											["loc_id"] = 6,
											["slot_id"] = 19,
											["sb"] = 3,
											["age"] = 27333773,
											["h"] = "|cff0070dd|Hitem:18323::::::::60:::::::::|h[萨特强弓]|h|r",
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [19]
									},
									["status"] = -3,
									["empty"] = 1,
									["bag_id"] = 1,
									["loc_id"] = 6,
								}, -- [1]
							},
							["slot_count"] = 19,
						}, -- [6]
						nil, -- [7]
						nil, -- [8]
						nil, -- [9]
						{
							["slot_count"] = 5,
							["bag"] = {
								{
									["loc_id"] = 10,
									["count"] = 5,
									["slot"] = {
										{
											["q"] = 3,
											["bag_id"] = 1,
											["expires"] = 27334390,
											["h"] = "|cff0070dd|Hitem:14344::::::::60:::::::::|h[大块魔光碎片]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["loc_id"] = 10,
											["slot_id"] = 1,
											["age"] = 27333670,
										}, -- [1]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["expires"] = 27334390,
											["h"] = "|cffffffff|Hitem:16204::::::::60:::::::::|h[幻影之尘]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["loc_id"] = 10,
											["slot_id"] = 2,
											["age"] = 27333670,
										}, -- [2]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["expires"] = 27334390,
											["h"] = "|cffffffff|Hitem:11176::::::::60:::::::::|h[梦境之尘]|h|r",
											["count"] = 5,
											["sb"] = 0,
											["loc_id"] = 10,
											["slot_id"] = 3,
											["age"] = 27333670,
										}, -- [3]
										{
											["q"] = 2,
											["bag_id"] = 1,
											["expires"] = 27334390,
											["h"] = "|cff1eff00|Hitem:16202::::::::60:::::::::|h[次级不灭精华]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["loc_id"] = 10,
											["slot_id"] = 4,
											["age"] = 27333670,
										}, -- [4]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["expires"] = 27334390,
											["h"] = "|cffffffff|Hitem:13443::::::::60:::::::::|h[超强法力药水]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["loc_id"] = 10,
											["slot_id"] = 5,
											["age"] = 27333670,
										}, -- [5]
									},
									["status"] = -3,
									["bag_id"] = 1,
									["type"] = 20,
								}, -- [1]
							},
						}, -- [10]
						nil, -- [11]
						nil, -- [12]
						nil, -- [13]
						nil, -- [14]
						nil, -- [15]
						{
							["bag"] = {
								{
									["type"] = 29,
									["count"] = 16,
									["slot"] = {
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 1,
											["sb"] = 3,
											["h"] = "reputation:369:友善:4793:6000:0:0:0",
											["bag_id"] = 1,
											["count"] = 7793,
										}, -- [1]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 2,
											["sb"] = 3,
											["h"] = "reputation:609:中立:297:3000:0:0:0",
											["bag_id"] = 1,
											["count"] = 297,
										}, -- [2]
										{
											["q"] = 0,
											["h"] = "reputation:72:崇敬:8366:21000:0:0:0",
											["count"] = 29366,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 4,
											["sb"] = 3,
											["h"] = "reputation:470:友善:3225:6000:0:0:0",
											["bag_id"] = 1,
											["count"] = 6225,
										}, -- [4]
										{
											["q"] = 0,
											["h"] = "reputation:577:友善:2887:6000:0:0:0",
											["count"] = 5887,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 5,
										}, -- [5]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 6,
											["sb"] = 3,
											["h"] = "reputation:749:中立:165:3000:0:0:0",
											["bag_id"] = 1,
											["count"] = 165,
										}, -- [6]
										{
											["q"] = 0,
											["h"] = "reputation:59:中立:770:3000:0:0:0",
											["count"] = 770,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 7,
										}, -- [7]
										{
											["q"] = 0,
											["h"] = "reputation:21:友善:5700:6000:0:0:0",
											["count"] = 8700,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 8,
										}, -- [8]
										{
											["q"] = 0,
											["h"] = "reputation:471:中立:1728:3000:0:0:0",
											["count"] = 1728,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 10,
											["sb"] = 3,
											["h"] = "reputation:87:仇恨:11450:36000:0:0:0",
											["bag_id"] = 1,
											["count"] = -30550,
										}, -- [10]
										{
											["q"] = 0,
											["h"] = "reputation:54:尊敬:5171:12000:0:0:0",
											["count"] = 14171,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 11,
										}, -- [11]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 12,
											["sb"] = 3,
											["h"] = "reputation:69:尊敬:9701:12000:0:0:0",
											["bag_id"] = 1,
											["count"] = 18701,
										}, -- [12]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 13,
											["sb"] = 3,
											["h"] = "reputation:47:尊敬:11386:12000:0:0:0",
											["bag_id"] = 1,
											["count"] = 20386,
										}, -- [13]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 14,
											["sb"] = 3,
											["h"] = "reputation:529:中立:1976:3000:0:0:0",
											["bag_id"] = 1,
											["count"] = 1976,
										}, -- [14]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 15,
											["sb"] = 3,
											["h"] = "reputation:509:中立:0:3000:0:0:0",
											["bag_id"] = 1,
											["count"] = 0,
										}, -- [15]
										{
											["q"] = 0,
											["h"] = "reputation:730:中立:2763:3000:0:0:0",
											["count"] = 2763,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 16,
										}, -- [16]
									},
									["status"] = -3,
									["bag_id"] = 1,
									["loc_id"] = 16,
								}, -- [1]
							},
							["slot_count"] = 16,
						}, -- [16]
					},
				},
				["!ACCOUNT - 100"] = {
					["info"] = {
						["class"] = "ACCOUNT",
						["class_local"] = "Account",
						["realm"] = "",
						["name"] = "我的账户",
						["faction"] = "",
						["player_id"] = "!ACCOUNT - 100",
						["level"] = 1,
						["proj"] = 2,
						["faction_local"] = "",
					},
				},
			},
			["version"] = 30963,
		},
		["version"] = 30963,
		["cache"] = {
			["default"] = {
				["1000:item:17774:1"] = "1!416",
			},
			["reputation"] = {
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "人类(玩家)",
				}, -- [1]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "兽人(玩家)",
				}, -- [2]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "矮人(玩家)",
				}, -- [3]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "暗夜精灵(玩家)",
				}, -- [4]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "亡灵(玩家)",
				}, -- [5]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "牛头人(玩家)",
				}, -- [6]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "生物",
				}, -- [7]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "侏儒(玩家)",
				}, -- [8]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "巨魔(玩家)",
				}, -- [9]
				nil, -- [10]
				nil, -- [11]
				nil, -- [12]
				nil, -- [13]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "怪物",
				}, -- [14]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "迪菲亚潜行者",
				}, -- [15]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "河爪豺狼人",
				}, -- [16]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "赤脊山豺狼人",
				}, -- [17]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "暗皮豺狼人",
				}, -- [18]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "鱼人",
				}, -- [19]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "亡灵(天灾军团)",
				}, -- [20]
				{
					["r"] = false,
					["d"] = "一个由黑水海盗的头目，大财主里维加兹经营的繁荣的海港城市。它也是热砂集团的一部分，主要仇敌是血帆海盗。",
					["w"] = true,
					["n"] = "藏宝海湾",
				}, -- [21]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蜘蛛",
				}, -- [22]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "野猪",
				}, -- [23]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狼人",
				}, -- [24]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狗头人",
				}, -- [25]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "血顶巨魔",
				}, -- [26]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "劈颅巨魔",
				}, -- [27]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "猎物",
				}, -- [28]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狼人",
				}, -- [29]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "叛变的迪菲亚潜行者(艾泽拉斯)",
				}, -- [30]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "友方",
				}, -- [31]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "石腭怪",
				}, -- [32]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "冰巨魔",
				}, -- [33]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑石氏族兽人",
				}, -- [34]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Villian",
				}, -- [35]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "牺牲品",
				}, -- [36]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "熊",
				}, -- [37]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "食人魔",
				}, -- [38]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "库森的雇佣兵",
				}, -- [39]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "卫队",
				}, -- [40]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "荆棘谷地精",
				}, -- [41]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "迅猛龙",
				}, -- [42]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "石化蜥蜴",
				}, -- [43]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "绿龙",
				}, -- [44]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "失落者",
				}, -- [45]
				nil, -- [46]
				{
					["r"] = false,
					["d"] = "这座联盟的大都市是丹莫罗矮人们的骄傲，也是麦格尼国王的家。",
					["w"] = false,
					["n"] = "铁炉堡",
				}, -- [47]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑铁矮人",
				}, -- [48]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "暮色森林守夜人",
				}, -- [49]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "红龙",
				}, -- [50]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "藓皮豺狼人",
				}, -- [51]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "龙喉氏族兽人",
				}, -- [52]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "疯狂侏儒",
				}, -- [53]
				{
					["r"] = false,
					["d"] = "诺莫瑞根以前的居民，现在流亡到了铁炉堡并居住在此，联盟方的重要成员。",
					["w"] = false,
					["n"] = "诺莫瑞根流亡者",
				}, -- [54]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "豹",
				}, -- [55]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "血色十字军",
				}, -- [56]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "烂皮豺狼人",
				}, -- [57]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "猩猩",
				}, -- [58]
				{
					["r"] = false,
					["d"] = "瑟银兄弟会的矮人有着无与伦比的制造技术，并致力于解开黑石山中的全部秘密。",
					["w"] = false,
					["n"] = "瑟银兄弟会",
				}, -- [59]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "纳迦",
				}, -- [60]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "达拉然",
				}, -- [61]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "弃灵",
				}, -- [62]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Darkhowl",
				}, -- [63]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "劣魔",
				}, -- [64]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "熊怪",
				}, -- [65]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "部落友军",
				}, -- [66]
				nil, -- [67]
				nil, -- [68]
				{
					["r"] = false,
					["d"] = "坐落在泰达希尔岛上的联盟城市，暗夜精灵的首都，由月女祭司泰兰德·语风统治。",
					["w"] = false,
					["n"] = "达纳苏斯",
				}, -- [69]
				{
					["r"] = false,
					["d"] = "一个主要由人类组成的犯罪组织，目前占据着奥特兰克山脉与希尔斯布莱德丘陵的部分地区。",
					["w"] = false,
					["n"] = "辛迪加",
				}, -- [70]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "希尔斯布莱德民兵",
				}, -- [71]
				{
					["r"] = false,
					["d"] = "这座人类势力的最后堡垒目前由年轻的国王安度因·乌瑞恩统治着。",
					["w"] = false,
					["n"] = "暴风城",
				}, -- [72]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "恶魔",
				}, -- [73]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "元素生物",
				}, -- [74]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "灵魂",
				}, -- [75]
				nil, -- [76]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "宝物",
				}, -- [77]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "泥嘴豺狼人",
				}, -- [78]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "希尔斯布莱德，南海镇",
				}, -- [79]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑龙",
				}, -- [80]
				nil, -- [81]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "枯木巨魔",
				}, -- [82]
				nil, -- [83]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "钢鬃野猪人",
				}, -- [84]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "刺背野猪人",
				}, -- [85]
				nil, -- [86]
				{
					["r"] = false,
					["d"] = "一群嗜血的海盗，所有海上商人的公敌。藏宝海湾的死敌。",
					["w"] = false,
					["n"] = "血帆海盗",
				}, -- [87]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑暗深渊",
				}, -- [88]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "龙虾人",
				}, -- [89]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "科卡尔半人马",
				}, -- [90]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "加拉克半人马",
				}, -- [91]
				{
					["r"] = false,
					["d"] = "一群居住在凄凉之地南方的半人马，玛格拉姆半人马的仇敌。",
					["w"] = true,
					["n"] = "吉尔吉斯半人马",
				}, -- [92]
				{
					["r"] = false,
					["d"] = "一群居住在凄凉之地东部的半人马，吉尔吉斯半人马的仇敌。",
					["w"] = true,
					["n"] = "玛格拉姆半人马",
				}, -- [93]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "玛洛迪",
				}, -- [94]
				nil, -- [95]
				nil, -- [96]
				nil, -- [97]
				nil, -- [98]
				nil, -- [99]
				nil, -- [100]
				nil, -- [101]
				nil, -- [102]
				nil, -- [103]
				nil, -- [104]
				nil, -- [105]
				nil, -- [106]
				nil, -- [107]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "塞拉摩",
				}, -- [108]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "剃刀沼泽野猪人",
				}, -- [109]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "钢鬃野猪人",
				}, -- [110]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Quilboar, Deathshead",
				}, -- [111]
				nil, -- [112]
				nil, -- [113]
				nil, -- [114]
				nil, -- [115]
				nil, -- [116]
				nil, -- [117]
				nil, -- [118]
				nil, -- [119]
				nil, -- [120]
				nil, -- [121]
				nil, -- [122]
				nil, -- [123]
				nil, -- [124]
				nil, -- [125]
				nil, -- [126]
				nil, -- [127]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "敌人",
				}, -- [128]
				[575] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "未堕落的熊怪",
				},
				[369] = {
					["r"] = false,
					["d"] = "热砂集团的首府，诸多优秀地精技师、炼金师和商人的家乡。",
					["w"] = true,
					["n"] = "加基森",
				},
				[869] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "加德纳尔",
				},
				[750] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "萨弗隆火元素",
				},
				[893] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "恶齿巨魔",
				},
				[389] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Gnomeregan Bug",
				},
				[909] = {
					["r"] = false,
					["d"] = "一个向全世界展示着各类珍奇异宝的旅行马戏团。他们经常会访问艾尔文森林和莫高雷。",
					["w"] = false,
					["n"] = "暗月马戏团",
				},
				[790] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Spirit Guide - Alliance",
				},
				[671] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Crab",
				},
				[679] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Training Dummy",
				},
				[409] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "鹰身人",
				},
				[576] = {
					["r"] = false,
					["d"] = "作为最后一支尚未堕落的熊怪部族，木喉部族正致力于保留他们那种独特的精神修行之道，并试图终结其他熊怪部族的痛苦。",
					["w"] = false,
					["n"] = "木喉要塞",
				},
				[148] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "小动物",
				},
				[429] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "火刃氏族",
				},
				[310] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蝙蝠",
				},
				[449] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "暗影蛛丝偷猎者",
				},
				[529] = {
					["r"] = false,
					["d"] = "一个致力于从亡灵天灾军团的威胁下拯救艾泽拉斯世界的组织。银色黎明的据点遍布东西瘟疫之地。",
					["w"] = true,
					["n"] = "银色黎明",
				},
				[168] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "奈瑟加德商队",
				},
				[672] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Crocilisk",
				},
				[469] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "联盟",
				},
				[950] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "ToWoW - Flag",
				},
				[577] = {
					["r"] = false,
					["d"] = "热砂集团经营之下的一座贸易城市，坐落于冬泉谷的两条主要干道的交叉处。",
					["w"] = true,
					["n"] = "永望镇",
				},
				[489] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Goblin, Dark Iron Bar Patron",
				},
				[609] = {
					["r"] = false,
					["d"] = "塞纳里奥议会的德鲁伊是自然的守卫者，他们定居于宁静的月光林地。",
					["w"] = true,
					["n"] = "塞纳里奥议会",
				},
				[509] = {
					["r"] = false,
					["d"] = "阿拉索联军正试图为暴风城夺回阿拉希盆地。",
					["w"] = false,
					["n"] = "阿拉索联军",
				},
				[649] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "管理者埃克索图斯",
				},
				[919] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "RC Objects",
				},
				[673] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Hyena",
				},
				[689] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Dragonflight, Black - Bait",
				},
				[951] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "ToWoW - Flag Trigger Alliance (DND)",
				},
				[729] = {
					["r"] = false,
					["d"] = "霜狼氏族正在努力将雷矛探险队赶出奥特兰克山谷。",
					["w"] = false,
					["n"] = "霜狼氏族",
				},
				[311] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "泰坦",
				},
				[450] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Searing Spider",
				},
				[531] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "青铜龙军团",
				},
				[920] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "红",
				},
				[674] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Owl",
				},
				[470] = {
					["r"] = false,
					["d"] = "热砂集团的成员，这座城市给许多希望在贫瘠之地做生意的人提供了一个开放和中立的天堂。",
					["w"] = true,
					["n"] = "棘齿城",
				},
				[849] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Spirit Guide - Horde",
				},
				[730] = {
					["r"] = false,
					["d"] = "一群在奥特兰克山谷建立了永久居所的矮人，正与霜狼氏族的兽人激烈交战中。",
					["w"] = false,
					["n"] = "雷矛卫队",
				},
				[510] = {
					["r"] = false,
					["d"] = "污染者试图为部落夺取阿拉希盆地的重要资源。",
					["w"] = false,
					["n"] = "污染者",
				},
				[770] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Gizlock's Charm",
				},
				[532] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蓝龙军团",
				},
				[921] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蓝",
				},
				[675] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Scorpid",
				},
				[572] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "邪枝巨魔",
				},
				[1041] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狂鱼",
				},
				[890] = {
					["r"] = false,
					["d"] = "灰谷地区坚定的守卫者，目前正与战歌氏族在战歌峡谷中激烈交战。",
					["w"] = false,
					["n"] = "银翼要塞",
				},
				[771] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "吉兹洛克",
				},
				[2402] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "CTF - Flag - Horde",
				},
				[169] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "热砂港",
				},
				[676] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Tallstrider",
				},
				[471] = {
					["r"] = false,
					["d"] = "尽管并非是联盟的一份子，但鹰巢山的矮人还是将联盟视为他们的朋友，并与部落保持着交战关系。",
					["w"] = false,
					["n"] = "蛮锤部族",
				},
				[809] = {
					["r"] = false,
					["d"] = "一群居住在厄运之槌的精灵后裔，他们仍然具有着相当渊博的智慧与学识，并保守着一些伟大的秘密。",
					["w"] = false,
					["n"] = "辛德拉",
				},
				[573] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "南海海盗",
				},
				[928] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "天灾入侵者",
				},
				[589] = {
					["r"] = false,
					["d"] = "这是一些专门在冬泉谷地区驯养冬泉霜刃豹的暗夜精灵。",
					["w"] = true,
					["n"] = "冬刃豹训练师",
				},
				[918] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "RC Enemies",
				},
				[917] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "铁炉堡军团",
				},
				[789] = {
					["r"] = false,
					["d"] = "",
					["w"] = false,
					["n"] = "莫洛加",
				},
				[189] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "联盟",
				},
				[629] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "断矛巨魔",
				},
				[511] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "巨人",
				},
				[229] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "哀嚎洞穴",
				},
				[249] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "异种蝎",
				},
				[269] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "银月幸存者",
				},
				[669] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Carrion Bird",
				},
				[931] = {
					["r"] = false,
					["d"] = "This faction only exists to test the editing of faction names and descriptions...",
					["w"] = true,
					["n"] = "Test Faction (not a real faction)",
				},
				[270] = {
					["r"] = false,
					["d"] = "这群居住在尤亚姆巴岛的巨魔正在努力招募全世界的勇士，希望他们能够帮助自己对抗祖尔格拉布中那个已经复活了的邪神哈卡，以及他手下的阿塔莱祭司们。",
					["w"] = false,
					["n"] = "赞达拉部族",
				},
				[912] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "卡利姆多联军",
				},
				[209] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "守望堡",
				},
				[910] = {
					["r"] = false,
					["d"] = "青铜龙军团的后代，时间的守卫者，对凡人种族漠不关心。",
					["w"] = false,
					["n"] = "诺兹多姆的子嗣",
				},
				[891] = {
					["r"] = false,
					["d"] = "",
					["w"] = false,
					["n"] = "联盟部队",
				},
				[769] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "吉兹洛克的假人",
				},
				[829] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Ogre (Captain Kromcrush)",
				},
				[309] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蝎子",
				},
				[749] = {
					["r"] = false,
					["d"] = "这些元素生物定居于艾萨拉的东部的一座小岛上，是拉格纳罗斯及其军团的死敌。",
					["w"] = true,
					["n"] = "海达希亚水元素",
				},
				[630] = {
					["r"] = false,
					["d"] = "",
					["w"] = false,
					["n"] = "暴掠龙训练师",
				},
				[915] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "克苏恩的军队",
				},
				[677] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Turtle",
				},
				[329] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "工头费苏勒",
				},
				[916] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "异种虫类",
				},
				[670] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Cat",
				},
				[678] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Beast - Wind Serpent",
				},
				[954] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "ToWoW - Flag Trigger Horde (DND)",
				},
				[349] = {
					["r"] = false,
					["d"] = "这个由潜行者与刺客组成的行会只欢迎那些有着出色实力的人进入他们的领地。他们也是辛迪加的仇敌。",
					["w"] = true,
					["n"] = "拉文霍德",
				},
				[2403] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "CTF - Flag - Alliance",
				},
			},
			["rule"] = {
				["1:1:1:3:1000:item:17774:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
			},
			["version"] = 30963,
		},
		["option"] = {
			["sort"] = {
				["method"] = {
					["data"] = {
						[9998] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								nil, -- [5]
								nil, -- [6]
								nil, -- [7]
								{
									["key"] = "slottype",
								}, -- [8]
								{
									["key"] = "expansion",
								}, -- [9]
								{
									["key"] = "itemstatlevel",
								}, -- [10]
								{
									["key"] = "id",
								}, -- [11]
								{
									["key"] = "itemuselevel",
								}, -- [12]
								{
									["key"] = "vendorprice",
								}, -- [13]
								{
									["key"] = "itemage",
								}, -- [14]
								{
									["key"] = "itemtype",
								}, -- [15]
							},
						},
						[9995] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								{
									["key"] = "slottype",
								}, -- [3]
								{
									["key"] = "expansion",
								}, -- [4]
								{
									["key"] = "itemstatlevel",
								}, -- [5]
								{
									["key"] = "id",
								}, -- [6]
								{
									["key"] = "itemuselevel",
								}, -- [7]
								{
									["key"] = "vendorprice",
								}, -- [8]
								{
									["key"] = "itemage",
								}, -- [9]
								{
									["key"] = "itemtype",
								}, -- [10]
								{
									["key"] = "category",
								}, -- [11]
								{
									["key"] = "location",
								}, -- [12]
								{
									["key"] = "name",
								}, -- [13]
								{
									["key"] = "count",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9999] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								{
									["key"] = "slottype",
								}, -- [3]
								{
									["key"] = "expansion",
								}, -- [4]
								{
									["key"] = "itemstatlevel",
								}, -- [5]
								{
									["key"] = "id",
								}, -- [6]
								{
									["key"] = "itemuselevel",
								}, -- [7]
								{
									["key"] = "vendorprice",
								}, -- [8]
								{
									["key"] = "itemage",
								}, -- [9]
								{
									["key"] = "itemtype",
								}, -- [10]
								{
									["key"] = "category",
								}, -- [11]
								{
									["key"] = "location",
								}, -- [12]
								{
									["key"] = "name",
								}, -- [13]
								{
									["key"] = "count",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9996] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								{
									["key"] = "slottype",
								}, -- [5]
								{
									["key"] = "expansion",
								}, -- [6]
								{
									["key"] = "itemstatlevel",
								}, -- [7]
								{
									["key"] = "id",
								}, -- [8]
								{
									["key"] = "itemuselevel",
								}, -- [9]
								{
									["key"] = "itemage",
								}, -- [10]
								{
									["key"] = "itemtype",
								}, -- [11]
								{
									["key"] = "category",
								}, -- [12]
								{
									["key"] = "location",
								}, -- [13]
								{
									["key"] = "name",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9993] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								{
									["key"] = "slottype",
								}, -- [3]
								{
									["key"] = "expansion",
								}, -- [4]
								{
									["key"] = "itemstatlevel",
								}, -- [5]
								{
									["key"] = "id",
								}, -- [6]
								{
									["key"] = "itemuselevel",
								}, -- [7]
								{
									["key"] = "vendorprice",
								}, -- [8]
								{
									["key"] = "itemage",
								}, -- [9]
								{
									["key"] = "itemtype",
								}, -- [10]
								{
									["key"] = "category",
								}, -- [11]
								{
									["key"] = "location",
								}, -- [12]
								{
									["key"] = "name",
								}, -- [13]
								{
									["key"] = "count",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9997] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								{
									["key"] = "slottype",
								}, -- [5]
								{
									["key"] = "expansion",
								}, -- [6]
								{
									["key"] = "itemstatlevel",
								}, -- [7]
								{
									["key"] = "id",
								}, -- [8]
								{
									["key"] = "itemuselevel",
								}, -- [9]
								{
									["key"] = "vendorprice",
								}, -- [10]
								{
									["key"] = "itemage",
								}, -- [11]
								{
									["key"] = "itemtype",
								}, -- [12]
								{
									["key"] = "category",
								}, -- [13]
								{
									["key"] = "location",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9994] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								{
									["key"] = "slottype",
								}, -- [5]
								{
									["key"] = "expansion",
								}, -- [6]
								{
									["key"] = "itemstatlevel",
								}, -- [7]
								{
									["key"] = "id",
								}, -- [8]
								{
									["key"] = "itemuselevel",
								}, -- [9]
								{
									["key"] = "vendorprice",
								}, -- [10]
								{
									["key"] = "itemage",
								}, -- [11]
								{
									["key"] = "itemtype",
								}, -- [12]
								{
									["key"] = "category",
								}, -- [13]
								{
									["key"] = "location",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
					},
				},
			},
			["transmog"] = {
				["enable"] = false,
			},
			["tooltip"] = {
				["battlepet"] = {
					["enable"] = false,
				},
			},
			["profile"] = {
				["data"] = {
					[1000] = {
						["location"] = {
							{
								["anchor"] = {
									["b"] = 356.111083984375,
									["l"] = 1004.336608886719,
									["r"] = 1768.336669921875,
									["t"] = 808.1112060546875,
								},
								["container"] = {
									["height"] = 274,
									["width"] = 764,
								},
							}, -- [1]
							[3] = {
								["anchor"] = {
									["b"] = 391.7779541015625,
									["t"] = 802.7779541015625,
									["l"] = 102.6669311523438,
									["r"] = 826.6669311523438,
								},
								["container"] = {
									["height"] = 233,
									["width"] = 724,
								},
							},
						},
					},
					[9999] = {
						["location"] = {
							[3] = {
							},
						},
					},
				},
			},
			["design"] = {
				["data"] = {
					[9999] = {
					},
					[9998] = {
					},
					[9997] = {
						["bar"] = {
							["data"] = {
								{
									["sort"] = {
									},
									["name"] = {
										["text"] = "",
										["custom"] = 1,
										["colour"] = {
											["r"] = 1,
											["g"] = 1,
											["b"] = 1,
										},
									},
									["background"] = {
										["custom"] = 1,
										["colour"] = {
											["a"] = 0.4,
											["r"] = 0,
											["g"] = 0,
											["b"] = 0.4,
										},
									},
									["border"] = {
										["custom"] = 1,
										["colour"] = {
											["r"] = 0.3,
											["g"] = 0.3,
											["b"] = 0.3,
										},
									},
									["width"] = {
										["min"] = 0,
									},
								}, -- [1]
							},
						},
					},
					[1000] = {
						["category"] = {
							["1!437"] = 3,
							["1!444"] = 2,
							["1!416"] = 2,
							["1!411"] = 4,
							["1!402"] = 2,
							["1!417"] = 3,
							["1!457"] = 2,
							["1!419"] = 5,
							["1!420"] = 5,
							["1!414"] = 2,
							["1!456"] = 2,
							["1!458"] = 2,
						},
					},
				},
			},
			["updatetimer"] = {
				["EVENT_ARKINV_VAULT_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_QUEST_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_LDB_CURRENCY_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_TRANSMOG_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_VAULT_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_LDB_MOUNT_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_COLLECTION_CURRENCY_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_BAG_RESCAN_BUCKET"] = {
				},
				["EVENT_ARKINV_MAIL_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_LOCATION_SCANNED_BUCKET"] = {
				},
				["EVENT_ARKINV_COLLECTION_REPUTATION_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_INVENTORY_CHANGE_BUCKET"] = {
				},
				["EVENT_ARKINV_LDB_REPUTATION_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_AUCTION_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_AUCTION_UPDATE_MASSIVE_BUCKET"] = {
				},
				["EVENT_ARKINV_BAG_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_BANK_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_BAG_UPDATE_COOLDOWN_BUCKET"] = {
				},
				["EVENT_ARKINV_VOID_UPDATE_BUCKET"] = {
				},
			},
			["version"] = 30963,
			["restack"] = {
				["blizzard"] = false,
			},
		},
	},
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "Default",
	},
}
