
ATTClassicSettings = {
	["General"] = {
	},
	["Tooltips"] = {
	},
}
ATTClassicAD = {
	["EnableTomTomWaypointsOnTaxi"] = false,
	["CollectedSpellsPerCharacter"] = {
		["Player-5458-02F6D2A3"] = {
			[674] = 1,
			[8198] = 1,
			[6547] = 1,
			[3275] = 1,
			[3276] = 1,
			[20230] = 1,
			[3277] = 1,
			[7934] = 1,
			[845] = 1,
			[676] = 1,
		},
	},
	["lockouts"] = {
		["Player-5458-02F6D2A3"] = {
		},
	},
	["CollectedFactionsPerCharacter"] = {
		["Player-5458-02F6D2A3"] = {
		},
	},
	["CollectedFlightPathsPerCharacter"] = {
		["Player-5458-02F6D2A3"] = {
			[5] = 1,
			[2] = 1,
			[4] = 1,
			[12] = 1,
		},
	},
	["DeathsPerCharacter"] = {
		["Player-5458-02F6D2A3"] = 4,
	},
	["CollectedFlightPaths"] = {
		[2] = 1,
		[12] = 1,
		[4] = 1,
		[5] = 1,
	},
	["CollectedQuests"] = {
		[6661] = 1,
		[6662] = 1,
		[35] = 1,
		[37] = 1,
		[39] = 1,
		[45] = 1,
		[47] = 1,
		[389] = 1,
		[59] = 1,
		[61] = 1,
		[1678] = 1,
		[86] = 1,
		[1001] = 1,
		[102] = 1,
		[106] = 1,
		[114] = 1,
		[118] = 1,
		[1002] = 1,
		[132] = 1,
		[1683] = 1,
		[3741] = 1,
		[244] = 1,
		[4681] = 1,
		[783] = 1,
		[141] = 1,
		[2098] = 1,
		[237] = 1,
		[71] = 1,
		[314] = 1,
		[83] = 1,
		[87] = 1,
		[6] = 1,
		[103] = 1,
		[107] = 1,
		[111] = 1,
		[119] = 1,
		[123] = 1,
		[267] = 1,
		[142] = 1,
		[166] = 1,
		[947] = 1,
		[4725] = 1,
		[13] = 1,
		[214] = 1,
		[14] = 1,
		[3903] = 1,
		[6261] = 1,
		[3904] = 1,
		[3905] = 1,
		[1638] = 1,
		[3524] = 1,
		[332] = 1,
		[1639] = 1,
		[1640] = 1,
		[982] = 1,
		[135] = 1,
		[6281] = 1,
		[40] = 1,
		[167] = 1,
		[6285] = 1,
		[983] = 1,
		[52] = 1,
		[54] = 1,
		[4761] = 1,
		[4762] = 1,
		[60] = 1,
		[984] = 1,
		[76] = 1,
		[2138] = 1,
		[88] = 1,
		[985] = 1,
		[1138] = 1,
		[112] = 1,
		[116] = 1,
		[120] = 1,
		[5545] = 1,
		[144] = 1,
		[152] = 1,
		[168] = 1,
		[955] = 1,
		[399] = 1,
		[224] = 1,
		[956] = 1,
		[957] = 1,
		[416] = 1,
		[432] = 1,
		[2158] = 1,
		[4811] = 1,
		[4812] = 1,
		[4813] = 1,
		[1339] = 1,
		[145] = 1,
		[153] = 1,
		[2041] = 1,
		[353] = 1,
		[417] = 1,
		[433] = 1,
		[986] = 1,
		[2139] = 1,
		[4763] = 1,
		[2078] = 1,
		[65] = 1,
		[373] = 1,
		[2040] = 1,
		[131] = 1,
		[246] = 1,
		[85] = 1,
		[129] = 1,
		[104] = 1,
		[9] = 1,
		[33] = 1,
		[418] = 1,
		[109] = 1,
		[239] = 1,
		[117] = 1,
		[1665] = 1,
		[36] = 1,
		[130] = 1,
		[146] = 1,
		[1666] = 1,
		[307] = 1,
		[15] = 1,
		[1667] = 1,
		[963] = 1,
		[121] = 1,
		[4723] = 1,
		[4727] = 1,
		[419] = 1,
		[11] = 1,
		[5261] = 1,
		[176] = 1,
		[958] = 1,
		[46] = 1,
		[12] = 1,
		[18] = 1,
		[3100] = 1,
		[6181] = 1,
		[2118] = 1,
		[1097] = 1,
		[965] = 1,
		[62] = 1,
		[143] = 1,
		[953] = 1,
		[155] = 1,
		[21] = 1,
		[954] = 1,
		[84] = 1,
		[966] = 1,
		[7] = 1,
	},
	["Deaths"] = 4,
	["TomTomIgnoreCompletedObjects"] = true,
	["Characters"] = {
		["Player-5458-02F6D2A3"] = "|cffc69b6d特变电工-鱼人摩洛克|r",
	},
	["CollectedQuestsPerCharacter"] = {
		["Player-5458-02F6D2A3"] = {
			[6661] = 1,
			[6662] = 1,
			[35] = 1,
			[37] = 1,
			[155] = 1,
			[45] = 1,
			[47] = 1,
			[389] = 1,
			[59] = 1,
			[61] = 1,
			[1678] = 1,
			[86] = 1,
			[1001] = 1,
			[102] = 1,
			[106] = 1,
			[114] = 1,
			[118] = 1,
			[1002] = 1,
			[3100] = 1,
			[1683] = 1,
			[3741] = 1,
			[244] = 1,
			[4681] = 1,
			[783] = 1,
			[141] = 1,
			[2098] = 1,
			[237] = 1,
			[71] = 1,
			[314] = 1,
			[83] = 1,
			[87] = 1,
			[6] = 1,
			[103] = 1,
			[107] = 1,
			[111] = 1,
			[119] = 1,
			[123] = 1,
			[267] = 1,
			[142] = 1,
			[166] = 1,
			[947] = 1,
			[4725] = 1,
			[4727] = 1,
			[214] = 1,
			[14] = 1,
			[2118] = 1,
			[6261] = 1,
			[3904] = 1,
			[3905] = 1,
			[1638] = 1,
			[3524] = 1,
			[21] = 1,
			[1639] = 1,
			[1640] = 1,
			[982] = 1,
			[135] = 1,
			[6281] = 1,
			[40] = 1,
			[167] = 1,
			[6285] = 1,
			[983] = 1,
			[52] = 1,
			[54] = 1,
			[4761] = 1,
			[4762] = 1,
			[239] = 1,
			[984] = 1,
			[76] = 1,
			[2138] = 1,
			[88] = 1,
			[985] = 1,
			[1138] = 1,
			[112] = 1,
			[116] = 1,
			[954] = 1,
			[5545] = 1,
			[144] = 1,
			[152] = 1,
			[168] = 1,
			[955] = 1,
			[399] = 1,
			[224] = 1,
			[956] = 1,
			[957] = 1,
			[416] = 1,
			[432] = 1,
			[2158] = 1,
			[4811] = 1,
			[4812] = 1,
			[4813] = 1,
			[1339] = 1,
			[145] = 1,
			[153] = 1,
			[2041] = 1,
			[353] = 1,
			[417] = 1,
			[433] = 1,
			[986] = 1,
			[2139] = 1,
			[4763] = 1,
			[2078] = 1,
			[65] = 1,
			[373] = 1,
			[2040] = 1,
			[131] = 1,
			[246] = 1,
			[85] = 1,
			[129] = 1,
			[104] = 1,
			[9] = 1,
			[33] = 1,
			[418] = 1,
			[109] = 1,
			[332] = 1,
			[117] = 1,
			[1665] = 1,
			[36] = 1,
			[130] = 1,
			[146] = 1,
			[1666] = 1,
			[307] = 1,
			[60] = 1,
			[1667] = 1,
			[963] = 1,
			[15] = 1,
			[11] = 1,
			[132] = 1,
			[419] = 1,
			[176] = 1,
			[84] = 1,
			[46] = 1,
			[12] = 1,
			[121] = 1,
			[120] = 1,
			[958] = 1,
			[13] = 1,
			[4723] = 1,
			[6181] = 1,
			[1097] = 1,
			[965] = 1,
			[3903] = 1,
			[62] = 1,
			[5261] = 1,
			[39] = 1,
			[18] = 1,
			[143] = 1,
			[953] = 1,
			[966] = 1,
			[7] = 1,
		},
	},
	["Position"] = -10.31,
	["Reagents"] = {
		[2592] = {
			{
				[3277] = 1,
			}, -- [1]
			{
				[3530] = 1,
			}, -- [2]
		},
		[1475] = {
			{
				[7934] = 1,
			}, -- [1]
			{
				[6452] = 1,
			}, -- [2]
		},
		[2589] = {
			{
				[3276] = 2,
				[3275] = 1,
			}, -- [1]
			{
				[2581] = 2,
				[1251] = 1,
			}, -- [2]
		},
	},
	["WaypointFilters"] = {
	},
	["CollectedSpells"] = {
		[674] = 1,
		[8198] = 1,
		[6547] = 1,
		[3275] = 1,
		[3276] = 1,
		[20230] = 1,
		[3277] = 1,
		[7934] = 1,
		[676] = 1,
		[845] = 1,
	},
	["CollectedFactions"] = {
	},
}
ATTClassicAuctionData = nil
ATTClassicDebugData = {
	{
		["hash"] = "mapID0",
		["mapID"] = 0,
		["g"] = {
			{
				["hash"] = "mapID947",
				["mapID"] = 947,
				["g"] = {
					{
						["hash"] = "mapID1415",
						["mapID"] = 1415,
						["g"] = {
							{
								["hash"] = "mapID1436",
								["mapID"] = 1436,
							}, -- [1]
							{
								["hash"] = "mapID1431",
								["mapID"] = 1431,
							}, -- [2]
							{
								["hash"] = "mapID1429",
								["mapID"] = 1429,
							}, -- [3]
							{
								["hash"] = "mapID1433",
								["mapID"] = 1433,
							}, -- [4]
							{
								["hash"] = "mapID1453",
								["mapID"] = 1453,
							}, -- [5]
							{
								["hash"] = "mapID1428",
								["mapID"] = 1428,
							}, -- [6]
							{
								["hash"] = "mapID1427",
								["mapID"] = 1427,
							}, -- [7]
							{
								["hash"] = "mapID1426",
								["mapID"] = 1426,
							}, -- [8]
							{
								["hash"] = "mapID1437",
								["mapID"] = 1437,
							}, -- [9]
						},
					}, -- [1]
					{
						["hash"] = "mapID1414",
						["mapID"] = 1414,
						["g"] = {
							{
								["hash"] = "mapID1439",
								["mapID"] = 1439,
							}, -- [1]
						},
					}, -- [2]
				},
			}, -- [1]
		},
	}, -- [1]
	{
		["hash"] = "mapID947",
		["mapID"] = 947,
		["g"] = {
			{
				["hash"] = "mapID1415",
				["mapID"] = 1415,
				["g"] = {
					{
						["hash"] = "mapID1436",
						["mapID"] = 1436,
						["g"] = {
							{
								["hash"] = "itemID829",
								["itemID"] = 829,
								["coord"] = {
									43.74640583992004, -- [1]
									27.1101176738739, -- [2]
									1436, -- [3]
								},
							}, -- [1]
							{
								["hash"] = "itemID1179",
								["itemID"] = 1179,
								["coord"] = {
									26.28986835479736, -- [1]
									48.06906580924988, -- [2]
									1436, -- [3]
								},
							}, -- [2]
							{
								["hash"] = "itemID2589",
								["itemID"] = 2589,
								["coord"] = {
									36.87794804573059, -- [1]
									82.1026623249054, -- [2]
									1436, -- [3]
								},
							}, -- [3]
							{
								["hash"] = "itemID858",
								["itemID"] = 858,
								["coord"] = {
									35.00908613204956, -- [1]
									86.0775351524353, -- [2]
									1436, -- [3]
								},
							}, -- [4]
							{
								["hash"] = "itemID1507",
								["itemID"] = 1507,
								["coord"] = {
									44.69025731086731, -- [1]
									26.11172199249268, -- [2]
									1436, -- [3]
								},
							}, -- [5]
							{
								["hash"] = "itemID1499",
								["itemID"] = 1499,
								["coord"] = {
									44.66626048088074, -- [1]
									26.51848793029785, -- [2]
									1436, -- [3]
								},
							}, -- [6]
							{
								["hash"] = "itemID2288",
								["itemID"] = 2288,
								["coord"] = {
									46.52555584907532, -- [1]
									27.58288383483887, -- [2]
									1436, -- [3]
								},
							}, -- [7]
							{
								["hash"] = "itemID2770",
								["itemID"] = 2770,
								["coord"] = {
									45.5485999584198, -- [1]
									27.28112936019898, -- [2]
									1436, -- [3]
								},
							}, -- [8]
							{
								["hash"] = "itemID2835",
								["itemID"] = 2835,
								["coord"] = {
									45.51656246185303, -- [1]
									27.26811170578003, -- [2]
									1436, -- [3]
								},
							}, -- [9]
							{
								["hash"] = "itemID2763",
								["itemID"] = 2763,
								["coord"] = {
									44.0310001373291, -- [1]
									26.27850770950317, -- [2]
									1436, -- [3]
								},
							}, -- [10]
							{
								["hash"] = "itemID841",
								["itemID"] = 841,
								["coord"] = {
									49.38855767250061, -- [1]
									19.16844844818115, -- [2]
									1436, -- [3]
								},
							}, -- [11]
							{
								["hash"] = "npcID233",
								["name"] = "农夫萨丁",
								["faction"] = "Alliance",
								["npcID"] = 233,
								["coord"] = {
									55.96804618835449, -- [1]
									31.11186027526856, -- [2]
									1436, -- [3]
								},
							}, -- [12]
							{
								["hash"] = "itemID3578",
								["itemID"] = 3578,
								["coord"] = {
									55.96804618835449, -- [1]
									31.11186027526856, -- [2]
									1436, -- [3]
								},
							}, -- [13]
							{
								["hash"] = "questID13",
								["description"] = "有人看见一群凶残的迪菲亚抢劫者洗劫了金海岸矿洞和月溪镇，我们人民军绝不能对这样的事袖手旁观。马上就出发吧，特变电工，让圣光重新照耀西部荒野。\n\n金海岸矿洞就在哨塔西边的海岸附近，作为训练的第二部分，我希望你能消灭15名迪菲亚抢劫者和15名迪菲亚强夺者。",
								["questID"] = 13,
								["g"] = {
								},
								["coord"] = {
									56.27267360687256, -- [1]
									47.61579632759094, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									234, -- [1]
								},
								["name"] = "格里安·斯托曼",
								["faction"] = "Alliance",
								["objectives"] = "哨兵岭的格里安·斯托曼要求你消灭15名迪菲亚抢劫者和15名迪菲亚强夺者，然后回去向他报告。",
							}, -- [14]
							{
								["hash"] = "itemID3511",
								["itemID"] = 3511,
								["coord"] = {
									54.01525497436523, -- [1]
									52.90685892105103, -- [2]
									1436, -- [3]
								},
							}, -- [15]
							{
								["hash"] = "npcID1668",
								["faction"] = "Alliance",
								["npcID"] = 1668,
								["text"] = "威廉·马克葛瑞格",
								["g"] = {
									{
										["hash"] = "itemID5439",
										["itemID"] = 5439,
										["cost"] = 90,
									}, -- [1]
									{
										["hash"] = "itemID11362",
										["itemID"] = 11362,
										["cost"] = 900,
									}, -- [2]
									{
										["hash"] = "itemID2512",
										["itemID"] = 2512,
										["cost"] = 9,
									}, -- [3]
									{
										["hash"] = "itemID2515",
										["itemID"] = 2515,
										["cost"] = 45,
									}, -- [4]
									{
										["hash"] = "itemID2507",
										["itemID"] = 2507,
										["cost"] = 1576,
									}, -- [5]
									{
										["hash"] = "itemID3026",
										["itemID"] = 3026,
										["cost"] = 3431,
									}, -- [6]
								},
								["coord"] = {
									57.67955183982849, -- [1]
									53.78948450088501, -- [2]
									1436, -- [3]
								},
							}, -- [16]
							{
								["hash"] = "itemID2592",
								["itemID"] = 2592,
								["coord"] = {
									52.57494449615479, -- [1]
									73.36114645004272, -- [2]
									1436, -- [3]
								},
							}, -- [17]
							{
								["hash"] = "itemID725",
								["itemID"] = 725,
								["coord"] = {
									54.78932857513428, -- [1]
									62.85369396209717, -- [2]
									1436, -- [3]
								},
							}, -- [18]
							{
								["hash"] = "itemID2287",
								["itemID"] = 2287,
								["coord"] = {
									43.96478533744812, -- [1]
									69.55958008766174, -- [2]
									1436, -- [3]
								},
							}, -- [19]
							{
								["hash"] = "npcID843",
								["faction"] = "Alliance",
								["npcID"] = 843,
								["text"] = "吉娜·马克葛瑞格",
								["g"] = {
									{
										["hash"] = "itemID7005",
										["itemID"] = 7005,
										["cost"] = 74,
									}, -- [1]
									{
										["hash"] = "itemID5956",
										["itemID"] = 5956,
										["cost"] = 16,
									}, -- [2]
									{
										["hash"] = "itemID2901",
										["itemID"] = 2901,
										["cost"] = 73,
									}, -- [3]
									{
										["hash"] = "itemID6256",
										["itemID"] = 6256,
										["cost"] = 21,
									}, -- [4]
									{
										["hash"] = "itemID6217",
										["itemID"] = 6217,
										["cost"] = 112,
									}, -- [5]
									{
										["hash"] = "itemID3371",
										["itemID"] = 3371,
										["cost"] = 18,
									}, -- [6]
									{
										["hash"] = "itemID2320",
										["itemID"] = 2320,
										["cost"] = 9,
									}, -- [7]
									{
										["hash"] = "itemID2321",
										["itemID"] = 2321,
										["cost"] = 90,
									}, -- [8]
									{
										["hash"] = "itemID2678",
										["itemID"] = 2678,
										["cost"] = 9,
									}, -- [9]
									{
										["hash"] = "itemID2692",
										["itemID"] = 2692,
										["cost"] = 36,
									}, -- [10]
									{
										["hash"] = "itemID2880",
										["itemID"] = 2880,
										["cost"] = 90,
									}, -- [11]
									{
										["hash"] = "itemID4289",
										["itemID"] = 4289,
										["cost"] = 45,
									}, -- [12]
									{
										["hash"] = "itemID6529",
										["itemID"] = 6529,
										["cost"] = 45,
									}, -- [13]
									{
										["hash"] = "itemID6530",
										["itemID"] = 6530,
										["cost"] = 90,
									}, -- [14]
									{
										["hash"] = "itemID2605",
										["itemID"] = 2605,
										["cost"] = 90,
									}, -- [15]
									{
										["hash"] = "itemID6260",
										["itemID"] = 6260,
										["cost"] = 45,
									}, -- [16]
									{
										["hash"] = "itemID2604",
										["itemID"] = 2604,
										["cost"] = 45,
									}, -- [17]
									{
										["hash"] = "itemID2324",
										["itemID"] = 2324,
										["cost"] = 22,
									}, -- [18]
									{
										["hash"] = "itemID5787",
										["itemID"] = 5787,
										["cost"] = 540,
									}, -- [19]
									{
										["hash"] = "itemID5786",
										["itemID"] = 5786,
										["cost"] = 495,
									}, -- [20]
									{
										["hash"] = "itemID6274",
										["itemID"] = 6274,
										["cost"] = 400,
									}, -- [21]
								},
								["coord"] = {
									57.63391852378845, -- [1]
									53.83653044700623, -- [2]
									1436, -- [3]
								},
							}, -- [20]
							{
								["hash"] = "itemID1154",
								["itemID"] = 1154,
								["coord"] = {
									56.30141496658325, -- [1]
									47.74482846260071, -- [2]
									1436, -- [3]
								},
							}, -- [21]
							{
								["hash"] = "npcID523",
								["name"] = "索尔",
								["faction"] = "Alliance",
								["npcID"] = 523,
								["coord"] = {
									56.55477046966553, -- [1]
									52.52687931060791, -- [2]
									1436, -- [3]
								},
							}, -- [22]
							{
								["hash"] = "questID135",
								["description"] = "我现在很想知道威利所提到的“石匠”是个什么意思，或许这只是一个口误？石匠公会跟迪菲亚真的有联系吗？或许暴风城军情七处的首领马迪亚斯·肖尔会知道真相。把威利的便笺拿给他，看看他对这个越来越大的谜团有什么想法吧。他就在旧城区的兵营里。",
								["questID"] = 135,
								["g"] = {
								},
								["coord"] = {
									56.23956918716431, -- [1]
									47.61286973953247, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									234, -- [1]
								},
								["name"] = "格里安·斯托曼",
								["faction"] = "Alliance",
								["objectives"] = "将威利的便笺交给暴风城的马迪亚斯·肖尔。",
							}, -- [23]
							{
								["hash"] = "itemID1327",
								["itemID"] = 1327,
								["coord"] = {
									56.23956918716431, -- [1]
									47.61286973953247, -- [2]
									1436, -- [3]
								},
							}, -- [24]
							{
								["hash"] = "questID142",
								["description"] = "我们必须得找到迪菲亚兄弟会藏身的地方。特变电工，我的探子报告说，迪菲亚帮的信使们经常出现在月溪镇、金海岸矿洞和詹戈洛德矿洞之间的路上。我希望你能抓住一个信使，要是他试图反抗，就干脆把他干掉，然后把他身上所有的东西带回来。",
								["questID"] = 142,
								["g"] = {
								},
								["coord"] = {
									56.22812509536743, -- [1]
									47.61562943458557, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									234, -- [1]
								},
								["name"] = "格里安·斯托曼",
								["faction"] = "Alliance",
								["objectives"] = "追捕西部荒野的迪菲亚信使，并将他身上携带着的信件交给斯托曼。",
							}, -- [25]
							{
								["hash"] = "questID144",
								["description"] = "所罗门镇长的信让我感到心痛。但显然他并不知道西部荒野的战事也很吃紧——或者他知道，但不得不抱着一丝希望来寻求我们的帮助。如果不是暴风城对西部荒野的人民不闻不问的话，我们也不会需要建立民兵组织的。\n\n将这封回信带给你在赤脊山的主人吧，战士。请转告他，我的心情也因为那么多勇士的牺牲而变得十分沉重。",
								["questID"] = 144,
								["g"] = {
								},
								["coord"] = {
									56.22812509536743, -- [1]
									47.61562943458557, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									234, -- [1]
								},
								["name"] = "格里安·斯托曼",
								["faction"] = "Alliance",
								["objectives"] = "将格里安·斯托曼的回信带给所罗门镇长。",
							}, -- [26]
							{
								["hash"] = "itemID1408",
								["itemID"] = 1408,
								["coord"] = {
									56.22812509536743, -- [1]
									47.61562943458557, -- [2]
									1436, -- [3]
								},
							}, -- [27]
							{
								["hash"] = "itemID2971",
								["itemID"] = 2971,
								["coord"] = {
									55.73300123214722, -- [1]
									36.11217141151428, -- [2]
									1436, -- [3]
								},
							}, -- [28]
							{
								["hash"] = "itemID4678",
								["itemID"] = 4678,
								["coord"] = {
									54.3806254863739, -- [1]
									35.29541492462158, -- [2]
									1436, -- [3]
								},
							}, -- [29]
							{
								["hash"] = "itemID732",
								["itemID"] = 732,
								["coord"] = {
									54.31067943572998, -- [1]
									34.08294320106506, -- [2]
									1436, -- [3]
								},
							}, -- [30]
							{
								["hash"] = "itemID1274",
								["itemID"] = 1274,
								["coord"] = {
									54.31067943572998, -- [1]
									34.08294320106506, -- [2]
									1436, -- [3]
								},
							}, -- [31]
							{
								["hash"] = "itemID814",
								["itemID"] = 814,
								["coord"] = {
									54.20554876327515, -- [1]
									35.055011510849, -- [2]
									1436, -- [3]
								},
							}, -- [32]
							{
								["hash"] = "itemID1514",
								["itemID"] = 1514,
								["coord"] = {
									56.48583769798279, -- [1]
									34.81389880180359, -- [2]
									1436, -- [3]
								},
							}, -- [33]
							{
								["hash"] = "itemID4361",
								["itemID"] = 4361,
								["coord"] = {
									52.96306610107422, -- [1]
									32.05739855766296, -- [2]
									1436, -- [3]
								},
							}, -- [34]
							{
								["hash"] = "itemID7997",
								["itemID"] = 7997,
								["coord"] = {
									42.89888739585877, -- [1]
									69.67546939849854, -- [2]
									1436, -- [3]
								},
							}, -- [35]
							{
								["hash"] = "itemID4566",
								["itemID"] = 4566,
								["coord"] = {
									43.64835023880005, -- [1]
									69.55075263977051, -- [2]
									1436, -- [3]
								},
							}, -- [36]
							{
								["hash"] = "itemID2455",
								["itemID"] = 2455,
								["coord"] = {
									43.96478533744812, -- [1]
									69.55958008766174, -- [2]
									1436, -- [3]
								},
							}, -- [37]
							{
								["hash"] = "itemID4537",
								["itemID"] = 4537,
								["coord"] = {
									43.96478533744812, -- [1]
									69.55958008766174, -- [2]
									1436, -- [3]
								},
							}, -- [38]
							{
								["hash"] = "itemID414",
								["itemID"] = 414,
								["coord"] = {
									52.10702419281006, -- [1]
									73.97662997245789, -- [2]
									1436, -- [3]
								},
							}, -- [39]
							{
								["hash"] = "itemID1381",
								["itemID"] = 1381,
								["coord"] = {
									43.95937919616699, -- [1]
									70.33423185348511, -- [2]
									1436, -- [3]
								},
							}, -- [40]
							{
								["hash"] = "itemID6556",
								["itemID"] = 6556,
								["coord"] = {
									43.38265061378479, -- [1]
									70.64628601074219, -- [2]
									1436, -- [3]
								},
							}, -- [41]
							{
								["hash"] = "itemID2998",
								["itemID"] = 2998,
								["coord"] = {
									36.31094098091126, -- [1]
									54.64558601379395, -- [2]
									1436, -- [3]
								},
							}, -- [42]
							{
								["hash"] = "questID14",
								["description"] = "一些迪菲亚路霸最近一直在避开我们，到处作恶。根据我手下最可靠的探子们的线报，这些迪菲亚路霸通常沿着从这里到西部荒野南部的道路打家劫舍。我们觉得他们现在应该就躲在南部的山丘那边，计划着下一步的行动。以人民军的名义，去消灭那些家伙。",
								["questID"] = 14,
								["g"] = {
									{
										["itemID"] = 1566,
									}, -- [1]
									{
										["itemID"] = 1480,
									}, -- [2]
									{
										["itemID"] = 12296,
									}, -- [3]
								},
								["coord"] = {
									56.23103380203247, -- [1]
									47.54962921142578, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									234, -- [1]
								},
								["name"] = "格里安·斯托曼",
								["faction"] = "Alliance",
								["objectives"] = "哨兵岭的格里安·斯托曼要求你消灭15个迪菲亚路霸、5个迪菲亚巡路者和5个迪菲亚拳匪，然后回去向他报告。",
							}, -- [43]
							{
								["hash"] = "questID155",
								["description"] = "这么说，斯托曼就派了你这么一个芦柴棒一样的家伙来保护我？希望你能行，当然如果你再叫上几个朋友帮忙就好了。\n\n你知道你要做些什么吧？我会把你带到迪菲亚潜行者的巢穴去，而你呢，就得保护好我。当然，你最好离我近点，越近越好。现在全迪菲亚兄弟会的人都想要我的脑袋呢。要是他们看见我和你在一起，一定会来把咱们都宰了的。\n\n等你和你的朋友准备好之后，就来跟我说一声吧。",
								["questID"] = 155,
								["g"] = {
								},
								["coord"] = {
									55.65328598022461, -- [1]
									47.40858674049377, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									467, -- [1]
								},
								["name"] = "迪菲亚叛徒",
								["faction"] = "Alliance",
								["objectives"] = "护送迪菲亚叛徒前往迪菲亚兄弟会的秘密藏身处。迪菲亚叛徒把你带到范克里夫和他的手下的巢穴之后，尽快回去向格里安·斯托曼汇报相关信息。",
							}, -- [44]
							{
								["hash"] = "itemID3651",
								["itemID"] = 3651,
								["coord"] = {
									42.75535345077515, -- [1]
									70.97813487052917, -- [2]
									1436, -- [3]
								},
							}, -- [45]
							{
								["hash"] = "questID166",
								["description"] = "这里恐怕还有最后一个任务需要你来完成。我们必须派人去除掉艾德温·范克里夫。说实话，就这样对一个活生生的人宣判死刑，这实在令我非常痛心，但为了西部荒野人民的利益，我不得不让范克里夫永远安息。把范克里夫干掉之后，提他的头来见我。",
								["questID"] = 166,
								["g"] = {
									{
										["itemID"] = 6087,
									}, -- [1]
									{
										["itemID"] = 2041,
									}, -- [2]
									{
										["itemID"] = 2042,
									}, -- [3]
								},
								["coord"] = {
									56.21376633644104, -- [1]
									47.45780229568481, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									234, -- [1]
								},
								["name"] = "格里安·斯托曼",
								["faction"] = "Alliance",
								["objectives"] = "杀死艾德温·范克里夫，把他的头交给格里安·斯托曼。",
							}, -- [46]
							{
								["hash"] = "questID214",
								["description"] = "迪菲亚兄弟会的人都会戴着一种红色的面罩，这显然已经是个尽人皆知的秘密了。但我们又了解到，这个面罩的材料是他们的成员在帮会内部地位的象征。\n\n既然如此，那么我希望你出马杀死一些兄弟会的高阶成员。他们的最高阶成员无疑都躲在范克里夫的秘密藏身处附近。作为证据，你要给我带回10条红色丝质面罩来，这样我才能给你奖励。祝你好运，特变电工。",
								["questID"] = 214,
								["g"] = {
									{
										["itemID"] = 2074,
									}, -- [1]
									{
										["itemID"] = 2089,
									}, -- [2]
									{
										["itemID"] = 6094,
									}, -- [3]
								},
								["coord"] = {
									56.75921440124512, -- [1]
									47.45127558708191, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									820, -- [1]
								},
								["name"] = "哨兵瑞尔",
								["faction"] = "Alliance",
								["objectives"] = "给哨兵岭哨塔的哨兵瑞尔带回10条红色丝质面罩。",
							}, -- [47]
							{
								["hash"] = "itemID1512",
								["itemID"] = 1512,
								["coord"] = {
									42.85845160484314, -- [1]
									70.75886726379395, -- [2]
									1436, -- [3]
								},
							}, -- [48]
							{
								["hash"] = "itemID6087",
								["itemID"] = 6087,
								["coord"] = {
									56.24608993530273, -- [1]
									47.61098623275757, -- [2]
									1436, -- [3]
								},
							}, -- [49]
							{
								["hash"] = "itemID6094",
								["itemID"] = 6094,
								["coord"] = {
									56.7765474319458, -- [1]
									47.41160273551941, -- [2]
									1436, -- [3]
								},
							}, -- [50]
							{
								["hash"] = "npcID1670",
								["faction"] = "Alliance",
								["npcID"] = 1670,
								["text"] = "迈克·米勒",
								["g"] = {
									{
										["hash"] = "itemID4540",
										["itemID"] = 4540,
										["cost"] = 22,
									}, -- [1]
									{
										["hash"] = "itemID4541",
										["itemID"] = 4541,
										["cost"] = 112,
									}, -- [2]
									{
										["hash"] = "itemID4542",
										["itemID"] = 4542,
										["cost"] = 450,
									}, -- [3]
									{
										["hash"] = "itemID4544",
										["itemID"] = 4544,
										["cost"] = 900,
									}, -- [4]
									{
										["hash"] = "itemID4601",
										["itemID"] = 4601,
										["cost"] = 1800,
									}, -- [5]
									{
										["hash"] = "itemID8950",
										["itemID"] = 8950,
										["cost"] = 3600,
									}, -- [6]
								},
								["coord"] = {
									57.67509937286377, -- [1]
									53.6321222782135, -- [2]
									1436, -- [3]
								},
							}, -- [51]
							{
								["hash"] = "npcID6491",
								["coord"] = {
									51.72339081764221, -- [1]
									49.67277646064758, -- [2]
									1436, -- [3]
								},
								["name"] = "灵魂医者",
								["npcID"] = 6491,
							}, -- [52]
							{
								["hash"] = "itemID2781",
								["itemID"] = 2781,
								["coord"] = {
									50.87448358535767, -- [1]
									79.57086563110352, -- [2]
									1436, -- [3]
								},
							}, -- [53]
							{
								["hash"] = "questID117",
								["description"] = "快点，朋友，动作要快\n要酿更多的酒来卖\n有人要酒呀没人要菜 \n一捆蛇麻草，就够酿酒来",
								["questID"] = 117,
								["g"] = {
									{
										["itemID"] = 1262,
										["hash"] = "itemID1262",
									}, -- [1]
								},
								["coord"] = {
									44.71843242645264, -- [1]
									80.30609488487244, -- [2]
									1436, -- [3]
								},
								["qgs"] = {
									239, -- [1]
								},
								["name"] = "葛瑞姆·雷酒",
								["faction"] = "Alliance",
								["objectives"] = "给葛瑞姆·雷酒带去5捆蛇麻草以完成他的特酿。",
							}, -- [54]
							{
								["hash"] = "itemID1262",
								["itemID"] = 1262,
								["coord"] = {
									44.71843242645264, -- [1]
									80.30609488487244, -- [2]
									1436, -- [3]
								},
							}, -- [55]
							{
								["hash"] = "itemID827",
								["itemID"] = 827,
								["coord"] = {
									36.84071898460388, -- [1]
									81.98057413101196, -- [2]
									1436, -- [3]
								},
							}, -- [56]
							{
								["qgs"] = {
									392, -- [1]
								},
								["coord"] = {
									30.08273839950562, -- [1]
									85.9440267086029, -- [2]
									1436, -- [3]
								},
								["name"] = "葛瑞森船长",
								["hash"] = "questID103",
								["description"] = "灯塔管理员一家被杀的那一个晚上实在是太可怕啦！我就那样无助地看着老瞎眼带着那群鱼人毁了他们全家。但过去的事就让它过去吧，我现在关心的是无尽之海中那些正把船只驶近暗礁的水手们的生命。如今，维持着灯塔上火炬不至熄灭的任务就落在我一个人身上了。\n\n从那些收割机器人身上找来5瓶灯油吧，这样我才能保住火炬上的火种。",
								["questID"] = 103,
								["g"] = {
									{
										["itemID"] = 1180,
									}, -- [1]
									{
										["itemID"] = 2455,
									}, -- [2]
									{
										["itemID"] = 118,
									}, -- [3]
								},
								["objectives"] = "给西部荒野灯塔中的葛瑞森船长带回5瓶灯油。",
							}, -- [57]
							{
								["hash"] = "itemID955",
								["itemID"] = 955,
								["coord"] = {
									34.13001298904419, -- [1]
									85.07997989654541, -- [2]
									1436, -- [3]
								},
							}, -- [58]
							{
								["hash"] = "itemID1180",
								["itemID"] = 1180,
								["coord"] = {
									30.08273839950562, -- [1]
									85.9440267086029, -- [2]
									1436, -- [3]
								},
							}, -- [59]
							{
								["hash"] = "itemID118",
								["itemID"] = 118,
								["coord"] = {
									30.08273839950562, -- [1]
									85.9440267086029, -- [2]
									1436, -- [3]
								},
							}, -- [60]
							{
								["qgs"] = {
									392, -- [1]
								},
								["coord"] = {
									30.08273839950562, -- [1]
									85.9440267086029, -- [2]
									1436, -- [3]
								},
								["name"] = "葛瑞森船长",
								["hash"] = "questID152",
								["description"] = "你或许已经注意到了，海岸线上有许多船只的残骸。无尽之海确实是非常凶险，我们必须确保西部荒野海岸线上没有那些该死的鱼人到处徘徊，只有这样水手们才能安全地找到靠港的路线。\n\n去杀死7只鱼人潮行者、7只鱼人战士、7只鱼人智者，还有7只鱼人滩行者，完成任务之后到我这里来领取奖赏。",
								["questID"] = 152,
								["g"] = {
								},
								["objectives"] = "杀死7只鱼人潮行者、7只鱼人战士、7只鱼人智者，还有7只鱼人滩行者，然后向西部荒野灯塔中的葛瑞森船长复命。",
							}, -- [61]
							{
								["qgs"] = {
									392, -- [1]
								},
								["coord"] = {
									30.08273839950562, -- [1]
									85.9440267086029, -- [2]
									1436, -- [3]
								},
								["name"] = "葛瑞森船长",
								["hash"] = "questID104",
								["description"] = "当我的生命终结在了那片岩石上之后，我根本不知道死后的世界会是怎样的。那天晚上的灯塔一片漆黑，因为老瞎眼吓跑了管理员全家。他们本已经逃跑了，但那天晚上他们又回来想要点亮灯塔，结果老瞎眼带着一群野蛮的鱼人突袭了灯塔。这一次，管理员的全家都在我面前无助地死去了……\n\n如果你在海岸边看到老瞎眼的话，就杀死它，把它的鳞片给我带回来，我会奖励你的。",
								["questID"] = 104,
								["g"] = {
									{
										["itemID"] = 1172,
									}, -- [1]
									{
										["itemID"] = 1557,
									}, -- [2]
									{
										["itemID"] = 5240,
									}, -- [3]
								},
								["objectives"] = "将老瞎眼的鳞片交给西部荒野灯塔旁的葛瑞森船长。",
							}, -- [62]
							{
								["hash"] = "itemID5523",
								["itemID"] = 5523,
								["coord"] = {
									44.67346668243408, -- [1]
									8.844435214996338, -- [2]
									1436, -- [3]
								},
							}, -- [63]
							{
								["hash"] = "itemID730",
								["itemID"] = 730,
								["coord"] = {
									44.04232501983643, -- [1]
									8.963757753372192, -- [2]
									1436, -- [3]
								},
							}, -- [64]
							{
								["hash"] = "itemID6289",
								["itemID"] = 6289,
								["coord"] = {
									44.67346668243408, -- [1]
									8.844435214996338, -- [2]
									1436, -- [3]
								},
							}, -- [65]
							{
								["hash"] = "itemID5503",
								["itemID"] = 5503,
								["coord"] = {
									57.11507201194763, -- [1]
									51.19675397872925, -- [2]
									1436, -- [3]
								},
							}, -- [66]
							{
								["hash"] = "itemID1788",
								["itemID"] = 1788,
								["coord"] = {
									35.59941649436951, -- [1]
									84.64646935462952, -- [2]
									1436, -- [3]
								},
							}, -- [67]
							{
								["hash"] = "itemID1813",
								["itemID"] = 1813,
								["coord"] = {
									32.98219442367554, -- [1]
									82.92548656463623, -- [2]
									1436, -- [3]
								},
							}, -- [68]
							{
								["hash"] = "itemID3636",
								["itemID"] = 3636,
								["coord"] = {
									34.13175940513611, -- [1]
									84.4255268573761, -- [2]
									1436, -- [3]
								},
							}, -- [69]
							{
								["hash"] = "itemID5784",
								["itemID"] = 5784,
								["coord"] = {
									26.33169293403626, -- [1]
									48.29025268554688, -- [2]
									1436, -- [3]
								},
							}, -- [70]
							{
								["hash"] = "itemID3012",
								["itemID"] = 3012,
								["coord"] = {
									34.7137451171875, -- [1]
									85.45786738395691, -- [2]
									1436, -- [3]
								},
							}, -- [71]
							{
								["hash"] = "itemID1740",
								["itemID"] = 1740,
								["coord"] = {
									27.68061757087708, -- [1]
									75.54447054862976, -- [2]
									1436, -- [3]
								},
							}, -- [72]
							{
								["hash"] = "itemID5498",
								["itemID"] = 5498,
								["coord"] = {
									26.20059251785278, -- [1]
									74.61961507797241, -- [2]
									1436, -- [3]
								},
							}, -- [73]
							{
								["hash"] = "itemID1405",
								["itemID"] = 1405,
								["coord"] = {
									26.08798742294312, -- [1]
									74.96439218521118, -- [2]
									1436, -- [3]
								},
							}, -- [74]
							{
								["hash"] = "itemID2977",
								["itemID"] = 2977,
								["coord"] = {
									26.55981779098511, -- [1]
									50.85678696632385, -- [2]
									1436, -- [3]
								},
							}, -- [75]
							{
								["hash"] = "itemID2778",
								["itemID"] = 2778,
								["coord"] = {
									42.83519983291626, -- [1]
									9.160798788070679, -- [2]
									1436, -- [3]
								},
							}, -- [76]
							{
								["hash"] = "itemID1566",
								["itemID"] = 1566,
								["coord"] = {
									56.21788501739502, -- [1]
									47.47324585914612, -- [2]
									1436, -- [3]
								},
							}, -- [77]
							{
								["hash"] = "itemID5240",
								["itemID"] = 5240,
								["coord"] = {
									30.11399507522583, -- [1]
									85.94766855239868, -- [2]
									1436, -- [3]
								},
							}, -- [78]
						},
					}, -- [1]
					{
						["hash"] = "mapID1433",
						["mapID"] = 1433,
						["g"] = {
							{
								["hash"] = "questID118",
								["description"] = "我把所有的铁都用来打造暴风城卫兵的装备，结果没有剩余的铁来打马掌了！\n\n把这封信带给闪金镇的铁匠阿古斯，信上说明了我现在的情况并要求他运一批马掌过来。",
								["questID"] = 118,
								["g"] = {
								},
								["coord"] = {
									30.83457350730896, -- [1]
									47.52992391586304, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									415, -- [1]
								},
								["name"] = "弗纳·奥斯古",
								["faction"] = "Alliance",
								["objectives"] = "把弗纳的便笺交给闪金镇的铁匠阿古斯。",
							}, -- [1]
							{
								["hash"] = "itemID1283",
								["itemID"] = 1283,
								["coord"] = {
									30.83457350730896, -- [1]
									47.52992391586304, -- [2]
									1433, -- [3]
								},
							}, -- [2]
							{
								["hash"] = "questID120",
								["description"] = "这真是段难熬的日子呀，战士。兽人的攻势没完没了，如果援军还不来的话，湖畔镇就要保不住了！我现在委托给你的这封信是非常重要的。立刻将这份报告送给暴风城的马库斯·乔纳森将军。你把信送到了那边之后，就马上带着那边回复的消息回来，无论是好消息还是坏消息，我都要尽快知道。\n\n现在就出发吧，快去快回！",
								["questID"] = 120,
								["g"] = {
								},
								["coord"] = {
									29.8030436038971, -- [1]
									44.45215463638306, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									344, -- [1]
								},
								["name"] = "所罗门镇长",
								["faction"] = "Alliance",
								["objectives"] = "所罗门镇长要求你给暴风城的马库斯·乔纳森将军送一封信，并且在完成任务之后尽快回报。",
							}, -- [3]
							{
								["hash"] = "itemID1293",
								["itemID"] = 1293,
								["coord"] = {
									29.8030436038971, -- [1]
									44.45215463638306, -- [2]
									1433, -- [3]
								},
							}, -- [4]
							{
								["hash"] = "questID116",
								["description"] = "我最近真是感觉有点没劲，特变电工。这些酒瓶子都快空了，运酒的船也很久没来了，这都怪那些该死的兽人。\n\n也许你帮我一个小忙？\n\n我希望你能从住在西部荒野的葛瑞姆·雷酒那里搞一桶雷霆啤酒，从暴风城搞一桶葡萄酒，从夜色镇搞一瓶月光酒，还有还有，再从闪金镇搞一袋蜂蜜酒来。把这些好酒都给我弄来，我会重重谢你的。",
								["questID"] = 116,
								["g"] = {
								},
								["coord"] = {
									26.64758563041687, -- [1]
									44.13886666297913, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									346, -- [1]
								},
								["name"] = "酒吧老板丹尼尔",
								["faction"] = "Alliance",
								["objectives"] = "湖畔镇的酒吧老板丹尼尔需要一桶雷霆啤酒，一桶葡萄酒，一瓶月光酒，还有一袋蜂蜜酒。",
							}, -- [5]
							{
								["hash"] = "npcID6727",
								["name"] = "旅店老板布瑞安娜",
								["faction"] = "Alliance",
								["npcID"] = 6727,
								["coord"] = {
									26.92176103591919, -- [1]
									44.64127421379089, -- [2]
									1433, -- [3]
								},
							}, -- [6]
							{
								["hash"] = "questID132",
								["description"] = "我现在可是冒着生命危险在和你说话。迪菲亚那帮人也是听命于某个神秘人士的，我上次听说他们与许多种族都有过合作，豺狼人，狗头人，甚至还有地精。\n\n把这张便笺交给斯托曼。上面写着我所知道的关于迪菲亚兄弟会的一切。",
								["questID"] = 132,
								["g"] = {
								},
								["coord"] = {
									26.5898585319519, -- [1]
									45.25752663612366, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									266, -- [1]
								},
								["name"] = "黑衣威利",
								["faction"] = "Alliance",
								["objectives"] = "将威利的便笺交给西部荒野的格里安·斯托曼。",
							}, -- [7]
							{
								["hash"] = "itemID1327",
								["itemID"] = 1327,
								["coord"] = {
									26.5898585319519, -- [1]
									45.25752663612366, -- [2]
									1433, -- [3]
								},
							}, -- [8]
							{
								["hash"] = "npcID8965",
								["npcID"] = 8965,
								["name"] = "肖恩",
								["coord"] = {
									29.34277057647705, -- [1]
									53.42909097671509, -- [2]
									1433, -- [3]
								},
							}, -- [9]
							{
								["qgs"] = {
									8965, -- [1]
								},
								["objectives"] = "找到希拉里的项链，将其还给湖畔镇的希拉里。",
								["name"] = "肖恩",
								["hash"] = "questID3741",
								["description"] = "我朋友希拉里的项链丢了，我们怎么都找不到。我们一整天都在这儿钓鱼，已经把周围都找遍了。我认为它只可能是落到湖里去了。我们的父母不让我们在湖里游泳……我妈妈说水下有一些可怕的生物，但是你好像不怕那些东西。\n\n你去帮她找到项链，好吗？",
								["questID"] = 3741,
								["g"] = {
								},
								["coord"] = {
									29.34277057647705, -- [1]
									53.42909097671509, -- [2]
									1433, -- [3]
								},
							}, -- [10]
							{
								["hash"] = "itemID10958",
								["itemID"] = 10958,
								["coord"] = {
									33.61376523971558, -- [1]
									55.33161163330078, -- [2]
									1433, -- [3]
								},
							}, -- [11]
							{
								["hash"] = "npcID8962",
								["npcID"] = 8962,
								["name"] = "希拉里",
								["coord"] = {
									29.27857637405396, -- [1]
									53.46389412879944, -- [2]
									1433, -- [3]
								},
							}, -- [12]
							{
								["hash"] = "npcID931",
								["name"] = "艾蕾娜·斯托姆法瑟",
								["faction"] = "Alliance",
								["npcID"] = 931,
								["coord"] = {
									30.60484528541565, -- [1]
									59.32401418685913, -- [2]
									1433, -- [3]
								},
							}, -- [13]
							{
								["hash"] = "questID143",
								["description"] = "暴风城的军队似乎遇到了些麻烦事，他们早就该到这里增援了，但直到现在还连个人影都没有。我们没多少时间可供浪费了！我不能再这样坐视人民继续无谓地牺牲而不去要求更多的增援。我听说西部荒野组建了一支民兵部队。\n\n把这封信带给他们的领袖格里安·斯托曼。或许斯托曼的人在国王陛下的部队到达之前能来帮忙抵挡上一阵。",
								["questID"] = 143,
								["g"] = {
								},
								["coord"] = {
									29.81699705123901, -- [1]
									44.44898366928101, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									344, -- [1]
								},
								["name"] = "所罗门镇长",
								["faction"] = "Alliance",
								["objectives"] = "所罗门镇长要求你给西部荒野的格里安·斯托曼送一封信。",
							}, -- [14]
							{
								["hash"] = "itemID1407",
								["itemID"] = 1407,
								["coord"] = {
									29.81699705123901, -- [1]
									44.44898366928101, -- [2]
									1433, -- [3]
								},
							}, -- [15]
							{
								["hash"] = "questID129",
								["description"] = "你能帮我一个小忙吗？我给卫兵帕克准备好了午饭，可他正在值勤……他是一个又高又壮的暴风城卫兵。他在外面是能自己保护自己的，可我们这样的寻常市民可不行，所以我没法去给他送饭……\n\n所以呢，如果你能帮我把他的午餐带给他的话，我也会给你提供一份免费的午餐！帕克就在通往暮色森林的路上巡逻。",
								["questID"] = 129,
								["g"] = {
								},
								["coord"] = {
									26.91383361816406, -- [1]
									45.52380442619324, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									379, -- [1]
								},
								["name"] = "达希",
								["faction"] = "Alliance",
								["objectives"] = "将卫兵帕克的午餐带给他，他就在通向夜色镇的路上巡逻。",
							}, -- [16]
							{
								["hash"] = "itemID5534",
								["itemID"] = 5534,
								["coord"] = {
									26.91383361816406, -- [1]
									45.52380442619324, -- [2]
									1433, -- [3]
								},
							}, -- [17]
							{
								["hash"] = "npcID791",
								["faction"] = "Alliance",
								["coord"] = {
									28.77150177955627, -- [1]
									47.47340083122253, -- [2]
									1433, -- [3]
								},
								["text"] = "林塞·阿什洛克",
								["g"] = {
									{
										["hash"] = "itemID159",
										["itemID"] = 159,
										["cost"] = 22,
									}, -- [1]
									{
										["hash"] = "itemID1179",
										["itemID"] = 1179,
										["cost"] = 112,
									}, -- [2]
									{
										["hash"] = "itemID1205",
										["itemID"] = 1205,
										["cost"] = 450,
									}, -- [3]
									{
										["hash"] = "itemID4496",
										["itemID"] = 4496,
										["cost"] = 450,
									}, -- [4]
									{
										["hash"] = "itemID4498",
										["itemID"] = 4498,
										["cost"] = 2250,
									}, -- [5]
									{
										["hash"] = "itemID2512",
										["itemID"] = 2512,
										["cost"] = 9,
									}, -- [6]
									{
										["hash"] = "itemID2515",
										["itemID"] = 2515,
										["cost"] = 45,
									}, -- [7]
									{
										["hash"] = "itemID2516",
										["itemID"] = 2516,
										["cost"] = 9,
									}, -- [8]
									{
										["hash"] = "itemID2519",
										["itemID"] = 2519,
										["cost"] = 45,
									}, -- [9]
									{
										["hash"] = "itemID2946",
										["itemID"] = 2946,
										["cost"] = 27,
									}, -- [10]
									{
										["hash"] = "itemID3107",
										["itemID"] = 3107,
										["cost"] = 68,
									}, -- [11]
									{
										["hash"] = "itemID3131",
										["itemID"] = 3131,
										["cost"] = 27,
									}, -- [12]
									{
										["hash"] = "itemID3135",
										["itemID"] = 3135,
										["cost"] = 68,
									}, -- [13]
									{
										["hash"] = "itemID4470",
										["itemID"] = 4470,
										["cost"] = 34,
									}, -- [14]
									{
										["hash"] = "itemID4471",
										["itemID"] = 4471,
										["cost"] = 122,
									}, -- [15]
									{
										["hash"] = "itemID5048",
										["itemID"] = 5048,
										["cost"] = 45,
									}, -- [16]
								},
								["npcID"] = 791,
							}, -- [18]
							{
								["hash"] = "questID145",
								["description"] = "看来我又得有事麻烦你了。我写一了封信给艾尔罗·埃伯洛克公爵，请求他从他的精锐部队——暮色森林守夜人——中抽出一些人来协助湖畔镇的防务。这封信必须马上呈送给他，而且你在旅途中要多加小心。埃伯洛克公爵是夜色镇的行政官，那座小镇就在暮色森林中，小心不要迷路了。",
								["questID"] = 145,
								["g"] = {
								},
								["coord"] = {
									29.82420921325684, -- [1]
									44.51488256454468, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									344, -- [1]
								},
								["name"] = "所罗门镇长",
								["faction"] = "Alliance",
								["objectives"] = "所罗门镇长要求你给夜色镇的艾尔罗·埃伯洛克公爵送一封信。",
							}, -- [19]
							{
								["hash"] = "itemID1409",
								["itemID"] = 1409,
								["coord"] = {
									29.82420921325684, -- [1]
									44.51488256454468, -- [2]
									1433, -- [3]
								},
							}, -- [20]
							{
								["hash"] = "itemID2589",
								["itemID"] = 2589,
								["coord"] = {
									30.27654886245728, -- [1]
									81.41475915908813, -- [2]
									1433, -- [3]
								},
							}, -- [21]
							{
								["hash"] = "itemID1791",
								["itemID"] = 1791,
								["coord"] = {
									29.03233766555786, -- [1]
									81.46284818649292, -- [2]
									1433, -- [3]
								},
							}, -- [22]
							{
								["hash"] = "itemID1179",
								["itemID"] = 1179,
								["coord"] = {
									27.97552347183228, -- [1]
									81.5311074256897, -- [2]
									1433, -- [3]
								},
							}, -- [23]
							{
								["hash"] = "itemID1212",
								["itemID"] = 1212,
								["coord"] = {
									30.40275573730469, -- [1]
									80.35255670547485, -- [2]
									1433, -- [3]
								},
							}, -- [24]
							{
								["hash"] = "itemID2592",
								["itemID"] = 2592,
								["coord"] = {
									30.00807762145996, -- [1]
									81.08535408973694, -- [2]
									1433, -- [3]
								},
							}, -- [25]
							{
								["hash"] = "questID130",
								["description"] = "你回到达希那边的时候，能替我捎几朵花给她吗？你可以在湖畔镇西边的草药店里买到花。\n\n不过，你去买花的时候……千万别告诉药草师玛蒂这花是谁买的，也别说是要送给谁的……",
								["questID"] = 130,
								["g"] = {
								},
								["coord"] = {
									15.30223488807678, -- [1]
									71.4994490146637, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									464, -- [1]
								},
								["name"] = "卫兵帕克",
								["faction"] = "Alliance",
								["objectives"] = "找到草药师玛蒂·詹罗斯，和她谈一谈。",
							}, -- [26]
							{
								["hash"] = "itemID1270",
								["itemID"] = 1270,
								["coord"] = {
									26.60226225852966, -- [1]
									44.13758516311646, -- [2]
									1433, -- [3]
								},
							}, -- [27]
							{
								["hash"] = "itemID10456",
								["itemID"] = 10456,
								["coord"] = {
									26.60226225852966, -- [1]
									44.13758516311646, -- [2]
									1433, -- [3]
								},
							}, -- [28]
							{
								["hash"] = "questID131",
								["description"] = "这是你要的花。我为你选了水仙，这是我最喜欢的花儿！",
								["questID"] = 131,
								["g"] = {
								},
								["coord"] = {
									22.04814553260803, -- [1]
									46.27320170402527, -- [2]
									1433, -- [3]
								},
								["qgs"] = {
									342, -- [1]
								},
								["name"] = "玛蒂·詹罗斯",
								["faction"] = "Alliance",
								["objectives"] = "将水仙花送给达希。",
							}, -- [29]
							{
								["hash"] = "itemID1325",
								["itemID"] = 1325,
								["coord"] = {
									22.04814553260803, -- [1]
									46.27320170402527, -- [2]
									1433, -- [3]
								},
							}, -- [30]
							{
								["hash"] = "itemID1326",
								["itemID"] = 1326,
								["coord"] = {
									26.72523856163025, -- [1]
									44.3737804889679, -- [2]
									1433, -- [3]
								},
							}, -- [31]
						},
					}, -- [2]
					{
						["hash"] = "mapID1453",
						["mapID"] = 1453,
						["g"] = {
							{
								["hash"] = "npcID5479",
								["name"] = "武神",
								["faction"] = "Alliance",
								["npcID"] = 5479,
								["coord"] = {
									78.6589503288269, -- [1]
									45.4785943031311, -- [2]
									1453, -- [3]
								},
							}, -- [1]
							{
								["hash"] = "npcID332",
								["name"] = "马迪亚斯·肖尔",
								["faction"] = "Alliance",
								["npcID"] = 332,
								["coord"] = {
									76.00324153900146, -- [1]
									59.73403453826904, -- [2]
									1453, -- [3]
								},
							}, -- [2]
							{
								["hash"] = "questID141",
								["description"] = "过去的石匠公会是由一个名叫艾德温·范克里夫的人运营着的。第一次兽人战争结束后，范克里夫承接下了在兽人们留下的废墟上重建暴风城的重任。很显然，范克里夫对国王陛下在重建工程完成之后给予他们的待遇非常不满意。总之，解释这一大堆具体的事情要花些时间。\n\n我这里有一份详细的说明，让你拿到西部荒野去交给你的雇主。你得马上把这个给他带去！",
								["questID"] = 141,
								["g"] = {
								},
								["coord"] = {
									76.00324153900146, -- [1]
									59.73403453826904, -- [2]
									1453, -- [3]
								},
								["qgs"] = {
									332, -- [1]
								},
								["name"] = "马迪亚斯·肖尔",
								["faction"] = "Alliance",
								["objectives"] = "将肖尔的报告交给西部荒野的格里安·斯托曼。",
							}, -- [3]
							{
								["hash"] = "itemID1353",
								["itemID"] = 1353,
								["coord"] = {
									76.00324153900146, -- [1]
									59.73403453826904, -- [2]
									1453, -- [3]
								},
							}, -- [4]
							{
								["hash"] = "npcID1432",
								["name"] = "雷纳多·加林纳",
								["faction"] = "Alliance",
								["npcID"] = 1432,
								["coord"] = {
									56.88126087188721, -- [1]
									63.67447376251221, -- [2]
									1453, -- [3]
								},
							}, -- [5]
							{
								["hash"] = "questID332",
								["description"] = "无论你跟任何人谈起酒，大家都会告诉你加林纳家卖的酒是全暴风城最好的。而且那里离我们这儿并不远，就在贸易区中，运河的边上。\n\n给，拿着这张酒票。把这个拿到店里去，交给我的姐姐苏泽塔，她会送你一瓶我们酿造的最有名的黑葡萄酒。你绝对不会后悔的！",
								["questID"] = 332,
								["g"] = {
								},
								["coord"] = {
									56.88126087188721, -- [1]
									63.67447376251221, -- [2]
									1453, -- [3]
								},
								["qgs"] = {
									1432, -- [1]
								},
								["name"] = "雷纳多·加林纳",
								["faction"] = "Alliance",
								["objectives"] = "到加林纳酒店去, 将酒票交给苏泽塔·加林纳以换一瓶免费的酒。",
							}, -- [6]
							{
								["hash"] = "itemID2722",
								["itemID"] = 2722,
								["coord"] = {
									56.88126087188721, -- [1]
									63.67447376251221, -- [2]
									1453, -- [3]
								},
							}, -- [7]
							{
								["hash"] = "itemID2723",
								["itemID"] = 2723,
								["coord"] = {
									52.21797227859497, -- [1]
									67.81255006790161, -- [2]
									1453, -- [3]
								},
							}, -- [8]
							{
								["hash"] = "npcID277",
								["name"] = "罗伯特·奥布斯",
								["faction"] = "Alliance",
								["npcID"] = 277,
								["text"] = "罗伯特·奥布斯",
								["g"] = {
									{
										["hash"] = "itemID2723",
										["itemID"] = 2723,
										["cost"] = 45,
									}, -- [1]
									{
										["hash"] = "itemID2593",
										["itemID"] = 2593,
										["cost"] = 135,
									}, -- [2]
									{
										["hash"] = "itemID2596",
										["itemID"] = 2596,
										["cost"] = 108,
									}, -- [3]
									{
										["hash"] = "itemID2594",
										["itemID"] = 2594,
										["cost"] = 1350,
									}, -- [4]
									{
										["hash"] = "itemID2595",
										["itemID"] = 2595,
										["cost"] = 1800,
									}, -- [5]
									{
										["hash"] = "itemID1941",
										["itemID"] = 1941,
										["cost"] = 734,
									}, -- [6]
								},
								["coord"] = {
									52.14341878890991, -- [1]
									67.73955225944519, -- [2]
									1453, -- [3]
								},
							}, -- [9]
							{
								["hash"] = "itemID1941",
								["itemID"] = 1941,
								["coord"] = {
									52.14341878890991, -- [1]
									67.73955225944519, -- [2]
									1453, -- [3]
								},
							}, -- [10]
							{
								["hash"] = "questID121",
								["description"] = "在我等待着国王陛下的回应时，希望你能把这封信交给所罗门镇长。\n\n快去吧，战士！",
								["questID"] = 121,
								["g"] = {
								},
								["coord"] = {
									64.031982421875, -- [1]
									75.30546188354492, -- [2]
									1453, -- [3]
								},
								["qgs"] = {
									466, -- [1]
								},
								["name"] = "马库斯·乔纳森将军",
								["faction"] = "Alliance",
								["objectives"] = "将暴风城的马库斯·乔纳森将军的回信带给湖畔镇的所罗门镇长。",
							}, -- [11]
							{
								["hash"] = "itemID1294",
								["itemID"] = 1294,
								["coord"] = {
									64.031982421875, -- [1]
									75.30546188354492, -- [2]
									1453, -- [3]
								},
							}, -- [12]
							{
								["hash"] = "npcID1287",
								["name"] = "玛尔达·维勒",
								["faction"] = "Alliance",
								["npcID"] = 1287,
								["text"] = "玛尔达·维勒",
								["g"] = {
									{
										["hash"] = "itemID851",
										["itemID"] = 851,
										["cost"] = 1821,
									}, -- [1]
									{
										["hash"] = "itemID2027",
										["itemID"] = 2027,
										["cost"] = 3434,
									}, -- [2]
									{
										["hash"] = "itemID923",
										["itemID"] = 923,
										["cost"] = 7869,
									}, -- [3]
									{
										["hash"] = "itemID1198",
										["itemID"] = 1198,
										["cost"] = 2408,
									}, -- [4]
									{
										["hash"] = "itemID2024",
										["itemID"] = 2024,
										["cost"] = 5470,
									}, -- [5]
									{
										["hash"] = "itemID922",
										["itemID"] = 922,
										["cost"] = 10834,
									}, -- [6]
									{
										["hash"] = "itemID2207",
										["itemID"] = 2207,
										["cost"] = 2151,
									}, -- [7]
									{
										["hash"] = "itemID2208",
										["itemID"] = 2208,
										["cost"] = 3285,
									}, -- [8]
									{
										["hash"] = "itemID2209",
										["itemID"] = 2209,
										["cost"] = 6404,
									}, -- [9]
									{
										["hash"] = "itemID852",
										["itemID"] = 852,
										["cost"] = 1565,
									}, -- [10]
									{
										["hash"] = "itemID2028",
										["itemID"] = 2028,
										["cost"] = 4558,
									}, -- [11]
									{
										["hash"] = "itemID925",
										["itemID"] = 925,
										["cost"] = 7017,
									}, -- [12]
									{
										["hash"] = "itemID1197",
										["itemID"] = 1197,
										["cost"] = 2399,
									}, -- [13]
									{
										["hash"] = "itemID2026",
										["itemID"] = 2026,
										["cost"] = 5657,
									}, -- [14]
									{
										["hash"] = "itemID924",
										["itemID"] = 924,
										["cost"] = 9875,
									}, -- [15]
									{
										["hash"] = "itemID854",
										["itemID"] = 854,
										["cost"] = 2720,
									}, -- [16]
									{
										["hash"] = "itemID2030",
										["itemID"] = 2030,
										["cost"] = 4990,
									}, -- [17]
									{
										["hash"] = "itemID928",
										["itemID"] = 928,
										["cost"] = 8874,
									}, -- [18]
									{
										["hash"] = "itemID853",
										["itemID"] = 853,
										["cost"] = 2168,
									}, -- [19]
									{
										["hash"] = "itemID2029",
										["itemID"] = 2029,
										["cost"] = 3977,
									}, -- [20]
									{
										["hash"] = "itemID927",
										["itemID"] = 927,
										["cost"] = 6258,
									}, -- [21]
									{
										["hash"] = "itemID1196",
										["itemID"] = 1196,
										["cost"] = 1993,
									}, -- [22]
									{
										["hash"] = "itemID2025",
										["itemID"] = 2025,
										["cost"] = 4774,
									}, -- [23]
									{
										["hash"] = "itemID926",
										["itemID"] = 926,
										["cost"] = 8806,
									}, -- [24]
									{
										["hash"] = "itemID15807",
										["itemID"] = 15807,
										["cost"] = 265,
									}, -- [25]
									{
										["hash"] = "itemID15808",
										["itemID"] = 15808,
										["cost"] = 3276,
									}, -- [26]
									{
										["hash"] = "itemID15809",
										["itemID"] = 15809,
										["cost"] = 13222,
									}, -- [27]
									{
										["hash"] = "itemID2512",
										["itemID"] = 2512,
										["cost"] = 9,
									}, -- [28]
									{
										["hash"] = "itemID2515",
										["itemID"] = 2515,
										["cost"] = 45,
									}, -- [29]
									{
										["hash"] = "itemID3030",
										["itemID"] = 3030,
										["cost"] = 270,
									}, -- [30]
									{
										["hash"] = "itemID2101",
										["itemID"] = 2101,
										["cost"] = 4,
									}, -- [31]
									{
										["hash"] = "itemID11362",
										["itemID"] = 11362,
										["cost"] = 900,
									}, -- [32]
									{
										["hash"] = "itemID7371",
										["itemID"] = 7371,
										["cost"] = 1800,
									}, -- [33]
								},
								["coord"] = {
									57.29771256446838, -- [1]
									57.05826282501221, -- [2]
									1453, -- [3]
								},
							}, -- [13]
							{
								["hash"] = "itemID2078",
								["itemID"] = 2078,
								["coord"] = {
									54.42543029785156, -- [1]
									66.26221537590027, -- [2]
									1453, -- [3]
								},
							}, -- [14]
							{
								["hash"] = "itemID2581",
								["itemID"] = 2581,
								["coord"] = {
									57.04377889633179, -- [1]
									60.24434566497803, -- [2]
									1453, -- [3]
								},
							}, -- [15]
							{
								["hash"] = "npcID68",
								["name"] = "暴风城卫兵",
								["faction"] = "Alliance",
								["npcID"] = 68,
								["coord"] = {
									60.41655540466309, -- [1]
									67.62264966964722, -- [2]
									1453, -- [3]
								},
							}, -- [16]
							{
								["hash"] = "npcID352",
								["name"] = "杜加尔·朗德瑞克",
								["faction"] = "Alliance",
								["npcID"] = 352,
								["coord"] = {
									66.14527702331543, -- [1]
									62.37080097198486, -- [2]
									1453, -- [3]
								},
							}, -- [17]
							{
								["hash"] = "itemID4371",
								["itemID"] = 4371,
								["coord"] = {
									54.46333289146423, -- [1]
									66.3320541381836, -- [2]
									1453, -- [3]
								},
							}, -- [18]
							{
								["hash"] = "npcID2456",
								["name"] = "牛顿·伯恩赛德",
								["faction"] = "Alliance",
								["coord"] = {
									56.96727633476257, -- [1]
									72.8730857372284, -- [2]
									1453, -- [3]
								},
								["npcID"] = 2456,
							}, -- [19]
							{
								["hash"] = "npcID5480",
								["name"] = "伊尔萨·考宾",
								["faction"] = "Alliance",
								["coord"] = {
									78.6589503288269, -- [1]
									45.4785943031311, -- [2]
									1453, -- [3]
								},
								["npcID"] = 5480,
							}, -- [20]
							{
								["hash"] = "questID1698",
								["description"] = "犹鲁斯·麦酒向联盟所有强大的战士发出了挑战。他在赤脊山的湖畔镇旅店等候着你们，并承诺会给所有通过试炼的战士提供丰厚的报酬。",
								["questID"] = 1698,
								["g"] = {
								},
								["coord"] = {
									78.6589503288269, -- [1]
									45.4785943031311, -- [2]
									1453, -- [3]
								},
								["qgs"] = {
									5479, -- [1]
								},
								["name"] = "武神",
								["faction"] = "Alliance",
								["objectives"] = "与犹鲁斯·麦酒谈一谈。",
							}, -- [21]
							{
								["hash"] = "itemID1893",
								["itemID"] = 1893,
								["coord"] = {
									65.32258987426758, -- [1]
									21.63723111152649, -- [2]
									1453, -- [3]
								},
							}, -- [22]
							{
								["hash"] = "itemID2037",
								["itemID"] = 2037,
								["coord"] = {
									65.32258987426758, -- [1]
									21.63723111152649, -- [2]
									1453, -- [3]
								},
							}, -- [23]
							{
								["hash"] = "itemID7606",
								["itemID"] = 7606,
								["coord"] = {
									55.51718473434448, -- [1]
									12.88389563560486, -- [2]
									1453, -- [3]
								},
							}, -- [24]
							{
								["hash"] = "questID2928",
								["description"] = "太糟糕了，特变电工。我们没有足够的零件让我们的陀螺式挖掘机部队进入丹莫罗。\n\n我们需要的是零件，特变电工，更多的零件。说到寻找零件，难道还有比诺莫瑞根更好的地方吗？我听说那里的机器人像牧区的牛似的到处游荡。\n\n我要你做的就是到诺莫瑞根去，把这些机器人拆开，拿出它们的内部装置。给我弄两打来就够了。",
								["questID"] = 2928,
								["g"] = {
									{
										["itemID"] = 9608,
									}, -- [1]
									{
										["itemID"] = 9609,
									}, -- [2]
								},
								["coord"] = {
									55.51718473434448, -- [1]
									12.88389563560486, -- [2]
									1453, -- [3]
								},
								["qgs"] = {
									6579, -- [1]
								},
								["name"] = "沉默的舒尼",
								["faction"] = "Alliance",
								["objectives"] = "收集24副机械内胆，把它们交给暴风城的舒尼。",
							}, -- [25]
							{
								["hash"] = "questID389",
								["description"] = "范克里夫和我过去都曾是石匠行会的成员，我们的主要工作是在战后重新建设暴风城。\n\n当我们完成了自己的职责时，却发现我们被彻底地欺骗了。贵族们拒绝付给我们酬劳，一些石匠行会的元老被提拔成了官员，但范克里夫出于对所有石匠会员的忠诚拒绝了他们。他组织了一场暴动，并离开了城市，从此发誓要进行复仇。\n\n他的副官巴基尔·斯瑞德或许对范克里夫的计划有一些了解，他目前正被关押在监狱里。",
								["questID"] = 389,
								["g"] = {
								},
								["coord"] = {
									48.96866083145142, -- [1]
									30.25765419006348, -- [2]
									1453, -- [3]
								},
								["qgs"] = {
									1646, -- [1]
								},
								["name"] = "巴隆斯·阿历克斯顿",
								["faction"] = "Alliance",
								["objectives"] = "与监狱的典狱官塞尔沃特谈一谈。",
							}, -- [26]
							{
								["hash"] = "npcID2327",
								["name"] = "珊娜·弗勒",
								["faction"] = "Alliance",
								["coord"] = {
									42.8633987903595, -- [1]
									26.38737559318543, -- [2]
									1453, -- [3]
								},
								["npcID"] = 2327,
							}, -- [27]
							{
								["hash"] = "questID391",
								["description"] = "让我们把话挑明了说吧，特变电工：我不信任你。但是，现在的情况紧急，我也管不了那么多了。\n\n你到下面去干掉那个该死的斯瑞德，把他的脑袋砍下来带给我。\n\n还有，如果你胆敢跟他合计什么把戏，或者你不上来了的话……只要被我抓到你，就准备跟那群蛆死在一块吧。",
								["questID"] = 391,
								["g"] = {
								},
								["coord"] = {
									41.41955971717835, -- [1]
									58.1433892250061, -- [2]
									1453, -- [3]
								},
								["qgs"] = {
									1719, -- [1]
								},
								["name"] = "典狱官塞尔沃特",
								["faction"] = "Alliance",
								["objectives"] = "杀死巴基尔·斯瑞德，把他的头带给监狱的典狱官塞尔沃特。",
							}, -- [28]
							{
								["hash"] = "npcID6740",
								["name"] = "旅店老板奥里森",
								["faction"] = "Alliance",
								["coord"] = {
									52.82868146896362, -- [1]
									65.55328965187073, -- [2]
									1453, -- [3]
								},
								["text"] = "旅店老板奥里森",
								["g"] = {
									{
										["hash"] = "itemID4540",
										["itemID"] = 4540,
										["cost"] = 22,
									}, -- [1]
									{
										["hash"] = "itemID4541",
										["itemID"] = 4541,
										["cost"] = 112,
									}, -- [2]
									{
										["hash"] = "itemID4542",
										["itemID"] = 4542,
										["cost"] = 450,
									}, -- [3]
									{
										["hash"] = "itemID4544",
										["itemID"] = 4544,
										["cost"] = 900,
									}, -- [4]
									{
										["hash"] = "itemID4601",
										["itemID"] = 4601,
										["cost"] = 1800,
									}, -- [5]
									{
										["hash"] = "itemID8950",
										["itemID"] = 8950,
										["cost"] = 3600,
									}, -- [6]
									{
										["hash"] = "itemID159",
										["itemID"] = 159,
										["cost"] = 22,
									}, -- [7]
									{
										["hash"] = "itemID1179",
										["itemID"] = 1179,
										["cost"] = 112,
									}, -- [8]
									{
										["hash"] = "itemID1205",
										["itemID"] = 1205,
										["cost"] = 450,
									}, -- [9]
									{
										["hash"] = "itemID1708",
										["itemID"] = 1708,
										["cost"] = 900,
									}, -- [10]
									{
										["hash"] = "itemID1645",
										["itemID"] = 1645,
										["cost"] = 1800,
									}, -- [11]
									{
										["hash"] = "itemID8766",
										["itemID"] = 8766,
										["cost"] = 3600,
									}, -- [12]
								},
								["npcID"] = 6740,
							}, -- [29]
							{
								["hash"] = "npcID1286",
								["name"] = "艾德娜·穆比",
								["faction"] = "Alliance",
								["coord"] = {
									58.05611610412598, -- [1]
									60.7277512550354, -- [2]
									1453, -- [3]
								},
								["text"] = "艾德娜·穆比",
								["g"] = {
									{
										["hash"] = "itemID7005",
										["itemID"] = 7005,
										["cost"] = 74,
									}, -- [1]
									{
										["hash"] = "itemID2901",
										["itemID"] = 2901,
										["cost"] = 73,
									}, -- [2]
									{
										["hash"] = "itemID5956",
										["itemID"] = 5956,
										["cost"] = 16,
									}, -- [3]
									{
										["hash"] = "itemID6256",
										["itemID"] = 6256,
										["cost"] = 21,
									}, -- [4]
									{
										["hash"] = "itemID6217",
										["itemID"] = 6217,
										["cost"] = 112,
									}, -- [5]
									{
										["hash"] = "itemID2678",
										["itemID"] = 2678,
										["cost"] = 9,
									}, -- [6]
									{
										["hash"] = "itemID2320",
										["itemID"] = 2320,
										["cost"] = 9,
									}, -- [7]
									{
										["hash"] = "itemID2880",
										["itemID"] = 2880,
										["cost"] = 90,
									}, -- [8]
									{
										["hash"] = "itemID3371",
										["itemID"] = 3371,
										["cost"] = 18,
									}, -- [9]
									{
										["hash"] = "itemID4289",
										["itemID"] = 4289,
										["cost"] = 45,
									}, -- [10]
									{
										["hash"] = "itemID6529",
										["itemID"] = 6529,
										["cost"] = 45,
									}, -- [11]
									{
										["hash"] = "itemID2604",
										["itemID"] = 2604,
										["cost"] = 45,
									}, -- [12]
									{
										["hash"] = "itemID2324",
										["itemID"] = 2324,
										["cost"] = 22,
									}, -- [13]
									{
										["hash"] = "itemID6260",
										["itemID"] = 6260,
										["cost"] = 45,
									}, -- [14]
									{
										["hash"] = "itemID2321",
										["itemID"] = 2321,
										["cost"] = 90,
									}, -- [15]
									{
										["hash"] = "itemID4291",
										["itemID"] = 4291,
										["cost"] = 450,
									}, -- [16]
									{
										["hash"] = "itemID8343",
										["itemID"] = 8343,
										["cost"] = 1800,
									}, -- [17]
									{
										["hash"] = "itemID2692",
										["itemID"] = 2692,
										["cost"] = 36,
									}, -- [18]
									{
										["hash"] = "itemID3713",
										["itemID"] = 3713,
										["cost"] = 144,
									}, -- [19]
									{
										["hash"] = "itemID3466",
										["itemID"] = 3466,
										["cost"] = 1800,
									}, -- [20]
									{
										["hash"] = "itemID3857",
										["itemID"] = 3857,
										["cost"] = 450,
									}, -- [21]
									{
										["hash"] = "itemID2928",
										["itemID"] = 2928,
										["cost"] = 18,
									}, -- [22]
									{
										["hash"] = "itemID2325",
										["itemID"] = 2325,
										["cost"] = 900,
									}, -- [23]
									{
										["hash"] = "itemID4341",
										["itemID"] = 4341,
										["cost"] = 450,
									}, -- [24]
									{
										["hash"] = "itemID4342",
										["itemID"] = 4342,
										["cost"] = 2250,
									}, -- [25]
									{
										["hash"] = "itemID4340",
										["itemID"] = 4340,
										["cost"] = 315,
									}, -- [26]
									{
										["hash"] = "itemID3372",
										["itemID"] = 3372,
										["cost"] = 180,
									}, -- [27]
									{
										["hash"] = "itemID8925",
										["itemID"] = 8925,
										["cost"] = 2250,
									}, -- [28]
									{
										["hash"] = "itemID4399",
										["itemID"] = 4399,
										["cost"] = 180,
									}, -- [29]
									{
										["hash"] = "itemID4400",
										["itemID"] = 4400,
										["cost"] = 1800,
									}, -- [30]
									{
										["hash"] = "itemID6530",
										["itemID"] = 6530,
										["cost"] = 90,
									}, -- [31]
									{
										["hash"] = "itemID6532",
										["itemID"] = 6532,
										["cost"] = 225,
									}, -- [32]
									{
										["hash"] = "itemID2605",
										["itemID"] = 2605,
										["cost"] = 90,
									}, -- [33]
								},
								["npcID"] = 1286,
							}, -- [30]
							{
								["hash"] = "itemID4245",
								["itemID"] = 4245,
								["coord"] = {
									54.40682172775269, -- [1]
									66.30513668060303, -- [2]
									1453, -- [3]
								},
							}, -- [31]
						},
					}, -- [3]
					{
						["hash"] = "mapID1429",
						["mapID"] = 1429,
						["g"] = {
							{
								["hash"] = "npcID514",
								["name"] = "铁匠阿古斯",
								["faction"] = "Alliance",
								["npcID"] = 514,
								["coord"] = {
									41.63835048675537, -- [1]
									65.64509272575378, -- [2]
									1429, -- [3]
								},
							}, -- [1]
							{
								["hash"] = "questID119",
								["description"] = "好的，我会给他送去50套马掌……\n\n就是这些，你看，全部都打包好了，随时可以出发！告诉弗纳，我很高兴和他做生意，哦，对了，提醒他看清楚箱子上的标签！",
								["questID"] = 119,
								["g"] = {
								},
								["coord"] = {
									41.63835048675537, -- [1]
									65.64509272575378, -- [2]
									1429, -- [3]
								},
								["qgs"] = {
									514, -- [1]
								},
								["name"] = "铁匠阿古斯",
								["faction"] = "Alliance",
								["objectives"] = "回去找赤脊山的弗纳·奥斯古，把铁匠阿古斯的一箱马掌交给他。",
							}, -- [2]
							{
								["hash"] = "itemID1284",
								["itemID"] = 1284,
								["coord"] = {
									41.63835048675537, -- [1]
									65.64509272575378, -- [2]
									1429, -- [3]
								},
							}, -- [3]
							{
								["hash"] = "npcID465",
								["faction"] = "Alliance",
								["npcID"] = 465,
								["text"] = "酒吧老板杜宾斯",
								["g"] = {
									{
										["hash"] = "itemID1939",
										["itemID"] = 1939,
										["cost"] = 608,
									}, -- [1]
									{
										["hash"] = "itemID159",
										["itemID"] = 159,
										["cost"] = 22,
									}, -- [2]
									{
										["hash"] = "itemID1179",
										["itemID"] = 1179,
										["cost"] = 112,
									}, -- [3]
									{
										["hash"] = "itemID1205",
										["itemID"] = 1205,
										["cost"] = 450,
									}, -- [4]
									{
										["hash"] = "itemID1708",
										["itemID"] = 1708,
										["cost"] = 900,
									}, -- [5]
									{
										["hash"] = "itemID1645",
										["itemID"] = 1645,
										["cost"] = 1800,
									}, -- [6]
									{
										["hash"] = "itemID8766",
										["itemID"] = 8766,
										["cost"] = 3600,
									}, -- [7]
									{
										["hash"] = "itemID2723",
										["itemID"] = 2723,
										["cost"] = 45,
									}, -- [8]
									{
										["hash"] = "itemID2593",
										["itemID"] = 2593,
										["cost"] = 135,
									}, -- [9]
									{
										["hash"] = "itemID2596",
										["itemID"] = 2596,
										["cost"] = 108,
									}, -- [10]
									{
										["hash"] = "itemID2594",
										["itemID"] = 2594,
										["cost"] = 1350,
									}, -- [11]
									{
										["hash"] = "itemID2595",
										["itemID"] = 2595,
										["cost"] = 1800,
									}, -- [12]
									{
										["hash"] = "itemID2070",
										["itemID"] = 2070,
										["cost"] = 22,
									}, -- [13]
									{
										["hash"] = "itemID414",
										["itemID"] = 414,
										["cost"] = 112,
									}, -- [14]
									{
										["hash"] = "itemID422",
										["itemID"] = 422,
										["cost"] = 450,
									}, -- [15]
									{
										["hash"] = "itemID1707",
										["itemID"] = 1707,
										["cost"] = 900,
									}, -- [16]
									{
										["hash"] = "itemID3927",
										["itemID"] = 3927,
										["cost"] = 1800,
									}, -- [17]
									{
										["hash"] = "itemID8932",
										["itemID"] = 8932,
										["cost"] = 3600,
									}, -- [18]
								},
								["coord"] = {
									43.90177726745606, -- [1]
									65.77922105789185, -- [2]
									1429, -- [3]
								},
							}, -- [4]
							{
								["hash"] = "itemID1939",
								["itemID"] = 1939,
								["coord"] = {
									43.90177726745606, -- [1]
									65.77922105789185, -- [2]
									1429, -- [3]
								},
							}, -- [5]
						},
					}, -- [4]
					{
						["hash"] = "mapID1431",
						["mapID"] = 1431,
						["g"] = {
							{
								["hash"] = "questID146",
								["description"] = "如果我不是和所罗门镇长私交甚密的话，我一定会以为他是个疯子的。因为暴风城拒绝出兵援助，就让我们把守夜人部队派去湖畔镇？守夜人部队就是因为这里被邪恶的魔法所影响才建立起来的。如果我把他们派离这里的话，恐怕还没等到他们走出森林，这里就会被邪恶的势力彻底吞没。\n\n把这封回信带给你在湖畔镇的主人吧。",
								["questID"] = 146,
								["g"] = {
								},
								["coord"] = {
									71.97039127349854, -- [1]
									46.57226800918579, -- [2]
									1431, -- [3]
								},
								["qgs"] = {
									263, -- [1]
								},
								["name"] = "艾尔罗·埃伯洛克公爵",
								["faction"] = "Alliance",
								["objectives"] = "将埃伯洛克公爵的回信带给所罗门镇长。",
							}, -- [1]
							{
								["hash"] = "itemID1410",
								["itemID"] = 1410,
								["coord"] = {
									71.97039127349854, -- [1]
									46.57226800918579, -- [2]
									1431, -- [3]
								},
							}, -- [2]
							{
								["hash"] = "npcID274",
								["faction"] = "Alliance",
								["coord"] = {
									73.87856245040894, -- [1]
									44.1564679145813, -- [2]
									1431, -- [3]
								},
								["text"] = "酒吧老板汉恩",
								["g"] = {
									{
										["hash"] = "itemID1942",
										["itemID"] = 1942,
										["cost"] = 1138,
									}, -- [1]
									{
										["hash"] = "itemID159",
										["itemID"] = 159,
										["cost"] = 22,
									}, -- [2]
									{
										["hash"] = "itemID1179",
										["itemID"] = 1179,
										["cost"] = 112,
									}, -- [3]
									{
										["hash"] = "itemID1205",
										["itemID"] = 1205,
										["cost"] = 450,
									}, -- [4]
									{
										["hash"] = "itemID1708",
										["itemID"] = 1708,
										["cost"] = 900,
									}, -- [5]
									{
										["hash"] = "itemID1645",
										["itemID"] = 1645,
										["cost"] = 1800,
									}, -- [6]
									{
										["hash"] = "itemID8766",
										["itemID"] = 8766,
										["cost"] = 3600,
									}, -- [7]
								},
								["npcID"] = 274,
							}, -- [3]
							{
								["hash"] = "itemID1942",
								["itemID"] = 1942,
								["coord"] = {
									73.87856245040894, -- [1]
									44.1564679145813, -- [2]
									1431, -- [3]
								},
							}, -- [4]
							{
								["hash"] = "npcID1676",
								["name"] = "芬布斯",
								["faction"] = "Alliance",
								["coord"] = {
									77.38780975341797, -- [1]
									48.64040613174439, -- [2]
									1431, -- [3]
								},
								["npcID"] = 1676,
							}, -- [5]
							{
								["hash"] = "npcID3133",
								["faction"] = "Alliance",
								["coord"] = {
									77.86199450492859, -- [1]
									48.31873774528503, -- [2]
									1431, -- [3]
								},
								["text"] = "赫尔伯",
								["g"] = {
									{
										["hash"] = "itemID3857",
										["itemID"] = 3857,
										["cost"] = 500,
									}, -- [1]
									{
										["hash"] = "itemID5956",
										["itemID"] = 5956,
										["cost"] = 18,
									}, -- [2]
									{
										["hash"] = "itemID2901",
										["itemID"] = 2901,
										["cost"] = 81,
									}, -- [3]
									{
										["hash"] = "itemID4399",
										["itemID"] = 4399,
										["cost"] = 200,
									}, -- [4]
									{
										["hash"] = "itemID4400",
										["itemID"] = 4400,
										["cost"] = 2000,
									}, -- [5]
									{
										["hash"] = "itemID2880",
										["itemID"] = 2880,
										["cost"] = 100,
									}, -- [6]
									{
										["hash"] = "itemID3466",
										["itemID"] = 3466,
										["cost"] = 2000,
									}, -- [7]
									{
										["hash"] = "itemID10648",
										["itemID"] = 10648,
										["cost"] = 500,
									}, -- [8]
									{
										["hash"] = "itemID10647",
										["itemID"] = 10647,
										["cost"] = 2000,
									}, -- [9]
									{
										["hash"] = "itemID4357",
										["itemID"] = 4357,
										["cost"] = 16,
									}, -- [10]
									{
										["hash"] = "itemID4364",
										["itemID"] = 4364,
										["cost"] = 48,
									}, -- [11]
								},
								["npcID"] = 3133,
							}, -- [6]
							{
								["hash"] = "npcID2409",
								["name"] = "菲利希亚·玛林",
								["faction"] = "Alliance",
								["coord"] = {
									77.53871083259583, -- [1]
									44.37554478645325, -- [2]
									1431, -- [3]
								},
								["npcID"] = 2409,
							}, -- [7]
						},
					}, -- [5]
				},
			}, -- [1]
			{
				["hash"] = "mapID1414",
				["mapID"] = 1414,
				["g"] = {
					{
						["hash"] = "mapID1439",
						["mapID"] = 1439,
						["g"] = {
							{
								["hash"] = "npcID6737",
								["name"] = "旅店老板莎希因",
								["faction"] = "Alliance",
								["coord"] = {
									36.9891881942749, -- [1]
									44.13917660713196, -- [2]
									1439, -- [3]
								},
								["npcID"] = 6737,
							}, -- [1]
							{
								["hash"] = "questID4763",
								["description"] = "我们已经知道熊怪的堕落与萨特有很大的关系，他们使用魔法护符控制熊怪。如果我们要尝试拯救熊怪的话，就必须击败引诱熊怪的萨特，取回他的护符！\n\n到我们的月亮井里去，在碗里盛满水，然后从北面的熊怪营帐中取回一些食物。把水和食物混合并放在河水边的营火旁，只要熊怪吃下食物，它就会得到净化，稍等片刻，那个引诱熊怪的萨特就会出现……这时你就要出手杀掉它！",
								["questID"] = 4763,
								["g"] = {
									{
										["itemID"] = 15204,
									}, -- [1]
									{
										["itemID"] = 15202,
									}, -- [2]
									{
										["itemID"] = 15203,
									}, -- [3]
								},
								["coord"] = {
									37.42271661758423, -- [1]
									40.22257328033447, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									3649, -- [1]
								},
								["name"] = "桑迪斯·织风",
								["faction"] = "Alliance",
								["objectives"] = "在空的净化碗里盛满奥伯丁月亮井的井水。\n\n在黑木熊怪的北部营地里收集水果、坚果和谷物各一份。\n\n将水和三种食物混合起来，放置在壁泉河附近的营火边，这样就会召来唤引诱熊怪堕落的萨特。\n\n取回堕落护符，将它交给奥伯丁的桑迪斯·织风。",
							}, -- [2]
							{
								["hash"] = "itemID12346",
								["itemID"] = 12346,
								["coord"] = {
									37.42271661758423, -- [1]
									40.22257328033447, -- [2]
									1439, -- [3]
								},
							}, -- [3]
							{
								["hash"] = "npcID3701",
								["name"] = "萨纳瑞恩·绿树",
								["faction"] = "Alliance",
								["coord"] = {
									38.79963159561157, -- [1]
									43.36274266242981, -- [2]
									1439, -- [3]
								},
								["npcID"] = 3701,
							}, -- [4]
							{
								["hash"] = "questID2139",
								["description"] = "特变电工，我们用惨痛的代价换取了黑海岸和奥伯丁的平安。\n\n你杀了很多早已病入膏肓的动物，减轻了森林的痛苦，也解脱了这些动物的灵魂。尽管这种状况只能持续一小会儿，但是奥伯丁的人民感谢你。\n\n我要交给你最后一项任务，请注意，这将是又一次的杀戮任务。我希望这是最后一次让你去做这样的事情，特变电工。\n\n有一只雌蓟熊住在东北方的一个靠近巴莎兰的洞穴里，杀了她。",
								["questID"] = 2139,
								["g"] = {
									{
										["itemID"] = 7738,
									}, -- [1]
									{
										["itemID"] = 7739,
									}, -- [2]
								},
								["coord"] = {
									38.82305026054382, -- [1]
									43.38831305503845, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									3701, -- [1]
								},
								["name"] = "萨纳瑞恩·绿树",
								["faction"] = "Alliance",
								["objectives"] = "找到雌蓟熊，然后杀掉它。",
							}, -- [5]
							{
								["hash"] = "npcID3693",
								["name"] = "特伦希斯",
								["faction"] = "Alliance",
								["coord"] = {
									39.32352066040039, -- [1]
									43.45147013664246, -- [2]
									1439, -- [3]
								},
								["npcID"] = 3693,
							}, -- [6]
							{
								["hash"] = "questID986",
								["description"] = "特变电工，你帮了我很多忙，我能不能再请求你帮助一下锐爪和他的主人沃科尔？我可以帮你精心制作一件有魔力的斗篷，它能够让你在寻找沃科尔时畅通无阻，免受黑海岸上任何猛兽的阻挠。\n\n不过要制作这件斗篷，我需要从月夜雄虎或者月夜雌虎身上获取几张张上等毛皮。你可以在急弯河以南找到那些月夜猛虎。",
								["questID"] = 986,
								["g"] = {
								},
								["coord"] = {
									39.33923840522766, -- [1]
									43.4332013130188, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									3693, -- [1]
								},
								["name"] = "特伦希斯",
								["faction"] = "Alliance",
								["objectives"] = "收集5张优质月夜猛虎毛皮，把它们交给奥伯丁的特伦希斯。",
							}, -- [7]
							{
								["hash"] = "questID990",
								["description"] = "特变电工，我的主人莱恩·狼行者正在灰谷的阿斯特兰纳城中等你。有了你的帮助，我们至少能稍微控制一下那里混乱的局势。\n\n从这儿向南走，沿着路一直前进——只要跟着那些指示牌，你应该不会迷路的。",
								["questID"] = 990,
								["g"] = {
								},
								["coord"] = {
									39.25737738609314, -- [1]
									43.50029230117798, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									3694, -- [1]
								},
								["name"] = "哨兵塞拉伊",
								["faction"] = "Alliance",
								["objectives"] = "在灰谷中找到莱恩·狼行者。",
							}, -- [8]
							{
								["hash"] = "questID1275",
								["description"] = "愚蠢的血精灵们已经彻底陷入了对魔法的狂热之中了，难道他们没有见到卡利姆多大陆上的萨特与纳迦们身上发生了些什么吗？\n\n我总觉得血精灵们也将会踏上这样一条不归之路，但是艾泽拉斯已经无法再承受多一种被魔法扭曲了心智的怪物了。\n\n我希望能够研究一下萨特和纳迦的脑干组织，这样也许就能了解那些精灵们的命运将会走向何方。在灰谷海岸边的黑暗深渊中有许多萨特和纳迦，你去那里找一找吧。\n\n这将会是一段漫长的旅程，一路小心，特变电工。",
								["questID"] = 1275,
								["g"] = {
									{
										["itemID"] = 7003,
									}, -- [1]
									{
										["itemID"] = 7004,
									}, -- [2]
								},
								["coord"] = {
									38.35750222206116, -- [1]
									43.11830401420593, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									8997, -- [1]
								},
								["name"] = "戈沙拉·夜语",
								["faction"] = "Alliance",
								["objectives"] = "奥伯丁的戈沙拉·夜语需要8块堕落者的脑干。",
							}, -- [9]
							{
								["hash"] = "itemID12347",
								["itemID"] = 12347,
								["coord"] = {
									37.73373365402222, -- [1]
									44.0460205078125, -- [2]
									1439, -- [3]
								},
							}, -- [10]
							{
								["hash"] = "objectID175320",
								["objectID"] = 175320,
								["text"] = "通缉：莫克迪普！",
								["g"] = {
									{
										["g"] = {
											{
												["itemID"] = 5315,
											}, -- [1]
											{
												["itemID"] = 15403,
											}, -- [2]
											{
												["itemID"] = 15404,
											}, -- [3]
										},
										["questID"] = 4740,
										["description"] = "注意！\n\n杀死名为“莫克迪普”的鱼人就可获得一笔赏金。这只邪恶的野兽至少杀死了一名哨兵，还涉嫌使至少两条货船在黑海岸沉没！\n\n莫克迪普最后一次出现是在是奥伯丁以南的一个有草棚的鱼人营地中，据信它保护着那里的草棚。杀死该鱼人后请到奥伯丁的哨兵戈琳达·纳希恩处领取赏金。\n\n奥伯丁乡村委员会",
										["objectives"] = "找到并杀死名为莫克迪普的鱼人。它守护着位于奥伯丁南部海岸的鱼人营地。\n\n向奥伯丁的哨兵戈琳达·纳希恩报告莫克迪普的死讯。",
									}, -- [1]
								},
								["coord"] = {
									37.27580308914185, -- [1]
									44.22624111175537, -- [2]
									1439, -- [3]
								},
							}, -- [11]
							{
								["hash"] = "itemID2592",
								["itemID"] = 2592,
								["coord"] = {
									50.96714496612549, -- [1]
									34.50020551681519, -- [2]
									1439, -- [3]
								},
							}, -- [12]
							{
								["hash"] = "itemID4537",
								["itemID"] = 4537,
								["coord"] = {
									50.58397054672241, -- [1]
									34.86731052398682, -- [2]
									1439, -- [3]
								},
							}, -- [13]
							{
								["hash"] = "itemID2780",
								["itemID"] = 2780,
								["coord"] = {
									50.58085322380066, -- [1]
									34.75848436355591, -- [2]
									1439, -- [3]
								},
							}, -- [14]
							{
								["hash"] = "itemID12342",
								["itemID"] = 12342,
								["coord"] = {
									50.67857503890991, -- [1]
									34.84992980957031, -- [2]
									1439, -- [3]
								},
							}, -- [15]
							{
								["hash"] = "itemID12343",
								["itemID"] = 12343,
								["coord"] = {
									51.81057453155518, -- [1]
									33.57294797897339, -- [2]
									1439, -- [3]
								},
							}, -- [16]
							{
								["hash"] = "itemID2589",
								["itemID"] = 2589,
								["coord"] = {
									52.02288627624512, -- [1]
									33.49400162696838, -- [2]
									1439, -- [3]
								},
							}, -- [17]
							{
								["hash"] = "itemID12341",
								["itemID"] = 12341,
								["coord"] = {
									52.79953479766846, -- [1]
									33.42211246490479, -- [2]
									1439, -- [3]
								},
							}, -- [18]
							{
								["hash"] = "itemID858",
								["itemID"] = 858,
								["coord"] = {
									55.78666925430298, -- [1]
									12.78247237205505, -- [2]
									1439, -- [3]
								},
							}, -- [19]
							{
								["hash"] = "itemID12355",
								["itemID"] = 12355,
								["coord"] = {
									52.50006914138794, -- [1]
									33.99757146835327, -- [2]
									1439, -- [3]
								},
							}, -- [20]
							{
								["hash"] = "itemID14093",
								["itemID"] = 14093,
								["coord"] = {
									51.57756805419922, -- [1]
									37.48498558998108, -- [2]
									1439, -- [3]
								},
							}, -- [21]
							{
								["hash"] = "itemID7073",
								["itemID"] = 7073,
								["coord"] = {
									51.57756805419922, -- [1]
									37.48498558998108, -- [2]
									1439, -- [3]
								},
							}, -- [22]
							{
								["hash"] = "itemID4671",
								["itemID"] = 4671,
								["coord"] = {
									51.56399607658386, -- [1]
									37.72980570793152, -- [2]
									1439, -- [3]
								},
							}, -- [23]
							{
								["hash"] = "itemID7074",
								["itemID"] = 7074,
								["coord"] = {
									51.56399607658386, -- [1]
									37.72980570793152, -- [2]
									1439, -- [3]
								},
							}, -- [24]
							{
								["hash"] = "questID2098",
								["description"] = "想要当一个出色的海盗可不简单呀，你这个旱鸭子是不会理解的。我们的生活并不仅仅只是掠夺和痛饮！唉，我的船在海岸附近被那些可恶的鱼龙给弄沉了。\n\n我希望我的大副能够重新回来工作！\n\n当我被冲到海岸的时候，大副的钥匙在岩石上折断了，接着又被黑海岸那一带的怪物给偷走了，我只记得隐约看见一些狂暴暗礁蟹、凶猛的森林陆行鸟和几个鱼人正在搜寻船的残骸……",
								["questID"] = 2098,
								["g"] = {
								},
								["coord"] = {
									56.69804811477661, -- [1]
									13.52323889732361, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									6667, -- [1]
								},
								["name"] = "基尔卡克·旋杆",
								["faction"] = "Alliance",
								["objectives"] = "找到基尔卡可钥匙的3段碎片，把它们交给基尔卡克·旋杆。",
							}, -- [25]
							{
								["hash"] = "itemID4776",
								["itemID"] = 4776,
								["coord"] = {
									60.35048961639404, -- [1]
									12.80279159545898, -- [2]
									1439, -- [3]
								},
							}, -- [26]
							{
								["hash"] = "itemID17056",
								["itemID"] = 17056,
								["coord"] = {
									60.72568893432617, -- [1]
									10.21928787231445, -- [2]
									1439, -- [3]
								},
							}, -- [27]
							{
								["hash"] = "itemID5114",
								["itemID"] = 5114,
								["coord"] = {
									60.72568893432617, -- [1]
									10.21928787231445, -- [2]
									1439, -- [3]
								},
							}, -- [28]
							{
								["hash"] = "itemID7498",
								["itemID"] = 7498,
								["coord"] = {
									60.78591346740723, -- [1]
									9.648346900939941, -- [2]
									1439, -- [3]
								},
							}, -- [29]
							{
								["hash"] = "itemID4775",
								["itemID"] = 4775,
								["coord"] = {
									60.72568893432617, -- [1]
									10.21928787231445, -- [2]
									1439, -- [3]
								},
							}, -- [30]
							{
								["hash"] = "itemID5135",
								["itemID"] = 5135,
								["coord"] = {
									62.73185610771179, -- [1]
									6.62418007850647, -- [2]
									1439, -- [3]
								},
							}, -- [31]
							{
								["hash"] = "itemID730",
								["itemID"] = 730,
								["coord"] = {
									55.78666925430298, -- [1]
									12.78247237205505, -- [2]
									1439, -- [3]
								},
							}, -- [32]
							{
								["hash"] = "itemID5784",
								["itemID"] = 5784,
								["coord"] = {
									55.78666925430298, -- [1]
									12.78247237205505, -- [2]
									1439, -- [3]
								},
							}, -- [33]
							{
								["hash"] = "itemID7499",
								["itemID"] = 7499,
								["coord"] = {
									55.78666925430298, -- [1]
									12.78247237205505, -- [2]
									1439, -- [3]
								},
							}, -- [34]
							{
								["hash"] = "itemID17057",
								["itemID"] = 17057,
								["coord"] = {
									56.44858479499817, -- [1]
									12.53675818443298, -- [2]
									1439, -- [3]
								},
							}, -- [35]
							{
								["hash"] = "itemID3010",
								["itemID"] = 3010,
								["coord"] = {
									56.44805431365967, -- [1]
									12.55534291267395, -- [2]
									1439, -- [3]
								},
							}, -- [36]
							{
								["hash"] = "itemID7500",
								["itemID"] = 7500,
								["coord"] = {
									56.806480884552, -- [1]
									13.00169825553894, -- [2]
									1439, -- [3]
								},
							}, -- [37]
							{
								["hash"] = "itemID2674",
								["itemID"] = 2674,
								["coord"] = {
									56.806480884552, -- [1]
									13.00169825553894, -- [2]
									1439, -- [3]
								},
							}, -- [38]
							{
								["hash"] = "itemID2675",
								["itemID"] = 2675,
								["coord"] = {
									56.806480884552, -- [1]
									13.00169825553894, -- [2]
									1439, -- [3]
								},
							}, -- [39]
							{
								["hash"] = "questID2078",
								["description"] = "旱鸭子，你得帮忙找到我的大副。\n\n带上这把钥匙，把它插入我的大副身上的钥匙孔里，然后把他给我带回来。\n\n那些鱼人们马上就要吃不了兜着走了，因为我的大副就要回来啦！",
								["questID"] = 2078,
								["g"] = {
								},
								["coord"] = {
									56.69829845428467, -- [1]
									13.50931525230408, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									6667, -- [1]
								},
								["name"] = "基尔卡克·旋杆",
								["faction"] = "Alliance",
								["objectives"] = "找到基尔卡克的大副——机械打手4100型，把他带到基尔卡克那里。",
							}, -- [40]
							{
								["hash"] = "itemID7442",
								["itemID"] = 7442,
								["coord"] = {
									56.69829845428467, -- [1]
									13.50931525230408, -- [2]
									1439, -- [3]
								},
							}, -- [41]
							{
								["hash"] = "itemID5996",
								["itemID"] = 5996,
								["coord"] = {
									56.675124168396, -- [1]
									13.53129744529724, -- [2]
									1439, -- [3]
								},
							}, -- [42]
							{
								["hash"] = "itemID5386",
								["itemID"] = 5386,
								["coord"] = {
									62.73185610771179, -- [1]
									6.62418007850647, -- [2]
									1439, -- [3]
								},
							}, -- [43]
							{
								["hash"] = "itemID5134",
								["itemID"] = 5134,
								["coord"] = {
									62.80139684677124, -- [1]
									7.703399658203125, -- [2]
									1439, -- [3]
								},
							}, -- [44]
							{
								["hash"] = "itemID15110",
								["itemID"] = 15110,
								["coord"] = {
									61.82563304901123, -- [1]
									8.587104082107544, -- [2]
									1439, -- [3]
								},
							}, -- [45]
							{
								["hash"] = "npcID4191",
								["faction"] = "Alliance",
								["coord"] = {
									37.09500432014465, -- [1]
									43.69908571243286, -- [2]
									1439, -- [3]
								},
								["text"] = "奥林迪雅",
								["g"] = {
									{
										["hash"] = "itemID16166",
										["itemID"] = 16166,
										["cost"] = 25,
									}, -- [1]
									{
										["hash"] = "itemID16167",
										["itemID"] = 16167,
										["cost"] = 125,
									}, -- [2]
									{
										["hash"] = "itemID16170",
										["itemID"] = 16170,
										["cost"] = 500,
									}, -- [3]
									{
										["hash"] = "itemID16169",
										["itemID"] = 16169,
										["cost"] = 1000,
									}, -- [4]
									{
										["hash"] = "itemID16168",
										["itemID"] = 16168,
										["cost"] = 2000,
									}, -- [5]
									{
										["hash"] = "itemID21030",
										["itemID"] = 21030,
										["cost"] = 2000,
									}, -- [6]
									{
										["hash"] = "itemID21033",
										["itemID"] = 21033,
										["cost"] = 4000,
									}, -- [7]
									{
										["hash"] = "itemID21031",
										["itemID"] = 21031,
										["cost"] = 4000,
									}, -- [8]
									{
										["hash"] = "itemID4536",
										["itemID"] = 4536,
										["cost"] = 25,
									}, -- [9]
									{
										["hash"] = "itemID4537",
										["itemID"] = 4537,
										["cost"] = 125,
									}, -- [10]
									{
										["hash"] = "itemID4538",
										["itemID"] = 4538,
										["cost"] = 500,
									}, -- [11]
									{
										["hash"] = "itemID4539",
										["itemID"] = 4539,
										["cost"] = 1000,
									}, -- [12]
									{
										["hash"] = "itemID4602",
										["itemID"] = 4602,
										["cost"] = 2000,
									}, -- [13]
									{
										["hash"] = "itemID8953",
										["itemID"] = 8953,
										["cost"] = 4000,
									}, -- [14]
									{
										["hash"] = "itemID159",
										["itemID"] = 159,
										["cost"] = 25,
									}, -- [15]
									{
										["hash"] = "itemID1179",
										["itemID"] = 1179,
										["cost"] = 125,
									}, -- [16]
									{
										["hash"] = "itemID1205",
										["itemID"] = 1205,
										["cost"] = 500,
									}, -- [17]
									{
										["hash"] = "itemID1708",
										["itemID"] = 1708,
										["cost"] = 1000,
									}, -- [18]
									{
										["hash"] = "itemID1645",
										["itemID"] = 1645,
										["cost"] = 2000,
									}, -- [19]
									{
										["hash"] = "itemID8766",
										["itemID"] = 8766,
										["cost"] = 4000,
									}, -- [20]
								},
								["npcID"] = 4191,
							}, -- [46]
							{
								["hash"] = "itemID15204",
								["itemID"] = 15204,
								["coord"] = {
									37.40575313568115, -- [1]
									40.21012783050537, -- [2]
									1439, -- [3]
								},
							}, -- [47]
							{
								["hash"] = "itemID7739",
								["itemID"] = 7739,
								["coord"] = {
									38.79963159561157, -- [1]
									43.36274266242981, -- [2]
									1439, -- [3]
								},
							}, -- [48]
							{
								["hash"] = "questID993",
								["description"] = "特变电工，斗篷做好了。你现在可以去寻找沃科尔，我希望时间还来得及。\n\n斗篷上的魔法被激活之后持续不了多久间，也许就只有五分钟左右的时间。你可以自行决定什么时候使用它，不过我建议你在找到锐爪以后再用。\n\n如果锐爪告诉我的消息是真的，那么你应该可以在南边的某个洞穴中找到他的主人。锐爪会在路边等你，看见它以后向它挥手打个招呼（使用/wave指令），然后它就会将它的主人所在的位置告诉你。",
								["questID"] = 993,
								["g"] = {
								},
								["coord"] = {
									39.32352066040039, -- [1]
									43.45147013664246, -- [2]
									1439, -- [3]
								},
								["qgs"] = {
									3693, -- [1]
								},
								["name"] = "特伦希斯",
								["faction"] = "Alliance",
								["objectives"] = "找到沃科尔。",
							}, -- [49]
							{
								["hash"] = "itemID5387",
								["itemID"] = 5387,
								["coord"] = {
									39.32352066040039, -- [1]
									43.45147013664246, -- [2]
									1439, -- [3]
								},
							}, -- [50]
							{
								["hash"] = "itemID3530",
								["itemID"] = 3530,
								["coord"] = {
									36.9891881942749, -- [1]
									44.13917660713196, -- [2]
									1439, -- [3]
								},
							}, -- [51]
							{
								["hash"] = "npcID6298",
								["faction"] = "Alliance",
								["coord"] = {
									38.20635080337524, -- [1]
									41.23611450195313, -- [2]
									1439, -- [3]
								},
								["text"] = "瑟尔格拉姆·石锤",
								["g"] = {
									{
										["itemID"] = 2901,
										["cost"] = 81,
									}, -- [1]
									{
										["itemID"] = 2880,
										["cost"] = 100,
									}, -- [2]
									{
										["itemID"] = 3466,
										["cost"] = 2000,
									}, -- [3]
									{
										["itemID"] = 3857,
										["cost"] = 500,
									}, -- [4]
								},
								["npcID"] = 6298,
							}, -- [52]
							{
								["hash"] = "npcID6300",
								["faction"] = "Alliance",
								["coord"] = {
									38.13276886940002, -- [1]
									41.17511510848999, -- [2]
									1439, -- [3]
								},
								["text"] = "艾丽萨·钢拳",
								["g"] = {
									{
										["hash"] = "itemID2901",
										["itemID"] = 2901,
										["cost"] = 81,
									}, -- [1]
									{
										["hash"] = "itemID5956",
										["itemID"] = 5956,
										["cost"] = 18,
									}, -- [2]
									{
										["hash"] = "itemID2880",
										["itemID"] = 2880,
										["cost"] = 100,
									}, -- [3]
									{
										["hash"] = "itemID3466",
										["itemID"] = 3466,
										["cost"] = 2000,
									}, -- [4]
									{
										["hash"] = "itemID3857",
										["itemID"] = 3857,
										["cost"] = 500,
									}, -- [5]
									{
										["hash"] = "itemID18567",
										["itemID"] = 18567,
										["cost"] = 150000,
									}, -- [6]
								},
								["npcID"] = 6300,
							}, -- [53]
						},
					}, -- [1]
				},
			}, -- [2]
		},
	}, -- [2]
	{
		["hash"] = "mapID291",
		["mapID"] = 291,
	}, -- [3]
	{
		["itemID"] = 2592,
		["hash"] = "itemID2592",
	}, -- [4]
	{
		["itemID"] = 915,
		["hash"] = "itemID915",
	}, -- [5]
	{
		["itemID"] = 1812,
		["hash"] = "itemID1812",
	}, -- [6]
	{
		["itemID"] = 2136,
		["hash"] = "itemID2136",
	}, -- [7]
	{
		["itemID"] = 2589,
		["hash"] = "itemID2589",
	}, -- [8]
	{
		["itemID"] = 1764,
		["hash"] = "itemID1764",
	}, -- [9]
	{
		["itemID"] = 414,
		["hash"] = "itemID414",
	}, -- [10]
	{
		["itemID"] = 2657,
		["hash"] = "itemID2657",
	}, -- [11]
	{
		["itemID"] = 6550,
		["hash"] = "itemID6550",
	}, -- [12]
	{
		["itemID"] = 5187,
		["hash"] = "itemID5187",
	}, -- [13]
	{
		["itemID"] = 2287,
		["hash"] = "itemID2287",
	}, -- [14]
	{
		["itemID"] = 4537,
		["hash"] = "itemID4537",
	}, -- [15]
	{
		["itemID"] = 1179,
		["hash"] = "itemID1179",
	}, -- [16]
	{
		["itemID"] = 1768,
		["hash"] = "itemID1768",
	}, -- [17]
	{
		["itemID"] = 1210,
		["hash"] = "itemID1210",
	}, -- [18]
	{
		["itemID"] = 1945,
		["hash"] = "itemID1945",
	}, -- [19]
	{
		["itemID"] = 7365,
		["hash"] = "itemID7365",
	}, -- [20]
	{
		["itemID"] = 2169,
		["hash"] = "itemID2169",
	}, -- [21]
	{
		["itemID"] = 5194,
		["hash"] = "itemID5194",
	}, -- [22]
	{
		["itemID"] = 5379,
		["hash"] = "itemID5379",
	}, -- [23]
	{
		["itemID"] = 1770,
		["hash"] = "itemID1770",
	}, -- [24]
	{
		["itemID"] = 4698,
		["hash"] = "itemID4698",
	}, -- [25]
	{
		["itemID"] = 858,
		["hash"] = "itemID858",
	}, -- [26]
	{
		["itemID"] = 10402,
		["hash"] = "itemID10402",
	}, -- [27]
	{
		["itemID"] = 814,
		["hash"] = "itemID814",
	}, -- [28]
	{
		["itemID"] = 4359,
		["hash"] = "itemID4359",
	}, -- [29]
	{
		["itemID"] = 4364,
		["hash"] = "itemID4364",
	}, -- [30]
	{
		["itemID"] = 1813,
		["hash"] = "itemID1813",
	}, -- [31]
	{
		["itemID"] = 1794,
		["hash"] = "itemID1794",
	}, -- [32]
	{
		["itemID"] = 1156,
		["hash"] = "itemID1156",
	}, -- [33]
	{
		["itemID"] = 6563,
		["hash"] = "itemID6563",
	}, -- [34]
	{
		["itemID"] = 1815,
		["hash"] = "itemID1815",
	}, -- [35]
	{
		["itemID"] = 4363,
		["hash"] = "itemID4363",
	}, -- [36]
	{
		["itemID"] = 4361,
		["hash"] = "itemID4361",
	}, -- [37]
	{
		["itemID"] = 2455,
		["hash"] = "itemID2455",
	}, -- [38]
	{
		["itemID"] = 5397,
		["hash"] = "itemID5397",
	}, -- [39]
	{
		["itemID"] = 1766,
		["hash"] = "itemID1766",
	}, -- [40]
	{
		["itemID"] = 15222,
		["hash"] = "itemID15222",
	}, -- [41]
	{
		["itemID"] = 1738,
		["hash"] = "itemID1738",
	}, -- [42]
	{
		["itemID"] = 5196,
		["hash"] = "itemID5196",
	}, -- [43]
	{
		["itemID"] = 1787,
		["hash"] = "itemID1787",
	}, -- [44]
	{
		["itemID"] = 1767,
		["hash"] = "itemID1767",
	}, -- [45]
	{
		["itemID"] = 1793,
		["hash"] = "itemID1793",
	}, -- [46]
	{
		["itemID"] = 1817,
		["hash"] = "itemID1817",
	}, -- [47]
	{
		["itemID"] = 1814,
		["hash"] = "itemID1814",
	}, -- [48]
	{
		["itemID"] = 6536,
		["hash"] = "itemID6536",
	}, -- [49]
	{
		["itemID"] = 2770,
		["hash"] = "itemID2770",
	}, -- [50]
	{
		["itemID"] = 1792,
		["hash"] = "itemID1792",
	}, -- [51]
	{
		["itemID"] = 7997,
		["hash"] = "itemID7997",
	}, -- [52]
	{
		["itemID"] = 2764,
		["hash"] = "itemID2764",
	}, -- [53]
	{
		["itemID"] = 5368,
		["hash"] = "itemID5368",
	}, -- [54]
	{
		["itemID"] = 1951,
		["hash"] = "itemID1951",
	}, -- [55]
	{
		["itemID"] = 5201,
		["hash"] = "itemID5201",
	}, -- [56]
	{
		["itemID"] = 5193,
		["hash"] = "itemID5193",
	}, -- [57]
	{
		["itemID"] = 3637,
		["hash"] = "itemID3637",
	}, -- [58]
	{
		["itemID"] = 2874,
		["hash"] = "itemID2874",
	}, -- [59]
	{
		["hash"] = "questID373",
		["description"] = "搜查艾德温·范克里夫的尸体时，你从一堆杂乱的物品中找到了一封还未来得及发出的信。地址一栏上写着巴隆斯·阿历克斯顿，暴风城石工协会，城市大厅，教堂广场。\n\n这显然是最近刚刚写好并封上的。",
		["questID"] = 373,
		["g"] = {
		},
		["objectives"] = "将艾德温·范克里夫的信交给巴隆斯·阿历克斯顿。",
	}, -- [60]
	{
		["itemID"] = 1510,
		["hash"] = "itemID1510",
	}, -- [61]
	{
		["itemID"] = 3012,
		["hash"] = "itemID3012",
	}, -- [62]
	{
		["itemID"] = 3643,
		["hash"] = "itemID3643",
	}, -- [63]
	{
		["itemID"] = 1894,
		["hash"] = "itemID1894",
	}, -- [64]
	{
		["itemID"] = 2771,
		["hash"] = "itemID2771",
	}, -- [65]
	{
		["itemID"] = 1788,
		["hash"] = "itemID1788",
	}, -- [66]
	{
		["itemID"] = 2781,
		["hash"] = "itemID2781",
	}, -- [67]
	{
		["itemID"] = 2581,
		["hash"] = "itemID2581",
	}, -- [68]
	{
		["itemID"] = 6547,
		["hash"] = "itemID6547",
	}, -- [69]
	{
		["itemID"] = 1113,
		["hash"] = "itemID1113",
	}, -- [70]
	{
		["itemID"] = 3655,
		["hash"] = "itemID3655",
	}, -- [71]
	{
		["itemID"] = 1875,
		["hash"] = "itemID1875",
	}, -- [72]
	{
		["itemID"] = 4567,
		["hash"] = "itemID4567",
	}, -- [73]
	{
		["itemID"] = 3577,
		["hash"] = "itemID3577",
	}, -- [74]
	{
		["itemID"] = 1811,
		["hash"] = "itemID1811",
	}, -- [75]
	{
		["itemID"] = 1741,
		["hash"] = "itemID1741",
	}, -- [76]
	{
		["itemID"] = 2835,
		["hash"] = "itemID2835",
	}, -- [77]
	{
		["itemID"] = 6583,
		["hash"] = "itemID6583",
	}, -- [78]
	{
		["hash"] = "mapID35",
		["mapID"] = 35,
	}, -- [79]
}
