
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1638037221,
				["averageItemLvl"] = 24.38461538461538,
				["Inventory"] = {
					[7] = "|cff0070dd|Hitem:6087:16:::::::33:::::::::|h[西部荒野马裤]|h|r",
					[15] = "|cff0070dd|Hitem:5193::::::::33:::::::::|h[兄弟会斗篷]|h|r",
					[18] = "|cffffffff|Hitem:15807::::::::33:::::::::|h[轻弩]|h|r",
					[4] = "|cffffffff|Hitem:2575::::::::33:::::::::|h[红色亚麻衬衣]|h|r",
					[8] = "|cff1eff00|Hitem:2910::::::::33:::::::::|h[金色民兵靴]|h|r",
					[16] = "|cff1eff00|Hitem:15225::::::1551:545490688:33:::::::::|h[能量之杉木锤]|h|r",
					[9] = "|cff1eff00|Hitem:6550::::::1179:1917742208:33:::::::::|h[野熊之士兵腕甲]|h|r",
					[5] = "|cff1eff00|Hitem:6545::::::1185:1179030656:33:::::::::|h[野熊之士兵护甲]|h|r",
					[10] = "|cff1eff00|Hitem:7606::::::::33:::::::::|h[极地护手]|h|r",
					[3] = "|cff1eff00|Hitem:9807::::::764:1759777920:33:::::::::|h[夜枭之超强护肩]|h|r",
					[11] = "|cff0070dd|Hitem:2933::::::::33:::::::::|h[乌瑞恩的图章]|h|r",
					[6] = "|cff1eff00|Hitem:7107::::::::33:::::::::|h[群星腰带]|h|r",
					[12] = "|cff1eff00|Hitem:12007::::::591:696674816:33:::::::::|h[灵猴之牧场戒指]|h|r",
					[17] = "|cff1eff00|Hitem:15231::::::1100:691838720:33:::::::::|h[野猪之狂战士飞斧]|h|r",
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 26,
					},
					["特变电工"] = {
						["averageItemLvl"] = 23,
					},
				},
			},
		},
	},
}
