
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638208019,
				["numFreeBagSlots"] = 8,
				["numBagSlots"] = 62,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							6245, -- [1]
							19938, -- [2]
							15131, -- [3]
							3793, -- [4]
						},
						["links"] = {
							"|cffffffff|Hitem:6245::::::::39:::::::::|h[卡尼托的背包]|h|r", -- [1]
							"|cff9d9d9d|Hitem:19938::::::::39:::::::::|h[重蝎腿]|h|r", -- [2]
							"|cff1eff00|Hitem:15131::::::1024:1253914240:39:::::::::|h[巨鲸之凶残长靴]|h|r", -- [3]
							"|cff9d9d9d|Hitem:3793::::::::39:::::::::|h[交织布靴]|h|r", -- [4]
						},
						["counts"] = {
							nil, -- [1]
							3, -- [2]
						},
						["link"] = "|cffffffff|Hitem:1725::::::::39:::::::::|h[大背包]|h|r",
						["size"] = 12,
						["icon"] = 133632,
						["freeslots"] = 8,
					},
					["Bag100"] = {
						["size"] = 24,
						["ids"] = {
							3655, -- [1]
						},
						["freeslots"] = 23,
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							3827, -- [1]
							6362, -- [2]
							3518, -- [3]
							3660, -- [4]
							7442, -- [5]
							2592, -- [6]
							16788, -- [7]
							4123, -- [8]
							8544, -- [9]
							6450, -- [10]
						},
						["links"] = {
							"|cffffffff|Hitem:3827::::::::39:::::::::|h[法力药水]|h|r", -- [1]
							"|cffffffff|Hitem:6362::::::::39:::::::::|h[新鲜的石鳞鳕鱼]|h|r", -- [2]
							"|cffffffff|Hitem:3518::::::::39:::::::::|h[被破译的信件]|h|r", -- [3]
							"|cffffffff|Hitem:3660::::::::39:::::::::|h[奥特兰克的书籍]|h|r", -- [4]
							"|cffffffff|Hitem:7442::::::::39:::::::::|h[基尔卡克的钥匙]|h|r", -- [5]
							"|cffffffff|Hitem:2592::::::::39:::::::::|h[毛料]|h|r", -- [6]
							"|cff1eff00|Hitem:16788::::::::39:::::::::|h[拉克摩尔船长的船舵]|h|r", -- [7]
							"|cff1eff00|Hitem:4123::::::::39:::::::::|h[寒铁肩铠]|h|r", -- [8]
							"|cffffffff|Hitem:8544::::::::39:::::::::|h[魔纹绷带]|h|r", -- [9]
							"|cffffffff|Hitem:6450::::::::39:::::::::|h[丝质绷带]|h|r", -- [10]
						},
						["icon"] = 133628,
						["link"] = "|cffffffff|Hitem:4245::::::::39:::::::::|h[丝绸小包]|h|r",
						["counts"] = {
							2, -- [1]
							3, -- [2]
							[6] = 20,
							[9] = 2,
							[10] = 20,
						},
						["size"] = 10,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							4338, -- [1]
							3248, -- [2]
							3771, -- [3]
							2592, -- [4]
							16789, -- [5]
							3385, -- [6]
							6223, -- [7]
							15848, -- [8]
							4634, -- [9]
							13703, -- [10]
						},
						["links"] = {
							"|cffffffff|Hitem:4338::::::::39:::::::::|h[魔纹布]|h|r", -- [1]
							"|cffffffff|Hitem:3248::::::::39:::::::::|h[翻译好的藏尸者信件]|h|r", -- [2]
							"|cffffffff|Hitem:3771::::::::39:::::::::|h[野猪火腿]|h|r", -- [3]
							"|cffffffff|Hitem:2592::::::::39:::::::::|h[毛料]|h|r", -- [4]
							"|cff1eff00|Hitem:16789::::::::39:::::::::|h[拉克摩尔船长的舵柄]|h|r", -- [5]
							"|cffffffff|Hitem:3385::::::::39:::::::::|h[次级法力药水]|h|r", -- [6]
							"|cff1eff00|Hitem:6223::::::::39:::::::::|h[夜色镇徽记之盾]|h|r", -- [7]
							"|cffffffff|Hitem:15848::::::::39:::::::::|h[幽灵磁铁箱]|h|r", -- [8]
							"|cff1eff00|Hitem:4634::::::::39:::::::::|h[铁质宝箱]|h|r", -- [9]
							"|cffffffff|Hitem:13703::::::::39:::::::::|h[科多兽骨]|h|r", -- [10]
						},
						["icon"] = 133628,
						["link"] = "|cffffffff|Hitem:4245::::::::39:::::::::|h[丝绸小包]|h|r",
						["counts"] = {
							[3] = 6,
							[10] = 10,
							[4] = 11,
						},
						["size"] = 10,
					},
					["Bag0"] = {
						["ids"] = {
							5800, -- [1]
							6948, -- [2]
							15225, -- [3]
							8075, -- [4]
							8075, -- [5]
							6451, -- [6]
							2665, -- [7]
							11884, -- [8]
							8075, -- [9]
							5827, -- [10]
							3713, -- [11]
							8075, -- [12]
							5122, -- [13]
							6451, -- [14]
							6450, -- [15]
							3898, -- [16]
							5852, -- [17]
							4306, -- [18]
							3030, -- [19]
							3728, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:5800::::::::38:::::::::|h[克拉维尔的零件]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::38:::::::::|h[炉石]|h|r", -- [2]
							"|cff1eff00|Hitem:15225::::::1551:545490688:38:::::::::|h[能量之杉木锤]|h|r", -- [3]
							"|cffffffff|Hitem:8075::::::::38:::::::::|h[魔法酵母]|h|r", -- [4]
							"|cffffffff|Hitem:8075::::::::38:::::::::|h[魔法酵母]|h|r", -- [5]
							"|cffffffff|Hitem:6451::::::::38:::::::::|h[厚丝质绷带]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::38:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cff1eff00|Hitem:11884::::::::38:::::::::|h[月光披肩]|h|r", -- [8]
							"|cffffffff|Hitem:8075::::::::38:::::::::|h[魔法酵母]|h|r", -- [9]
							"|cffffffff|Hitem:5827::::::::38:::::::::|h[菲兹尔·铜栓的信]|h|r", -- [10]
							"|cffffffff|Hitem:3713::::::::38:::::::::|h[舒心草]|h|r", -- [11]
							"|cffffffff|Hitem:8075::::::::38:::::::::|h[魔法酵母]|h|r", -- [12]
							"|cff9d9d9d|Hitem:5122::::::::38:::::::::|h[厚科多兽毛]|h|r", -- [13]
							"|cffffffff|Hitem:6451::::::::38:::::::::|h[厚丝质绷带]|h|r", -- [14]
							"|cffffffff|Hitem:6450::::::::38:::::::::|h[丝质绷带]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::38:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:5852::::::::38:::::::::|h[燃料调节器的蓝图]|h|r", -- [17]
							"|cffffffff|Hitem:4306::::::::38:::::::::|h[丝绸]|h|r", -- [18]
							"|cffffffff|Hitem:3030::::::::38:::::::::|h[锐锋箭]|h|r", -- [19]
							"|cffffffff|Hitem:3728::::::::38:::::::::|h[香烤狮肉]|h|r", -- [20]
						},
						["cooldowns"] = {
							[20] = "1638206651.7|1|1",
							[12] = "1638206651.7|1|1",
							[4] = "1638206651.7|1|1",
							[9] = "1638206651.7|1|1",
							[5] = "1638206651.7|1|1",
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							[13] = 2,
							[14] = 6,
							[15] = 14,
							[9] = 20,
							[18] = 20,
							[19] = 145,
							[20] = 5,
							[11] = 4,
							[6] = 20,
							[12] = 20,
							[5] = 20,
						},
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::39:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cff9d9d9d|Hitem:3799::::::::39:::::::::|h[交织外衣]|h|r", -- [1]
							"|cff9d9d9d|Hitem:5121::::::::39:::::::::|h[肮脏的科多兽鳞片]|h|r", -- [2]
							"|cffffffff|Hitem:4306::::::::39:::::::::|h[丝绸]|h|r", -- [3]
							"|cff1eff00|Hitem:4636::::::::39:::::::::|h[精铁宝箱]|h|r", -- [4]
							"|cffffffff|Hitem:1710::::::::39:::::::::|h[强效治疗药水]|h|r", -- [5]
							"|cffffffff|Hitem:4306::::::::39:::::::::|h[丝绸]|h|r", -- [6]
							"|cffffffff|Hitem:12037::::::::39:::::::::|h[神秘的肉]|h|r", -- [7]
							"|cff1eff00|Hitem:16793::::::::39:::::::::|h[弧铁肩甲]|h|r", -- [8]
							"|cffffffff|Hitem:1288::::::::39:::::::::|h[大毒囊]|h|r", -- [9]
							"|cff9d9d9d|Hitem:19937::::::::39:::::::::|h[小蝎爪]|h|r", -- [10]
						},
						["counts"] = {
							[3] = 20,
							[6] = 12,
							[5] = 2,
						},
						["ids"] = {
							3799, -- [1]
							5121, -- [2]
							4306, -- [3]
							4636, -- [4]
							1710, -- [5]
							4306, -- [6]
							12037, -- [7]
							16793, -- [8]
							1288, -- [9]
							19937, -- [10]
						},
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
