
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1638643113,
				["averageItemLvl"] = 37.8,
				["Inventory"] = {
					"|cff1eff00|Hitem:1282::::::::44:::::::::|h[火花铁帽]|h|r", -- [1]
					"|cff1eff00|Hitem:12028::::::1188:2053675904:44:::::::::|h[野熊之黑陶项链]|h|r", -- [2]
					"|cff1eff00|Hitem:15698::::::::44:::::::::|h[激斗肩铠]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::44:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff1eff00|Hitem:11195::::::::44:::::::::|h[战铸胸甲]|h|r", -- [5]
					"|cff1eff00|Hitem:14906::::::1560:1157381632:44:::::::::|h[能量之蛮兽腰带]|h|r", -- [6]
					"|cff0070dd|Hitem:6087:16:::::::44:::::::::|h[西部荒野马裤]|h|r", -- [7]
					"|cff1eff00|Hitem:4653::::::::44:::::::::|h[铁踵之靴]|h|r", -- [8]
					"|cff0070dd|Hitem:9409::::::1557:176719232:44:::::::::|h[能量之艾隆纳亚的护腕]|h|r", -- [9]
					"|cff0070dd|Hitem:9410::::::1208:1184142464:44:::::::::|h[野熊之山壁之拳]|h|r", -- [10]
					"|cff0070dd|Hitem:2933::::::::44:::::::::|h[乌瑞恩的图章]|h|r", -- [11]
					"|cff1eff00|Hitem:7552::::::::44:::::::::|h[猎鹰之钩]|h|r", -- [12]
					"|cff1eff00|Hitem:2820::::::::44:::::::::|h[灵巧秒表]|h|r", -- [13]
					nil, -- [14]
					"|cff0070dd|Hitem:5193::::::::44:::::::::|h[兄弟会斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:9418::::::::44:::::::::|h[斩石者]|h|r", -- [16]
					nil, -- [17]
					"|cffffffff|Hitem:15807::::::::44:::::::::|h[轻弩]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
