
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1640458252,
				["Factions"] = {
					18701, -- [1]
					nil, -- [2]
					20386, -- [3]
					29366, -- [4]
					[25] = 396,
					[15] = 8700,
					[30] = 770,
					[16] = 5887,
					[9] = 143,
					[18] = 6225,
					[19] = 15622,
					[11] = 5852,
					[22] = 297,
					[17] = 7793,
					[32] = 1728,
				},
			},
		},
	},
}
