
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1639501608,
				["Factions"] = {
					17821, -- [1]
					nil, -- [2]
					19402, -- [3]
					28053, -- [4]
					[25] = 16,
					[15] = 8700,
					[30] = 770,
					[16] = 5887,
					[32] = 1728,
					[18] = 6225,
					[19] = 475,
					[11] = 3,
					[22] = 165,
					[17] = 7793,
				},
			},
		},
	},
}
