
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1639070205,
				["numFreeBagSlots"] = 33,
				["numBagSlots"] = 76,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							2799, -- [2]
							3030, -- [3]
							nil, -- [4]
							6259, -- [5]
							nil, -- [6]
							nil, -- [7]
							8075, -- [8]
							8075, -- [9]
							[11] = 4338,
							[13] = 5117,
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:2799::::::::50:::::::::|h[猩猩牙]|h|r", -- [2]
							"|cffffffff|Hitem:3030::::::::50:::::::::|h[锐锋箭]|h|r", -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:6259::::::::50:::::::::|h[格罗多克猩猩的肝脏]|h|r", -- [5]
							nil, -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:8075::::::::50:::::::::|h[魔法酵母]|h|r", -- [8]
							"|cffffffff|Hitem:8075::::::::50:::::::::|h[魔法酵母]|h|r", -- [9]
							[11] = "|cffffffff|Hitem:4338::::::::50:::::::::|h[魔纹布]|h|r",
							[13] = "|cffffffff|Hitem:5117::::::::50:::::::::|h[鲜艳的羽毛]|h|r",
						},
						["counts"] = {
							nil, -- [1]
							10, -- [2]
							118, -- [3]
							nil, -- [4]
							3, -- [5]
							nil, -- [6]
							nil, -- [7]
							19, -- [8]
							19, -- [9]
							nil, -- [10]
							18, -- [11]
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::50:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 7,
					},
					["Bag100"] = {
						["freeslots"] = 23,
						["ids"] = {
							3655, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							13446, -- [1]
							10443, -- [2]
							8151, -- [3]
							4623, -- [4]
							9240, -- [5]
							nil, -- [6]
							10660, -- [7]
							10561, -- [8]
							[11] = 1645,
							[12] = 4306,
							[13] = 9471,
						},
						["links"] = {
							"|cffffffff|Hitem:13446::::::::50:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:10443::::::::50:::::::::|h[烧焦的信件]|h|r", -- [2]
							"|cffffffff|Hitem:8151::::::::50:::::::::|h[魔精]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::50:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cff1eff00|Hitem:9240::::::::50:::::::::|h[祖尔法拉克之槌]|h|r", -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:10660::::::::50:::::::::|h[第一块摩沙鲁石板]|h|r", -- [7]
							"|cffffffff|Hitem:10561::::::::50:::::::::|h[秘银外壳]|h|r", -- [8]
							[11] = "|cffffffff|Hitem:1645::::::::50:::::::::|h[草莓汁]|h|r",
							[12] = "|cffffffff|Hitem:4306::::::::50:::::::::|h[丝绸]|h|r",
							[13] = "|cffffffff|Hitem:9471::::::::50:::::::::|h[耐克鲁姆的徽章]|h|r",
						},
						["freeslots"] = 4,
						["counts"] = {
							4, -- [1]
							[3] = 5,
							[12] = 2,
							[4] = 2,
						},
						["link"] = "|cffffffff|Hitem:14046::::::::50:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::50:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cff1eff00|Hitem:6828::::::::50:::::::::|h[幻像圆盾]|h|r", -- [1]
							"|cffffffff|Hitem:11324::::::::50:::::::::|h[探险者的背包]|h|r", -- [2]
							"|cffffffff|Hitem:9260::::::::50:::::::::|h[烈性朗姆酒]|h|r", -- [3]
							"|cff0070dd|Hitem:11086::::::::50:::::::::|h[保护者迦萨斯]|h|r", -- [4]
							"|cffffffff|Hitem:9234::::::::50:::::::::|h[深渊皇冠]|h|r", -- [5]
							"|cffffffff|Hitem:10661::::::::50:::::::::|h[第二块摩沙鲁石板]|h|r", -- [6]
							[10] = "|cff1eff00|Hitem:8623::::::::50:::::::::|h[OOX-17/TN定位器]|h|r",
							[11] = "|cffffffff|Hitem:4338::::::::50:::::::::|h[魔纹布]|h|r",
						},
						["freeslots"] = 6,
						["ids"] = {
							6828, -- [1]
							11324, -- [2]
							9260, -- [3]
							11086, -- [4]
							9234, -- [5]
							10661, -- [6]
							[10] = 8623,
							[11] = 4338,
						},
						["icon"] = 133652,
						["counts"] = {
							[11] = 3,
						},
						["size"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							11471, -- [1]
							6948, -- [2]
							13446, -- [3]
							17048, -- [4]
							5655, -- [5]
							19040, -- [6]
							9507, -- [7]
							18294, -- [8]
							8647, -- [9]
							[11] = 7971,
							[12] = 5866,
							[13] = 12359,
							[15] = 13446,
							[16] = 3898,
							[18] = 8545,
						},
						["links"] = {
							"|cffffffff|Hitem:11471::::::::50:::::::::|h[脆弱的小精龙卵]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::50:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:13446::::::::50:::::::::|h[特效治疗药水]|h|r", -- [3]
							"|cffffffff|Hitem:17048::::::::50:::::::::|h[奇特的朗姆酒]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::50:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cff1eff00|Hitem:19040::::::::50:::::::::|h[索尔宾的大砍刀]|h|r", -- [6]
							"|cffffffff|Hitem:9507::::::::50:::::::::|h[仔细包装过的箱子]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::50:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							"|cffffffff|Hitem:8647::::::::50:::::::::|h[蛋箱]|h|r", -- [9]
							[11] = "|cff1eff00|Hitem:7971::::::::50:::::::::|h[黑珍珠]|h|r",
							[12] = "|cffffffff|Hitem:5866::::::::50:::::::::|h[精铁矿石样本]|h|r",
							[13] = "|cffffffff|Hitem:12359::::::::50:::::::::|h[瑟银锭]|h|r",
							[15] = "|cffffffff|Hitem:13446::::::::50:::::::::|h[特效治疗药水]|h|r",
							[16] = "|cffffffff|Hitem:3898::::::::50:::::::::|h[图书馆手稿]|h|r",
							[18] = "|cffffffff|Hitem:8545::::::::50:::::::::|h[厚魔纹绷带]|h|r",
						},
						["freeslots"] = 5,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							[15] = 5,
							[13] = 2,
							[8] = 3,
							[18] = 18,
							[4] = 5,
						},
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::50:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:6258::::::::50:::::::::|h[铁鬃熊的肝脏]|h|r", -- [11]
							"|cffffffff|Hitem:4582::::::::50:::::::::|h[柔软的狼尾]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::50:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 11,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							6258, -- [11]
							4582, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["counts"] = {
							[12] = 3,
							[11] = 3,
						},
						["size"] = 14,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
