
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["Inventory"] = {
					"|cffa335ee|Hitem:12640:2543:::::::60:::::::::|h[狮心头盔]|h|r", -- [1]
					"|cff0070dd|Hitem:15411::::::::60:::::::::|h[弗丁印记]|h|r", -- [2]
					"|cff0070dd|Hitem:12927::::::::60:::::::::|h[强击护肩]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::60:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cffa335ee|Hitem:11726:1891:::::::60:::::::::|h[野蛮角斗士链甲]|h|r", -- [5]
					"|cff0070dd|Hitem:13142::::::::60:::::::::|h[黑龙束带]|h|r", -- [6]
					"|cff0070dd|Hitem:15062:2543:::::::60:::::::::|h[魔暴龙皮护腿]|h|r", -- [7]
					"|cff1eff00|Hitem:9637::::::::60:::::::::|h[断骨长靴]|h|r", -- [8]
					"|cff0070dd|Hitem:12936:1885:::::::60:::::::::|h[雷德的护腕]|h|r", -- [9]
					"|cff0070dd|Hitem:15063:931:::::::60:::::::::|h[魔暴龙皮手套]|h|r", -- [10]
					"|cff0070dd|Hitem:12548::::::::60:::::::::|h[麦格尼的意志]|h|r", -- [11]
					"|cff0070dd|Hitem:13098::::::::60:::::::::|h[痛苦指环]|h|r", -- [12]
					"|cff0070dd|Hitem:13965::::::::60:::::::::|h[黑手饰物]|h|r", -- [13]
					"|cff0070dd|Hitem:11815::::::::60:::::::::|h[正义之手]|h|r", -- [14]
					"|cff0070dd|Hitem:13340:849:::::::60:::::::::|h[黑爵士的斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:12940:1900:::::::60:::::::::|h[雷德的神圣控诉者]|h|r", -- [16]
					"|cff0070dd|Hitem:12939:1900:::::::60:::::::::|h[雷德的部族护卫者]|h|r", -- [17]
					"|cff0070dd|Hitem:18323:664:::::::60:::::::::|h[萨特强弓]|h|r", -- [18]
				},
				["averageItemLvl"] = 60.11764705882353,
				["lastUpdate"] = 1640631126,
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.山河归一"] = {
				["Members"] = {
					["阿阮"] = {
						["averageItemLvl"] = 3,
					},
				},
			},
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
