
DataStore_MailsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1643126605,
				["Mails"] = {
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 20,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 29.29120445251465,
					}, -- [1]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 20,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 29.29120445251465,
					}, -- [2]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14343,
						["link"] = "|cff0070dd|Hitem:14343::::::::60:::::::::|h[小块魔光碎片]|h|r",
						["count"] = 1,
						["lastCheck"] = 1643126605,
						["icon"] = 132874,
						["daysLeft"] = 29.29120445251465,
					}, -- [3]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 13,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 29.29120445251465,
					}, -- [4]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 11176,
						["link"] = "|cffffffff|Hitem:11176::::::::60:::::::::|h[梦境之尘]|h|r",
						["count"] = 5,
						["lastCheck"] = 1643126605,
						["icon"] = 132855,
						["daysLeft"] = 29.29120445251465,
					}, -- [5]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 20,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 29.29120445251465,
					}, -- [6]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 7910,
						["link"] = "|cff1eff00|Hitem:7910::::::::60:::::::::|h[红宝石]|h|r",
						["count"] = 2,
						["lastCheck"] = 1643126605,
						["icon"] = 134129,
						["daysLeft"] = 29.29120445251465,
					}, -- [7]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 16203,
						["link"] = "|cff1eff00|Hitem:16203::::::::60:::::::::|h[强效不灭精华]|h|r",
						["count"] = 5,
						["lastCheck"] = 1643126605,
						["icon"] = 132864,
						["daysLeft"] = 29.29120445251465,
					}, -- [8]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 20,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 29.29120445251465,
					}, -- [9]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 20,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 29.29120445251465,
					}, -- [10]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 20,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 29.29120445251465,
					}, -- [11]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 16204,
						["link"] = "|cffffffff|Hitem:16204::::::::60:::::::::|h[幻影之尘]|h|r",
						["count"] = 16,
						["lastCheck"] = 1643126605,
						["icon"] = 132856,
						["daysLeft"] = 29.29120445251465,
					}, -- [12]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 4337,
						["link"] = "|cffffffff|Hitem:4337::::::::60:::::::::|h[粗蜘蛛丝]|h|r",
						["count"] = 2,
						["lastCheck"] = 1643126605,
						["icon"] = 136113,
						["daysLeft"] = 30.29122734069824,
					}, -- [13]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 7972,
						["link"] = "|cffffffff|Hitem:7972::::::::60:::::::::|h[亡灵腐液]|h|r",
						["count"] = 1,
						["lastCheck"] = 1643126605,
						["icon"] = 134437,
						["daysLeft"] = 30.29122734069824,
					}, -- [14]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 14,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 30.29122734069824,
					}, -- [15]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 14047,
						["link"] = "|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r",
						["count"] = 20,
						["lastCheck"] = 1643126605,
						["icon"] = 132903,
						["daysLeft"] = 30.29122734069824,
					}, -- [16]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 8545,
						["link"] = "|cffffffff|Hitem:8545::::::::60:::::::::|h[厚魔纹绷带]|h|r",
						["count"] = 5,
						["lastCheck"] = 1643126605,
						["icon"] = 133690,
						["daysLeft"] = 30.29122734069824,
					}, -- [17]
					{
						["returned"] = true,
						["sender"] = "Dwac",
						["itemID"] = 16204,
						["link"] = "|cffffffff|Hitem:16204::::::::60:::::::::|h[幻影之尘]|h|r",
						["count"] = 4,
						["lastCheck"] = 1643126605,
						["icon"] = 132856,
						["daysLeft"] = 30.29122734069824,
					}, -- [18]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-20 00时,在游戏中对玩家 黑龙费尔默-A******s的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.0194702148438,
					}, -- [19]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 15时,在游戏中对玩家 鱼人摩洛克-还***牛的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 361.6521911621094,
					}, -- [20]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 鱼人摩洛克-灬**灬的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 361.7745971679688,
					}, -- [21]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 火妖鲁西弗隆-熊*丶的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 361.7747497558594,
					}, -- [22]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 鱼人摩洛克-北***杨的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 361.7749328613281,
					}, -- [23]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 逐风者-J**x的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 361.7751770019531,
					}, -- [24]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 鱼人摩洛克-亡****哥的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 361.7753295898438,
					}, -- [25]
					{
						["lastCheck"] = 1643126605,
						["sender"] = "客服支持",
						["subject"] = "举报结果通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "您好! \n您于 2022-01-20 00时,在游戏中举报的玩家黑龙费尔默-A******s 已被证实存在违规行为而受到临时冻结处罚 。 推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 363.2638854980469,
					}, -- [26]
				},
				["lastVisitDate"] = "2022/01/26 00:03",
			},
		},
	},
}
