
DataStore_AuctionsDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1655622749,
				["Auctions"] = {
					"0|20404|9||149975|149975|3", -- [1]
					"0|12804|4||7899|7899|3", -- [2]
					"0|7910|1||6499|6499|3", -- [3]
					"0|3864|1||1672|1672|3", -- [4]
					"0|13446|5||10007499|10007499|3", -- [5]
				},
				["lastVisitDate"] = "2022/06/19 15:12",
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645540372,
				["lastVisitDate"] = "2022/02/22 22:32",
			},
		},
	},
}
