
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 13,
				["numBankSlots"] = 110,
				["lastUpdate"] = 1642099179,
				["numFreeBagSlots"] = 46,
				["Containers"] = {
					["Bag10"] = {
						["rarity"] = 1,
					},
					["Bag8"] = {
						["rarity"] = 2,
					},
					["Bag0"] = {
						["ids"] = {
							18587, -- [1]
							6948, -- [2]
							11285, -- [3]
							17904, -- [4]
							22895, -- [5]
							20558, -- [6]
							13965, -- [7]
							17333, -- [8]
							nil, -- [9]
							22895, -- [10]
							22895, -- [11]
							22895, -- [12]
							3387, -- [13]
							19045, -- [14]
							5956, -- [15]
							22895, -- [16]
							nil, -- [17]
							22895, -- [18]
							2820, -- [19]
							10790, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:18587::::::::60:::::::::|h[地精起搏器XL型]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::60:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:11285::::::::60:::::::::|h[锯齿箭]|h|r", -- [3]
							"|cffa335ee|Hitem:17904::::::::60:::::::::|h[6级雷矛勋章]|h|r", -- [4]
							"|cffffffff|Hitem:22895::::::::60:::::::::|h[魔法肉桂面包]|h|r", -- [5]
							"|cff1eff00|Hitem:20558::::::::60:::::::::|h[战歌峡谷荣誉奖章]|h|r", -- [6]
							"|cff0070dd|Hitem:13965::::::::60:::::::::|h[黑手饰物]|h|r", -- [7]
							"|cffffffff|Hitem:17333::::::::60:::::::::|h[水之精萃]|h|r", -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:22895::::::::60:::::::::|h[魔法肉桂面包]|h|r", -- [10]
							"|cffffffff|Hitem:22895::::::::60:::::::::|h[魔法肉桂面包]|h|r", -- [11]
							"|cffffffff|Hitem:22895::::::::60:::::::::|h[魔法肉桂面包]|h|r", -- [12]
							"|cffffffff|Hitem:3387::::::::60:::::::::|h[有限无敌药水]|h|r", -- [13]
							"|cff0070dd|Hitem:19045::::::::60:::::::::|h[雷矛军旗]|h|r", -- [14]
							"|cffffffff|Hitem:5956::::::::60:::::::::|h[铁匠之锤]|h|r", -- [15]
							"|cffffffff|Hitem:22895::::::::60:::::::::|h[魔法肉桂面包]|h|r", -- [16]
							nil, -- [17]
							"|cffffffff|Hitem:22895::::::::60:::::::::|h[魔法肉桂面包]|h|r", -- [18]
							"|cff1eff00|Hitem:2820::::::::60:::::::::|h[灵巧秒表]|h|r", -- [19]
							"|cffffffff|Hitem:10790::::::::60:::::::::|h[侏儒工程师协会会员卡]|h|r", -- [20]
						},
						["freeslots"] = 2,
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							61, -- [3]
							nil, -- [4]
							9, -- [5]
							16, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							20, -- [10]
							20, -- [11]
							20, -- [12]
							4, -- [13]
							nil, -- [14]
							nil, -- [15]
							20, -- [16]
							nil, -- [17]
							20, -- [18]
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 2,
						["link"] = "|cff1eff00|Hitem:4500::::::::60:::::::::|h[旅行者的背包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:13446::::::::60:::::::::|h[特效治疗药水]|h|r", -- [8]
							[10] = "|cffffffff|Hitem:14530::::::::60:::::::::|h[厚符文布绷带]|h|r",
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							2, -- [8]
							[10] = 19,
						},
						["size"] = 16,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							13446, -- [8]
							[10] = 14530,
						},
						["icon"] = 133633,
						["freeslots"] = 14,
					},
					["Bag100"] = {
						["ids"] = {
							18399, -- [1]
							12640, -- [2]
							13529, -- [3]
							17746, -- [4]
							12065, -- [5]
							9958, -- [6]
							9030, -- [7]
							12927, -- [8]
							9240, -- [9]
							17191, -- [10]
							18370, -- [11]
							14620, -- [12]
							13072, -- [13]
							21994, -- [14]
							18384, -- [15]
							12935, -- [16]
							14525, -- [17]
							18466, -- [18]
							14617, -- [19]
							7910, -- [20]
							4638, -- [21]
							4638, -- [22]
							11078, -- [23]
							7068, -- [24]
						},
						["size"] = 24,
						["counts"] = {
							[24] = 2,
							[7] = 4,
							[20] = 2,
							[23] = 18,
						},
						["links"] = {
							"|cff0070dd|Hitem:18399::::::::60:::::::::|h[海洋之风]|h|r", -- [1]
							"|cffa335ee|Hitem:12640:2543:::::::60:::::::::|h[狮心头盔]|h|r", -- [2]
							"|cff0070dd|Hitem:13529::::::::60:::::::::|h[奈鲁布恩坎的壳]|h|r", -- [3]
							"|cff0070dd|Hitem:17746::::::::60:::::::::|h[诺克赛恩的镣铐]|h|r", -- [4]
							"|cff1eff00|Hitem:12065::::::::60:::::::::|h[元素屏障]|h|r", -- [5]
							"|cff1eff00|Hitem:9958::::::1200:687029632:60:::::::::|h[野熊之好战者的圆盾]|h|r", -- [6]
							"|cffffffff|Hitem:9030::::::::60:::::::::|h[滋补药剂]|h|r", -- [7]
							"|cff0070dd|Hitem:12927::::::::60:::::::::|h[强击护肩]|h|r", -- [8]
							"|cff1eff00|Hitem:9240::::::::60:::::::::|h[祖尔法拉克之槌]|h|r", -- [9]
							"|cff0070dd|Hitem:17191::::::::60:::::::::|h[塞雷布拉斯节杖]|h|r", -- [10]
							"|cff0070dd|Hitem:18370::::::::60:::::::::|h[警惕护符]|h|r", -- [11]
							"|cff0070dd|Hitem:14620::::::::60:::::::::|h[亡骨束带]|h|r", -- [12]
							"|cff0070dd|Hitem:13072::::::::60:::::::::|h[握石护手]|h|r", -- [13]
							"|cff0070dd|Hitem:21994::::::::60:::::::::|h[英勇腰带]|h|r", -- [14]
							"|cff0070dd|Hitem:18384::::::::60:::::::::|h[胆汁肩铠]|h|r", -- [15]
							"|cff0070dd|Hitem:12935::::::::60:::::::::|h[战争统帅护腿]|h|r", -- [16]
							"|cff0070dd|Hitem:14525::::::::60:::::::::|h[骨节护手]|h|r", -- [17]
							"|cff0070dd|Hitem:18466::::::::60:::::::::|h[埃雷萨拉斯皇家徽记]|h|r", -- [18]
							"|cffffffff|Hitem:14617::::::::60:::::::::|h[外科医生衬衣]|h|r", -- [19]
							"|cff1eff00|Hitem:7910::::::::60:::::::::|h[红宝石]|h|r", -- [20]
							"|cff1eff00|Hitem:4638::::::::60:::::::::|h[强化钢质宝箱]|h|r", -- [21]
							"|cff1eff00|Hitem:4638::::::::60:::::::::|h[强化钢质宝箱]|h|r", -- [22]
							"|cffffffff|Hitem:11078::::::::60:::::::::|h[遗物宝箱钥匙]|h|r", -- [23]
							"|cffffffff|Hitem:7068::::::::60:::::::::|h[元素火焰]|h|r", -- [24]
						},
					},
					["Bag5"] = {
						["rarity"] = 1,
					},
					["Bag4"] = {
						["rarity"] = 2,
						["link"] = "|cff1eff00|Hitem:4500::::::::60:::::::::|h[旅行者的背包]|h|r",
						["links"] = {
							[13] = "|cff1eff00|Hitem:15870::::::::60:::::::::|h[黄金万能钥匙]|h|r",
						},
						["counts"] = {
							[13] = 6,
						},
						["size"] = 16,
						["ids"] = {
							[13] = 15870,
						},
						["icon"] = 133633,
						["freeslots"] = 15,
					},
					["Bag-2"] = {
						["ids"] = {
							11000, -- [1]
							12382, -- [2]
						},
						["links"] = {
							"|cffffffff|Hitem:11000::::::::60:::::::::|h[暗炉钥匙]|h|r", -- [1]
							"|cff1eff00|Hitem:12382::::::::60:::::::::|h[城市大门钥匙]|h|r", -- [2]
						},
						["freeslots"] = 30,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag1"] = {
						["rarity"] = 2,
						["link"] = "|cff1eff00|Hitem:4500::::::::60:::::::::|h[旅行者的背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:8529::::::::60:::::::::|h[诺格弗格药剂]|h|r", -- [2]
							"|cffffffff|Hitem:3486::::::::60:::::::::|h[重砂轮]|h|r", -- [3]
							"|cffffffff|Hitem:9206::::::::60:::::::::|h[巨人药剂]|h|r", -- [4]
							"|cffffffff|Hitem:13928::::::::60:::::::::|h[烤鱿鱼]|h|r", -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							"|cff1eff00|Hitem:20559::::::::60:::::::::|h[阿拉希盆地荣誉奖章]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:4306::::::::60:::::::::|h[丝绸]|h|r", -- [14]
							nil, -- [15]
							"|cffffffff|Hitem:11285::::::::60:::::::::|h[锯齿箭]|h|r", -- [16]
						},
						["icon"] = 133633,
						["size"] = 16,
						["ids"] = {
							nil, -- [1]
							8529, -- [2]
							3486, -- [3]
							9206, -- [4]
							13928, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							20559, -- [12]
							nil, -- [13]
							4306, -- [14]
							nil, -- [15]
							11285, -- [16]
						},
						["counts"] = {
							nil, -- [1]
							4, -- [2]
							14, -- [3]
							2, -- [4]
							18, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							7, -- [12]
							nil, -- [13]
							10, -- [14]
							nil, -- [15]
							200, -- [16]
						},
						["freeslots"] = 9,
					},
					["Bag2"] = {
						["rarity"] = 2,
						["ids"] = {
							4390, -- [1]
							4390, -- [2]
							16309, -- [3]
							18777, -- [4]
							nil, -- [5]
							14047, -- [6]
							nil, -- [7]
							13523, -- [8]
							nil, -- [9]
							nil, -- [10]
							14047, -- [11]
							nil, -- [12]
							13457, -- [13]
							7075, -- [14]
							nil, -- [15]
							6219, -- [16]
						},
						["links"] = {
							"|cffffffff|Hitem:4390::::::::60:::::::::|h[铁皮手雷]|h|r", -- [1]
							"|cffffffff|Hitem:4390::::::::60:::::::::|h[铁皮手雷]|h|r", -- [2]
							"|cff0070dd|Hitem:16309::::::::60:::::::::|h[龙火护符]|h|r", -- [3]
							"|cffa335ee|Hitem:18777::::::::60:::::::::|h[迅捷棕马]|h|r", -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r", -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:13523::::::::60:::::::::|h[无辜者之血]|h|r", -- [8]
							nil, -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r", -- [11]
							nil, -- [12]
							"|cffffffff|Hitem:13457::::::::60:::::::::|h[强效火焰防护药水]|h|r", -- [13]
							"|cffffffff|Hitem:7075::::::::60:::::::::|h[大地之核]|h|r", -- [14]
							nil, -- [15]
							"|cffffffff|Hitem:6219::::::::60:::::::::|h[弧光扳手]|h|r", -- [16]
						},
						["counts"] = {
							10, -- [1]
							10, -- [2]
							[6] = 13,
							[11] = 15,
							[13] = 3,
							[14] = 3,
						},
						["size"] = 16,
						["link"] = "|cff1eff00|Hitem:4500::::::::60:::::::::|h[旅行者的背包]|h|r",
						["icon"] = 133633,
						["freeslots"] = 6,
					},
					["Bag9"] = {
						["rarity"] = 1,
					},
					["Bag7"] = {
						["rarity"] = 1,
					},
					["Bag6"] = {
						["rarity"] = 1,
					},
				},
				["numBagSlots"] = 84,
			},
		},
		["Version"] = 1,
	},
}
