
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1638292233,
				["averageItemLvl"] = 29.71428571428572,
				["Inventory"] = {
					"|cff1eff00|Hitem:1282::::::::40:::::::::|h[火花铁帽]|h|r", -- [1]
					"|cff1eff00|Hitem:12028::::::1188:2053675904:40:::::::::|h[野熊之黑陶项链]|h|r", -- [2]
					"|cff1eff00|Hitem:15698::::::::40:::::::::|h[激斗肩铠]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::40:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff1eff00|Hitem:15557::::::1206:1380370304:40:::::::::|h[野熊之劫掠者胸甲]|h|r", -- [5]
					"|cff1eff00|Hitem:3758::::::::40:::::::::|h[十字军腰带]|h|r", -- [6]
					"|cff0070dd|Hitem:6087:16:::::::40:::::::::|h[西部荒野马裤]|h|r", -- [7]
					"|cff1eff00|Hitem:2910::::::::40:::::::::|h[金色民兵靴]|h|r", -- [8]
					"|cff1eff00|Hitem:6550::::::1179:1917742208:40:::::::::|h[野熊之士兵腕甲]|h|r", -- [9]
					"|cff1eff00|Hitem:4107::::::::40:::::::::|h[猎虎手套]|h|r", -- [10]
					"|cff0070dd|Hitem:2933::::::::40:::::::::|h[乌瑞恩的图章]|h|r", -- [11]
					"|cff1eff00|Hitem:6757::::::::40:::::::::|h[吉安娜的徽记之戒]|h|r", -- [12]
					nil, -- [13]
					nil, -- [14]
					"|cff0070dd|Hitem:5193::::::::40:::::::::|h[兄弟会斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:6977::::::::40:::::::::|h[旋风之剑]|h|r", -- [16]
					nil, -- [17]
					"|cffffffff|Hitem:15807::::::::40:::::::::|h[轻弩]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 40,
					},
					["特变电工"] = {
						["averageItemLvl"] = 29,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
