
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1643649961,
				["averageItemLvl"] = 63.375,
				["Inventory"] = {
					"|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r", -- [1]
					"|cffa335ee|Hitem:18404::::::::60:::::::::|h[奥妮克希亚龙牙坠饰]|h|r", -- [2]
					"|cff0070dd|Hitem:22001::::::::60:::::::::|h[英勇肩铠]|h|r", -- [3]
					nil, -- [4]
					"|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r", -- [5]
					"|cff0070dd|Hitem:21994::::::::60:::::::::|h[英勇腰带]|h|r", -- [6]
					"|cff0070dd|Hitem:23301:1506:::::::60:::::::::|h[骑士队长的板甲护腿]|h|r", -- [7]
					"|cffa335ee|Hitem:21995:1887:::::::60:::::::::|h[英勇长靴]|h|r", -- [8]
					"|cff0070dd|Hitem:21996:1886:::::::60:::::::::|h[英勇护腕]|h|r", -- [9]
					"|cff0070dd|Hitem:23286:927:::::::60:::::::::|h[骑士中尉的板甲护手]|h|r", -- [10]
					"|cffa335ee|Hitem:19325::::::::60:::::::::|h[胡里奥指环]|h|r", -- [11]
					"|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r", -- [12]
					"|cff0070dd|Hitem:18634::::::::60:::::::::|h[超低温寒冰偏斜器]|h|r", -- [13]
					"|cff0070dd|Hitem:11815::::::::60:::::::::|h[正义之手]|h|r", -- [14]
					"|cff0070dd|Hitem:13397:849:::::::60:::::::::|h[石像鬼斗篷]|h|r", -- [15]
					"|cffa335ee|Hitem:19323:37:::::::60:::::::::|h[无坚不摧之力]|h|r", -- [16]
					nil, -- [17]
					"|cff0070dd|Hitem:19107::::::::60:::::::::|h[觅血者]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.山河归一"] = {
				["Members"] = {
					["夏虫不可语冰"] = {
						["averageItemLvl"] = 61,
					},
					["巴托里"] = {
						["averageItemLvl"] = 54,
					},
					["爱你两世丶"] = {
						["averageItemLvl"] = 3,
					},
					["莉娜"] = {
						["averageItemLvl"] = 10,
					},
					["哈宁"] = {
						["averageItemLvl"] = 62,
					},
				},
			},
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
