
DataStore_MailsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1643294803,
				["Mails"] = {
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-20 00时,在游戏中对玩家 黑龙费尔默-A******s的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 357.0728454589844,
					}, -- [1]
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 15时,在游戏中对玩家 鱼人摩洛克-还***牛的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.70556640625,
					}, -- [2]
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 鱼人摩洛克-灬**灬的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.8279724121094,
					}, -- [3]
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 火妖鲁西弗隆-熊*丶的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.828125,
					}, -- [4]
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 鱼人摩洛克-北***杨的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.8283081054688,
					}, -- [5]
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 逐风者-J**x的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.8285522460938,
					}, -- [6]
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-22 18时,在游戏中对玩家 鱼人摩洛克-亡****哥的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.8287048339844,
					}, -- [7]
					{
						["lastCheck"] = 1643294803,
						["sender"] = "客服支持",
						["subject"] = "举报结果通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "您好! \n您于 2022-01-20 00时,在游戏中举报的玩家黑龙费尔默-A******s 已被证实存在违规行为而受到临时冻结处罚 。 推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 361.3172607421875,
					}, -- [8]
				},
				["lastVisitDate"] = "2022/01/27 22:46",
			},
		},
	},
}
