
DataStore_InventoryDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1646758021,
				["averageItemLvl"] = 61.125,
				["Inventory"] = {
					"|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r", -- [1]
					"|cffa335ee|Hitem:18404::::::::60:::::::::|h[奥妮克希亚龙牙坠饰]|h|r", -- [2]
					"|cff0070dd|Hitem:22001::::::::60:::::::::|h[英勇肩铠]|h|r", -- [3]
					nil, -- [4]
					"|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r", -- [5]
					"|cff0070dd|Hitem:21994::::::::60:::::::::|h[英勇腰带]|h|r", -- [6]
					"|cff0070dd|Hitem:23301:1506:::::::60:::::::::|h[骑士队长的板甲护腿]|h|r", -- [7]
					"|cffa335ee|Hitem:21995:1887:::::::60:::::::::|h[英勇长靴]|h|r", -- [8]
					"|cff0070dd|Hitem:21996:1886:::::::60:::::::::|h[英勇护腕]|h|r", -- [9]
					"|cff0070dd|Hitem:23286:927:::::::60:::::::::|h[骑士中尉的板甲护手]|h|r", -- [10]
					"|cffa335ee|Hitem:19325::::::::60:::::::::|h[胡里奥指环]|h|r", -- [11]
					"|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r", -- [12]
					"|cff0070dd|Hitem:18854::::::::60:::::::::|h[联盟徽记]|h|r", -- [13]
					"|cff0070dd|Hitem:11815::::::::60:::::::::|h[正义之手]|h|r", -- [14]
					"|cff0070dd|Hitem:13397:849:::::::60:::::::::|h[石像鬼斗篷]|h|r", -- [15]
					"|cffa335ee|Hitem:19364:37:::::::60:::::::::|h[阿什坎迪，兄弟会之剑]|h|r", -- [16]
					nil, -- [17]
					"|cff0070dd|Hitem:19107::::::::60:::::::::|h[觅血者]|h|r", -- [18]
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["Inventory"] = {
					[8] = "|cffffffff|Hitem:43::::::::1:::::::::|h[]|h|r",
					[16] = "|cffffffff|Hitem:2361::::::::1:::::::::|h[]|h|r",
					[7] = "|cffffffff|Hitem:6118::::::::1:::::::::|h[]|h|r",
					[4] = "|cffffffff|Hitem:6117::::::::1:::::::::|h[]|h|r",
				},
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["Inventory"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					"|cffffffff|Hitem:6117::::::::17:::::::::|h[]|h|r", -- [4]
					"|cffffffff|Hitem:6195::::::::17:::::::::|h[]|h|r", -- [5]
					"|cffffffff|Hitem:14746::::::::17:::::::::|h[]|h|r", -- [6]
					"|cffffffff|Hitem:2978::::::::17:::::::::|h[]|h|r", -- [7]
					"|cffffffff|Hitem:6506::::::::17:::::::::|h[]|h|r", -- [8]
					"|cffffffff|Hitem:6177::::::::17:::::::::|h[]|h|r", -- [9]
					"|cffffffff|Hitem:2980::::::::17:::::::::|h[]|h|r", -- [10]
					[16] = "|cffffffff|Hitem:3193::::::678:31308416:17:::::::::|h[]|h|r",
					[15] = "|cffffffff|Hitem:4689::::::::17:::::::::|h[]|h|r",
				},
				["lastUpdate"] = 1645858908,
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.山河归一"] = {
				["Members"] = {
					["夏虫不可语冰"] = {
						["averageItemLvl"] = 61,
					},
					["影子丶"] = {
						["averageItemLvl"] = 62,
					},
					["Dptic"] = {
						["averageItemLvl"] = 24,
					},
					["爱你两世丶"] = {
						["averageItemLvl"] = 3,
					},
					["巴托里"] = {
						["averageItemLvl"] = 54,
					},
				},
			},
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
				},
			},
		},
	},
}
