
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1641753742,
				["Factions"] = {
					19431, -- [1]
					nil, -- [2]
					22687, -- [3]
					30715, -- [4]
					[25] = 13865,
					[28] = 220,
					[15] = 8703,
					[30] = 770,
					[16] = 5890,
					[9] = 143,
					[18] = 6231,
					[19] = 25151,
					[11] = 42999,
					[22] = 640,
					[17] = 7795,
					[32] = 1728,
				},
			},
		},
	},
}
