
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1639590118,
				["averageItemLvl"] = 50.05882352941177,
				["Inventory"] = {
					"|cff0070dd|Hitem:10749::::::::57:::::::::|h[灰岩头盔]|h|r", -- [1]
					"|cff1eff00|Hitem:17772::::::::57:::::::::|h[热情暗影残片坠饰]|h|r", -- [2]
					"|cff1eff00|Hitem:9531::::::::57:::::::::|h[晶岩肩铠]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::57:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff0070dd|Hitem:11678::::::::57:::::::::|h[阿努希尔之壳]|h|r", -- [5]
					"|cff1eff00|Hitem:14960::::::1206:1952731648:57:::::::::|h[野熊之大酋长腰带]|h|r", -- [6]
					"|cff1eff00|Hitem:11910::::::::57:::::::::|h[珠宝缀饰腿甲]|h|r", -- [7]
					"|cff1eff00|Hitem:12021::::::::57:::::::::|h[盾甲铁靴]|h|r", -- [8]
					"|cff1eff00|Hitem:10239::::::193:1698566400:57:::::::::|h[力量之重型板层臂铠]|h|r", -- [9]
					"|cff0070dd|Hitem:9410::::::1208:1184142464:57:::::::::|h[野熊之山壁之拳]|h|r", -- [10]
					"|cff1eff00|Hitem:10780::::::::57:::::::::|h[哈卡印记]|h|r", -- [11]
					"|cff1eff00|Hitem:12102::::::::57:::::::::|h[贵族之戒]|h|r", -- [12]
					"|cff1eff00|Hitem:17774::::::::57:::::::::|h[天选者印记]|h|r", -- [13]
					"|cff1eff00|Hitem:11122::::::::57:::::::::|h[棍子上的胡萝卜]|h|r", -- [14]
					"|cff1eff00|Hitem:4114::::::::57:::::::::|h[黑潮斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:11086::::::::57:::::::::|h[保护者迦萨斯]|h|r", -- [16]
					"|cff1eff00|Hitem:11915::::::::57:::::::::|h[希兹尔的遮雨板]|h|r", -- [17]
					"|cff1eff00|Hitem:3430::::::132:1813535872:57:::::::::|h[敏捷之狙击步枪]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.污手党"] = {
				["Members"] = {
					["特变电工"] = {
						["averageItemLvl"] = 3,
					},
				},
			},
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
				},
			},
		},
	},
}
