
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638643323,
				["numFreeBagSlots"] = 37,
				["numBagSlots"] = 76,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							3030, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							3248, -- [7]
							[11] = 4338,
							[10] = 5862,
						},
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:3030::::::::44:::::::::|h[锐锋箭]|h|r", -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:3248::::::::44:::::::::|h[翻译好的藏尸者信件]|h|r", -- [7]
							[11] = "|cffffffff|Hitem:4338::::::::44:::::::::|h[魔纹布]|h|r",
							[10] = "|cffffffff|Hitem:5862::::::::44:::::::::|h[爆盐增压器]|h|r",
						},
						["counts"] = {
							[3] = 129,
							[11] = 20,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::44:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 10,
					},
					["Bag100"] = {
						["freeslots"] = 23,
						["ids"] = {
							3655, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							5803, -- [1]
							nil, -- [2]
							4306, -- [3]
							4623, -- [4]
							[9] = 929,
							[10] = 3928,
							[12] = 4338,
							[13] = 1645,
						},
						["links"] = {
							"|cffffffff|Hitem:5803::::::::44:::::::::|h[梦境之尘]|h|r", -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:4306::::::::44:::::::::|h[丝绸]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::44:::::::::|h[次级石盾药水]|h|r", -- [4]
							[9] = "|cffffffff|Hitem:929::::::::44:::::::::|h[治疗药水]|h|r",
							[10] = "|cffffffff|Hitem:3928::::::::44:::::::::|h[超强治疗药水]|h|r",
							[12] = "|cffffffff|Hitem:4338::::::::44:::::::::|h[魔纹布]|h|r",
							[13] = "|cffffffff|Hitem:1645::::::::44:::::::::|h[草莓汁]|h|r",
						},
						["counts"] = {
							10, -- [1]
							nil, -- [2]
							10, -- [3]
							2, -- [4]
							[12] = 10,
							[10] = 3,
							[13] = 2,
						},
						["freeslots"] = 7,
						["link"] = "|cffffffff|Hitem:14046::::::::44:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::44:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cff1eff00|Hitem:6828::::::::44:::::::::|h[幻像圆盾]|h|r", -- [1]
							"|cffffffff|Hitem:4502::::::::44:::::::::|h[精灵宝石样本]|h|r", -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:8047::::::::44:::::::::|h[紫色蘑菇]|h|r", -- [4]
							nil, -- [5]
							"|cff1eff00|Hitem:4636::::::::44:::::::::|h[精铁宝箱]|h|r", -- [6]
							[9] = "|cffffffff|Hitem:7668::::::::44:::::::::|h[染血的日记]|h|r",
							[11] = "|cffffffff|Hitem:5421::::::::44:::::::::|h[炽热魔符]|h|r",
							[12] = "|cffffffff|Hitem:4649::::::::44:::::::::|h[葛利·硬骨的便笺]|h|r",
						},
						["icon"] = 133652,
						["freeslots"] = 7,
						["ids"] = {
							6828, -- [1]
							4502, -- [2]
							nil, -- [3]
							8047, -- [4]
							nil, -- [5]
							4636, -- [6]
							[9] = 7668,
							[11] = 5421,
							[12] = 4649,
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							7, -- [4]
						},
						["size"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							3825, -- [1]
							6948, -- [2]
							4457, -- [3]
							nil, -- [4]
							5655, -- [5]
							4544, -- [6]
							2665, -- [7]
							18294, -- [8]
							nil, -- [9]
							8009, -- [10]
							nil, -- [11]
							8075, -- [12]
							nil, -- [13]
							6451, -- [14]
							8075, -- [15]
							3898, -- [16]
							8052, -- [17]
							8075, -- [18]
							5938, -- [19]
						},
						["links"] = {
							"|cffffffff|Hitem:3825::::::::44:::::::::|h[坚韧药剂]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::44:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:4457::::::::44:::::::::|h[烧烤秃鹰翅膀]|h|r", -- [3]
							nil, -- [4]
							"|cff0070dd|Hitem:5655::::::::44:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:4544::::::::44:::::::::|h[莫高雷香料面包]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::44:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::44:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:8009::::::::44:::::::::|h[德提亚姆能量石]|h|r", -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:8075::::::::44:::::::::|h[魔法酵母]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:6451::::::::44:::::::::|h[厚丝质绷带]|h|r", -- [14]
							"|cffffffff|Hitem:8075::::::::44:::::::::|h[魔法酵母]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::44:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:8052::::::::44:::::::::|h[安纳洛姆能量石]|h|r", -- [17]
							"|cffffffff|Hitem:8075::::::::44:::::::::|h[魔法酵母]|h|r", -- [18]
							"|cffffffff|Hitem:5938::::::::44:::::::::|h[新鲜的螃蟹腿]|h|r", -- [19]
						},
						["freeslots"] = 5,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							[14] = 5,
							[15] = 20,
							[8] = 3,
							[17] = 4,
							[18] = 20,
							[10] = 4,
							[6] = 2,
							[12] = 17,
							[19] = 12,
						},
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::44:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:1710::::::::44:::::::::|h[强效治疗药水]|h|r", -- [4]
							nil, -- [5]
							"|cff1eff00|Hitem:9419::::::::44:::::::::|h[加加恩的火锤]|h|r", -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:7075::::::::44:::::::::|h[大地之核]|h|r", -- [11]
							"|cffffffff|Hitem:4582::::::::44:::::::::|h[柔软的狼尾]|h|r", -- [12]
							"|cff1eff00|Hitem:4987::::::::44:::::::::|h[矮人队长之剑]|h|r", -- [13]
							"|cffffffff|Hitem:7442::::::::44:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							1710, -- [4]
							nil, -- [5]
							9419, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							7075, -- [11]
							4582, -- [12]
							4987, -- [13]
							7442, -- [14]
						},
						["counts"] = {
							[11] = 2,
							[12] = 3,
							[4] = 3,
						},
						["freeslots"] = 8,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
