
DataStore_AgendaDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1658561552,
				["DungeonIDs"] = {
					["黑翼之巢 40人|22825410"] = "401247|1658561552|0|1",
				},
				["BossKills"] = {
					["黑翼之巢 40人|22825410"] = {
						"狂野的拉佐格尔|1", -- [1]
						"堕落的瓦拉斯塔兹|1", -- [2]
						"勒什雷尔|1", -- [3]
						"费尔默|1", -- [4]
						"埃博诺克|1", -- [5]
						"弗莱格尔|1", -- [6]
						"克洛玛古斯|1", -- [7]
						"奈法利安|1", -- [8]
					},
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858909,
			},
		},
	},
}
