
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 16,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1639332965,
				["numFreeBagSlots"] = 21,
				["numBagSlots"] = 76,
				["Containers"] = {
					["Bag0"] = {
						["ids"] = {
							1490, -- [1]
							6948, -- [2]
							11284, -- [3]
							17048, -- [4]
							5655, -- [5]
							11318, -- [6]
							8948, -- [7]
							10455, -- [8]
							10286, -- [9]
							17781, -- [10]
							11834, -- [11]
							8529, -- [12]
							12359, -- [13]
							10662, -- [14]
							10707, -- [15]
							3898, -- [16]
							11315, -- [17]
							8545, -- [18]
							11912, -- [19]
							11188, -- [20]
						},
						["links"] = {
							"|cff1eff00|Hitem:1490::::::::54:::::::::|h[守护之符]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::54:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:11284::::::::54:::::::::|h[精准弹丸]|h|r", -- [3]
							"|cffffffff|Hitem:17048::::::::54:::::::::|h[奇特的朗姆酒]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::54:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:11318::::::::54:::::::::|h[阿塔莱之雾]|h|r", -- [6]
							"|cffffffff|Hitem:8948::::::::54:::::::::|h[晒干的牛肝菌]|h|r", -- [7]
							"|cff1eff00|Hitem:10455::::::::54:::::::::|h[被禁锢的伊兰尼库斯精华]|h|r", -- [8]
							"|cffffffff|Hitem:10286::::::::54:::::::::|h[野性之心]|h|r", -- [9]
							"|cffffffff|Hitem:17781::::::::54:::::::::|h[贱民的指引]|h|r", -- [10]
							"|cffffffff|Hitem:11834::::::::54:::::::::|h[极度粘稠的沥青]|h|r", -- [11]
							"|cffffffff|Hitem:8529::::::::54:::::::::|h[诺格弗格药剂]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::54:::::::::|h[瑟银锭]|h|r", -- [13]
							"|cffffffff|Hitem:10662::::::::54:::::::::|h[装满的哈卡之卵]|h|r", -- [14]
							"|cff1eff00|Hitem:10707::::::::54:::::::::|h[钢板胫甲]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::54:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:11315::::::::54:::::::::|h[血瓣花苗]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::54:::::::::|h[厚魔纹绷带]|h|r", -- [18]
							"|cffffffff|Hitem:11912::::::::54:::::::::|h[一组软泥怪采样瓶]|h|r", -- [19]
							"|cffffffff|Hitem:11188::::::::54:::::::::|h[黄色能量水晶]|h|r", -- [20]
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							[13] = 14,
							[7] = 3,
							[4] = 5,
							[9] = 4,
							[18] = 6,
							[20] = 8,
							[3] = 200,
							[6] = 5,
							[12] = 5,
							[11] = 4,
						},
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::54:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:11186::::::::54:::::::::|h[红色能量水晶]|h|r", -- [4]
							nil, -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:8152::::::::54:::::::::|h[大瓶魔精]|h|r", -- [7]
							nil, -- [8]
							"|cffffffff|Hitem:3928::::::::54:::::::::|h[超强治疗药水]|h|r", -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:18944::::::::54:::::::::|h[熏火龙的鳞片]|h|r", -- [11]
							nil, -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::54:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 9,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							11186, -- [4]
							nil, -- [5]
							nil, -- [6]
							8152, -- [7]
							nil, -- [8]
							3928, -- [9]
							nil, -- [10]
							18944, -- [11]
							nil, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["counts"] = {
							[4] = 5,
							[9] = 3,
							[11] = 18,
						},
						["size"] = 14,
					},
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							7552, -- [1]
							17760, -- [2]
							[6] = 10444,
							[7] = 10575,
							[9] = 3827,
							[10] = 11086,
						},
						["links"] = {
							"|cff1eff00|Hitem:7552::::::::54:::::::::|h[猎鹰之钩]|h|r", -- [1]
							"|cffffffff|Hitem:17760::::::::54:::::::::|h[生命之种]|h|r", -- [2]
							[6] = "|cffffffff|Hitem:10444::::::::54:::::::::|h[标准型闪光信号枪]|h|r",
							[7] = "|cffffffff|Hitem:10575::::::::54:::::::::|h[黑龙皮]|h|r",
							[9] = "|cffffffff|Hitem:3827::::::::54:::::::::|h[法力药水]|h|r",
							[10] = "|cff0070dd|Hitem:11086::::::::54:::::::::|h[保护者迦萨斯]|h|r",
						},
						["counts"] = {
							[9] = 2,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::54:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 8,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							1520, -- [1]
							11018, -- [2]
							6149, -- [3]
							4623, -- [4]
							9240, -- [5]
							11184, -- [6]
							10830, -- [7]
							9259, -- [8]
							15722, -- [9]
							8150, -- [10]
							8151, -- [11]
							11132, -- [12]
							11474, -- [13]
							13446, -- [14]
						},
						["links"] = {
							"|cff9d9d9d|Hitem:1520::::::::54:::::::::|h[巨魔的汗水]|h|r", -- [1]
							"|cffffffff|Hitem:11018::::::::54:::::::::|h[安戈洛的泥土]|h|r", -- [2]
							"|cffffffff|Hitem:6149::::::::54:::::::::|h[强效法力药水]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::54:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cff1eff00|Hitem:9240::::::::54:::::::::|h[祖尔法拉克之槌]|h|r", -- [5]
							"|cffffffff|Hitem:11184::::::::54:::::::::|h[蓝色能量水晶]|h|r", -- [6]
							"|cffffffff|Hitem:10830::::::::54:::::::::|h[M73破片手榴弹]|h|r", -- [7]
							"|cffffffff|Hitem:9259::::::::54:::::::::|h[巨魔部族项链]|h|r", -- [8]
							"|cffffffff|Hitem:15722::::::::54:::::::::|h[斯普拉格的水壶]|h|r", -- [9]
							"|cffffffff|Hitem:8150::::::::54:::::::::|h[石中盐]|h|r", -- [10]
							"|cffffffff|Hitem:8151::::::::54:::::::::|h[魔精]|h|r", -- [11]
							"|cffffffff|Hitem:11132::::::::54:::::::::|h[未使用的采集瓶]|h|r", -- [12]
							"|cffffffff|Hitem:11474::::::::54:::::::::|h[精龙的蛋]|h|r", -- [13]
							"|cffffffff|Hitem:13446::::::::54:::::::::|h[特效治疗药水]|h|r", -- [14]
						},
						["link"] = "|cffffffff|Hitem:14046::::::::54:::::::::|h[符文布背包]|h|r",
						["counts"] = {
							[6] = 4,
							[7] = 3,
							[10] = 7,
							[2] = 11,
							[4] = 2,
							[14] = 4,
						},
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							13446, -- [1]
							4338, -- [2]
							11124, -- [3]
							nil, -- [4]
							11114, -- [5]
							11830, -- [6]
							15216, -- [7]
							11185, -- [8]
							nil, -- [9]
							17191, -- [10]
							nil, -- [11]
							11113, -- [12]
							20767, -- [13]
						},
						["links"] = {
							"|cffffffff|Hitem:13446::::::::54:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:4338::::::::54:::::::::|h[魔纹布]|h|r", -- [2]
							"|cff0070dd|Hitem:11124::::::::54:::::::::|h[流放者头盔]|h|r", -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:11114::::::::54:::::::::|h[恐龙骨头]|h|r", -- [5]
							"|cffffffff|Hitem:11830::::::::54:::::::::|h[精细的双帆龙鳞片]|h|r", -- [6]
							"|cff1eff00|Hitem:15216::::::682:1946349312:54:::::::::|h[猛虎之符文剑]|h|r", -- [7]
							"|cffffffff|Hitem:11185::::::::54:::::::::|h[绿色能量水晶]|h|r", -- [8]
							nil, -- [9]
							"|cff0070dd|Hitem:17191::::::::54:::::::::|h[塞雷布拉斯节杖]|h|r", -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:11113::::::::54:::::::::|h[食物箱]|h|r", -- [12]
							"|cffffffff|Hitem:20767::::::::54:::::::::|h[浮渣覆盖的袋子]|h|r", -- [13]
						},
						["icon"] = 133652,
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::54:::::::::|h[符文布背包]|h|r",
						["counts"] = {
							5, -- [1]
							17, -- [2]
							[8] = 8,
						},
						["freeslots"] = 4,
					},
					["Bag100"] = {
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::54:::::::::|h[抛光盾牌]|h|r", -- [1]
							"|cff0070dd|Hitem:9418::::::::54:::::::::|h[斩石者]|h|r", -- [2]
							"|cff1eff00|Hitem:20640::::::::54:::::::::|h[南海小桶]|h|r", -- [3]
							"|cff0070dd|Hitem:17746::::::::54:::::::::|h[诺克赛恩的镣铐]|h|r", -- [4]
							"|cff0070dd|Hitem:10845::::::::54:::::::::|h[战士的拥抱]|h|r", -- [5]
							"|cff1eff00|Hitem:9958::::::1200:687029632:54:::::::::|h[野熊之好战者的圆盾]|h|r", -- [6]
							"|cff1eff00|Hitem:19141::::::::54:::::::::|h[丝瓜]|h|r", -- [7]
							"|cff1eff00|Hitem:2820::::::::54:::::::::|h[灵巧秒表]|h|r", -- [8]
						},
						["ids"] = {
							3655, -- [1]
							9418, -- [2]
							20640, -- [3]
							17746, -- [4]
							10845, -- [5]
							9958, -- [6]
							19141, -- [7]
							2820, -- [8]
						},
						["size"] = 24,
						["freeslots"] = 16,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
