
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638292674,
				["numFreeBagSlots"] = 47,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::40:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:3827::::::::40:::::::::|h[法力药水]|h|r", -- [1]
							"|cffffffff|Hitem:1710::::::::40:::::::::|h[强效治疗药水]|h|r", -- [2]
							"|cffffffff|Hitem:3030::::::::40:::::::::|h[锐锋箭]|h|r", -- [3]
							"|cffffffff|Hitem:6807::::::::40:::::::::|h[炖青蛙腿]|h|r", -- [4]
							"|cff1eff00|Hitem:6223::::::::40:::::::::|h[夜色镇徽记之盾]|h|r", -- [5]
							"|cffffffff|Hitem:3771::::::::40:::::::::|h[野猪火腿]|h|r", -- [6]
							"|cffffffff|Hitem:3248::::::::40:::::::::|h[翻译好的藏尸者信件]|h|r", -- [7]
							[9] = "|cffffffff|Hitem:3385::::::::40:::::::::|h[次级法力药水]|h|r",
							[10] = "|cffffffff|Hitem:5862::::::::40:::::::::|h[爆盐增压器]|h|r",
							[11] = "|cffffffff|Hitem:4338::::::::40:::::::::|h[魔纹布]|h|r",
							[12] = "|cffffffff|Hitem:2592::::::::40:::::::::|h[毛料]|h|r",
						},
						["icon"] = 133652,
						["freeslots"] = 3,
						["ids"] = {
							3827, -- [1]
							1710, -- [2]
							3030, -- [3]
							6807, -- [4]
							6223, -- [5]
							3771, -- [6]
							3248, -- [7]
							[9] = 3385,
							[10] = 5862,
							[11] = 4338,
							[12] = 2592,
						},
						["counts"] = {
							2, -- [1]
							2, -- [2]
							141, -- [3]
							19, -- [4]
							nil, -- [5]
							3, -- [6]
							[11] = 2,
							[12] = 11,
						},
						["size"] = 14,
					},
					["Bag100"] = {
						["size"] = 24,
						["ids"] = {
							3655, -- [1]
						},
						["freeslots"] = 23,
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::40:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::40:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							[14] = 7442,
							[13] = 3518,
							[12] = 4639,
						},
						["links"] = {
							[14] = "|cffffffff|Hitem:7442::::::::40:::::::::|h[基尔卡克的钥匙]|h|r",
							[13] = "|cffffffff|Hitem:3518::::::::40:::::::::|h[被破译的信件]|h|r",
							[12] = "|cffffffff|Hitem:4639::::::::40:::::::::|h[魔力海藻]|h|r",
						},
						["icon"] = 133652,
						["freeslots"] = 11,
						["link"] = "|cffffffff|Hitem:14046::::::::40:::::::::|h[符文布背包]|h|r",
						["size"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							3825, -- [1]
							6948, -- [2]
							15225, -- [3]
							5539, -- [4]
							5655, -- [5]
							6451, -- [6]
							2665, -- [7]
							18294, -- [8]
							nil, -- [9]
							5827, -- [10]
							nil, -- [11]
							8075, -- [12]
							8075, -- [13]
							6451, -- [14]
							8075, -- [15]
							3898, -- [16]
							nil, -- [17]
							nil, -- [18]
							nil, -- [19]
							3728, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:3825::::::::40:::::::::|h[坚韧药剂]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::40:::::::::|h[炉石]|h|r", -- [2]
							"|cff1eff00|Hitem:15225::::::1551:545490688:40:::::::::|h[能量之杉木锤]|h|r", -- [3]
							"|cffffffff|Hitem:5539::::::::40:::::::::|h[表扬信]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::40:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:6451::::::::40:::::::::|h[厚丝质绷带]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::40:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::40:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:5827::::::::40:::::::::|h[菲兹尔·铜栓的信]|h|r", -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:8075::::::::40:::::::::|h[魔法酵母]|h|r", -- [12]
							"|cffffffff|Hitem:8075::::::::40:::::::::|h[魔法酵母]|h|r", -- [13]
							"|cffffffff|Hitem:6451::::::::40:::::::::|h[厚丝质绷带]|h|r", -- [14]
							"|cffffffff|Hitem:8075::::::::40:::::::::|h[魔法酵母]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::40:::::::::|h[图书馆手稿]|h|r", -- [16]
							nil, -- [17]
							nil, -- [18]
							nil, -- [19]
							"|cffffffff|Hitem:3728::::::::40:::::::::|h[香烤狮肉]|h|r", -- [20]
						},
						["counts"] = {
							[13] = 20,
							[14] = 6,
							[15] = 20,
							[8] = 5,
							[20] = 4,
							[6] = 17,
							[12] = 17,
						},
						["cooldowns"] = {
							[2] = "1638292232.778|3600|1",
						},
						["size"] = 20,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["freeslots"] = 5,
					},
				},
				["numBagSlots"] = 76,
			},
		},
		["Version"] = 1,
	},
}
