
DataStore_AuctionsDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1646669539,
				["Auctions"] = {
					"0|13456|5||75999|75999|3", -- [1]
					"0|13459|5||207889|207889|3", -- [2]
					"0|13459|5||207889|207889|3", -- [3]
					"0|13459|5||207889|207889|3", -- [4]
				},
				["lastVisitDate"] = "2022/03/08 00:12",
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645540372,
				["lastVisitDate"] = "2022/02/22 22:32",
			},
		},
	},
}
