
DataStore_CraftsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["Professions"] = {
					["附魔"] = {
						["isPrimary"] = true,
						["MaxRank"] = 75,
						["Rank"] = 32,
					},
					["急救"] = {
						["Categories"] = {
							"消耗品", -- [1]
							"材料", -- [2]
						},
						["isSecondary"] = true,
						["Crafts"] = {
							"0|消耗品", -- [1]
							"2|14530", -- [2]
							"3|14529", -- [3]
							"3|8545", -- [4]
							"4|6450", -- [5]
							"4|1251", -- [6]
							"4|6451", -- [7]
							"4|2581", -- [8]
							"4|3531", -- [9]
							"4|3530", -- [10]
							"4|8544", -- [11]
							"0|材料", -- [12]
							"4|6452", -- [13]
						},
						["MaxRank"] = 300,
						["Rank"] = 299,
					},
					["骑术：马"] = {
						["isSecondary"] = true,
						["MaxRank"] = 300,
						["Rank"] = 300,
					},
				},
				["lastUpdate"] = 1640284835,
				["Prof1"] = "附魔",
			},
		},
	},
}
DataStore_CraftsRefDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Reagents"] = {
			[6451] = "4306,2",
			[6452] = "1475,1",
			[8545] = "4338,2",
			[1251] = "2589,1",
			[3530] = "2592,1",
			[3531] = "2592,2",
			[14530] = "14047,2",
			[8544] = "4338,1",
			[14529] = "14047,1",
			[6450] = "4306,1",
			[2581] = "2589,2",
		},
	},
}
