
DataStore_AgendaDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1656944651,
				["DungeonIDs"] = {
					["安其拉神殿 40人|22321057"] = "203749|1656944651|0|1",
				},
				["BossKills"] = {
					["安其拉神殿 40人|22321057"] = {
						"预言者斯克拉姆|1", -- [1]
						"安其拉三宝|1", -- [2]
						"沙尔图拉|1", -- [3]
						"顽强的范克瑞斯|1", -- [4]
						"维希度斯|1", -- [5]
						"哈霍兰公主|1", -- [6]
						"双子皇帝|1", -- [7]
						"奥罗|1", -- [8]
						"克苏恩|1", -- [9]
					},
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858909,
			},
		},
	},
}
