
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1637684276,
				["averageItemLvl"] = 18,
				["Inventory"] = {
					[7] = "|cff0070dd|Hitem:6087::::::::23:::::::::|h[西部荒野马裤]|h|r",
					[15] = "|cff0070dd|Hitem:5193::::::::23:::::::::|h[兄弟会斗篷]|h|r",
					[8] = "|cff1eff00|Hitem:15489::::::1182:137505152:23:::::::::|h[野熊之血斑马靴]|h|r",
					[16] = "|cff0070dd|Hitem:5194::::::::23:::::::::|h[工头战斧]|h|r",
					[9] = "|cff1eff00|Hitem:6550::::::1179:1917742208:23:::::::::|h[野熊之士兵腕甲]|h|r",
					[5] = "|cff1eff00|Hitem:15479::::::1094:1986009728:23:::::::::|h[野猪之冲锋者护甲]|h|r",
					[10] = "|cff1eff00|Hitem:7606::::::::23:::::::::|h[极地护手]|h|r",
					[6] = "|cff1eff00|Hitem:15404::::::::23:::::::::|h[破浪束带]|h|r",
					[18] = "|cffffffff|Hitem:15807::::::::23:::::::::|h[轻弩]|h|r",
					[4] = "|cffffffff|Hitem:2575::::::::23:::::::::|h[红色亚麻衬衣]|h|r",
				},
			},
		},
	},
}
