
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1642873481,
				["Factions"] = {
					19466, -- [1]
					nil, -- [2]
					22830, -- [3]
					30750, -- [4]
					[25] = 18073,
					[28] = 220,
					[15] = 8703,
					[30] = 770,
					[16] = 5890,
					[9] = 6380,
					[18] = 6231,
					[10] = 6033,
					[19] = 25151,
					[11] = 42999,
					[22] = 640,
					[32] = 1728,
					[17] = 7795,
				},
			},
		},
	},
}
