
DataStore_AgendaDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1644141269,
				["DungeonIDs"] = {
					["熔火之心 40人|12649079"] = "306331|1644141269|0|1",
				},
				["BossKills"] = {
					["奥妮克希亚的巢穴 40人|12635837"] = {
						"奥妮克希亚|1", -- [1]
					},
					["熔火之心 40人|12649079"] = {
						"鲁西弗隆|1", -- [1]
						"玛格曼达|1", -- [2]
						"基赫纳斯|1", -- [3]
						"加尔|1", -- [4]
						"沙斯拉尔|1", -- [5]
						"迦顿男爵|1", -- [6]
						"萨弗隆先驱者|1", -- [7]
						"焚化者古雷曼格|1", -- [8]
						"管理者埃克索图斯|1", -- [9]
						"拉格纳罗斯|1", -- [10]
					},
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1644331007,
			},
		},
	},
}
