
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638122868,
				["numFreeBagSlots"] = 29,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:1725::::::::36:::::::::|h[大背包]|h|r",
						["freeslots"] = 12,
						["icon"] = 133632,
						["size"] = 12,
					},
					["Bag100"] = {
						["size"] = 24,
						["ids"] = {
							3655, -- [1]
						},
						["freeslots"] = 23,
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::37:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:2008::::::::37:::::::::|h[巨魔传说第四章]|h|r", -- [1]
							"|cffffffff|Hitem:4479::::::::37:::::::::|h[燃烧咒符]|h|r", -- [2]
							"|cffffffff|Hitem:2006::::::::37:::::::::|h[巨魔传说第二章]|h|r", -- [3]
							"|cffffffff|Hitem:4480::::::::37:::::::::|h[雷霆咒符]|h|r", -- [4]
							"|cffffffff|Hitem:7442::::::::37:::::::::|h[基尔卡克的钥匙]|h|r", -- [5]
							"|cffffffff|Hitem:2592::::::::37:::::::::|h[毛料]|h|r", -- [6]
							"|cffffffff|Hitem:16113::::::::37:::::::::|h[手册：魔纹绷带]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:6450::::::::37:::::::::|h[丝质绷带]|h|r", -- [10]
						},
						["counts"] = {
							[6] = 19,
							[2] = 8,
							[10] = 20,
							[4] = 8,
						},
						["size"] = 10,
						["ids"] = {
							2008, -- [1]
							4479, -- [2]
							2006, -- [3]
							4480, -- [4]
							7442, -- [5]
							2592, -- [6]
							16113, -- [7]
							nil, -- [8]
							nil, -- [9]
							6450, -- [10]
						},
						["icon"] = 133628,
						["freeslots"] = 2,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::37:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:3901::::::::37:::::::::|h[血顶巨魔的獠牙]|h|r", -- [1]
							"|cffffffff|Hitem:3248::::::::37:::::::::|h[翻译好的藏尸者信件]|h|r", -- [2]
							[6] = "|cffffffff|Hitem:4306::::::::37:::::::::|h[丝绸]|h|r",
							[7] = "|cff1eff00|Hitem:6223::::::::37:::::::::|h[夜色镇徽记之盾]|h|r",
							[9] = "|cff1eff00|Hitem:4634::::::::37:::::::::|h[铁质宝箱]|h|r",
						},
						["icon"] = 133628,
						["size"] = 10,
						["ids"] = {
							3901, -- [1]
							3248, -- [2]
							[6] = 4306,
							[7] = 6223,
							[9] = 4634,
						},
						["counts"] = {
							20, -- [1]
						},
						["freeslots"] = 5,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							3901, -- [2]
							4306, -- [3]
							4636, -- [4]
							nil, -- [5]
							3357, -- [6]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:3901::::::::37:::::::::|h[血顶巨魔的獠牙]|h|r", -- [2]
							"|cffffffff|Hitem:4306::::::::37:::::::::|h[丝绸]|h|r", -- [3]
							"|cff1eff00|Hitem:4636::::::::37:::::::::|h[精铁宝箱]|h|r", -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:3357::::::::37:::::::::|h[活根草]|h|r", -- [6]
						},
						["icon"] = 133628,
						["freeslots"] = 6,
						["link"] = "|cffffffff|Hitem:4245::::::::37:::::::::|h[丝绸小包]|h|r",
						["counts"] = {
							nil, -- [1]
							10, -- [2]
							20, -- [3]
							[6] = 8,
						},
						["size"] = 10,
					},
					["Bag0"] = {
						["ids"] = {
							5800, -- [1]
							6948, -- [2]
							4481, -- [3]
							nil, -- [4]
							nil, -- [5]
							6451, -- [6]
							2665, -- [7]
							4338, -- [8]
							1487, -- [9]
							5827, -- [10]
							3713, -- [11]
							1487, -- [12]
							nil, -- [13]
							3960, -- [14]
							6450, -- [15]
							3898, -- [16]
							5852, -- [17]
							nil, -- [18]
							3030, -- [19]
							6929, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:5800::::::::37:::::::::|h[克拉维尔的零件]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::37:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:4481::::::::37:::::::::|h[海浪咒符]|h|r", -- [3]
							nil, -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:6451::::::::37:::::::::|h[厚丝质绷带]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::37:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:4338::::::::37:::::::::|h[魔纹布]|h|r", -- [8]
							"|cffffffff|Hitem:1487::::::::37:::::::::|h[魔法粗面包]|h|r", -- [9]
							"|cffffffff|Hitem:5827::::::::37:::::::::|h[菲兹尔·铜栓的信]|h|r", -- [10]
							"|cffffffff|Hitem:3713::::::::37:::::::::|h[舒心草]|h|r", -- [11]
							"|cffffffff|Hitem:1487::::::::37:::::::::|h[魔法粗面包]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:3960::::::::37:::::::::|h[一包水元素护腕]|h|r", -- [14]
							"|cffffffff|Hitem:6450::::::::37:::::::::|h[丝质绷带]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::37:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:5852::::::::37:::::::::|h[燃料调节器的蓝图]|h|r", -- [17]
							nil, -- [18]
							"|cffffffff|Hitem:3030::::::::37:::::::::|h[锐锋箭]|h|r", -- [19]
							"|cffffffff|Hitem:6929::::::::37:::::::::|h[巴斯拉的羊皮纸]|h|r", -- [20]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							8, -- [3]
							nil, -- [4]
							nil, -- [5]
							20, -- [6]
							[11] = 4,
							[15] = 16,
							[12] = 3,
							[9] = 3,
							[19] = 168,
						},
						["size"] = 20,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["freeslots"] = 4,
					},
				},
				["numBagSlots"] = 62,
			},
		},
		["Version"] = 1,
	},
}
