
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1644055818,
				["Factions"] = {
					19521, -- [1]
					nil, -- [2]
					22885, -- [3]
					30805, -- [4]
					[25] = 23804,
					[28] = 220,
					[15] = 8703,
					[30] = 770,
					[16] = 5890,
					[9] = 8954,
					[18] = 6231,
					[10] = 8030,
					[17] = 7795,
					[11] = 42999,
					[22] = 998,
					[32] = 1728,
					[19] = 25151,
				},
			},
		},
	},
}
