
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638463346,
				["numFreeBagSlots"] = 31,
				["numBagSlots"] = 76,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							3030, -- [3]
							nil, -- [4]
							nil, -- [5]
							3771, -- [6]
							3248, -- [7]
							[11] = 4338,
							[10] = 5862,
							[9] = 3385,
						},
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:3030::::::::42:::::::::|h[锐锋箭]|h|r", -- [3]
							nil, -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:3771::::::::42:::::::::|h[野猪火腿]|h|r", -- [6]
							"|cffffffff|Hitem:3248::::::::42:::::::::|h[翻译好的藏尸者信件]|h|r", -- [7]
							[11] = "|cffffffff|Hitem:4338::::::::42:::::::::|h[魔纹布]|h|r",
							[10] = "|cffffffff|Hitem:5862::::::::42:::::::::|h[爆盐增压器]|h|r",
							[9] = "|cffffffff|Hitem:3385::::::::42:::::::::|h[次级法力药水]|h|r",
						},
						["counts"] = {
							[11] = 6,
							[6] = 4,
							[9] = 3,
							[3] = 138,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::42:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 8,
					},
					["Bag100"] = {
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["ids"] = {
							3655, -- [1]
						},
						["size"] = 24,
						["freeslots"] = 23,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							5803, -- [1]
							nil, -- [2]
							8075, -- [3]
							4623, -- [4]
							3928, -- [5]
							8075, -- [6]
							8075, -- [7]
							3928, -- [8]
							929, -- [9]
							nil, -- [10]
							nil, -- [11]
							4306, -- [12]
							nil, -- [13]
							8150, -- [14]
						},
						["links"] = {
							"|cffffffff|Hitem:5803::::::::42:::::::::|h[梦境之尘]|h|r", -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:8075::::::::42:::::::::|h[魔法酵母]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::42:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cffffffff|Hitem:3928::::::::42:::::::::|h[超强治疗药水]|h|r", -- [5]
							"|cffffffff|Hitem:8075::::::::42:::::::::|h[魔法酵母]|h|r", -- [6]
							"|cffffffff|Hitem:8075::::::::42:::::::::|h[魔法酵母]|h|r", -- [7]
							"|cffffffff|Hitem:3928::::::::42:::::::::|h[超强治疗药水]|h|r", -- [8]
							"|cffffffff|Hitem:929::::::::42:::::::::|h[治疗药水]|h|r", -- [9]
							nil, -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:4306::::::::42:::::::::|h[丝绸]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:8150::::::::42:::::::::|h[石中盐]|h|r", -- [14]
						},
						["freeslots"] = 4,
						["counts"] = {
							10, -- [1]
							nil, -- [2]
							20, -- [3]
							2, -- [4]
							2, -- [5]
							20, -- [6]
							8, -- [7]
							5, -- [8]
							2, -- [9]
							nil, -- [10]
							nil, -- [11]
							15, -- [12]
							nil, -- [13]
							3, -- [14]
						},
						["link"] = "|cffffffff|Hitem:14046::::::::42:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::42:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cff1eff00|Hitem:6828::::::::42:::::::::|h[幻像圆盾]|h|r", -- [1]
							"|cffffffff|Hitem:4502::::::::42:::::::::|h[精灵宝石样本]|h|r", -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							"|cff1eff00|Hitem:4636::::::::42:::::::::|h[精铁宝箱]|h|r", -- [6]
							"|cffffffff|Hitem:7912::::::::42:::::::::|h[坚固的石头]|h|r", -- [7]
							"|cffffffff|Hitem:7067::::::::42:::::::::|h[元素之土]|h|r", -- [8]
							nil, -- [9]
							"|cff1eff00|Hitem:1529::::::::42:::::::::|h[翡翠]|h|r", -- [10]
							"|cff1eff00|Hitem:2776::::::::42:::::::::|h[金矿石]|h|r", -- [11]
						},
						["freeslots"] = 7,
						["icon"] = 133652,
						["ids"] = {
							6828, -- [1]
							4502, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							4636, -- [6]
							7912, -- [7]
							7067, -- [8]
							nil, -- [9]
							1529, -- [10]
							2776, -- [11]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							3, -- [7]
							3, -- [8]
							[11] = 2,
						},
						["size"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							3825, -- [1]
							6948, -- [2]
							4457, -- [3]
							nil, -- [4]
							5655, -- [5]
							6451, -- [6]
							2665, -- [7]
							18294, -- [8]
							6827, -- [9]
							nil, -- [10]
							4791, -- [11]
							8075, -- [12]
							2289, -- [13]
							6451, -- [14]
							4511, -- [15]
							3898, -- [16]
							8075, -- [17]
							4624, -- [18]
							5938, -- [19]
							3728, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:3825::::::::42:::::::::|h[坚韧药剂]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::42:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:4457::::::::42:::::::::|h[烧烤秃鹰翅膀]|h|r", -- [3]
							nil, -- [4]
							"|cff0070dd|Hitem:5655::::::::42:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:6451::::::::42:::::::::|h[厚丝质绷带]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::42:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::42:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							"|cffffffff|Hitem:6827::::::::42:::::::::|h[一箱补给品]|h|r", -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:4791::::::::42:::::::::|h[魔法水]|h|r", -- [11]
							"|cffffffff|Hitem:8075::::::::42:::::::::|h[魔法酵母]|h|r", -- [12]
							"|cffffffff|Hitem:2289::::::::42:::::::::|h[力量卷轴 II]|h|r", -- [13]
							"|cffffffff|Hitem:6451::::::::42:::::::::|h[厚丝质绷带]|h|r", -- [14]
							"|cff1eff00|Hitem:4511::::::::42:::::::::|h[黑水之锤]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::42:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:8075::::::::42:::::::::|h[魔法酵母]|h|r", -- [17]
							"|cffffffff|Hitem:4624::::::::42:::::::::|h[配方：次级石盾药水]|h|r", -- [18]
							"|cffffffff|Hitem:5938::::::::42:::::::::|h[新鲜的螃蟹腿]|h|r", -- [19]
							"|cffffffff|Hitem:3728::::::::42:::::::::|h[香烤狮肉]|h|r", -- [20]
						},
						["freeslots"] = 2,
						["cooldowns"] = {
							[2] = "1638463241.161|3600|1",
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							[14] = 6,
							[8] = 3,
							[17] = 20,
							[20] = 4,
							[3] = 2,
							[6] = 10,
							[12] = 18,
							[19] = 12,
						},
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::42:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:1710::::::::42:::::::::|h[强效治疗药水]|h|r", -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:4609::::::::42:::::::::|h[食谱：烧烤秃鹰翅膀]|h|r", -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:4582::::::::42:::::::::|h[柔软的狼尾]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::42:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							1710, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							4609, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							4582, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							2, -- [4]
							[12] = 3,
						},
						["freeslots"] = 10,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
