
DataStore_CraftsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["Professions"] = {
					["急救"] = {
						["Categories"] = {
							"消耗品", -- [1]
							"材料", -- [2]
						},
						["isSecondary"] = true,
						["MaxRank"] = 150,
						["Crafts"] = {
							"0|消耗品", -- [1]
							"2|3530", -- [2]
							"3|2581", -- [3]
							"4|1251", -- [4]
							"0|材料", -- [5]
							"2|6452", -- [6]
						},
						["Rank"] = 103,
					},
				},
				["lastUpdate"] = 1637604319,
			},
		},
	},
}
DataStore_CraftsRefDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Reagents"] = {
			[2581] = "2589,2",
			[6452] = "1475,1",
			[3530] = "2592,1",
			[1251] = "2589,1",
		},
	},
}
