
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["Inventory"] = {
					"|cff0070dd|Hitem:22411::::::::60:::::::::|h[刽子手的头盔]|h|r", -- [1]
					"|cff0070dd|Hitem:13091::::::::60:::::::::|h[莫里斯元帅的勋章]|h|r", -- [2]
					"|cff0070dd|Hitem:16733::::::::60:::::::::|h[勇气肩甲]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::60:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff0070dd|Hitem:11678::::::::60:::::::::|h[阿努希尔之壳]|h|r", -- [5]
					"|cff0070dd|Hitem:13142::::::::60:::::::::|h[黑龙束带]|h|r", -- [6]
					"|cff0070dd|Hitem:12935::::::::60:::::::::|h[战争统帅护腿]|h|r", -- [7]
					"|cff0070dd|Hitem:13381::::::::60:::::::::|h[炮手长靴]|h|r", -- [8]
					"|cff0070dd|Hitem:21996::::::::60:::::::::|h[英勇护腕]|h|r", -- [9]
					"|cff0070dd|Hitem:13072::::::::60:::::::::|h[握石护手]|h|r", -- [10]
					"|cff0070dd|Hitem:13373::::::::60:::::::::|h[血肉指环]|h|r", -- [11]
					"|cff0070dd|Hitem:13098::::::::60:::::::::|h[痛苦指环]|h|r", -- [12]
					"|cff0070dd|Hitem:13965::::::::60:::::::::|h[黑手饰物]|h|r", -- [13]
					"|cff1eff00|Hitem:17774::::::::60:::::::::|h[天选者印记]|h|r", -- [14]
					"|cff0070dd|Hitem:11930::::::::60:::::::::|h[皇帝的新斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:13401::::::::60:::::::::|h[提米的手]|h|r", -- [16]
					"|cff0070dd|Hitem:12602:929:::::::60:::::::::|h[龙人之盾]|h|r", -- [17]
					"|cff0070dd|Hitem:16996::::::::60:::::::::|h[血木猎弓]|h|r", -- [18]
				},
				["averageItemLvl"] = 60.41176470588236,
				["lastUpdate"] = 1640458300,
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.山河归一"] = {
				["Members"] = {
					["阿阮"] = {
						["averageItemLvl"] = 3,
					},
					["哈宁"] = {
						["averageItemLvl"] = 61,
					},
				},
			},
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
				},
			},
		},
	},
}
