
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1637689900,
				["numFreeBagSlots"] = 23,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::24:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:858::::::::24:::::::::|h[次级治疗药水]|h|r", -- [1]
							[3] = "|cffffffff|Hitem:2455::::::::24:::::::::|h[初级法力药水]|h|r",
							[7] = "|cffffffff|Hitem:2592::::::::24:::::::::|h[毛料]|h|r",
							[5] = "|cffffffff|Hitem:730::::::::24:::::::::|h[鱼人的眼球]|h|r",
						},
						["icon"] = 133628,
						["freeslots"] = 6,
						["ids"] = {
							858, -- [1]
							[3] = 2455,
							[7] = 2592,
							[5] = 730,
						},
						["counts"] = {
							5, -- [1]
							[7] = 8,
						},
						["size"] = 10,
					},
					["Bag100"] = {
						["size"] = 24,
						["ids"] = {
							3655, -- [1]
						},
						["freeslots"] = 23,
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							2699, -- [1]
							nil, -- [2]
							3182, -- [3]
							nil, -- [4]
							7442, -- [5]
							5568, -- [6]
							nil, -- [7]
							769, -- [8]
							5996, -- [9]
							955, -- [10]
						},
						["links"] = {
							"|cffffffff|Hitem:2699::::::::24:::::::::|h[食谱：赤脊山炖肉]|h|r", -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:3182::::::::24:::::::::|h[蜘蛛丝]|h|r", -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:7442::::::::24:::::::::|h[基尔卡克的钥匙]|h|r", -- [5]
							"|cffffffff|Hitem:5568::::::::24:::::::::|h[光滑的鹅卵石]|h|r", -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:769::::::::24:::::::::|h[大块野猪肉]|h|r", -- [8]
							"|cffffffff|Hitem:5996::::::::24:::::::::|h[水下呼吸药剂]|h|r", -- [9]
							"|cffffffff|Hitem:955::::::::24:::::::::|h[智力卷轴]|h|r", -- [10]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							10, -- [6]
							nil, -- [7]
							2, -- [8]
							4, -- [9]
						},
						["size"] = 10,
						["link"] = "|cffffffff|Hitem:4245::::::::24:::::::::|h[丝绸小包]|h|r",
						["icon"] = 133628,
						["freeslots"] = 3,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							5134, -- [5]
							3174, -- [6]
							nil, -- [7]
							730, -- [8]
							5635, -- [9]
						},
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:5134::::::::24:::::::::|h[毛茸茸的小爪子]|h|r", -- [5]
							"|cffffffff|Hitem:3174::::::::24:::::::::|h[蜘蛛的毒液]|h|r", -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:730::::::::24:::::::::|h[鱼人的眼球]|h|r", -- [8]
							"|cffffffff|Hitem:5635::::::::24:::::::::|h[锋利的爪子]|h|r", -- [9]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							2, -- [5]
							3, -- [6]
							nil, -- [7]
							10, -- [8]
						},
						["freeslots"] = 6,
						["link"] = "|cffffffff|Hitem:4245::::::::24:::::::::|h[丝绸小包]|h|r",
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::24:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							[6] = "|cffffffff|Hitem:5784::::::::24:::::::::|h[粘糊糊的鱼人鳞片]|h|r",
							[7] = "|cff1eff00|Hitem:5196::::::::24:::::::::|h[重拳先生的战斧]|h|r",
						},
						["counts"] = {
							[6] = 5,
						},
						["freeslots"] = 8,
						["ids"] = {
							[6] = 5784,
							[7] = 5196,
						},
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag0"] = {
						["ids"] = {
							3663, -- [1]
							6948, -- [2]
							2581, -- [3]
							3530, -- [4]
							4306, -- [5]
							4605, -- [6]
							4371, -- [7]
							2589, -- [8]
							2313, -- [9]
							3531, -- [10]
							1082, -- [11]
							769, -- [12]
							3680, -- [13]
							2512, -- [14]
							730, -- [15]
							723, -- [16]
							1322, -- [17]
							118, -- [18]
							3567, -- [19]
							2562, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:3663::::::::24:::::::::|h[鱼人鳍汤]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::24:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:2581::::::::24:::::::::|h[厚亚麻绷带]|h|r", -- [3]
							"|cffffffff|Hitem:3530::::::::24:::::::::|h[绒线绷带]|h|r", -- [4]
							"|cffffffff|Hitem:4306::::::::24:::::::::|h[丝绸]|h|r", -- [5]
							"|cffffffff|Hitem:4605::::::::24:::::::::|h[红斑蘑菇]|h|r", -- [6]
							"|cffffffff|Hitem:4371::::::::24:::::::::|h[青铜管]|h|r", -- [7]
							"|cffffffff|Hitem:2589::::::::24:::::::::|h[亚麻布]|h|r", -- [8]
							"|cffffffff|Hitem:2313::::::::24:::::::::|h[中型护甲片]|h|r", -- [9]
							"|cffffffff|Hitem:3531::::::::24:::::::::|h[厚绒线绷带]|h|r", -- [10]
							"|cffffffff|Hitem:1082::::::::24:::::::::|h[赤脊山炖肉]|h|r", -- [11]
							"|cffffffff|Hitem:769::::::::24:::::::::|h[大块野猪肉]|h|r", -- [12]
							"|cffffffff|Hitem:3680::::::::24:::::::::|h[食谱：鱼人鳍汤]|h|r", -- [13]
							"|cffffffff|Hitem:2512::::::::24:::::::::|h[劣质箭]|h|r", -- [14]
							"|cffffffff|Hitem:730::::::::24:::::::::|h[鱼人的眼球]|h|r", -- [15]
							"|cffffffff|Hitem:723::::::::24:::::::::|h[血牙野猪的肝]|h|r", -- [16]
							"|cffffffff|Hitem:1322::::::::24:::::::::|h[鱼肝油]|h|r", -- [17]
							"|cffffffff|Hitem:118::::::::24:::::::::|h[初级治疗药水]|h|r", -- [18]
							"|cff1eff00|Hitem:3567::::::::24:::::::::|h[矮人钓鱼竿]|h|r", -- [19]
							"|cffffffff|Hitem:2562::::::::24:::::::::|h[海棠花]|h|r", -- [20]
						},
						["counts"] = {
							[9] = 2,
							[14] = 98,
							[18] = 5,
							[15] = 10,
							[8] = 2,
							[16] = 2,
							[17] = 5,
							[5] = 3,
							[10] = 6,
							[3] = 20,
							[11] = 5,
							[6] = 8,
							[12] = 9,
							[4] = 3,
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
				},
				["numBagSlots"] = 60,
			},
		},
		["Version"] = 1,
	},
}
