
DataStore_AgendaDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1653725492,
				["DungeonIDs"] = {
					["安其拉废墟 20人|21142973"] = "226107|1653725492|0|1",
				},
				["BossKills"] = {
					["安其拉废墟 20人|21142973"] = {
						"库林纳克斯|1", -- [1]
						"拉贾克斯将军|1", -- [2]
						"莫阿姆|1", -- [3]
						"吞咽者布鲁|0", -- [4]
						"狩猎者阿亚米斯|0", -- [5]
						"无疤者奥斯里安|1", -- [6]
					},
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858909,
			},
		},
	},
}
