
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1653571175,
				["Factions"] = {
					20291, -- [1]
					nil, -- [2]
					23655, -- [3]
					31575, -- [4]
					[25] = 37664,
					[18] = 6236,
					[28] = 220,
					[15] = 8714,
					[30] = 770,
					[16] = 5895,
					[32] = 1728,
					[34] = 42999,
					[10] = 11093,
					[19] = 28534,
					[11] = 42999,
					[22] = 2897,
					[17] = 7801,
					[9] = 11704,
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
				["Factions"] = {
					3100, -- [1]
					nil, -- [2]
					4000, -- [3]
					3100, -- [4]
				},
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858908,
				["Factions"] = {
					5461, -- [1]
					nil, -- [2]
					8641, -- [3]
					4088, -- [4]
				},
			},
		},
	},
}
