
DataStore_CraftsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["Professions"] = {
					["急救"] = {
						["Categories"] = {
							"消耗品", -- [1]
							"材料", -- [2]
						},
						["isSecondary"] = true,
						["MaxRank"] = 225,
						["Crafts"] = {
							"0|消耗品", -- [1]
							"2|6451", -- [2]
							"3|6450", -- [3]
							"4|1251", -- [4]
							"4|2581", -- [5]
							"4|3531", -- [6]
							"4|3530", -- [7]
							"0|材料", -- [8]
							"4|6452", -- [9]
						},
						["Rank"] = 207,
					},
				},
				["lastUpdate"] = 1638115951,
			},
		},
	},
}
DataStore_CraftsRefDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Reagents"] = {
			[2581] = "2589,2",
			[1251] = "2589,1",
			[6451] = "4306,2",
			[6450] = "4306,1",
			[6452] = "1475,1",
			[3531] = "2592,2",
			[3530] = "2592,1",
		},
	},
}
