
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1637604499,
				["numFreeBagSlots"] = 37,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::21:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:858::::::::21:::::::::|h[次级治疗药水]|h|r", -- [1]
						},
						["icon"] = 133628,
						["freeslots"] = 9,
						["ids"] = {
							858, -- [1]
						},
						["counts"] = {
							5, -- [1]
						},
						["size"] = 10,
					},
					["Bag100"] = {
						["freeslots"] = 23,
						["ids"] = {
							3655, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							[5] = 7442,
							[9] = 5996,
						},
						["links"] = {
							[5] = "|cffffffff|Hitem:7442::::::::21:::::::::|h[基尔卡克的钥匙]|h|r",
							[9] = "|cffffffff|Hitem:5996::::::::21:::::::::|h[水下呼吸药剂]|h|r",
						},
						["counts"] = {
							[9] = 5,
						},
						["link"] = "|cffffffff|Hitem:4245::::::::21:::::::::|h[丝绸小包]|h|r",
						["size"] = 10,
						["icon"] = 133628,
						["freeslots"] = 8,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							[5] = 5134,
						},
						["links"] = {
							[5] = "|cffffffff|Hitem:5134::::::::22:::::::::|h[毛茸茸的小爪子]|h|r",
						},
						["counts"] = {
							[5] = 2,
						},
						["link"] = "|cffffffff|Hitem:4245::::::::22:::::::::|h[丝绸小包]|h|r",
						["freeslots"] = 9,
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::22:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							[8] = "|cffffffff|Hitem:1113::::::::22:::::::::|h[魔法面包]|h|r",
							[7] = "|cff1eff00|Hitem:5196::::::::22:::::::::|h[重拳先生的战斧]|h|r",
							[9] = "|cffffffff|Hitem:1113::::::::22:::::::::|h[魔法面包]|h|r",
						},
						["counts"] = {
							[8] = 11,
							[9] = 20,
						},
						["freeslots"] = 7,
						["ids"] = {
							[8] = 1113,
							[7] = 5196,
							[9] = 1113,
						},
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag0"] = {
						["ids"] = {
							858, -- [1]
							6948, -- [2]
							2581, -- [3]
							4537, -- [4]
							17119, -- [5]
							4605, -- [6]
							4371, -- [7]
							1274, -- [8]
							1326, -- [9]
							nil, -- [10]
							nil, -- [11]
							nil, -- [12]
							5354, -- [13]
							2512, -- [14]
							730, -- [15]
							5387, -- [16]
							3530, -- [17]
							118, -- [18]
							3530, -- [19]
						},
						["links"] = {
							"|cffffffff|Hitem:858::::::::22:::::::::|h[次级治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::22:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:2581::::::::22:::::::::|h[厚亚麻绷带]|h|r", -- [3]
							"|cffffffff|Hitem:4537::::::::22:::::::::|h[泰拉比姆香蕉]|h|r", -- [4]
							"|cffffffff|Hitem:17119::::::::22:::::::::|h[矿道鼠肉串]|h|r", -- [5]
							"|cffffffff|Hitem:4605::::::::22:::::::::|h[红斑蘑菇]|h|r", -- [6]
							"|cffffffff|Hitem:4371::::::::22:::::::::|h[青铜管]|h|r", -- [7]
							"|cffffffff|Hitem:1274::::::::22:::::::::|h[蛇麻草]|h|r", -- [8]
							"|cffffffff|Hitem:1326::::::::22:::::::::|h[爆炒太阳鱼]|h|r", -- [9]
							nil, -- [10]
							nil, -- [11]
							nil, -- [12]
							"|cffffffff|Hitem:5354::::::::22:::::::::|h[写给德尔格伦的信]|h|r", -- [13]
							"|cffffffff|Hitem:2512::::::::22:::::::::|h[劣质箭]|h|r", -- [14]
							"|cffffffff|Hitem:730::::::::22:::::::::|h[鱼人的眼球]|h|r", -- [15]
							"|cff1eff00|Hitem:5387::::::::22:::::::::|h[附有魔法的月虎披风]|h|r", -- [16]
							"|cffffffff|Hitem:3530::::::::22:::::::::|h[绒线绷带]|h|r", -- [17]
							"|cffffffff|Hitem:118::::::::22:::::::::|h[初级治疗药水]|h|r", -- [18]
							"|cffffffff|Hitem:3530::::::::22:::::::::|h[绒线绷带]|h|r", -- [19]
						},
						["size"] = 20,
						["cooldowns"] = {
							[2] = "1637604046.483|3600|1",
						},
						["counts"] = {
							2, -- [1]
							[17] = 20,
							[4] = 5,
							[8] = 4,
							[14] = 113,
							[9] = 10,
							[18] = 5,
							[19] = 8,
							[15] = 8,
							[3] = 20,
							[6] = 10,
							[5] = 7,
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["freeslots"] = 4,
					},
				},
				["numBagSlots"] = 60,
			},
		},
		["Version"] = 1,
	},
}
