
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["Inventory"] = {
					"|cff1eff00|Hitem:9664::::::::47:::::::::|h[卫戍头盔]|h|r", -- [1]
					"|cff1eff00|Hitem:12028::::::1188:2053675904:47:::::::::|h[野熊之黑陶项链]|h|r", -- [2]
					"|cff1eff00|Hitem:15698::::::::47:::::::::|h[激斗肩铠]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::47:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff1eff00|Hitem:11195::::::::47:::::::::|h[战铸胸甲]|h|r", -- [5]
					"|cff1eff00|Hitem:14906::::::1560:1157381632:47:::::::::|h[能量之蛮兽腰带]|h|r", -- [6]
					"|cff0070dd|Hitem:6087:16:::::::47:::::::::|h[西部荒野马裤]|h|r", -- [7]
					"|cff1eff00|Hitem:4653::::::::47:::::::::|h[铁踵之靴]|h|r", -- [8]
					"|cff0070dd|Hitem:9409::::::1557:176719232:47:::::::::|h[能量之艾隆纳亚的护腕]|h|r", -- [9]
					"|cff0070dd|Hitem:9410::::::1208:1184142464:47:::::::::|h[野熊之山壁之拳]|h|r", -- [10]
					"|cff1eff00|Hitem:4549::::::::47:::::::::|h[海焰指环]|h|r", -- [11]
					"|cff1eff00|Hitem:7552::::::::47:::::::::|h[猎鹰之钩]|h|r", -- [12]
					"|cff1eff00|Hitem:2820::::::::47:::::::::|h[灵巧秒表]|h|r", -- [13]
					nil, -- [14]
					"|cff1eff00|Hitem:4114::::::::47:::::::::|h[黑潮斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:9418::::::::47:::::::::|h[斩石者]|h|r", -- [16]
					nil, -- [17]
					"|cffffffff|Hitem:15807::::::::47:::::::::|h[轻弩]|h|r", -- [18]
				},
				["averageItemLvl"] = 40.73333333333333,
				["lastUpdate"] = 1638807124,
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
