
DataStore_AgendaDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1655630322,
				["DungeonIDs"] = {
					["安其拉废墟 20人|21957527"] = "135678|1655630322|0|1",
					["祖尔格拉布 20人|21930441"] = "135678|1655630322|0|1",
					["安其拉神殿 40人|21925775"] = "308478|1655630322|0|1",
					["黑翼之巢 40人|21958577"] = "308478|1655630322|0|1",
				},
				["BossKills"] = {
					["安其拉废墟 20人|21957527"] = {
						"库林纳克斯|1", -- [1]
						"拉贾克斯将军|1", -- [2]
						"莫阿姆|1", -- [3]
						"吞咽者布鲁|0", -- [4]
						"狩猎者阿亚米斯|0", -- [5]
						"无疤者奥斯里安|1", -- [6]
					},
					["祖尔格拉布 20人|21930441"] = {
						"高阶祭司耶克里克|1", -- [1]
						"高阶祭司温诺希斯|1", -- [2]
						"高阶祭司玛尔里|1", -- [3]
						"血领主曼多基尔|1", -- [4]
						"疯狂之缘|0", -- [5]
						"高阶祭司塞卡尔|1", -- [6]
						"加兹兰卡|0", -- [7]
						"高阶祭司娅尔罗|1", -- [8]
						"妖术师金度|1", -- [9]
						"哈卡|1", -- [10]
					},
					["安其拉神殿 40人|21925775"] = {
						"预言者斯克拉姆|1", -- [1]
						"安其拉三宝|1", -- [2]
						"沙尔图拉|1", -- [3]
						"顽强的范克瑞斯|1", -- [4]
						"维希度斯|1", -- [5]
						"哈霍兰公主|1", -- [6]
						"双子皇帝|1", -- [7]
						"奥罗|1", -- [8]
						"克苏恩|1", -- [9]
					},
					["黑翼之巢 40人|21958577"] = {
						"狂野的拉佐格尔|1", -- [1]
						"堕落的瓦拉斯塔兹|1", -- [2]
						"勒什雷尔|1", -- [3]
						"费尔默|1", -- [4]
						"埃博诺克|1", -- [5]
						"弗莱格尔|1", -- [6]
						"克洛玛古斯|1", -- [7]
						"奈法利安|1", -- [8]
					},
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858909,
			},
		},
	},
}
