
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638724130,
				["numFreeBagSlots"] = 38,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::46:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:2799::::::::46:::::::::|h[猩猩牙]|h|r", -- [2]
							"|cffffffff|Hitem:3030::::::::46:::::::::|h[锐锋箭]|h|r", -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:3248::::::::46:::::::::|h[翻译好的藏尸者信件]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:4338::::::::46:::::::::|h[魔纹布]|h|r", -- [11]
						},
						["icon"] = 133652,
						["freeslots"] = 10,
						["ids"] = {
							nil, -- [1]
							2799, -- [2]
							3030, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							3248, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							4338, -- [11]
						},
						["counts"] = {
							nil, -- [1]
							6, -- [2]
							126, -- [3]
							[11] = 19,
						},
						["size"] = 14,
					},
					["Bag100"] = {
						["size"] = 24,
						["ids"] = {
							3655, -- [1]
						},
						["freeslots"] = 23,
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::46:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:8075::::::::46:::::::::|h[魔法酵母]|h|r", -- [2]
							"|cffffffff|Hitem:8075::::::::46:::::::::|h[魔法酵母]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::46:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cffffffff|Hitem:8075::::::::46:::::::::|h[魔法酵母]|h|r", -- [5]
							[9] = "|cffffffff|Hitem:1707::::::::46:::::::::|h[暴风城奶酪]|h|r",
							[10] = "|cffffffff|Hitem:8075::::::::46:::::::::|h[魔法酵母]|h|r",
							[13] = "|cffffffff|Hitem:8075::::::::46:::::::::|h[魔法酵母]|h|r",
							[14] = "|cffffffff|Hitem:8075::::::::46:::::::::|h[魔法酵母]|h|r",
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							nil, -- [1]
							8075, -- [2]
							8075, -- [3]
							4623, -- [4]
							8075, -- [5]
							[9] = 1707,
							[10] = 8075,
							[13] = 8075,
							[14] = 8075,
						},
						["counts"] = {
							nil, -- [1]
							7, -- [2]
							20, -- [3]
							2, -- [4]
							20, -- [5]
							[10] = 20,
							[13] = 20,
							[14] = 20,
						},
						["freeslots"] = 6,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							6828, -- [1]
							[6] = 4636,
							[13] = 3385,
							[12] = 4649,
							[5] = 4338,
							[9] = 7668,
						},
						["links"] = {
							"|cff1eff00|Hitem:6828::::::::46:::::::::|h[幻像圆盾]|h|r", -- [1]
							[6] = "|cff1eff00|Hitem:4636::::::::46:::::::::|h[精铁宝箱]|h|r",
							[13] = "|cffffffff|Hitem:3385::::::::46:::::::::|h[次级法力药水]|h|r",
							[12] = "|cffffffff|Hitem:4649::::::::46:::::::::|h[葛利·硬骨的便笺]|h|r",
							[5] = "|cffffffff|Hitem:4338::::::::46:::::::::|h[魔纹布]|h|r",
							[9] = "|cffffffff|Hitem:7668::::::::46:::::::::|h[染血的日记]|h|r",
						},
						["counts"] = {
							[5] = 20,
							[13] = 3,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::46:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 8,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::46:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:3827::::::::46:::::::::|h[法力药水]|h|r", -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:1710::::::::46:::::::::|h[强效治疗药水]|h|r", -- [4]
							nil, -- [5]
							"|cff1eff00|Hitem:9419::::::::46:::::::::|h[加加恩的火锤]|h|r", -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:4582::::::::46:::::::::|h[柔软的狼尾]|h|r", -- [12]
							"|cff1eff00|Hitem:4987::::::::46:::::::::|h[矮人队长之剑]|h|r", -- [13]
							"|cffffffff|Hitem:7442::::::::46:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							2, -- [4]
							[12] = 3,
						},
						["size"] = 14,
						["ids"] = {
							nil, -- [1]
							3827, -- [2]
							nil, -- [3]
							1710, -- [4]
							nil, -- [5]
							9419, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							4582, -- [12]
							4987, -- [13]
							7442, -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 8,
					},
					["Bag0"] = {
						["ids"] = {
							3825, -- [1]
							6948, -- [2]
							nil, -- [3]
							8544, -- [4]
							5655, -- [5]
							4338, -- [6]
							2665, -- [7]
							18294, -- [8]
							5826, -- [9]
							5865, -- [10]
							7971, -- [11]
							5866, -- [12]
							10699, -- [13]
							6451, -- [14]
							[16] = 3898,
						},
						["links"] = {
							"|cffffffff|Hitem:3825::::::::46:::::::::|h[坚韧药剂]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::46:::::::::|h[炉石]|h|r", -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:8544::::::::46:::::::::|h[魔纹绷带]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::46:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:4338::::::::46:::::::::|h[魔纹布]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::46:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::46:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							"|cffffffff|Hitem:5826::::::::46:::::::::|h[克拉维尔的设计图]|h|r", -- [9]
							"|cffffffff|Hitem:5865::::::::46:::::::::|h[改进型爆盐增压器]|h|r", -- [10]
							"|cff1eff00|Hitem:7971::::::::46:::::::::|h[黑珍珠]|h|r", -- [11]
							"|cffffffff|Hitem:5866::::::::46:::::::::|h[精铁矿石样本]|h|r", -- [12]
							"|cffffffff|Hitem:10699::::::::46:::::::::|h[叶基亚的树枝]|h|r", -- [13]
							"|cffffffff|Hitem:6451::::::::46:::::::::|h[厚丝质绷带]|h|r", -- [14]
							[16] = "|cffffffff|Hitem:3898::::::::46:::::::::|h[图书馆手稿]|h|r",
						},
						["freeslots"] = 6,
						["counts"] = {
							[8] = 3,
							[14] = 5,
							[4] = 9,
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
				},
				["numBagSlots"] = 76,
			},
		},
		["Version"] = 1,
	},
}
