
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638897538,
				["numFreeBagSlots"] = 21,
				["numBagSlots"] = 76,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							2799, -- [2]
							3030, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							3248, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							4338, -- [11]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:2799::::::::48:::::::::|h[猩猩牙]|h|r", -- [2]
							"|cffffffff|Hitem:3030::::::::48:::::::::|h[锐锋箭]|h|r", -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:3248::::::::48:::::::::|h[翻译好的藏尸者信件]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:4338::::::::48:::::::::|h[魔纹布]|h|r", -- [11]
						},
						["counts"] = {
							nil, -- [1]
							6, -- [2]
							121, -- [3]
							[11] = 2,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::48:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 10,
					},
					["Bag100"] = {
						["size"] = 24,
						["ids"] = {
							3655, -- [1]
						},
						["freeslots"] = 23,
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							13446, -- [1]
							10443, -- [2]
							1645, -- [3]
							4623, -- [4]
							8483, -- [5]
							15156, -- [6]
							8544, -- [7]
							10561, -- [8]
							9358, -- [9]
							4306, -- [10]
							8564, -- [11]
							nil, -- [12]
							nil, -- [13]
							6149, -- [14]
						},
						["links"] = {
							"|cffffffff|Hitem:13446::::::::48:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:10443::::::::48:::::::::|h[烧焦的信件]|h|r", -- [2]
							"|cffffffff|Hitem:1645::::::::48:::::::::|h[草莓汁]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::48:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cffffffff|Hitem:8483::::::::48:::::::::|h[废土水袋]|h|r", -- [5]
							"|cff1eff00|Hitem:15156::::::616:260071296:48:::::::::|h[灵猴之午夜圆帽]|h|r", -- [6]
							"|cffffffff|Hitem:8544::::::::48:::::::::|h[魔纹绷带]|h|r", -- [7]
							"|cffffffff|Hitem:10561::::::::48:::::::::|h[秘银外壳]|h|r", -- [8]
							"|cff9d9d9d|Hitem:9358::::::::48:::::::::|h[裹头巾]|h|r", -- [9]
							"|cffffffff|Hitem:4306::::::::48:::::::::|h[丝绸]|h|r", -- [10]
							"|cffffffff|Hitem:8564::::::::48:::::::::|h[角鹰兽的蛋]|h|r", -- [11]
							nil, -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:6149::::::::48:::::::::|h[强效法力药水]|h|r", -- [14]
						},
						["freeslots"] = 2,
						["counts"] = {
							4, -- [1]
							nil, -- [2]
							2, -- [3]
							2, -- [4]
							4, -- [5]
							[7] = 15,
							[10] = 5,
						},
						["link"] = "|cffffffff|Hitem:14046::::::::48:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::48:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cff1eff00|Hitem:6828::::::::48:::::::::|h[幻像圆盾]|h|r", -- [1]
							"|cff1eff00|Hitem:14268::::::1885:833197952:48:::::::::|h[火焰惩戒之盖亚护腕]|h|r", -- [2]
							"|cffffffff|Hitem:9260::::::::48:::::::::|h[烈性朗姆酒]|h|r", -- [3]
							nil, -- [4]
							nil, -- [5]
							"|cff1eff00|Hitem:4636::::::::48:::::::::|h[精铁宝箱]|h|r", -- [6]
							"|cffffffff|Hitem:8152::::::::48:::::::::|h[大瓶魔精]|h|r", -- [7]
							"|cff9d9d9d|Hitem:9357::::::::48:::::::::|h[鹦鹉的骸骨]|h|r", -- [8]
							"|cffffffff|Hitem:7668::::::::48:::::::::|h[染血的日记]|h|r", -- [9]
							"|cff1eff00|Hitem:8623::::::::48:::::::::|h[OOX-17/TN定位器]|h|r", -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:4649::::::::48:::::::::|h[葛利·硬骨的便笺]|h|r", -- [12]
							"|cffffffff|Hitem:3385::::::::48:::::::::|h[次级法力药水]|h|r", -- [13]
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							6828, -- [1]
							14268, -- [2]
							9260, -- [3]
							nil, -- [4]
							nil, -- [5]
							4636, -- [6]
							8152, -- [7]
							9357, -- [8]
							7668, -- [9]
							8623, -- [10]
							nil, -- [11]
							4649, -- [12]
							3385, -- [13]
						},
						["counts"] = {
							[8] = 2,
							[13] = 3,
						},
						["freeslots"] = 4,
					},
					["Bag0"] = {
						["ids"] = {
							3825, -- [1]
							6948, -- [2]
							13446, -- [3]
							8544, -- [4]
							5655, -- [5]
							8545, -- [6]
							9328, -- [7]
							18294, -- [8]
							6727, -- [9]
							4653, -- [10]
							7971, -- [11]
							5866, -- [12]
							12359, -- [13]
							6451, -- [14]
							13446, -- [15]
							3898, -- [16]
							9664, -- [17]
							8545, -- [18]
							8076, -- [19]
							4602, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:3825::::::::48:::::::::|h[坚韧药剂]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::48:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:13446::::::::48:::::::::|h[特效治疗药水]|h|r", -- [3]
							"|cffffffff|Hitem:8544::::::::48:::::::::|h[魔纹绷带]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::48:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:8545::::::::48:::::::::|h[厚魔纹绷带]|h|r", -- [6]
							"|cffffffff|Hitem:9328::::::::48:::::::::|h[超级摄影器FX]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::48:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							"|cff1eff00|Hitem:6727::::::::48:::::::::|h[拉泽瑞克的赛车手套]|h|r", -- [9]
							"|cff1eff00|Hitem:4653::::::::48:::::::::|h[铁踵之靴]|h|r", -- [10]
							"|cff1eff00|Hitem:7971::::::::48:::::::::|h[黑珍珠]|h|r", -- [11]
							"|cffffffff|Hitem:5866::::::::48:::::::::|h[精铁矿石样本]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::48:::::::::|h[瑟银锭]|h|r", -- [13]
							"|cffffffff|Hitem:6451::::::::48:::::::::|h[厚丝质绷带]|h|r", -- [14]
							"|cffffffff|Hitem:13446::::::::48:::::::::|h[特效治疗药水]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::48:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cff1eff00|Hitem:9664::::::::48:::::::::|h[卫戍头盔]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::48:::::::::|h[厚魔纹绷带]|h|r", -- [18]
							"|cffffffff|Hitem:8076::::::::48:::::::::|h[魔法甜面包]|h|r", -- [19]
							"|cffffffff|Hitem:4602::::::::48:::::::::|h[饱满的南瓜]|h|r", -- [20]
						},
						["cooldowns"] = {
							[2] = "1638896936.3|3600|1",
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							2, -- [1]
							[13] = 2,
							[15] = 5,
							[8] = 3,
							[18] = 20,
							[19] = 20,
							[20] = 10,
							[3] = 4,
							[6] = 19,
							[14] = 5,
							[4] = 15,
						},
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::48:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:8076::::::::48:::::::::|h[魔法甜面包]|h|r", -- [2]
							"|cffffffff|Hitem:8076::::::::48:::::::::|h[魔法甜面包]|h|r", -- [3]
							"|cffffffff|Hitem:1710::::::::48:::::::::|h[强效治疗药水]|h|r", -- [4]
							"|cffffffff|Hitem:8076::::::::48:::::::::|h[魔法甜面包]|h|r", -- [5]
							"|cff1eff00|Hitem:9419::::::::48:::::::::|h[加加恩的火锤]|h|r", -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:11725::::::::48:::::::::|h[水晶蜘蛛腿]|h|r", -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:4582::::::::48:::::::::|h[柔软的狼尾]|h|r", -- [12]
							"|cff1eff00|Hitem:4987::::::::48:::::::::|h[矮人队长之剑]|h|r", -- [13]
							"|cffffffff|Hitem:7442::::::::48:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 5,
						["ids"] = {
							nil, -- [1]
							8076, -- [2]
							8076, -- [3]
							1710, -- [4]
							8076, -- [5]
							9419, -- [6]
							nil, -- [7]
							11725, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							4582, -- [12]
							4987, -- [13]
							7442, -- [14]
						},
						["counts"] = {
							nil, -- [1]
							20, -- [2]
							20, -- [3]
							nil, -- [4]
							20, -- [5]
							nil, -- [6]
							nil, -- [7]
							2, -- [8]
							[12] = 3,
						},
						["size"] = 14,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
