
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1640891170,
				["Factions"] = {
					18728, -- [1]
					nil, -- [2]
					20413, -- [3]
					29476, -- [4]
					[25] = 4972,
					[28] = 220,
					[15] = 8700,
					[30] = 770,
					[16] = 5887,
					[9] = 143,
					[18] = 6225,
					[19] = 23254,
					[11] = 8619,
					[22] = 297,
					[32] = 1728,
					[17] = 7793,
				},
			},
		},
	},
}
