
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1646147026,
				["Factions"] = {
					19521, -- [1]
					nil, -- [2]
					22885, -- [3]
					30805, -- [4]
					[25] = 26114,
					[28] = 220,
					[15] = 8703,
					[30] = 770,
					[16] = 5890,
					[9] = 8987,
					[18] = 6231,
					[10] = 8068,
					[19] = 25151,
					[11] = 42999,
					[22] = 998,
					[17] = 7795,
					[32] = 1728,
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
				["Factions"] = {
					3100, -- [1]
					nil, -- [2]
					4000, -- [3]
					3100, -- [4]
				},
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858908,
				["Factions"] = {
					5461, -- [1]
					nil, -- [2]
					8641, -- [3]
					4088, -- [4]
				},
			},
		},
	},
}
