
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1641405159,
				["Factions"] = {
					19202, -- [1]
					nil, -- [2]
					21774, -- [3]
					30486, -- [4]
					[25] = 9487,
					[28] = 220,
					[15] = 8700,
					[30] = 770,
					[16] = 5887,
					[9] = 143,
					[18] = 6225,
					[19] = 25151,
					[11] = 33576,
					[22] = 640,
					[17] = 7793,
					[32] = 1728,
				},
			},
		},
	},
}
