
DataStore_MailsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1642524793,
				["Mails"] = {
					{
						["lastCheck"] = 1642524793,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-16 16时,在游戏中对玩家 鱼人摩洛克-牛*公的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 362.6751708984375,
					}, -- [1]
					{
						["lastCheck"] = 1642524793,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-16 21时,在游戏中对玩家 鱼人摩洛克-魔*的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 362.8772583007813,
					}, -- [2]
					{
						["lastCheck"] = 1642524793,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2022-01-17 00时,在游戏中对玩家 鱼人摩洛克-我***妇的举报，我们将持续对该角色进行监控，推荐您关注并绑定微信公众号“暴雪游戏服务中心”获得结果通知，登录官方暴雪游戏安全中心-个人中心我的举报查看所有举报详情。\n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 363.0029907226563,
					}, -- [3]
				},
				["lastVisitDate"] = "2022/01/19 00:53",
			},
		},
	},
}
