
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1639247396,
				["averageItemLvl"] = 45.1875,
				["Inventory"] = {
					"|cff1eff00|Hitem:20640::::::::53:::::::::|h[南海小桶]|h|r", -- [1]
					"|cff1eff00|Hitem:17772::::::::53:::::::::|h[热情暗影残片坠饰]|h|r", -- [2]
					"|cff1eff00|Hitem:9531::::::::53:::::::::|h[晶岩肩铠]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::53:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff1eff00|Hitem:11195:1843:::::::53:::::::::|h[战铸胸甲]|h|r", -- [5]
					"|cff1eff00|Hitem:14960::::::1206:1952731648:53:::::::::|h[野熊之大酋长腰带]|h|r", -- [6]
					"|cff1eff00|Hitem:10740::::::::53:::::::::|h[百夫长腿甲]|h|r", -- [7]
					"|cff1eff00|Hitem:9637::::::::53:::::::::|h[断骨长靴]|h|r", -- [8]
					"|cff1eff00|Hitem:10239::::::193:1698566400:53:::::::::|h[力量之重型板层臂铠]|h|r", -- [9]
					"|cff0070dd|Hitem:9410::::::1208:1184142464:53:::::::::|h[野熊之山壁之拳]|h|r", -- [10]
					"|cff0070dd|Hitem:9533::::::::53:::::::::|h[石工兄弟会之戒]|h|r", -- [11]
					"|cff1eff00|Hitem:7552::::::::53:::::::::|h[猎鹰之钩]|h|r", -- [12]
					"|cff1eff00|Hitem:17774::::::::53:::::::::|h[天选者印记]|h|r", -- [13]
					"|cff1eff00|Hitem:11122::::::::53:::::::::|h[棍子上的胡萝卜]|h|r", -- [14]
					"|cff1eff00|Hitem:4114::::::::53:::::::::|h[黑潮斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:9418::::::::53:::::::::|h[斩石者]|h|r", -- [16]
					nil, -- [17]
					"|cffffffff|Hitem:15807::::::::53:::::::::|h[轻弩]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
				},
			},
		},
	},
}
