
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1637948696,
				["numFreeBagSlots"] = 21,
				["numBagSlots"] = 60,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::29:::::::::|h[丝绸小包]|h|r",
						["size"] = 10,
						["icon"] = 133628,
						["freeslots"] = 10,
					},
					["Bag100"] = {
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["ids"] = {
							3655, -- [1]
						},
						["size"] = 24,
						["freeslots"] = 23,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							5948, -- [1]
							1774, -- [2]
							4606, -- [3]
							2592, -- [4]
							7442, -- [5]
							1819, -- [6]
							3385, -- [7]
							2589, -- [8]
							5996, -- [9]
							1821, -- [10]
						},
						["links"] = {
							"|cffffffff|Hitem:5948::::::::30:::::::::|h[写给乔贞的信]|h|r", -- [1]
							"|cff9d9d9d|Hitem:1774::::::::30:::::::::|h[织锦披风]|h|r", -- [2]
							"|cffffffff|Hitem:4606::::::::30:::::::::|h[多孔蘑菇]|h|r", -- [3]
							"|cffffffff|Hitem:2592::::::::30:::::::::|h[毛料]|h|r", -- [4]
							"|cffffffff|Hitem:7442::::::::30:::::::::|h[基尔卡克的钥匙]|h|r", -- [5]
							"|cff9d9d9d|Hitem:1819::::::::30:::::::::|h[刨木锄]|h|r", -- [6]
							"|cffffffff|Hitem:3385::::::::30:::::::::|h[次级法力药水]|h|r", -- [7]
							"|cffffffff|Hitem:2589::::::::30:::::::::|h[亚麻布]|h|r", -- [8]
							"|cffffffff|Hitem:5996::::::::30:::::::::|h[水下呼吸药剂]|h|r", -- [9]
							"|cff9d9d9d|Hitem:1821::::::::30:::::::::|h[弯曲的剑]|h|r", -- [10]
						},
						["icon"] = 133628,
						["size"] = 10,
						["link"] = "|cffffffff|Hitem:4245::::::::30:::::::::|h[丝绸小包]|h|r",
						["counts"] = {
							[7] = 2,
							[8] = 2,
							[3] = 10,
							[4] = 16,
							[9] = 2,
						},
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::30:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:3628::::::::30:::::::::|h[迪克斯特·瓦德的手掌]|h|r", -- [1]
							nil, -- [2]
							"|cff9d9d9d|Hitem:3378::::::::30:::::::::|h[织锦腰带]|h|r", -- [3]
							"|cff9d9d9d|Hitem:1799::::::::30:::::::::|h[生皮手套]|h|r", -- [4]
							"|cff9d9d9d|Hitem:2219::::::::30:::::::::|h[小圆盾]|h|r", -- [5]
							"|cff1eff00|Hitem:6391::::::::30:::::::::|h[图样：漂亮的绿衬衣]|h|r", -- [6]
							"|cffffffff|Hitem:929::::::::30:::::::::|h[治疗药水]|h|r", -- [7]
							"|cffffffff|Hitem:4306::::::::30:::::::::|h[丝绸]|h|r", -- [8]
							"|cff1eff00|Hitem:1206::::::::30:::::::::|h[绿玛瑙]|h|r", -- [9]
							"|cffffffff|Hitem:1205::::::::30:::::::::|h[果汁]|h|r", -- [10]
						},
						["counts"] = {
							[8] = 8,
						},
						["size"] = 10,
						["ids"] = {
							3628, -- [1]
							nil, -- [2]
							3378, -- [3]
							1799, -- [4]
							2219, -- [5]
							6391, -- [6]
							929, -- [7]
							4306, -- [8]
							1206, -- [9]
							1205, -- [10]
						},
						["icon"] = 133628,
						["freeslots"] = 1,
					},
					["Bag0"] = {
						["ids"] = {
							2161, -- [1]
							6948, -- [2]
							3531, -- [3]
							5274, -- [4]
							4306, -- [5]
							4605, -- [6]
							2665, -- [7]
							2563, -- [8]
							nil, -- [9]
							3531, -- [10]
							1082, -- [11]
							6842, -- [12]
							2943, -- [13]
							2512, -- [14]
							nil, -- [15]
							6572, -- [16]
							1322, -- [17]
							118, -- [18]
							3030, -- [19]
							3630, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:2161::::::::30:::::::::|h[斯温农场中的书]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::30:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:3531::::::::30:::::::::|h[厚绒线绷带]|h|r", -- [3]
							"|cff1eff00|Hitem:5274::::::::30:::::::::|h[玫瑰衬肩]|h|r", -- [4]
							"|cffffffff|Hitem:4306::::::::30:::::::::|h[丝绸]|h|r", -- [5]
							"|cffffffff|Hitem:4605::::::::30:::::::::|h[红斑蘑菇]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::30:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:2563::::::::30:::::::::|h[怪味粉末]|h|r", -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:3531::::::::30:::::::::|h[厚绒线绷带]|h|r", -- [10]
							"|cffffffff|Hitem:1082::::::::30:::::::::|h[赤脊山炖肉]|h|r", -- [11]
							"|cffffffff|Hitem:6842::::::::30:::::::::|h[弗伦的材料清单]|h|r", -- [12]
							"|cff1eff00|Hitem:2943::::::::30:::::::::|h[帕雷斯之眼]|h|r", -- [13]
							"|cffffffff|Hitem:2512::::::::30:::::::::|h[劣质箭]|h|r", -- [14]
							nil, -- [15]
							"|cff1eff00|Hitem:6572::::::588:2016107648:30:::::::::|h[灵猴之防御者之盾]|h|r", -- [16]
							"|cffffffff|Hitem:1322::::::::30:::::::::|h[鱼肝油]|h|r", -- [17]
							"|cffffffff|Hitem:118::::::::30:::::::::|h[初级治疗药水]|h|r", -- [18]
							"|cffffffff|Hitem:3030::::::::30:::::::::|h[锐锋箭]|h|r", -- [19]
							"|cffffffff|Hitem:3630::::::::30:::::::::|h[塔格尔的头颅]|h|r", -- [20]
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
						["counts"] = {
							[3] = 18,
							[5] = 20,
							[6] = 7,
							[10] = 20,
							[11] = 3,
							[14] = 20,
							[18] = 4,
							[19] = 200,
							[17] = 5,
						},
						["freeslots"] = 2,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							3770, -- [1]
							1711, -- [2]
						},
						["links"] = {
							"|cffffffff|Hitem:3770::::::::29:::::::::|h[羊排]|h|r", -- [1]
							"|cffffffff|Hitem:1711::::::::29:::::::::|h[耐力卷轴 II]|h|r", -- [2]
						},
						["counts"] = {
							4, -- [1]
						},
						["size"] = 10,
						["link"] = "|cffffffff|Hitem:4245::::::::29:::::::::|h[丝绸小包]|h|r",
						["icon"] = 133628,
						["freeslots"] = 8,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
