
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1639163532,
				["numFreeBagSlots"] = 29,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::51:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:4338::::::::51:::::::::|h[魔纹布]|h|r", -- [1]
							"|cffffffff|Hitem:2799::::::::51:::::::::|h[猩猩牙]|h|r", -- [2]
							"|cffffffff|Hitem:3030::::::::51:::::::::|h[锐锋箭]|h|r", -- [3]
							[5] = "|cffffffff|Hitem:6259::::::::51:::::::::|h[格罗多克猩猩的肝脏]|h|r",
							[13] = "|cffffffff|Hitem:5117::::::::51:::::::::|h[鲜艳的羽毛]|h|r",
							[11] = "|cffffffff|Hitem:4338::::::::51:::::::::|h[魔纹布]|h|r",
						},
						["icon"] = 133652,
						["freeslots"] = 8,
						["ids"] = {
							4338, -- [1]
							2799, -- [2]
							3030, -- [3]
							[5] = 6259,
							[13] = 5117,
							[11] = 4338,
						},
						["counts"] = {
							4, -- [1]
							10, -- [2]
							117, -- [3]
							[11] = 20,
							[13] = 2,
							[5] = 3,
						},
						["size"] = 14,
					},
					["Bag100"] = {
						["freeslots"] = 23,
						["ids"] = {
							3655, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							13446, -- [1]
							10443, -- [2]
							8151, -- [3]
							4623, -- [4]
							9240, -- [5]
							10826, -- [6]
							9527, -- [7]
							10561, -- [8]
							14960, -- [9]
							6300, -- [10]
							9531, -- [11]
							4306, -- [12]
						},
						["links"] = {
							"|cffffffff|Hitem:13446::::::::51:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:10443::::::::51:::::::::|h[烧焦的信件]|h|r", -- [2]
							"|cffffffff|Hitem:8151::::::::51:::::::::|h[魔精]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::51:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cff1eff00|Hitem:9240::::::::51:::::::::|h[祖尔法拉克之槌]|h|r", -- [5]
							"|cff1eff00|Hitem:10826::::::::51:::::::::|h[学识法杖]|h|r", -- [6]
							"|cff1eff00|Hitem:9527::::::::51:::::::::|h[幻法之杖]|h|r", -- [7]
							"|cffffffff|Hitem:10561::::::::51:::::::::|h[秘银外壳]|h|r", -- [8]
							"|cff1eff00|Hitem:14960::::::1206:1952731648:51:::::::::|h[野熊之大酋长腰带]|h|r", -- [9]
							"|cff9d9d9d|Hitem:6300::::::::51:::::::::|h[獠牙碎片]|h|r", -- [10]
							"|cff1eff00|Hitem:9531::::::::51:::::::::|h[晶岩肩铠]|h|r", -- [11]
							"|cffffffff|Hitem:4306::::::::51:::::::::|h[丝绸]|h|r", -- [12]
						},
						["icon"] = 133652,
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::51:::::::::|h[符文布背包]|h|r",
						["counts"] = {
							4, -- [1]
							nil, -- [2]
							5, -- [3]
							2, -- [4]
							[12] = 2,
						},
						["freeslots"] = 2,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							6828, -- [1]
							nil, -- [2]
							9260, -- [3]
							11086, -- [4]
							[11] = 4338,
						},
						["links"] = {
							"|cff1eff00|Hitem:6828::::::::51:::::::::|h[幻像圆盾]|h|r", -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:9260::::::::51:::::::::|h[烈性朗姆酒]|h|r", -- [3]
							"|cff0070dd|Hitem:11086::::::::51:::::::::|h[保护者迦萨斯]|h|r", -- [4]
							[11] = "|cffffffff|Hitem:4338::::::::51:::::::::|h[魔纹布]|h|r",
						},
						["counts"] = {
							[11] = 20,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::51:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 10,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::51:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:4419::::::::51:::::::::|h[智力卷轴 III]|h|r", -- [7]
							"|cffffffff|Hitem:10286::::::::51:::::::::|h[野性之心]|h|r", -- [8]
							"|cffffffff|Hitem:3928::::::::51:::::::::|h[超强治疗药水]|h|r", -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:6258::::::::51:::::::::|h[铁鬃熊的肝脏]|h|r", -- [11]
							"|cffffffff|Hitem:4582::::::::51:::::::::|h[柔软的狼尾]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::51:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["counts"] = {
							[11] = 3,
							[12] = 3,
							[9] = 4,
						},
						["size"] = 14,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							4419, -- [7]
							10286, -- [8]
							3928, -- [9]
							nil, -- [10]
							6258, -- [11]
							4582, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 8,
					},
					["Bag0"] = {
						["ids"] = {
							nil, -- [1]
							6948, -- [2]
							8594, -- [3]
							17048, -- [4]
							5655, -- [5]
							19040, -- [6]
							9507, -- [7]
							18294, -- [8]
							8647, -- [9]
							16739, -- [10]
							7971, -- [11]
							5866, -- [12]
							12359, -- [13]
							8076, -- [14]
							13446, -- [15]
							3898, -- [16]
							8076, -- [17]
							8545, -- [18]
							8076, -- [19]
							6257, -- [20]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:6948::::::::51:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:8594::::::::51:::::::::|h[昆虫分析报告]|h|r", -- [3]
							"|cffffffff|Hitem:17048::::::::51:::::::::|h[奇特的朗姆酒]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::51:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cff1eff00|Hitem:19040::::::::51:::::::::|h[索尔宾的大砍刀]|h|r", -- [6]
							"|cffffffff|Hitem:9507::::::::51:::::::::|h[仔细包装过的箱子]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::51:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							"|cffffffff|Hitem:8647::::::::51:::::::::|h[蛋箱]|h|r", -- [9]
							"|cff1eff00|Hitem:16739::::::::51:::::::::|h[毛木衬肩]|h|r", -- [10]
							"|cff1eff00|Hitem:7971::::::::51:::::::::|h[黑珍珠]|h|r", -- [11]
							"|cffffffff|Hitem:5866::::::::51:::::::::|h[精铁矿石样本]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::51:::::::::|h[瑟银锭]|h|r", -- [13]
							"|cffffffff|Hitem:8076::::::::51:::::::::|h[魔法甜面包]|h|r", -- [14]
							"|cffffffff|Hitem:13446::::::::51:::::::::|h[特效治疗药水]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::51:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:8076::::::::51:::::::::|h[魔法甜面包]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::51:::::::::|h[厚魔纹绷带]|h|r", -- [18]
							"|cffffffff|Hitem:8076::::::::51:::::::::|h[魔法甜面包]|h|r", -- [19]
							"|cffffffff|Hitem:6257::::::::51:::::::::|h[大鹏的砂囊]|h|r", -- [20]
						},
						["freeslots"] = 1,
						["cooldowns"] = {
							[2] = "1639161569.531|3600|1",
						},
						["counts"] = {
							[13] = 2,
							[14] = 9,
							[4] = 5,
							[8] = 3,
							[17] = 20,
							[18] = 18,
							[19] = 12,
							[20] = 3,
							[15] = 5,
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
				},
				["numBagSlots"] = 76,
			},
		},
		["Version"] = 1,
	},
}
