
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 42,
				["numBankSlots"] = 66,
				["lastUpdate"] = 1639935877,
				["numFreeBagSlots"] = 12,
				["Containers"] = {
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							12602, -- [1]
							11754, -- [2]
							12530, -- [3]
							10243, -- [4]
							nil, -- [5]
							3928, -- [6]
							14047, -- [7]
							10306, -- [8]
							11086, -- [9]
							nil, -- [10]
							nil, -- [11]
							13204, -- [12]
							12021, -- [13]
							7442, -- [14]
						},
						["links"] = {
							"|cff0070dd|Hitem:12602:929:::::::60:::::::::|h[龙人之盾]|h|r", -- [1]
							"|cff1eff00|Hitem:11754::::::::60:::::::::|h[黑钻石]|h|r", -- [2]
							"|cffffffff|Hitem:12530::::::::60:::::::::|h[尖塔蜘蛛卵]|h|r", -- [3]
							"|cff1eff00|Hitem:10243::::::1208:1787980928:60:::::::::|h[野熊之重型板层束带]|h|r", -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:3928::::::::60:::::::::|h[超强治疗药水]|h|r", -- [6]
							"|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r", -- [7]
							"|cffffffff|Hitem:10306::::::::60:::::::::|h[精神卷轴 IV]|h|r", -- [8]
							"|cff0070dd|Hitem:11086::::::::60:::::::::|h[保护者迦萨斯]|h|r", -- [9]
							nil, -- [10]
							nil, -- [11]
							"|cff0070dd|Hitem:13204::::::::60:::::::::|h[巴什古德之锤]|h|r", -- [12]
							"|cff1eff00|Hitem:12021::::::::60:::::::::|h[盾甲铁靴]|h|r", -- [13]
							"|cffffffff|Hitem:7442::::::::60:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["counts"] = {
							[2] = 2,
							[7] = 19,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 3,
					},
					["Bag100"] = {
						["ids"] = {
							3655, -- [1]
							9418, -- [2]
							10455, -- [3]
							17746, -- [4]
							12065, -- [5]
							9958, -- [6]
							19141, -- [7]
							2820, -- [8]
							9240, -- [9]
							17191, -- [10]
							10740, -- [11]
							13443, -- [12]
							3827, -- [13]
							6149, -- [14]
							4338, -- [15]
							11176, -- [16]
							11137, -- [17]
							16202, -- [18]
							14343, -- [19]
							7910, -- [20]
							4638, -- [21]
							4638, -- [22]
							11078, -- [23]
							7068, -- [24]
						},
						["size"] = 24,
						["counts"] = {
							[24] = 2,
							[13] = 2,
							[15] = 17,
							[16] = 2,
							[12] = 2,
							[19] = 2,
							[23] = 18,
							[17] = 8,
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::58:::::::::|h[抛光盾牌]|h|r", -- [1]
							"|cff0070dd|Hitem:9418::::::::58:::::::::|h[斩石者]|h|r", -- [2]
							"|cff1eff00|Hitem:10455::::::::58:::::::::|h[被禁锢的伊兰尼库斯精华]|h|r", -- [3]
							"|cff0070dd|Hitem:17746::::::::58:::::::::|h[诺克赛恩的镣铐]|h|r", -- [4]
							"|cff1eff00|Hitem:12065::::::::58:::::::::|h[元素屏障]|h|r", -- [5]
							"|cff1eff00|Hitem:9958::::::1200:687029632:58:::::::::|h[野熊之好战者的圆盾]|h|r", -- [6]
							"|cff1eff00|Hitem:19141::::::::58:::::::::|h[丝瓜]|h|r", -- [7]
							"|cff1eff00|Hitem:2820::::::::58:::::::::|h[灵巧秒表]|h|r", -- [8]
							"|cff1eff00|Hitem:9240::::::::58:::::::::|h[祖尔法拉克之槌]|h|r", -- [9]
							"|cff0070dd|Hitem:17191::::::::58:::::::::|h[塞雷布拉斯节杖]|h|r", -- [10]
							"|cff1eff00|Hitem:10740::::::::58:::::::::|h[百夫长腿甲]|h|r", -- [11]
							"|cffffffff|Hitem:13443::::::::58:::::::::|h[超强法力药水]|h|r", -- [12]
							"|cffffffff|Hitem:3827::::::::58:::::::::|h[法力药水]|h|r", -- [13]
							"|cffffffff|Hitem:6149::::::::58:::::::::|h[强效法力药水]|h|r", -- [14]
							"|cffffffff|Hitem:4338::::::::58:::::::::|h[魔纹布]|h|r", -- [15]
							"|cffffffff|Hitem:11176::::::::58:::::::::|h[梦境之尘]|h|r", -- [16]
							"|cffffffff|Hitem:11137::::::::58:::::::::|h[幻象之尘]|h|r", -- [17]
							"|cff1eff00|Hitem:16202::::::::58:::::::::|h[次级不灭精华]|h|r", -- [18]
							"|cff0070dd|Hitem:14343::::::::58:::::::::|h[小块魔光碎片]|h|r", -- [19]
							"|cff1eff00|Hitem:7910::::::::58:::::::::|h[红宝石]|h|r", -- [20]
							"|cff1eff00|Hitem:4638::::::::58:::::::::|h[强化钢质宝箱]|h|r", -- [21]
							"|cff1eff00|Hitem:4638::::::::58:::::::::|h[强化钢质宝箱]|h|r", -- [22]
							"|cffffffff|Hitem:11078::::::::58:::::::::|h[遗物宝箱钥匙]|h|r", -- [23]
							"|cffffffff|Hitem:7068::::::::58:::::::::|h[元素火焰]|h|r", -- [24]
						},
					},
					["Bag5"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cff0070dd|Hitem:18718::::::::60:::::::::|h[大十字军的头盔]|h|r", -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:12712::::::::60:::::::::|h[瓦罗什的魔精]|h|r", -- [3]
							nil, -- [4]
							"|cff1eff00|Hitem:11910::::::::60:::::::::|h[珠宝缀饰腿甲]|h|r", -- [5]
							"|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r", -- [6]
							"|cff0070dd|Hitem:13381::::::::60:::::::::|h[炮手长靴]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							"|cff0070dd|Hitem:9410::::::1208:1184142464:60:::::::::|h[野熊之山壁之拳]|h|r", -- [10]
							"|cffffffff|Hitem:12345::::::::60:::::::::|h[比修的装置]|h|r", -- [11]
							nil, -- [12]
							"|cff0070dd|Hitem:13401::::::::60:::::::::|h[提米的手]|h|r", -- [13]
						},
						["counts"] = {
							[6] = 8,
						},
						["size"] = 14,
						["ids"] = {
							18718, -- [1]
							nil, -- [2]
							12712, -- [3]
							nil, -- [4]
							11910, -- [5]
							14047, -- [6]
							13381, -- [7]
							nil, -- [8]
							nil, -- [9]
							9410, -- [10]
							12345, -- [11]
							nil, -- [12]
							13401, -- [13]
						},
						["icon"] = 133652,
						["freeslots"] = 6,
					},
					["Bag-2"] = {
						["ids"] = {
							11000, -- [1]
						},
						["links"] = {
							"|cffffffff|Hitem:11000::::::::60:::::::::|h[暗炉钥匙]|h|r", -- [1]
						},
						["freeslots"] = 31,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:8076::::::::60:::::::::|h[魔法甜面包]|h|r", -- [1]
							"|cffffffff|Hitem:8076::::::::60:::::::::|h[魔法甜面包]|h|r", -- [2]
							"|cffffffff|Hitem:8076::::::::60:::::::::|h[魔法甜面包]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::60:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cffffffff|Hitem:8076::::::::60:::::::::|h[魔法甜面包]|h|r", -- [5]
							"|cffffffff|Hitem:12412::::::::60:::::::::|h[第四块摩沙鲁石板]|h|r", -- [6]
							"|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r", -- [7]
							"|cffffffff|Hitem:13443::::::::60:::::::::|h[超强法力药水]|h|r", -- [8]
							"|cffffffff|Hitem:8952::::::::60:::::::::|h[烤鹌鹑]|h|r", -- [9]
							"|cffffffff|Hitem:12730::::::::60:::::::::|h[瓦罗什的卷轴]|h|r", -- [10]
							"|cffffffff|Hitem:13289::::::::60:::::::::|h[埃根的冲击器]|h|r", -- [11]
							"|cff1eff00|Hitem:16202::::::::60:::::::::|h[次级不灭精华]|h|r", -- [12]
							"|cffffffff|Hitem:11474::::::::60:::::::::|h[精龙的蛋]|h|r", -- [13]
							"|cffffffff|Hitem:14530::::::::60:::::::::|h[厚符文布绷带]|h|r", -- [14]
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							8076, -- [1]
							8076, -- [2]
							8076, -- [3]
							4623, -- [4]
							8076, -- [5]
							12412, -- [6]
							14047, -- [7]
							13443, -- [8]
							8952, -- [9]
							12730, -- [10]
							13289, -- [11]
							16202, -- [12]
							11474, -- [13]
							14530, -- [14]
						},
						["counts"] = {
							17, -- [1]
							20, -- [2]
							20, -- [3]
							[5] = 20,
							[7] = 19,
							[14] = 8,
						},
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							12846, -- [1]
							17309, -- [2]
							8952, -- [3]
							16663, -- [4]
							18777, -- [5]
							12534, -- [6]
							20560, -- [7]
							12710, -- [8]
							nil, -- [9]
							13174, -- [10]
							12219, -- [11]
							1490, -- [12]
							nil, -- [13]
							14344, -- [14]
						},
						["links"] = {
							"|cffffffff|Hitem:12846::::::::60:::::::::|h[银色黎明委任徽章]|h|r", -- [1]
							"|cffffffff|Hitem:17309::::::::60:::::::::|h[不谐护腕]|h|r", -- [2]
							"|cffffffff|Hitem:8952::::::::60:::::::::|h[烤鹌鹑]|h|r", -- [3]
							"|cffffffff|Hitem:16663::::::::60:::::::::|h[黑龙勇士之血]|h|r", -- [4]
							"|cffa335ee|Hitem:18777::::::::60:::::::::|h[迅捷棕马]|h|r", -- [5]
							"|cffffffff|Hitem:12534::::::::60:::::::::|h[欧莫克的头颅]|h|r", -- [6]
							"|cff1eff00|Hitem:20560::::::::60:::::::::|h[奥特兰克山谷荣誉奖章]|h|r", -- [7]
							"|cffffffff|Hitem:12710::::::::60:::::::::|h[比斯巨兽的发光肉块]|h|r", -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:13174::::::::60:::::::::|h[瘟疫肉块]|h|r", -- [10]
							"|cffffffff|Hitem:12219::::::::60:::::::::|h[原始晋升印章]|h|r", -- [11]
							"|cff1eff00|Hitem:1490::::::::60:::::::::|h[守护之符]|h|r", -- [12]
							nil, -- [13]
							"|cff0070dd|Hitem:14344::::::::60:::::::::|h[大块魔光碎片]|h|r", -- [14]
						},
						["counts"] = {
							[3] = 20,
							[2] = 12,
							[7] = 5,
							[10] = 17,
						},
						["freeslots"] = 2,
						["link"] = "|cffffffff|Hitem:14046::::::::60:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							17774, -- [1]
							6948, -- [2]
							11285, -- [3]
							9531, -- [4]
							nil, -- [5]
							11833, -- [6]
							12264, -- [7]
							14529, -- [8]
							14529, -- [9]
							11176, -- [10]
							12411, -- [11]
							12529, -- [12]
							8766, -- [13]
							17310, -- [14]
							12938, -- [15]
							3898, -- [16]
							12284, -- [17]
							8545, -- [18]
							14047, -- [19]
							16204, -- [20]
						},
						["links"] = {
							"|cff1eff00|Hitem:17774::::::::60:::::::::|h[天选者印记]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::60:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:11285::::::::60:::::::::|h[锯齿箭]|h|r", -- [3]
							"|cff1eff00|Hitem:9531::::::::60:::::::::|h[晶岩肩铠]|h|r", -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:11833::::::::60:::::::::|h[格里什皇后诱引剂]|h|r", -- [6]
							"|cffffffff|Hitem:12264::::::::60:::::::::|h[座狼笼]|h|r", -- [7]
							"|cffffffff|Hitem:14529::::::::60:::::::::|h[符文布绷带]|h|r", -- [8]
							"|cffffffff|Hitem:14529::::::::60:::::::::|h[符文布绷带]|h|r", -- [9]
							"|cffffffff|Hitem:11176::::::::60:::::::::|h[梦境之尘]|h|r", -- [10]
							"|cffffffff|Hitem:12411::::::::60:::::::::|h[第三块摩沙鲁石板]|h|r", -- [11]
							"|cffffffff|Hitem:12529::::::::60:::::::::|h[烟网蜘蛛笼]|h|r", -- [12]
							"|cffffffff|Hitem:8766::::::::60:::::::::|h[晨露酒]|h|r", -- [13]
							"|cffffffff|Hitem:17310::::::::60:::::::::|h[海神之水]|h|r", -- [14]
							"|cffffffff|Hitem:12938::::::::60:::::::::|h[英雄之血]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::60:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:12284::::::::60:::::::::|h[龙灵采集器900型]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::60:::::::::|h[厚魔纹绷带]|h|r", -- [18]
							"|cffffffff|Hitem:14047::::::::60:::::::::|h[符文布]|h|r", -- [19]
							"|cffffffff|Hitem:16204::::::::60:::::::::|h[幻影之尘]|h|r", -- [20]
						},
						["counts"] = {
							[13] = 3,
							[15] = 3,
							[8] = 19,
							[9] = 5,
							[18] = 5,
							[10] = 5,
							[3] = 179,
							[19] = 20,
						},
						["cooldowns"] = {
							[2] = "1639934756.624|3600|1",
						},
						["size"] = 20,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["freeslots"] = 1,
					},
					["Bag7"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag6"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
				},
				["numBagSlots"] = 76,
			},
		},
		["Version"] = 1,
	},
}
