
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1640009205,
				["averageItemLvl"] = 58.94117647058823,
				["Inventory"] = {
					"|cff0070dd|Hitem:20521::::::::60:::::::::|h[怒火面甲]|h|r", -- [1]
					"|cff0070dd|Hitem:15411::::::::60:::::::::|h[弗丁印记]|h|r", -- [2]
					"|cff0070dd|Hitem:12927::::::::60:::::::::|h[强击护肩]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::60:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff0070dd|Hitem:11678::::::::60:::::::::|h[阿努希尔之壳]|h|r", -- [5]
					"|cff0070dd|Hitem:13142::::::::60:::::::::|h[黑龙束带]|h|r", -- [6]
					"|cff0070dd|Hitem:15062:1506:::::::60:::::::::|h[魔暴龙皮护腿]|h|r", -- [7]
					"|cff1eff00|Hitem:9637::::::::60:::::::::|h[断骨长靴]|h|r", -- [8]
					"|cff0070dd|Hitem:12936:1885:::::::60:::::::::|h[雷德的护腕]|h|r", -- [9]
					"|cff0070dd|Hitem:15063:927:::::::60:::::::::|h[魔暴龙皮手套]|h|r", -- [10]
					"|cff0070dd|Hitem:12548::::::::60:::::::::|h[麦格尼的意志]|h|r", -- [11]
					"|cff0070dd|Hitem:13098::::::::60:::::::::|h[痛苦指环]|h|r", -- [12]
					"|cff0070dd|Hitem:13965::::::::60:::::::::|h[黑手饰物]|h|r", -- [13]
					"|cff1eff00|Hitem:17774::::::::60:::::::::|h[天选者印记]|h|r", -- [14]
					"|cff0070dd|Hitem:11930::::::::60:::::::::|h[皇帝的新斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:12940:1900:::::::60:::::::::|h[雷德的神圣控诉者]|h|r", -- [16]
					"|cff0070dd|Hitem:12939:1900:::::::60:::::::::|h[雷德的部族护卫者]|h|r", -- [17]
					"|cff0070dd|Hitem:16996::::::::60:::::::::|h[血木猎弓]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.污手党"] = {
				["Members"] = {
					["特变电工"] = {
						["averageItemLvl"] = 2,
					},
				},
			},
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
