
DataStore_MailsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1639502515,
				["Mails"] = {
					{
						["lastCheck"] = 1639502515,
						["sender"] = "普拉特·马克格鲁比",
						["subject"] = "",
						["returned"] = false,
						["money"] = 0,
						["text"] = "你好，我写这封信是要告诉你，羽月要塞一切都好。我做了一些新的皮革装备，感谢你对我的帮助！\n\n我还剩下了一些皮革，所以就寄给你来表示我的谢意。如果你再次路过羽月要塞，别忘了来我这里坐坐！\n\n你的朋友，\n普拉特",
						["icon"] = 134327,
						["daysLeft"] = 25.74246597290039,
					}, -- [1]
					{
						["lastCheck"] = 1639502515,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-11-24 23时,在游戏中对玩家 鱼人摩洛克-修*帅的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 345.0680847167969,
					}, -- [2]
					{
						["lastCheck"] = 1639502515,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-11-28 14时,在游戏中对玩家 鱼人摩洛克-小*蛋的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 348.5548095703125,
					}, -- [3]
					{
						["lastCheck"] = 1639502515,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-11-28 14时,在游戏中对玩家 鱼人摩洛克-职**怪的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 348.5685729980469,
					}, -- [4]
					{
						["lastCheck"] = 1639502515,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-12-02 00时,在游戏中对玩家 鱼人摩洛克-找*儿的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 351.9857788085938,
					}, -- [5]
					{
						["lastCheck"] = 1639502515,
						["sender"] = "客服支持",
						["subject"] = "举报结果通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n您于 2021-11-28 14时,在游戏中举报的玩家鱼人摩洛克-职**怪 已被证实存在违规行为而受到临时冻结处罚 。 感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 352.4097900390625,
					}, -- [6]
				},
				["lastVisitDate"] = "2021/12/15 01:21",
			},
		},
	},
}
