
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638037720,
				["numFreeBagSlots"] = 31,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							11152, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:11152::::::::33:::::::::|h[公式：附魔手套 - 钓鱼]|h|r", -- [1]
						},
						["link"] = "|cffffffff|Hitem:4245::::::::33:::::::::|h[丝绸小包]|h|r",
						["freeslots"] = 9,
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag100"] = {
						["freeslots"] = 23,
						["ids"] = {
							3655, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::33:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:4432::::::::33:::::::::|h[苏利·巴鲁的信]|h|r", -- [4]
							"|cffffffff|Hitem:7442::::::::33:::::::::|h[基尔卡克的钥匙]|h|r", -- [5]
							"|cffffffff|Hitem:2592::::::::33:::::::::|h[毛料]|h|r", -- [6]
							"|cffffffff|Hitem:16113::::::::33:::::::::|h[手册：魔纹绷带]|h|r", -- [7]
							[9] = "|cffffffff|Hitem:5996::::::::33:::::::::|h[水下呼吸药剂]|h|r",
							[10] = "|cffffffff|Hitem:6450::::::::33:::::::::|h[丝质绷带]|h|r",
						},
						["counts"] = {
							[6] = 4,
							[9] = 2,
							[10] = 20,
						},
						["freeslots"] = 4,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							4432, -- [4]
							7442, -- [5]
							2592, -- [6]
							16113, -- [7]
							[9] = 5996,
							[10] = 6450,
						},
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::33:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:3248::::::::33:::::::::|h[翻译好的藏尸者信件]|h|r", -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:858::::::::33:::::::::|h[次级治疗药水]|h|r", -- [4]
							"|cffffffff|Hitem:858::::::::33:::::::::|h[次级治疗药水]|h|r", -- [5]
							"|cffffffff|Hitem:4306::::::::33:::::::::|h[丝绸]|h|r", -- [6]
							"|cffffffff|Hitem:929::::::::33:::::::::|h[治疗药水]|h|r", -- [7]
						},
						["icon"] = 133628,
						["freeslots"] = 5,
						["ids"] = {
							nil, -- [1]
							3248, -- [2]
							nil, -- [3]
							858, -- [4]
							858, -- [5]
							4306, -- [6]
							929, -- [7]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							5, -- [4]
							2, -- [5]
						},
						["size"] = 10,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::33:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:2162::::::::33:::::::::|h[莎拉之戒]|h|r", -- [1]
							nil, -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:3385::::::::33:::::::::|h[次级法力药水]|h|r", -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							"|cff1eff00|Hitem:11152::::::::33:::::::::|h[公式：附魔手套 - 钓鱼]|h|r", -- [8]
							"|cff1eff00|Hitem:5498::::::::33:::::::::|h[有光泽的小珍珠]|h|r", -- [9]
						},
						["freeslots"] = 6,
						["ids"] = {
							2162, -- [1]
							nil, -- [2]
							nil, -- [3]
							3385, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							11152, -- [8]
							5498, -- [9]
						},
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag0"] = {
						["ids"] = {
							nil, -- [1]
							6948, -- [2]
							nil, -- [3]
							nil, -- [4]
							6451, -- [5]
							2712, -- [6]
							2665, -- [7]
							2609, -- [8]
							1114, -- [9]
							nil, -- [10]
							nil, -- [11]
							nil, -- [12]
							1114, -- [13]
							2916, -- [14]
							6450, -- [15]
							nil, -- [16]
							1322, -- [17]
							118, -- [18]
							3030, -- [19]
							730, -- [20]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:6948::::::::33:::::::::|h[炉石]|h|r", -- [2]
							nil, -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:6451::::::::33:::::::::|h[厚丝质绷带]|h|r", -- [5]
							"|cffffffff|Hitem:2712::::::::33:::::::::|h[一箱光铸铁锭]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::33:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:2609::::::::33:::::::::|h[拆弹胶质]|h|r", -- [8]
							"|cffffffff|Hitem:1114::::::::33:::::::::|h[魔法黑面包]|h|r", -- [9]
							nil, -- [10]
							nil, -- [11]
							nil, -- [12]
							"|cffffffff|Hitem:1114::::::::33:::::::::|h[魔法黑面包]|h|r", -- [13]
							"|cff1eff00|Hitem:2916::::::::33:::::::::|h[金狮之盾]|h|r", -- [14]
							"|cffffffff|Hitem:6450::::::::33:::::::::|h[丝质绷带]|h|r", -- [15]
							nil, -- [16]
							"|cffffffff|Hitem:1322::::::::33:::::::::|h[鱼肝油]|h|r", -- [17]
							"|cffffffff|Hitem:118::::::::33:::::::::|h[初级治疗药水]|h|r", -- [18]
							"|cffffffff|Hitem:3030::::::::33:::::::::|h[锐锋箭]|h|r", -- [19]
							"|cffffffff|Hitem:730::::::::33:::::::::|h[鱼人的眼球]|h|r", -- [20]
						},
						["freeslots"] = 7,
						["counts"] = {
							[13] = 15,
							[15] = 20,
							[5] = 6,
							[19] = 186,
							[17] = 5,
							[18] = 4,
							[20] = 7,
							[9] = 8,
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
				},
				["numBagSlots"] = 60,
			},
		},
		["Version"] = 1,
	},
}
