
DataStore_AgendaDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1652110521,
				["DungeonIDs"] = {
					["奥妮克希亚的巢穴 40人|20002566"] = "372279|1652110521|0|1",
					["黑翼之巢 40人|19938326"] = "199479|1652110521|0|1",
					["祖尔格拉布 20人|19916746"] = "26679|1652110521|0|1",
				},
				["BossKills"] = {
					["奥妮克希亚的巢穴 40人|20002566"] = {
						"奥妮克希亚|1", -- [1]
					},
					["黑翼之巢 40人|19938326"] = {
						"狂野的拉佐格尔|1", -- [1]
						"堕落的瓦拉斯塔兹|1", -- [2]
						"勒什雷尔|1", -- [3]
						"费尔默|1", -- [4]
						"埃博诺克|1", -- [5]
						"弗莱格尔|1", -- [6]
						"克洛玛古斯|1", -- [7]
						"奈法利安|1", -- [8]
					},
					["祖尔格拉布 20人|19916746"] = {
						"高阶祭司耶克里克|1", -- [1]
						"高阶祭司温诺希斯|1", -- [2]
						"高阶祭司玛尔里|1", -- [3]
						"血领主曼多基尔|1", -- [4]
						"疯狂之缘|0", -- [5]
						"高阶祭司塞卡尔|1", -- [6]
						"加兹兰卡|0", -- [7]
						"高阶祭司娅尔罗|1", -- [8]
						"妖术师金度|1", -- [9]
						"哈卡|1", -- [10]
					},
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858909,
			},
		},
	},
}
