
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1637776046,
				["numFreeBagSlots"] = 34,
				["numBagSlots"] = 60,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							858, -- [1]
						},
						["links"] = {
							"|cffffffff|Hitem:858::::::::26:::::::::|h[次级治疗药水]|h|r", -- [1]
						},
						["size"] = 10,
						["cooldowns"] = {
							"1637775054.767|120|1", -- [1]
						},
						["link"] = "|cffffffff|Hitem:4245::::::::26:::::::::|h[丝绸小包]|h|r",
						["icon"] = 133628,
						["freeslots"] = 9,
					},
					["Bag100"] = {
						["freeslots"] = 23,
						["ids"] = {
							3655, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::26:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:1114::::::::26:::::::::|h[魔法黑面包]|h|r", -- [1]
							nil, -- [2]
							"|cff1eff00|Hitem:1210::::::::26:::::::::|h[暗影石]|h|r", -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:7442::::::::26:::::::::|h[基尔卡克的钥匙]|h|r", -- [5]
							[9] = "|cffffffff|Hitem:5996::::::::26:::::::::|h[水下呼吸药剂]|h|r",
						},
						["icon"] = 133628,
						["freeslots"] = 6,
						["ids"] = {
							1114, -- [1]
							nil, -- [2]
							1210, -- [3]
							nil, -- [4]
							7442, -- [5]
							[9] = 5996,
						},
						["counts"] = {
							8, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							4, -- [9]
						},
						["size"] = 10,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::26:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:1475::::::::26:::::::::|h[小毒囊]|h|r", -- [1]
						},
						["icon"] = 133628,
						["size"] = 10,
						["ids"] = {
							1475, -- [1]
						},
						["counts"] = {
							2, -- [1]
						},
						["freeslots"] = 9,
					},
					["Bag0"] = {
						["ids"] = {
							2161, -- [1]
							6948, -- [2]
							2581, -- [3]
							3530, -- [4]
							4306, -- [5]
							4605, -- [6]
							2665, -- [7]
							2563, -- [8]
							6970, -- [9]
							3531, -- [10]
							1082, -- [11]
							6842, -- [12]
							2592, -- [13]
							2512, -- [14]
							1205, -- [15]
							1083, -- [16]
							1322, -- [17]
							118, -- [18]
							nil, -- [19]
							1114, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:2161::::::::26:::::::::|h[斯温农场中的书]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::26:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:2581::::::::26:::::::::|h[厚亚麻绷带]|h|r", -- [3]
							"|cffffffff|Hitem:3530::::::::26:::::::::|h[绒线绷带]|h|r", -- [4]
							"|cffffffff|Hitem:4306::::::::26:::::::::|h[丝绸]|h|r", -- [5]
							"|cffffffff|Hitem:4605::::::::26:::::::::|h[红斑蘑菇]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::26:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:2563::::::::26:::::::::|h[怪味粉末]|h|r", -- [8]
							"|cff1eff00|Hitem:6970::::::::26:::::::::|h[弗伦的礼物]|h|r", -- [9]
							"|cffffffff|Hitem:3531::::::::26:::::::::|h[厚绒线绷带]|h|r", -- [10]
							"|cffffffff|Hitem:1082::::::::26:::::::::|h[赤脊山炖肉]|h|r", -- [11]
							"|cffffffff|Hitem:6842::::::::26:::::::::|h[弗伦的材料清单]|h|r", -- [12]
							"|cffffffff|Hitem:2592::::::::26:::::::::|h[毛料]|h|r", -- [13]
							"|cffffffff|Hitem:2512::::::::26:::::::::|h[劣质箭]|h|r", -- [14]
							"|cffffffff|Hitem:1205::::::::26:::::::::|h[果汁]|h|r", -- [15]
							"|cffffffff|Hitem:1083::::::::26:::::::::|h[阿祖拉的铭文饰品]|h|r", -- [16]
							"|cffffffff|Hitem:1322::::::::26:::::::::|h[鱼肝油]|h|r", -- [17]
							"|cffffffff|Hitem:118::::::::26:::::::::|h[初级治疗药水]|h|r", -- [18]
							nil, -- [19]
							"|cffffffff|Hitem:1114::::::::26:::::::::|h[魔法黑面包]|h|r", -- [20]
						},
						["freeslots"] = 1,
						["cooldowns"] = {
							[2] = "1637773034.021|3600|1",
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							20, -- [3]
							3, -- [4]
							5, -- [5]
							7, -- [6]
							[10] = 16,
							[11] = 4,
							[13] = 11,
							[14] = 86,
							[18] = 5,
							[17] = 5,
							[20] = 12,
						},
						["size"] = 20,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							[7] = 5194,
						},
						["links"] = {
							[7] = "|cff0070dd|Hitem:5194::::::::26:::::::::|h[工头战斧]|h|r",
						},
						["icon"] = 133628,
						["size"] = 10,
						["link"] = "|cffffffff|Hitem:4245::::::::26:::::::::|h[丝绸小包]|h|r",
						["freeslots"] = 9,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
