
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1639851838,
				["averageItemLvl"] = 52.35294117647059,
				["Inventory"] = {
					"|cff0070dd|Hitem:20521::::::::59:::::::::|h[怒火面甲]|h|r", -- [1]
					"|cff1eff00|Hitem:17772::::::::59:::::::::|h[热情暗影残片坠饰]|h|r", -- [2]
					"|cff1eff00|Hitem:12082::::::::59:::::::::|h[龙皮肩铠]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::59:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff0070dd|Hitem:11678::::::::59:::::::::|h[阿努希尔之壳]|h|r", -- [5]
					"|cff1eff00|Hitem:10243::::::1208:1787980928:59:::::::::|h[野熊之重型板层束带]|h|r", -- [6]
					"|cff0070dd|Hitem:15062:1506:::::::59:::::::::|h[魔暴龙皮护腿]|h|r", -- [7]
					"|cff1eff00|Hitem:9637::::::::59:::::::::|h[断骨长靴]|h|r", -- [8]
					"|cff1eff00|Hitem:10239::::::193:1698566400:59:::::::::|h[力量之重型板层臂铠]|h|r", -- [9]
					"|cff0070dd|Hitem:15063:927:::::::59:::::::::|h[魔暴龙皮手套]|h|r", -- [10]
					"|cff0070dd|Hitem:12548::::::::59:::::::::|h[麦格尼的意志]|h|r", -- [11]
					"|cff0070dd|Hitem:9533::::::::59:::::::::|h[石工兄弟会之戒]|h|r", -- [12]
					"|cff1eff00|Hitem:17774::::::::59:::::::::|h[天选者印记]|h|r", -- [13]
					"|cff1eff00|Hitem:1490::::::::59:::::::::|h[守护之符]|h|r", -- [14]
					"|cff0070dd|Hitem:11930::::::::59:::::::::|h[皇帝的新斗篷]|h|r", -- [15]
					"|cff0070dd|Hitem:11817::::::::59:::::::::|h[安格弗的剑]|h|r", -- [16]
					"|cff0070dd|Hitem:17705::::::::59:::::::::|h[痛击之刃]|h|r", -- [17]
					"|cff1eff00|Hitem:3430::::::132:1813535872:59:::::::::|h[敏捷之狙击步枪]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.污手党"] = {
				["Members"] = {
					["特变电工"] = {
						["averageItemLvl"] = 52,
					},
				},
			},
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 41,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
