
DataStore_MailsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1637992071,
				["Mails"] = {
					{
						["returned"] = false,
						["sender"] = "联盟拍卖行",
						["itemID"] = 4496,
						["link"] = "|cffffffff|Hitem:4496::::::::30:::::::::|h[棕色小包]|h|r",
						["lastCheck"] = 1637992071,
						["count"] = 1,
						["icon"] = 133634,
						["daysLeft"] = 25.81234931945801,
					}, -- [1]
					{
						["returned"] = false,
						["sender"] = "联盟拍卖行",
						["itemID"] = 4496,
						["link"] = "|cffffffff|Hitem:4496::::::::30:::::::::|h[棕色小包]|h|r",
						["lastCheck"] = 1637992071,
						["count"] = 1,
						["icon"] = 133634,
						["daysLeft"] = 25.81234931945801,
					}, -- [2]
					{
						["returned"] = false,
						["sender"] = "联盟拍卖行",
						["itemID"] = 15225,
						["link"] = "|cff1eff00|Hitem:15225::::::1551:545490688:30:::::::::|h[能量之杉木锤]|h|r",
						["lastCheck"] = 1637992071,
						["count"] = 1,
						["icon"] = 133045,
						["daysLeft"] = 29.99929428100586,
					}, -- [3]
					{
						["lastCheck"] = 1637992071,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-11-24 23时,在游戏中对玩家 鱼人摩洛克-修*帅的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 362.5500793457031,
					}, -- [4]
				},
				["lastVisitDate"] = "2021/11/27 13:47",
			},
		},
	},
}
