
DataStore_AgendaDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1641405159,
				["DungeonIDs"] = {
					["奥妮克希亚的巢穴 40人|9539999"] = "277640|1641405159|0|1",
					["熔火之心 40人|9215704"] = "18440|1641405159|0|1",
				},
				["BossKills"] = {
					["奥妮克希亚的巢穴 40人|9539999"] = {
						"奥妮克希亚|1", -- [1]
					},
					["熔火之心 40人|9215704"] = {
						"鲁西弗隆|1", -- [1]
						"玛格曼达|1", -- [2]
						"基赫纳斯|1", -- [3]
						"加尔|1", -- [4]
						"沙斯拉尔|1", -- [5]
						"迦顿男爵|1", -- [6]
						"萨弗隆先驱者|1", -- [7]
						"焚化者古雷曼格|1", -- [8]
						"管理者埃克索图斯|1", -- [9]
						"拉格纳罗斯|0", -- [10]
					},
				},
			},
		},
	},
}
