
DataStore_AgendaDB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1646553810,
				["DungeonIDs"] = {
					["熔火之心 40人|15065367"] = "312991|1646553810|0|1",
					["祖尔格拉布 20人|15075288"] = "140191|1646553810|0|1",
					["黑翼之巢 40人|15132181"] = "312991|1646553810|0|1",
				},
				["BossKills"] = {
					["熔火之心 40人|15065367"] = {
						"鲁西弗隆|1", -- [1]
						"玛格曼达|1", -- [2]
						"基赫纳斯|1", -- [3]
						"加尔|1", -- [4]
						"沙斯拉尔|1", -- [5]
						"迦顿男爵|1", -- [6]
						"萨弗隆先驱者|1", -- [7]
						"焚化者古雷曼格|1", -- [8]
						"管理者埃克索图斯|1", -- [9]
						"拉格纳罗斯|1", -- [10]
					},
					["祖尔格拉布 20人|15075288"] = {
						"高阶祭司耶克里克|1", -- [1]
						"高阶祭司温诺希斯|1", -- [2]
						"高阶祭司玛尔里|1", -- [3]
						"血领主曼多基尔|1", -- [4]
						"疯狂之缘|0", -- [5]
						"高阶祭司塞卡尔|1", -- [6]
						"加兹兰卡|0", -- [7]
						"高阶祭司娅尔罗|1", -- [8]
						"妖术师金度|1", -- [9]
						"哈卡|1", -- [10]
					},
					["黑翼之巢 40人|15132181"] = {
						"狂野的拉佐格尔|1", -- [1]
						"堕落的瓦拉斯塔兹|1", -- [2]
						"勒什雷尔|1", -- [3]
						"费尔默|1", -- [4]
						"埃博诺克|1", -- [5]
						"弗莱格尔|1", -- [6]
						"克洛玛古斯|1", -- [7]
						"奈法利安|1", -- [8]
					},
				},
			},
			["Default.鱼人摩洛克.顶级程序员"] = {
				["lastUpdate"] = 1644135021,
			},
			["Default.鱼人摩洛克.Javascript"] = {
				["lastUpdate"] = 1645858909,
			},
		},
	},
}
