
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1637864757,
				["numFreeBagSlots"] = 32,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							3617, -- [2]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:3617::::::::29:::::::::|h[暗影坠饰]|h|r", -- [2]
						},
						["link"] = "|cffffffff|Hitem:4245::::::::29:::::::::|h[丝绸小包]|h|r",
						["freeslots"] = 9,
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag100"] = {
						["freeslots"] = 23,
						["ids"] = {
							3655, -- [1]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::29:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:929::::::::29:::::::::|h[治疗药水]|h|r", -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:4606::::::::29:::::::::|h[多孔蘑菇]|h|r", -- [3]
							"|cffffffff|Hitem:2592::::::::29:::::::::|h[毛料]|h|r", -- [4]
							"|cffffffff|Hitem:7442::::::::29:::::::::|h[基尔卡克的钥匙]|h|r", -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:3385::::::::29:::::::::|h[次级法力药水]|h|r", -- [7]
							[9] = "|cffffffff|Hitem:5996::::::::29:::::::::|h[水下呼吸药剂]|h|r",
						},
						["freeslots"] = 4,
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							10, -- [3]
							20, -- [4]
							[7] = 2,
							[9] = 2,
						},
						["ids"] = {
							929, -- [1]
							nil, -- [2]
							4606, -- [3]
							2592, -- [4]
							7442, -- [5]
							nil, -- [6]
							3385, -- [7]
							[9] = 5996,
						},
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							2944, -- [2]
							[7] = 929,
							[8] = 4306,
							[9] = 1206,
						},
						["links"] = {
							nil, -- [1]
							"|cff1eff00|Hitem:2944::::::::29:::::::::|h[被诅咒的帕雷斯之眼]|h|r", -- [2]
							[7] = "|cffffffff|Hitem:929::::::::29:::::::::|h[治疗药水]|h|r",
							[8] = "|cffffffff|Hitem:4306::::::::29:::::::::|h[丝绸]|h|r",
							[9] = "|cff1eff00|Hitem:1206::::::::29:::::::::|h[绿玛瑙]|h|r",
						},
						["freeslots"] = 6,
						["link"] = "|cffffffff|Hitem:4245::::::::29:::::::::|h[丝绸小包]|h|r",
						["icon"] = 133628,
						["size"] = 10,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:4245::::::::29:::::::::|h[丝绸小包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:3770::::::::29:::::::::|h[羊排]|h|r", -- [1]
						},
						["icon"] = 133628,
						["freeslots"] = 9,
						["ids"] = {
							3770, -- [1]
						},
						["counts"] = {
							4, -- [1]
						},
						["size"] = 10,
					},
					["Bag0"] = {
						["ids"] = {
							2161, -- [1]
							6948, -- [2]
							3531, -- [3]
							nil, -- [4]
							4306, -- [5]
							4605, -- [6]
							2665, -- [7]
							2563, -- [8]
							nil, -- [9]
							3531, -- [10]
							1082, -- [11]
							6842, -- [12]
							2592, -- [13]
							2512, -- [14]
							[16] = 6572,
							[17] = 1322,
							[18] = 118,
							[19] = 3030,
						},
						["links"] = {
							"|cffffffff|Hitem:2161::::::::29:::::::::|h[斯温农场中的书]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::29:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:3531::::::::29:::::::::|h[厚绒线绷带]|h|r", -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:4306::::::::29:::::::::|h[丝绸]|h|r", -- [5]
							"|cffffffff|Hitem:4605::::::::29:::::::::|h[红斑蘑菇]|h|r", -- [6]
							"|cffffffff|Hitem:2665::::::::29:::::::::|h[暴风城特产调料]|h|r", -- [7]
							"|cffffffff|Hitem:2563::::::::29:::::::::|h[怪味粉末]|h|r", -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:3531::::::::29:::::::::|h[厚绒线绷带]|h|r", -- [10]
							"|cffffffff|Hitem:1082::::::::29:::::::::|h[赤脊山炖肉]|h|r", -- [11]
							"|cffffffff|Hitem:6842::::::::29:::::::::|h[弗伦的材料清单]|h|r", -- [12]
							"|cffffffff|Hitem:2592::::::::29:::::::::|h[毛料]|h|r", -- [13]
							"|cffffffff|Hitem:2512::::::::29:::::::::|h[劣质箭]|h|r", -- [14]
							[16] = "|cff1eff00|Hitem:6572::::::588:2016107648:29:::::::::|h[灵猴之防御者之盾]|h|r",
							[17] = "|cffffffff|Hitem:1322::::::::29:::::::::|h[鱼肝油]|h|r",
							[18] = "|cffffffff|Hitem:118::::::::29:::::::::|h[初级治疗药水]|h|r",
							[19] = "|cffffffff|Hitem:3030::::::::29:::::::::|h[锐锋箭]|h|r",
						},
						["freeslots"] = 4,
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							10, -- [3]
							nil, -- [4]
							20, -- [5]
							7, -- [6]
							[13] = 3,
							[14] = 40,
							[17] = 5,
							[18] = 4,
							[10] = 20,
							[11] = 3,
							[19] = 200,
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
				},
				["numBagSlots"] = 60,
			},
		},
		["Version"] = 1,
	},
}
