
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1638985255,
				["numFreeBagSlots"] = 24,
				["numBagSlots"] = 76,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							2799, -- [2]
							3030, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							3248, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							4338, -- [11]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:2799::::::::49:::::::::|h[猩猩牙]|h|r", -- [2]
							"|cffffffff|Hitem:3030::::::::49:::::::::|h[锐锋箭]|h|r", -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:3248::::::::49:::::::::|h[翻译好的藏尸者信件]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:4338::::::::49:::::::::|h[魔纹布]|h|r", -- [11]
						},
						["counts"] = {
							nil, -- [1]
							6, -- [2]
							118, -- [3]
							[11] = 6,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::49:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 10,
					},
					["Bag100"] = {
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["ids"] = {
							3655, -- [1]
						},
						["size"] = 24,
						["freeslots"] = 23,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							13446, -- [1]
							10443, -- [2]
							4589, -- [3]
							4623, -- [4]
							9240, -- [5]
							3676, -- [6]
							20763, -- [7]
							10561, -- [8]
							3989, -- [9]
							4306, -- [10]
							8564, -- [11]
							1645, -- [12]
							nil, -- [13]
							3900, -- [14]
						},
						["links"] = {
							"|cffffffff|Hitem:13446::::::::49:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:10443::::::::49:::::::::|h[烧焦的信件]|h|r", -- [2]
							"|cffffffff|Hitem:4589::::::::49:::::::::|h[细长的狮鹫羽毛]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::49:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cff1eff00|Hitem:9240::::::::49:::::::::|h[祖尔法拉克之槌]|h|r", -- [5]
							"|cff9d9d9d|Hitem:3676::::::::49:::::::::|h[粘糊糊的液体]|h|r", -- [6]
							"|cff9d9d9d|Hitem:20763::::::::49:::::::::|h[破损的武器]|h|r", -- [7]
							"|cffffffff|Hitem:10561::::::::49:::::::::|h[秘银外壳]|h|r", -- [8]
							"|cff9d9d9d|Hitem:3989::::::::49:::::::::|h[格挡轻盾]|h|r", -- [9]
							"|cffffffff|Hitem:4306::::::::49:::::::::|h[丝绸]|h|r", -- [10]
							"|cffffffff|Hitem:8564::::::::49:::::::::|h[角鹰兽的蛋]|h|r", -- [11]
							"|cffffffff|Hitem:1645::::::::49:::::::::|h[草莓汁]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:3900::::::::49:::::::::|h[紫葡萄酒]|h|r", -- [14]
						},
						["counts"] = {
							4, -- [1]
							[6] = 2,
							[7] = 3,
							[10] = 7,
							[12] = 2,
							[4] = 2,
							[14] = 12,
						},
						["freeslots"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::49:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::49:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cff1eff00|Hitem:6828::::::::49:::::::::|h[幻像圆盾]|h|r", -- [1]
							"|cffffffff|Hitem:11324::::::::49:::::::::|h[探险者的背包]|h|r", -- [2]
							"|cffffffff|Hitem:9260::::::::49:::::::::|h[烈性朗姆酒]|h|r", -- [3]
							"|cff9d9d9d|Hitem:4584::::::::49:::::::::|h[大爪子]|h|r", -- [4]
							"|cffffffff|Hitem:3928::::::::49:::::::::|h[超强治疗药水]|h|r", -- [5]
							"|cff1eff00|Hitem:4636::::::::49:::::::::|h[精铁宝箱]|h|r", -- [6]
							nil, -- [7]
							nil, -- [8]
							"|cffffffff|Hitem:7668::::::::49:::::::::|h[染血的日记]|h|r", -- [9]
							"|cff1eff00|Hitem:8623::::::::49:::::::::|h[OOX-17/TN定位器]|h|r", -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:4649::::::::49:::::::::|h[葛利·硬骨的便笺]|h|r", -- [12]
							"|cffffffff|Hitem:3385::::::::49:::::::::|h[次级法力药水]|h|r", -- [13]
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							6828, -- [1]
							11324, -- [2]
							9260, -- [3]
							4584, -- [4]
							3928, -- [5]
							4636, -- [6]
							nil, -- [7]
							nil, -- [8]
							7668, -- [9]
							8623, -- [10]
							nil, -- [11]
							4649, -- [12]
							3385, -- [13]
						},
						["counts"] = {
							[13] = 3,
						},
						["freeslots"] = 4,
					},
					["Bag0"] = {
						["ids"] = {
							3825, -- [1]
							6948, -- [2]
							13446, -- [3]
							12208, -- [4]
							5655, -- [5]
							8545, -- [6]
							9263, -- [7]
							18294, -- [8]
							4583, -- [9]
							nil, -- [10]
							7971, -- [11]
							5866, -- [12]
							12359, -- [13]
							9468, -- [14]
							13446, -- [15]
							3898, -- [16]
							1520, -- [17]
							8545, -- [18]
							3671, -- [19]
							4602, -- [20]
						},
						["links"] = {
							"|cffffffff|Hitem:3825::::::::49:::::::::|h[坚韧药剂]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::49:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:13446::::::::49:::::::::|h[特效治疗药水]|h|r", -- [3]
							"|cffffffff|Hitem:12208::::::::49:::::::::|h[嫩狼肉]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::49:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:8545::::::::49:::::::::|h[厚魔纹绷带]|h|r", -- [6]
							"|cffffffff|Hitem:9263::::::::49:::::::::|h[特洛亚斯的法杖]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::49:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							"|cff9d9d9d|Hitem:4583::::::::49:::::::::|h[厚毛狼皮]|h|r", -- [9]
							nil, -- [10]
							"|cff1eff00|Hitem:7971::::::::49:::::::::|h[黑珍珠]|h|r", -- [11]
							"|cffffffff|Hitem:5866::::::::49:::::::::|h[精铁矿石样本]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::49:::::::::|h[瑟银锭]|h|r", -- [13]
							"|cffffffff|Hitem:9468::::::::49:::::::::|h[沙普比克的羽毛]|h|r", -- [14]
							"|cffffffff|Hitem:13446::::::::49:::::::::|h[特效治疗药水]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::49:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cff9d9d9d|Hitem:1520::::::::49:::::::::|h[巨魔的汗水]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::49:::::::::|h[厚魔纹绷带]|h|r", -- [18]
							"|cff9d9d9d|Hitem:3671::::::::49:::::::::|h[死者的颅骨]|h|r", -- [19]
							"|cffffffff|Hitem:4602::::::::49:::::::::|h[饱满的南瓜]|h|r", -- [20]
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["cooldowns"] = {
							[2] = "1638983771.066|3600|1",
						},
						["size"] = 20,
						["counts"] = {
							2, -- [1]
							[13] = 2,
							[4] = 2,
							[8] = 3,
							[17] = 2,
							[18] = 20,
							[20] = 9,
							[3] = 4,
							[6] = 11,
							[15] = 5,
							[19] = 3,
						},
						["freeslots"] = 1,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::49:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:1710::::::::49:::::::::|h[强效治疗药水]|h|r", -- [4]
							nil, -- [5]
							"|cff1eff00|Hitem:9419::::::::49:::::::::|h[加加恩的火锤]|h|r", -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:11725::::::::49:::::::::|h[水晶蜘蛛腿]|h|r", -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:4582::::::::49:::::::::|h[柔软的狼尾]|h|r", -- [12]
							"|cff1eff00|Hitem:4987::::::::49:::::::::|h[矮人队长之剑]|h|r", -- [13]
							"|cffffffff|Hitem:7442::::::::49:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 8,
						["ids"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							1710, -- [4]
							nil, -- [5]
							9419, -- [6]
							nil, -- [7]
							11725, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							4582, -- [12]
							4987, -- [13]
							7442, -- [14]
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							2, -- [8]
							[12] = 3,
						},
						["size"] = 14,
					},
					["Bag-2"] = {
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 32,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
