
DataStore_MailsDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1638897538,
				["Mails"] = {
					{
						["lastCheck"] = 1638897538,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-11-24 23时,在游戏中对玩家 鱼人摩洛克-修*帅的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 352.0701293945313,
					}, -- [1]
					{
						["lastCheck"] = 1638897538,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-11-28 14时,在游戏中对玩家 鱼人摩洛克-小*蛋的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 355.5568542480469,
					}, -- [2]
					{
						["lastCheck"] = 1638897538,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-11-28 14时,在游戏中对玩家 鱼人摩洛克-职**怪的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 355.5705871582031,
					}, -- [3]
					{
						["lastCheck"] = 1638897538,
						["sender"] = "客服支持",
						["subject"] = "举报处理通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n我们已经收到了您于 2021-12-02 00时,在游戏中对玩家 鱼人摩洛克-找*儿的举报，我们将持续对该角色进行监控，后续可登录暴雪游戏安全中心-个人中心我的举报查看举报详情。 \n感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 358.9878234863281,
					}, -- [4]
					{
						["lastCheck"] = 1638897538,
						["sender"] = "客服支持",
						["subject"] = "举报结果通知",
						["returned"] = true,
						["money"] = 0,
						["text"] = "尊敬的艾泽拉斯勇士： \n您好! \n您于 2021-11-28 14时,在游戏中举报的玩家鱼人摩洛克-职**怪 已被证实存在违规行为而受到临时冻结处罚 。 感谢您为维护《魔兽世界》游戏环境做出的贡献！ \n本邮箱只作为发出邮件使用，请不要回复本邮件。 \n此致 \n网 易 暴 雪 游 戏 客 服 团队",
						["icon"] = 135724,
						["daysLeft"] = 359.4118347167969,
					}, -- [5]
				},
				["lastVisitDate"] = "2021/12/08 01:18",
			},
		},
	},
}
