
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1638122498,
				["averageItemLvl"] = 29.4,
				["Inventory"] = {
					"|cff1eff00|Hitem:1282::::::::37:::::::::|h[火花铁帽]|h|r", -- [1]
					"|cff1eff00|Hitem:12028::::::1188:2053675904:37:::::::::|h[野熊之黑陶项链]|h|r", -- [2]
					"|cff1eff00|Hitem:4123::::::::37:::::::::|h[寒铁肩铠]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::37:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff1eff00|Hitem:7454::::::609:219077632:37:::::::::|h[灵猴之骑士胸甲]|h|r", -- [5]
					"|cff1eff00|Hitem:7107::::::::37:::::::::|h[群星腰带]|h|r", -- [6]
					"|cff0070dd|Hitem:6087:16:::::::37:::::::::|h[西部荒野马裤]|h|r", -- [7]
					"|cff1eff00|Hitem:2910::::::::37:::::::::|h[金色民兵靴]|h|r", -- [8]
					"|cff1eff00|Hitem:6550::::::1179:1917742208:37:::::::::|h[野熊之士兵腕甲]|h|r", -- [9]
					"|cff1eff00|Hitem:4107::::::::37:::::::::|h[猎虎手套]|h|r", -- [10]
					"|cff0070dd|Hitem:2933::::::::37:::::::::|h[乌瑞恩的图章]|h|r", -- [11]
					"|cff1eff00|Hitem:6757::::::::37:::::::::|h[吉安娜的徽记之戒]|h|r", -- [12]
					nil, -- [13]
					nil, -- [14]
					"|cff0070dd|Hitem:5193::::::::37:::::::::|h[兄弟会斗篷]|h|r", -- [15]
					"|cff1eff00|Hitem:15225::::::1551:545490688:37:::::::::|h[能量之杉木锤]|h|r", -- [16]
					"|cff1eff00|Hitem:15231::::::1100:691838720:37:::::::::|h[野猪之狂战士飞斧]|h|r", -- [17]
					"|cffffffff|Hitem:15807::::::::37:::::::::|h[轻弩]|h|r", -- [18]
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["当我入夢丶"] = {
						["averageItemLvl"] = 23,
					},
					["特变电工"] = {
						["averageItemLvl"] = 28,
					},
					["奶不住快跑啊"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
