
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["Inventory"] = {
					[7] = "|cff0070dd|Hitem:6087:16:::::::29:::::::::|h[西部荒野马裤]|h|r",
					[11] = "|cff1eff00|Hitem:1449::::::::29:::::::::|h[弱效导魔戒指]|h|r",
					[9] = "|cff1eff00|Hitem:6550::::::1179:1917742208:29:::::::::|h[野熊之士兵腕甲]|h|r",
					[4] = "|cffffffff|Hitem:2575::::::::29:::::::::|h[红色亚麻衬衣]|h|r",
					[8] = "|cff1eff00|Hitem:2910::::::::29:::::::::|h[金色民兵靴]|h|r",
					[16] = "|cff1eff00|Hitem:15230::::::504:398234496:29:::::::::|h[孤狼之劈山斧]|h|r",
					[17] = "|cff1eff00|Hitem:5196::::::::29:::::::::|h[重拳先生的战斧]|h|r",
					[5] = "|cff1eff00|Hitem:6545::::::1185:1179030656:29:::::::::|h[野熊之士兵护甲]|h|r",
					[10] = "|cff1eff00|Hitem:7606::::::::29:::::::::|h[极地护手]|h|r",
					[18] = "|cffffffff|Hitem:15807::::::::29:::::::::|h[轻弩]|h|r",
					[3] = "|cff1eff00|Hitem:9807::::::764:1759777920:29:::::::::|h[夜枭之超强护肩]|h|r",
					[6] = "|cff1eff00|Hitem:15404::::::::29:::::::::|h[破浪束带]|h|r",
					[12] = "|cff1eff00|Hitem:12007::::::591:696674816:29:::::::::|h[灵猴之牧场戒指]|h|r",
					[15] = "|cff0070dd|Hitem:5193::::::::29:::::::::|h[兄弟会斗篷]|h|r",
				},
				["averageItemLvl"] = 21.38461538461538,
				["lastUpdate"] = 1637948165,
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["雪凉"] = {
						["averageItemLvl"] = 19,
					},
				},
			},
		},
	},
}
