
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 23,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1639247396,
				["numFreeBagSlots"] = 25,
				["Containers"] = {
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::53:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:17760::::::::53:::::::::|h[生命之种]|h|r", -- [2]
							"|cffffffff|Hitem:3030::::::::53:::::::::|h[锐锋箭]|h|r", -- [3]
							"|cffffffff|Hitem:7075::::::::53:::::::::|h[大地之核]|h|r", -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:10444::::::::53:::::::::|h[标准型闪光信号枪]|h|r", -- [6]
							"|cffffffff|Hitem:10575::::::::53:::::::::|h[黑龙皮]|h|r", -- [7]
							"|cff1eff00|Hitem:6828::::::::53:::::::::|h[幻像圆盾]|h|r", -- [8]
							"|cffffffff|Hitem:3827::::::::53:::::::::|h[法力药水]|h|r", -- [9]
							"|cff0070dd|Hitem:17705::::::::53:::::::::|h[痛击之刃]|h|r", -- [10]
						},
						["icon"] = 133652,
						["freeslots"] = 6,
						["ids"] = {
							nil, -- [1]
							17760, -- [2]
							3030, -- [3]
							7075, -- [4]
							nil, -- [5]
							10444, -- [6]
							10575, -- [7]
							6828, -- [8]
							3827, -- [9]
							17705, -- [10]
						},
						["counts"] = {
							[3] = 108,
							[4] = 3,
							[9] = 2,
						},
						["size"] = 14,
					},
					["Bag100"] = {
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::21:::::::::|h[抛光盾牌]|h|r", -- [1]
						},
						["ids"] = {
							3655, -- [1]
						},
						["size"] = 24,
						["freeslots"] = 23,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::53:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:13446::::::::53:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:4338::::::::53:::::::::|h[魔纹布]|h|r", -- [2]
							[4] = "|cffffffff|Hitem:4623::::::::53:::::::::|h[次级石盾药水]|h|r",
							[5] = "|cff1eff00|Hitem:9240::::::::53:::::::::|h[祖尔法拉克之槌]|h|r",
							[8] = "|cffffffff|Hitem:10561::::::::53:::::::::|h[秘银外壳]|h|r",
							[10] = "|cffffffff|Hitem:8150::::::::53:::::::::|h[石中盐]|h|r",
							[13] = "|cffffffff|Hitem:11474::::::::53:::::::::|h[精龙的蛋]|h|r",
						},
						["freeslots"] = 7,
						["icon"] = 133652,
						["ids"] = {
							13446, -- [1]
							4338, -- [2]
							[4] = 4623,
							[5] = 9240,
							[8] = 10561,
							[10] = 8150,
							[13] = 11474,
						},
						["counts"] = {
							[2] = 20,
							[4] = 2,
							[10] = 7,
						},
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::53:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cff1eff00|Hitem:7909::::::::53:::::::::|h[青绿石]|h|r", -- [2]
							"|cffffffff|Hitem:9260::::::::53:::::::::|h[烈性朗姆酒]|h|r", -- [3]
							"|cff0070dd|Hitem:11086::::::::53:::::::::|h[保护者迦萨斯]|h|r", -- [4]
							"|cffffffff|Hitem:7912::::::::53:::::::::|h[坚固的石头]|h|r", -- [5]
							nil, -- [6]
							"|cff1eff00|Hitem:15216::::::682:1946349312:53:::::::::|h[猛虎之符文剑]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							"|cff0070dd|Hitem:17191::::::::53:::::::::|h[塞雷布拉斯节杖]|h|r", -- [10]
							"|cff1eff00|Hitem:3430::::::132:1813535872:53:::::::::|h[敏捷之狙击步枪]|h|r", -- [11]
						},
						["counts"] = {
							[5] = 5,
						},
						["freeslots"] = 7,
						["ids"] = {
							nil, -- [1]
							7909, -- [2]
							9260, -- [3]
							11086, -- [4]
							7912, -- [5]
							nil, -- [6]
							15216, -- [7]
							nil, -- [8]
							nil, -- [9]
							17191, -- [10]
							3430, -- [11]
						},
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							10445, -- [2]
							3818, -- [3]
							nil, -- [4]
							17746, -- [5]
							4338, -- [6]
							4419, -- [7]
							4607, -- [8]
							3928, -- [9]
							4608, -- [10]
							18944, -- [11]
							4625, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:10445::::::::53:::::::::|h[绘图工具包]|h|r", -- [2]
							"|cffffffff|Hitem:3818::::::::53:::::::::|h[枯叶草]|h|r", -- [3]
							nil, -- [4]
							"|cff0070dd|Hitem:17746::::::::53:::::::::|h[诺克赛恩的镣铐]|h|r", -- [5]
							"|cffffffff|Hitem:4338::::::::53:::::::::|h[魔纹布]|h|r", -- [6]
							"|cffffffff|Hitem:4419::::::::53:::::::::|h[智力卷轴 III]|h|r", -- [7]
							"|cffffffff|Hitem:4607::::::::53:::::::::|h[美味的洞穴菇]|h|r", -- [8]
							"|cffffffff|Hitem:3928::::::::53:::::::::|h[超强治疗药水]|h|r", -- [9]
							"|cffffffff|Hitem:4608::::::::53:::::::::|h[新鲜的黑蘑菇]|h|r", -- [10]
							"|cffffffff|Hitem:18944::::::::53:::::::::|h[熏火龙的鳞片]|h|r", -- [11]
							"|cffffffff|Hitem:4625::::::::53:::::::::|h[火焰花]|h|r", -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::53:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["counts"] = {
							[6] = 13,
							[7] = 2,
							[9] = 2,
							[11] = 18,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::53:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 3,
					},
					["Bag0"] = {
						["ids"] = {
							6287, -- [1]
							6948, -- [2]
							19141, -- [3]
							17048, -- [4]
							5655, -- [5]
							12028, -- [6]
							8948, -- [7]
							18294, -- [8]
							4306, -- [9]
							17781, -- [10]
							7971, -- [11]
							8529, -- [12]
							12359, -- [13]
							10465, -- [14]
							2820, -- [15]
							3898, -- [16]
							14047, -- [17]
							8545, -- [18]
						},
						["links"] = {
							"|cffffffff|Hitem:6287::::::::53:::::::::|h[阿塔莱石板碎片]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::53:::::::::|h[炉石]|h|r", -- [2]
							"|cff1eff00|Hitem:19141::::::::53:::::::::|h[丝瓜]|h|r", -- [3]
							"|cffffffff|Hitem:17048::::::::53:::::::::|h[奇特的朗姆酒]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::53:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cff1eff00|Hitem:12028::::::1188:2053675904:53:::::::::|h[野熊之黑陶项链]|h|r", -- [6]
							"|cffffffff|Hitem:8948::::::::53:::::::::|h[晒干的牛肝菌]|h|r", -- [7]
							"|cffffffff|Hitem:18294::::::::53:::::::::|h[强力水下呼吸药剂]|h|r", -- [8]
							"|cffffffff|Hitem:4306::::::::53:::::::::|h[丝绸]|h|r", -- [9]
							"|cffffffff|Hitem:17781::::::::53:::::::::|h[贱民的指引]|h|r", -- [10]
							"|cff1eff00|Hitem:7971::::::::53:::::::::|h[黑珍珠]|h|r", -- [11]
							"|cffffffff|Hitem:8529::::::::53:::::::::|h[诺格弗格药剂]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::53:::::::::|h[瑟银锭]|h|r", -- [13]
							"|cffffffff|Hitem:10465::::::::53:::::::::|h[哈卡之卵]|h|r", -- [14]
							"|cff1eff00|Hitem:2820::::::::53:::::::::|h[灵巧秒表]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::53:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:14047::::::::53:::::::::|h[符文布]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::53:::::::::|h[厚魔纹绷带]|h|r", -- [18]
						},
						["freeslots"] = 2,
						["counts"] = {
							[13] = 14,
							[17] = 12,
							[8] = 3,
							[18] = 11,
							[12] = 5,
							[4] = 5,
							[9] = 8,
							[7] = 20,
						},
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
				},
				["numBagSlots"] = 76,
			},
		},
		["Version"] = 1,
	},
}
