
DataStore_InventoryDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["lastUpdate"] = 1637601969,
				["averageItemLvl"] = 17.77777777777778,
				["Inventory"] = {
					[7] = "|cff0070dd|Hitem:6087::::::::21:::::::::|h[西部荒野马裤]|h|r",
					[15] = "|cff0070dd|Hitem:5193::::::::21:::::::::|h[兄弟会斗篷]|h|r",
					[8] = "|cff1eff00|Hitem:2037::::::::21:::::::::|h[掘地工之靴]|h|r",
					[16] = "|cff0070dd|Hitem:5194::::::::21:::::::::|h[工头战斧]|h|r",
					[9] = "|cff1eff00|Hitem:6550::::::1179:1917742208:21:::::::::|h[野熊之士兵腕甲]|h|r",
					[5] = "|cff1eff00|Hitem:15479::::::1094:1986009728:21:::::::::|h[野猪之冲锋者护甲]|h|r",
					[10] = "|cff1eff00|Hitem:7606::::::::21:::::::::|h[极地护手]|h|r",
					[6] = "|cffffffff|Hitem:1154::::::::21:::::::::|h[人民军腰带]|h|r",
					[4] = "|cffffffff|Hitem:2575::::::::21:::::::::|h[红色亚麻衬衣]|h|r",
					[18] = "|cffffffff|Hitem:15807::::::::21:::::::::|h[轻弩]|h|r",
				},
			},
		},
		["Guilds"] = {
			["Default.鱼人摩洛克.limit"] = {
				["Members"] = {
					["特变电工"] = {
						["averageItemLvl"] = 17,
					},
				},
			},
		},
	},
}
