
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 51,
				["numBankSlots"] = 66,
				["lastUpdate"] = 1639666929,
				["numFreeBagSlots"] = 23,
				["Containers"] = {
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							7068, -- [1]
							11754, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							3928, -- [9]
							13443, -- [10]
							18944, -- [11]
							nil, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["links"] = {
							"|cffffffff|Hitem:7068::::::::57:::::::::|h[元素火焰]|h|r", -- [1]
							"|cff1eff00|Hitem:11754::::::::57:::::::::|h[黑钻石]|h|r", -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							"|cffffffff|Hitem:3928::::::::57:::::::::|h[超强治疗药水]|h|r", -- [9]
							"|cffffffff|Hitem:13443::::::::57:::::::::|h[超强法力药水]|h|r", -- [10]
							"|cffffffff|Hitem:18944::::::::57:::::::::|h[熏火龙的鳞片]|h|r", -- [11]
							nil, -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::57:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["counts"] = {
							2, -- [1]
							[11] = 18,
							[10] = 2,
							[9] = 4,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::57:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 8,
					},
					["Bag100"] = {
						["size"] = 24,
						["ids"] = {
							3655, -- [1]
							9418, -- [2]
							10455, -- [3]
							17746, -- [4]
							nil, -- [5]
							9958, -- [6]
							19141, -- [7]
							2820, -- [8]
							9240, -- [9]
							17191, -- [10]
							10740, -- [11]
						},
						["freeslots"] = 14,
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::57:::::::::|h[抛光盾牌]|h|r", -- [1]
							"|cff0070dd|Hitem:9418::::::::57:::::::::|h[斩石者]|h|r", -- [2]
							"|cff1eff00|Hitem:10455::::::::57:::::::::|h[被禁锢的伊兰尼库斯精华]|h|r", -- [3]
							"|cff0070dd|Hitem:17746::::::::57:::::::::|h[诺克赛恩的镣铐]|h|r", -- [4]
							nil, -- [5]
							"|cff1eff00|Hitem:9958::::::1200:687029632:57:::::::::|h[野熊之好战者的圆盾]|h|r", -- [6]
							"|cff1eff00|Hitem:19141::::::::57:::::::::|h[丝瓜]|h|r", -- [7]
							"|cff1eff00|Hitem:2820::::::::57:::::::::|h[灵巧秒表]|h|r", -- [8]
							"|cff1eff00|Hitem:9240::::::::57:::::::::|h[祖尔法拉克之槌]|h|r", -- [9]
							"|cff0070dd|Hitem:17191::::::::57:::::::::|h[塞雷布拉斯节杖]|h|r", -- [10]
							"|cff1eff00|Hitem:10740::::::::57:::::::::|h[百夫长腿甲]|h|r", -- [11]
						},
					},
					["Bag5"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::57:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::57:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cff0070dd|Hitem:10749::::::::57:::::::::|h[灰岩头盔]|h|r", -- [1]
							nil, -- [2]
							nil, -- [3]
							"|cffffffff|Hitem:11078::::::::57:::::::::|h[遗物宝箱钥匙]|h|r", -- [4]
							"|cff1eff00|Hitem:11910::::::::57:::::::::|h[珠宝缀饰腿甲]|h|r", -- [5]
							"|cff1eff00|Hitem:4638::::::::57:::::::::|h[强化钢质宝箱]|h|r", -- [6]
							"|cff1eff00|Hitem:12021::::::::57:::::::::|h[盾甲铁靴]|h|r", -- [7]
							"|cffffffff|Hitem:11108::::::::57:::::::::|h[褪色的照片]|h|r", -- [8]
							"|cffffffff|Hitem:3827::::::::57:::::::::|h[法力药水]|h|r", -- [9]
							"|cff0070dd|Hitem:9410::::::1208:1184142464:57:::::::::|h[野熊之山壁之拳]|h|r", -- [10]
							"|cff1eff00|Hitem:10780::::::::57:::::::::|h[哈卡印记]|h|r", -- [11]
							"|cff1eff00|Hitem:12102::::::::57:::::::::|h[贵族之戒]|h|r", -- [12]
							"|cff0070dd|Hitem:11086::::::::57:::::::::|h[保护者迦萨斯]|h|r", -- [13]
							"|cff1eff00|Hitem:11915::::::::57:::::::::|h[希兹尔的遮雨板]|h|r", -- [14]
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							10749, -- [1]
							nil, -- [2]
							nil, -- [3]
							11078, -- [4]
							11910, -- [5]
							4638, -- [6]
							12021, -- [7]
							11108, -- [8]
							3827, -- [9]
							9410, -- [10]
							10780, -- [11]
							12102, -- [12]
							11086, -- [13]
							11915, -- [14]
						},
						["counts"] = {
							[4] = 3,
							[9] = 2,
						},
						["freeslots"] = 2,
					},
					["Bag-2"] = {
						["ids"] = {
							11000, -- [1]
						},
						["links"] = {
							"|cffffffff|Hitem:11000::::::::57:::::::::|h[暗炉钥匙]|h|r", -- [1]
						},
						["freeslots"] = 31,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag7"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::57:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::57:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:13446::::::::57:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:4338::::::::57:::::::::|h[魔纹布]|h|r", -- [2]
							"|cffffffff|Hitem:8952::::::::57:::::::::|h[烤鹌鹑]|h|r", -- [3]
							"|cffffffff|Hitem:1710::::::::57:::::::::|h[强效治疗药水]|h|r", -- [4]
							"|cffffffff|Hitem:14047::::::::57:::::::::|h[符文布]|h|r", -- [5]
							nil, -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:18945::::::::57:::::::::|h[黑铁残油]|h|r", -- [8]
						},
						["counts"] = {
							nil, -- [1]
							17, -- [2]
							20, -- [3]
							4, -- [4]
							3, -- [5]
							[8] = 93,
						},
						["freeslots"] = 8,
						["cooldowns"] = {
							"1639666799.767|120|1", -- [1]
							[4] = "1639666799.767|120|1",
						},
						["ids"] = {
							13446, -- [1]
							4338, -- [2]
							8952, -- [3]
							1710, -- [4]
							14047, -- [5]
							nil, -- [6]
							nil, -- [7]
							18945, -- [8]
						},
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							1490, -- [1]
							6948, -- [2]
							11284, -- [3]
							11231, -- [4]
							5655, -- [5]
							11833, -- [6]
							8952, -- [7]
							14529, -- [8]
							14529, -- [9]
							17781, -- [10]
							11883, -- [11]
							8529, -- [12]
							12359, -- [13]
							14047, -- [14]
							12065, -- [15]
							3898, -- [16]
							13853, -- [17]
							8545, -- [18]
							11403, -- [19]
							11402, -- [20]
						},
						["links"] = {
							"|cff1eff00|Hitem:1490::::::::57:::::::::|h[守护之符]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::57:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:11284::::::::57:::::::::|h[精准弹丸]|h|r", -- [3]
							"|cffffffff|Hitem:11231::::::::57:::::::::|h[特殊的黑龙皮]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::57:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:11833::::::::57:::::::::|h[格里什皇后诱引剂]|h|r", -- [6]
							"|cffffffff|Hitem:8952::::::::57:::::::::|h[烤鹌鹑]|h|r", -- [7]
							"|cffffffff|Hitem:14529::::::::57:::::::::|h[符文布绷带]|h|r", -- [8]
							"|cffffffff|Hitem:14529::::::::57:::::::::|h[符文布绷带]|h|r", -- [9]
							"|cffffffff|Hitem:17781::::::::57:::::::::|h[贱民的指引]|h|r", -- [10]
							"|cffffffff|Hitem:11883::::::::57:::::::::|h[肮脏的背包]|h|r", -- [11]
							"|cffffffff|Hitem:8529::::::::57:::::::::|h[诺格弗格药剂]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::57:::::::::|h[瑟银锭]|h|r", -- [13]
							"|cffffffff|Hitem:14047::::::::57:::::::::|h[符文布]|h|r", -- [14]
							"|cff1eff00|Hitem:12065::::::::57:::::::::|h[元素屏障]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::57:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:13853::::::::57:::::::::|h[食腐虫肉块]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::57:::::::::|h[厚魔纹绷带]|h|r", -- [18]
							"|cff9d9d9d|Hitem:11403::::::::57:::::::::|h[巨大的蝙蝠牙齿]|h|r", -- [19]
							"|cff9d9d9d|Hitem:11402::::::::57:::::::::|h[光滑的蝙蝠皮]|h|r", -- [20]
						},
						["counts"] = {
							[13] = 14,
							[7] = 18,
							[14] = 19,
							[8] = 19,
							[9] = 2,
							[18] = 5,
							[19] = 2,
							[3] = 155,
							[12] = 5,
							[17] = 5,
						},
						["cooldowns"] = {
							[2] = "1639664799.076|3600|1",
							[5] = "1639666928.55|3|1",
						},
						["size"] = 20,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::57:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:7077::::::::57:::::::::|h[火焰之心]|h|r", -- [1]
							"|cffffffff|Hitem:11018::::::::57:::::::::|h[安戈洛的泥土]|h|r", -- [2]
							"|cffffffff|Hitem:6149::::::::57:::::::::|h[强效法力药水]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::57:::::::::|h[次级石盾药水]|h|r", -- [4]
							nil, -- [5]
							"|cffffffff|Hitem:11404::::::::57:::::::::|h[邪恶的蝙蝠眼]|h|r", -- [6]
							"|cffffffff|Hitem:10830::::::::57:::::::::|h[M73破片手榴弹]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:8150::::::::57:::::::::|h[石中盐]|h|r", -- [10]
							"|cffffffff|Hitem:18945::::::::57:::::::::|h[黑铁残油]|h|r", -- [11]
							[13] = "|cffffffff|Hitem:11474::::::::57:::::::::|h[精龙的蛋]|h|r",
						},
						["icon"] = 133652,
						["freeslots"] = 5,
						["ids"] = {
							7077, -- [1]
							11018, -- [2]
							6149, -- [3]
							4623, -- [4]
							nil, -- [5]
							11404, -- [6]
							10830, -- [7]
							nil, -- [8]
							nil, -- [9]
							8150, -- [10]
							18945, -- [11]
							[13] = 11474,
						},
						["counts"] = {
							[11] = 24,
							[2] = 24,
							[10] = 8,
							[4] = 2,
							[7] = 3,
						},
						["size"] = 14,
					},
					["Bag6"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::57:::::::::|h[符文布背包]|h|r",
						["freeslots"] = 14,
						["icon"] = 133652,
						["size"] = 14,
					},
				},
				["numBagSlots"] = 76,
			},
		},
		["Version"] = 1,
	},
}
