
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 42,
				["numBankSlots"] = 66,
				["lastUpdate"] = 1639851838,
				["numFreeBagSlots"] = 28,
				["numBagSlots"] = 76,
				["Containers"] = {
					["Bag3"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::59:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cff1eff00|Hitem:11754::::::::59:::::::::|h[黑钻石]|h|r", -- [2]
							nil, -- [3]
							nil, -- [4]
							"|cffffffff|Hitem:11412::::::::59:::::::::|h[娜玛拉之瓶]|h|r", -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							nil, -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::59:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 11,
						["ids"] = {
							nil, -- [1]
							11754, -- [2]
							nil, -- [3]
							nil, -- [4]
							11412, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							nil, -- [9]
							nil, -- [10]
							nil, -- [11]
							nil, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["counts"] = {
							nil, -- [1]
							2, -- [2]
						},
						["size"] = 14,
					},
					["Bag-2"] = {
						["ids"] = {
							11000, -- [1]
						},
						["links"] = {
							"|cffffffff|Hitem:11000::::::::59:::::::::|h[暗炉钥匙]|h|r", -- [1]
						},
						["size"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["freeslots"] = 31,
					},
					["Bag5"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
						["size"] = 14,
						["icon"] = 133652,
						["freeslots"] = 14,
					},
					["Bag4"] = {
						["rarity"] = 1,
						["ids"] = {
							10749, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							11910, -- [5]
							nil, -- [6]
							12021, -- [7]
							nil, -- [8]
							nil, -- [9]
							9410, -- [10]
							10780, -- [11]
							12102, -- [12]
							11915, -- [13]
						},
						["links"] = {
							"|cff0070dd|Hitem:10749::::::::59:::::::::|h[灰岩头盔]|h|r", -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							"|cff1eff00|Hitem:11910::::::::59:::::::::|h[珠宝缀饰腿甲]|h|r", -- [5]
							nil, -- [6]
							"|cff1eff00|Hitem:12021::::::::59:::::::::|h[盾甲铁靴]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							"|cff0070dd|Hitem:9410::::::1208:1184142464:59:::::::::|h[野熊之山壁之拳]|h|r", -- [10]
							"|cff1eff00|Hitem:10780::::::::59:::::::::|h[哈卡印记]|h|r", -- [11]
							"|cff1eff00|Hitem:12102::::::::59:::::::::|h[贵族之戒]|h|r", -- [12]
							"|cff1eff00|Hitem:11915::::::::59:::::::::|h[希兹尔的遮雨板]|h|r", -- [13]
						},
						["freeslots"] = 7,
						["link"] = "|cffffffff|Hitem:14046::::::::59:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag100"] = {
						["ids"] = {
							3655, -- [1]
							9418, -- [2]
							10455, -- [3]
							17746, -- [4]
							12065, -- [5]
							9958, -- [6]
							19141, -- [7]
							2820, -- [8]
							9240, -- [9]
							17191, -- [10]
							10740, -- [11]
							13443, -- [12]
							3827, -- [13]
							6149, -- [14]
							4338, -- [15]
							11176, -- [16]
							11137, -- [17]
							16202, -- [18]
							14343, -- [19]
							7910, -- [20]
							4638, -- [21]
							4638, -- [22]
							11078, -- [23]
							7068, -- [24]
						},
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::58:::::::::|h[抛光盾牌]|h|r", -- [1]
							"|cff0070dd|Hitem:9418::::::::58:::::::::|h[斩石者]|h|r", -- [2]
							"|cff1eff00|Hitem:10455::::::::58:::::::::|h[被禁锢的伊兰尼库斯精华]|h|r", -- [3]
							"|cff0070dd|Hitem:17746::::::::58:::::::::|h[诺克赛恩的镣铐]|h|r", -- [4]
							"|cff1eff00|Hitem:12065::::::::58:::::::::|h[元素屏障]|h|r", -- [5]
							"|cff1eff00|Hitem:9958::::::1200:687029632:58:::::::::|h[野熊之好战者的圆盾]|h|r", -- [6]
							"|cff1eff00|Hitem:19141::::::::58:::::::::|h[丝瓜]|h|r", -- [7]
							"|cff1eff00|Hitem:2820::::::::58:::::::::|h[灵巧秒表]|h|r", -- [8]
							"|cff1eff00|Hitem:9240::::::::58:::::::::|h[祖尔法拉克之槌]|h|r", -- [9]
							"|cff0070dd|Hitem:17191::::::::58:::::::::|h[塞雷布拉斯节杖]|h|r", -- [10]
							"|cff1eff00|Hitem:10740::::::::58:::::::::|h[百夫长腿甲]|h|r", -- [11]
							"|cffffffff|Hitem:13443::::::::58:::::::::|h[超强法力药水]|h|r", -- [12]
							"|cffffffff|Hitem:3827::::::::58:::::::::|h[法力药水]|h|r", -- [13]
							"|cffffffff|Hitem:6149::::::::58:::::::::|h[强效法力药水]|h|r", -- [14]
							"|cffffffff|Hitem:4338::::::::58:::::::::|h[魔纹布]|h|r", -- [15]
							"|cffffffff|Hitem:11176::::::::58:::::::::|h[梦境之尘]|h|r", -- [16]
							"|cffffffff|Hitem:11137::::::::58:::::::::|h[幻象之尘]|h|r", -- [17]
							"|cff1eff00|Hitem:16202::::::::58:::::::::|h[次级不灭精华]|h|r", -- [18]
							"|cff0070dd|Hitem:14343::::::::58:::::::::|h[小块魔光碎片]|h|r", -- [19]
							"|cff1eff00|Hitem:7910::::::::58:::::::::|h[红宝石]|h|r", -- [20]
							"|cff1eff00|Hitem:4638::::::::58:::::::::|h[强化钢质宝箱]|h|r", -- [21]
							"|cff1eff00|Hitem:4638::::::::58:::::::::|h[强化钢质宝箱]|h|r", -- [22]
							"|cffffffff|Hitem:11078::::::::58:::::::::|h[遗物宝箱钥匙]|h|r", -- [23]
							"|cffffffff|Hitem:7068::::::::58:::::::::|h[元素火焰]|h|r", -- [24]
						},
						["counts"] = {
							[13] = 2,
							[17] = 8,
							[15] = 17,
							[23] = 18,
							[12] = 2,
							[19] = 2,
							[16] = 2,
							[24] = 2,
						},
						["size"] = 24,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["ids"] = {
							nil, -- [1]
							12203, -- [2]
							12208, -- [3]
							4623, -- [4]
							13446, -- [5]
							12412, -- [6]
							10830, -- [7]
							11404, -- [8]
							15229, -- [9]
							15815, -- [10]
							13289, -- [11]
							10239, -- [12]
							11474, -- [13]
							6530, -- [14]
						},
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:12203::::::::59:::::::::|h[红狼肉]|h|r", -- [2]
							"|cffffffff|Hitem:12208::::::::59:::::::::|h[嫩狼肉]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::59:::::::::|h[次级石盾药水]|h|r", -- [4]
							"|cffffffff|Hitem:13446::::::::59:::::::::|h[特效治疗药水]|h|r", -- [5]
							"|cffffffff|Hitem:12412::::::::59:::::::::|h[第四块摩沙鲁石板]|h|r", -- [6]
							"|cffffffff|Hitem:10830::::::::59:::::::::|h[M73破片手榴弹]|h|r", -- [7]
							"|cffffffff|Hitem:11404::::::::59:::::::::|h[邪恶的蝙蝠眼]|h|r", -- [8]
							"|cff1eff00|Hitem:15229::::::1556:88690944:59:::::::::|h[能量之祝福战锤]|h|r", -- [9]
							"|cff1eff00|Hitem:15815::::::::59:::::::::|h[哈米亚的披风]|h|r", -- [10]
							"|cffffffff|Hitem:13289::::::::59:::::::::|h[埃根的冲击器]|h|r", -- [11]
							"|cff1eff00|Hitem:10239::::::1198:1799927040:59:::::::::|h[野熊之重型板层臂铠]|h|r", -- [12]
							"|cffffffff|Hitem:11474::::::::59:::::::::|h[精龙的蛋]|h|r", -- [13]
							"|cffffffff|Hitem:6530::::::::59:::::::::|h[夜色虫]|h|r", -- [14]
						},
						["freeslots"] = 1,
						["counts"] = {
							nil, -- [1]
							6, -- [2]
							7, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							3, -- [7]
						},
						["link"] = "|cffffffff|Hitem:14046::::::::59:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::59:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:8766::::::::59:::::::::|h[晨露酒]|h|r", -- [1]
							nil, -- [2]
							"|cffffffff|Hitem:8952::::::::59:::::::::|h[烤鹌鹑]|h|r", -- [3]
							"|cffffffff|Hitem:1710::::::::59:::::::::|h[强效治疗药水]|h|r", -- [4]
							"|cffffffff|Hitem:14047::::::::59:::::::::|h[符文布]|h|r", -- [5]
							[7] = "|cff1eff00|Hitem:20560::::::::59:::::::::|h[奥特兰克山谷荣誉奖章]|h|r",
							[14] = "|cff0070dd|Hitem:11086::::::::59:::::::::|h[保护者迦萨斯]|h|r",
						},
						["icon"] = 133652,
						["size"] = 14,
						["ids"] = {
							8766, -- [1]
							nil, -- [2]
							8952, -- [3]
							1710, -- [4]
							14047, -- [5]
							[7] = 20560,
							[14] = 11086,
						},
						["counts"] = {
							nil, -- [1]
							nil, -- [2]
							18, -- [3]
							3, -- [4]
							20, -- [5]
							[7] = 5,
						},
						["freeslots"] = 8,
					},
					["Bag7"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
						["size"] = 14,
						["icon"] = 133652,
						["freeslots"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							11122, -- [1]
							6948, -- [2]
							11284, -- [3]
							9531, -- [4]
							5655, -- [5]
							11833, -- [6]
							15814, -- [7]
							14529, -- [8]
							14529, -- [9]
							8146, -- [10]
							12411, -- [11]
							8529, -- [12]
							12359, -- [13]
							14047, -- [14]
							12938, -- [15]
							3898, -- [16]
							14047, -- [17]
							8545, -- [18]
							12115, -- [19]
						},
						["links"] = {
							"|cff1eff00|Hitem:11122::::::::59:::::::::|h[棍子上的胡萝卜]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::59:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:11284::::::::59:::::::::|h[精准弹丸]|h|r", -- [3]
							"|cff1eff00|Hitem:9531::::::::59:::::::::|h[晶岩肩铠]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::59:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:11833::::::::59:::::::::|h[格里什皇后诱引剂]|h|r", -- [6]
							"|cff1eff00|Hitem:15814::::::::59:::::::::|h[哈米亚斩杀者]|h|r", -- [7]
							"|cffffffff|Hitem:14529::::::::59:::::::::|h[符文布绷带]|h|r", -- [8]
							"|cffffffff|Hitem:14529::::::::59:::::::::|h[符文布绷带]|h|r", -- [9]
							"|cffffffff|Hitem:8146::::::::59:::::::::|h[邪恶之爪]|h|r", -- [10]
							"|cffffffff|Hitem:12411::::::::59:::::::::|h[第三块摩沙鲁石板]|h|r", -- [11]
							"|cffffffff|Hitem:8529::::::::59:::::::::|h[诺格弗格药剂]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::59:::::::::|h[瑟银锭]|h|r", -- [13]
							"|cffffffff|Hitem:14047::::::::59:::::::::|h[符文布]|h|r", -- [14]
							"|cffffffff|Hitem:12938::::::::59:::::::::|h[英雄之血]|h|r", -- [15]
							"|cffffffff|Hitem:3898::::::::59:::::::::|h[图书馆手稿]|h|r", -- [16]
							"|cffffffff|Hitem:14047::::::::59:::::::::|h[符文布]|h|r", -- [17]
							"|cffffffff|Hitem:8545::::::::59:::::::::|h[厚魔纹绷带]|h|r", -- [18]
							"|cff1eff00|Hitem:12115::::::::59:::::::::|h[坚定束腰]|h|r", -- [19]
						},
						["freeslots"] = 1,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["counts"] = {
							[13] = 14,
							[14] = 20,
							[15] = 2,
							[8] = 14,
							[9] = 2,
							[18] = 5,
							[10] = 2,
							[3] = 134,
							[12] = 5,
							[17] = 20,
						},
						["size"] = 20,
					},
					["Bag6"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::58:::::::::|h[符文布背包]|h|r",
						["size"] = 14,
						["icon"] = 133652,
						["freeslots"] = 14,
					},
				},
			},
		},
		["Version"] = 1,
	},
}
