
DataStore_ContainersDB = {
	["profileKeys"] = {
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.特变电工"] = {
				["numFreeBankSlots"] = 7,
				["numBankSlots"] = 24,
				["lastUpdate"] = 1639418315,
				["numFreeBagSlots"] = 38,
				["Containers"] = {
					["Bag100"] = {
						["links"] = {
							"|cff1eff00|Hitem:3655::::::::56:::::::::|h[抛光盾牌]|h|r", -- [1]
							"|cff0070dd|Hitem:9418::::::::56:::::::::|h[斩石者]|h|r", -- [2]
							"|cff1eff00|Hitem:20640::::::::56:::::::::|h[南海小桶]|h|r", -- [3]
							"|cff0070dd|Hitem:17746::::::::56:::::::::|h[诺克赛恩的镣铐]|h|r", -- [4]
							"|cff0070dd|Hitem:10845::::::::56:::::::::|h[战士的拥抱]|h|r", -- [5]
							"|cff1eff00|Hitem:9958::::::1200:687029632:56:::::::::|h[野熊之好战者的圆盾]|h|r", -- [6]
							"|cff1eff00|Hitem:19141::::::::56:::::::::|h[丝瓜]|h|r", -- [7]
							"|cff1eff00|Hitem:2820::::::::56:::::::::|h[灵巧秒表]|h|r", -- [8]
							"|cff1eff00|Hitem:9240::::::::56:::::::::|h[祖尔法拉克之槌]|h|r", -- [9]
							"|cff0070dd|Hitem:17191::::::::56:::::::::|h[塞雷布拉斯节杖]|h|r", -- [10]
							"|cff1eff00|Hitem:10707::::::::56:::::::::|h[钢板胫甲]|h|r", -- [11]
							"|cff0070dd|Hitem:10749::::::::56:::::::::|h[灰岩头盔]|h|r", -- [12]
							"|cff1eff00|Hitem:11915::::::::56:::::::::|h[希兹尔的遮雨板]|h|r", -- [13]
							"|cff1eff00|Hitem:11910::::::::56:::::::::|h[珠宝缀饰腿甲]|h|r", -- [14]
							"|cff1eff00|Hitem:10780::::::::56:::::::::|h[哈卡印记]|h|r", -- [15]
							"|cff1eff00|Hitem:10740::::::::56:::::::::|h[百夫长腿甲]|h|r", -- [16]
							"|cff0070dd|Hitem:9410::::::1208:1184142464:56:::::::::|h[野熊之山壁之拳]|h|r", -- [17]
						},
						["ids"] = {
							3655, -- [1]
							9418, -- [2]
							20640, -- [3]
							17746, -- [4]
							10845, -- [5]
							9958, -- [6]
							19141, -- [7]
							2820, -- [8]
							9240, -- [9]
							17191, -- [10]
							10707, -- [11]
							10749, -- [12]
							11915, -- [13]
							11910, -- [14]
							10780, -- [15]
							10740, -- [16]
							9410, -- [17]
						},
						["size"] = 24,
						["freeslots"] = 7,
					},
					["Bag3"] = {
						["rarity"] = 1,
						["ids"] = {
							7068, -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							3928, -- [9]
							nil, -- [10]
							18944, -- [11]
							nil, -- [12]
							nil, -- [13]
							7442, -- [14]
						},
						["links"] = {
							"|cffffffff|Hitem:7068::::::::56:::::::::|h[元素火焰]|h|r", -- [1]
							nil, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							nil, -- [8]
							"|cffffffff|Hitem:3928::::::::56:::::::::|h[超强治疗药水]|h|r", -- [9]
							nil, -- [10]
							"|cffffffff|Hitem:18944::::::::56:::::::::|h[熏火龙的鳞片]|h|r", -- [11]
							nil, -- [12]
							nil, -- [13]
							"|cffffffff|Hitem:7442::::::::56:::::::::|h[基尔卡克的钥匙]|h|r", -- [14]
						},
						["counts"] = {
							[9] = 4,
							[11] = 18,
						},
						["size"] = 14,
						["link"] = "|cffffffff|Hitem:14046::::::::56:::::::::|h[符文布背包]|h|r",
						["icon"] = 133652,
						["freeslots"] = 10,
					},
					["Bag4"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::56:::::::::|h[符文布背包]|h|r",
						["links"] = {
							nil, -- [1]
							"|cffffffff|Hitem:17760::::::::56:::::::::|h[生命之种]|h|r", -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							"|cffffffff|Hitem:11108::::::::56:::::::::|h[褪色的照片]|h|r", -- [8]
							"|cffffffff|Hitem:3827::::::::56:::::::::|h[法力药水]|h|r", -- [9]
							"|cff0070dd|Hitem:11086::::::::56:::::::::|h[保护者迦萨斯]|h|r", -- [10]
						},
						["icon"] = 133652,
						["freeslots"] = 10,
						["ids"] = {
							nil, -- [1]
							17760, -- [2]
							nil, -- [3]
							nil, -- [4]
							nil, -- [5]
							nil, -- [6]
							nil, -- [7]
							11108, -- [8]
							3827, -- [9]
							11086, -- [10]
						},
						["counts"] = {
							[9] = 2,
						},
						["size"] = 14,
					},
					["Bag-2"] = {
						["freeslots"] = 32,
						["icon"] = "ICONS\\INV_Misc_Key_04.blp",
						["size"] = 32,
					},
					["Bag1"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::56:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:8952::::::::56:::::::::|h[烤鹌鹑]|h|r", -- [1]
							"|cffffffff|Hitem:11018::::::::56:::::::::|h[安戈洛的泥土]|h|r", -- [2]
							"|cffffffff|Hitem:6149::::::::56:::::::::|h[强效法力药水]|h|r", -- [3]
							"|cffffffff|Hitem:4623::::::::56:::::::::|h[次级石盾药水]|h|r", -- [4]
							nil, -- [5]
							nil, -- [6]
							"|cffffffff|Hitem:10830::::::::56:::::::::|h[M73破片手榴弹]|h|r", -- [7]
							nil, -- [8]
							nil, -- [9]
							"|cffffffff|Hitem:8150::::::::56:::::::::|h[石中盐]|h|r", -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:11844::::::::56:::::::::|h[匹斯特苏格的安戈洛报告]|h|r", -- [12]
							"|cffffffff|Hitem:11474::::::::56:::::::::|h[精龙的蛋]|h|r", -- [13]
							"|cffffffff|Hitem:13446::::::::56:::::::::|h[特效治疗药水]|h|r", -- [14]
						},
						["icon"] = 133652,
						["freeslots"] = 5,
						["ids"] = {
							8952, -- [1]
							11018, -- [2]
							6149, -- [3]
							4623, -- [4]
							nil, -- [5]
							nil, -- [6]
							10830, -- [7]
							nil, -- [8]
							nil, -- [9]
							8150, -- [10]
							nil, -- [11]
							11844, -- [12]
							11474, -- [13]
							13446, -- [14]
						},
						["counts"] = {
							2, -- [1]
							24, -- [2]
							nil, -- [3]
							2, -- [4]
							nil, -- [5]
							nil, -- [6]
							3, -- [7]
							[10] = 7,
							[14] = 2,
						},
						["size"] = 14,
					},
					["Bag2"] = {
						["rarity"] = 1,
						["link"] = "|cffffffff|Hitem:14046::::::::56:::::::::|h[符文布背包]|h|r",
						["links"] = {
							"|cffffffff|Hitem:13446::::::::56:::::::::|h[特效治疗药水]|h|r", -- [1]
							"|cffffffff|Hitem:4338::::::::56:::::::::|h[魔纹布]|h|r", -- [2]
							"|cffffffff|Hitem:8952::::::::56:::::::::|h[烤鹌鹑]|h|r", -- [3]
							"|cffffffff|Hitem:1710::::::::56:::::::::|h[强效治疗药水]|h|r", -- [4]
							[11] = "|cffffffff|Hitem:11133::::::::56:::::::::|h[林克的训练之剑]|h|r",
							[14] = "|cffffffff|Hitem:3857::::::::56:::::::::|h[煤块]|h|r",
						},
						["counts"] = {
							5, -- [1]
							17, -- [2]
							20, -- [3]
							4, -- [4]
							[14] = 3,
						},
						["freeslots"] = 8,
						["ids"] = {
							13446, -- [1]
							4338, -- [2]
							8952, -- [3]
							1710, -- [4]
							[11] = 11133,
							[14] = 3857,
						},
						["icon"] = 133652,
						["size"] = 14,
					},
					["Bag0"] = {
						["ids"] = {
							11122, -- [1]
							6948, -- [2]
							11284, -- [3]
							11231, -- [4]
							5655, -- [5]
							11833, -- [6]
							14047, -- [7]
							10455, -- [8]
							12102, -- [9]
							17781, -- [10]
							nil, -- [11]
							8529, -- [12]
							12359, -- [13]
							[16] = 3898,
							[18] = 8545,
							[19] = 11912,
						},
						["links"] = {
							"|cff1eff00|Hitem:11122::::::::56:::::::::|h[棍子上的胡萝卜]|h|r", -- [1]
							"|cffffffff|Hitem:6948::::::::56:::::::::|h[炉石]|h|r", -- [2]
							"|cffffffff|Hitem:11284::::::::56:::::::::|h[精准弹丸]|h|r", -- [3]
							"|cffffffff|Hitem:11231::::::::56:::::::::|h[特殊的黑龙皮]|h|r", -- [4]
							"|cff0070dd|Hitem:5655::::::::56:::::::::|h[栗色马缰绳]|h|r", -- [5]
							"|cffffffff|Hitem:11833::::::::56:::::::::|h[格里什皇后诱引剂]|h|r", -- [6]
							"|cffffffff|Hitem:14047::::::::56:::::::::|h[符文布]|h|r", -- [7]
							"|cff1eff00|Hitem:10455::::::::56:::::::::|h[被禁锢的伊兰尼库斯精华]|h|r", -- [8]
							"|cff1eff00|Hitem:12102::::::::56:::::::::|h[贵族之戒]|h|r", -- [9]
							"|cffffffff|Hitem:17781::::::::56:::::::::|h[贱民的指引]|h|r", -- [10]
							nil, -- [11]
							"|cffffffff|Hitem:8529::::::::56:::::::::|h[诺格弗格药剂]|h|r", -- [12]
							"|cffffffff|Hitem:12359::::::::56:::::::::|h[瑟银锭]|h|r", -- [13]
							[16] = "|cffffffff|Hitem:3898::::::::56:::::::::|h[图书馆手稿]|h|r",
							[18] = "|cffffffff|Hitem:8545::::::::56:::::::::|h[厚魔纹绷带]|h|r",
							[19] = "|cffffffff|Hitem:11912::::::::56:::::::::|h[一组软泥怪采样瓶]|h|r",
						},
						["counts"] = {
							[13] = 14,
							[18] = 5,
							[3] = 199,
							[12] = 5,
						},
						["cooldowns"] = {
							[2] = "1639418313.251|3600|1",
						},
						["freeslots"] = 5,
						["icon"] = "Interface\\Buttons\\Button-Backpack-Up",
						["size"] = 20,
					},
				},
				["numBagSlots"] = 76,
			},
		},
		["Version"] = 1,
	},
}
