
_detalhes_global = {
	["npcid_pool"] = {
		[0] = "击倒",
		[1020] = "杂斑迅猛龙",
		[10158] = "月夜枭兽",
		[1021] = "杂斑尖啸龙",
		[511] = "疯狂的食尸鬼",
		[1022] = "杂斑镰爪龙",
		[1023] = "杂斑刺喉龙",
		[1024] = "蓝腮鱼人",
		[1025] = "蓝腮污水鱼人",
		[1026] = "蓝腮强盗",
		[4100] = "尖啸鹰身人",
		[1028] = "蓝腮泥浆鱼人",
		[515] = "鱼人袭击者",
		[4112] = "砂齿歹徒",
		[1031] = "红色软泥怪",
		[4120] = "雷鸣岩石元素",
		[4124] = "千针石林山狮",
		[4128] = "乱齿捕猎者",
		[1035] = "龙喉沼泽行者",
		[2070] = "月夜猛虎幼崽",
		[4140] = "恐蝎劫掠者",
		[1039] = "沼泽定居者",
		[1040] = "沼泽爬行者",
		[522] = "摩拉迪姆",
		[525] = "癞皮狼",
		[1051] = "黑铁矮人",
		[2102] = "龙喉步兵",
		[1053] = "黑铁隧道工",
		[1054] = "黑铁爆破手",
		[1057] = "龙喉白骨守卫",
		[531] = "骸骨魔",
		[4248] = "杂毛土狼",
		[533] = "夜行织影狼人",
		[539] = "小型结网毒蜘蛛",
		[2156] = "破损的傀儡",
		[2158] = "砂石斥候",
		[2160] = "砂石地占师",
		[2164] = "狂暴蓟熊",
		[2168] = "黑木战士",
		[2170] = "黑木巨熊怪",
		[4344] = "尘泥杂斑鳄鱼",
		[2176] = "被诅咒的贵族",
		[2178] = "哀嚎的贵族",
		[2180] = "雷鳞海妖",
		[4360] = "黑鳍战士",
		[1095] = "风险投资公司经理",
		[2190] = "野生劣魔",
		[1097] = "风险投资公司技工",
		[4388] = "幼年黑色蛇颈龙",
		[4392] = "腐蚀性的沼泽软泥怪",
		[2202] = "灰雾滩行者",
		[2204] = "灰雾撒网者",
		[2206] = "灰雾猎人",
		[2208] = "灰雾潮行者",
		[4416] = "迪菲亚赤膊矿工",
		[2212] = "戴瑟雷萨特",
		[1109] = "碎尸鸟",
		[1110] = "骷髅袭击者",
		[1111] = "吸血捕猎者",
		[3249] = "哈达斯 <天帝龍魂>",
		[1115] = "石腭击颅者",
		[1117] = "石腭断骨者",
		[4464] = "黑石角斗士",
		[1120] = "霜鬃巨魔",
		[2240] = "辛迪加劫匪",
		[1122] = "霜鬃剥皮者",
		[2248] = "洞穴雪人",
		[2250] = "山岭雪人",
		[2252] = "破碎岭食人魔",
		[2254] = "破碎岭虐待者",
		[565] = "疯狂的恐狼",
		[4512] = "野猪",
		[10079] = "卫兵穆赫·月角",
		[569] = "绿色独行蛛",
		[285] = "鱼人",
		[570] = "食脑者",
		[1144] = "莫什奥格巫医",
		[10159] = "小月夜枭兽",
		[36] = "麦田傀儡",
		[1150] = "淡水鳄",
		[1152] = "钳嘴鳄鱼",
		[1157] = "被诅咒的水手",
		[1158] = "被诅咒的水兵",
		[1159] = "大副斯涅利格",
		[1160] = "哈林多尔船长",
		[1161] = "碎石穴居人",
		[1162] = "碎石怪斥候",
		[2324] = "黑木风语者",
		[1166] = "碎石怪先知",
		[4664] = "火刃劫掠者",
		[2336] = "暗滩狂热者",
		[4672] = "怨怒魔仆",
		[1172] = "坑道鼠歹徒",
		[1173] = "坑道鼠斥候",
		[1174] = "坑道鼠地卜师",
		[1175] = "坑道鼠掘地工",
		[1176] = "坑道鼠征粮官",
		[1177] = "坑道鼠勘探员",
		[2354] = "邪恶的灰熊",
		[590] = "迪菲亚强夺者",
		[3381] = "南海歹徒",
		[4716] = "滑刃潮行者",
		[1183] = "莫格罗什秘法师",
		[4728] = "砂腭蜥蜴",
		[1185] = "林木潜伏者",
		[1186] = "老黑熊",
		[594] = "迪菲亚匪徒",
		[2374] = "碎鳍泥浆鱼人",
		[2376] = "碎鳍智者",
		[2384] = "饥饿的山地狮",
		[1195] = "森林潜伏者",
		[3417] = "活火 <迪菲亚法师>",
		[1200] = "摩本特·费尔",
		[1201] = "雪豹",
		[1202] = "坑道鼠狗头人",
		[2406] = "山地狮",
		[604] = "瘟疫食尸鬼",
		[1210] = "卓克苏尔",
		[38] = "迪菲亚暴徒",
		[1222] = "黑铁工兵",
		[3475] = "豹",
		[154] = "大碎尸鸟",
		[2462] = "食腐虫",
		[1236] = "狗头人掘地工",
		[619] = "迪菲亚咒术师",
		[622] = "地精工程师",
		[623] = "骷髅矿工",
		[624] = "亡灵挖掘者",
		[625] = "亡灵爆破者",
		[1251] = "裂拳好战者",
		[314] = "寒冰箭",
		[628] = "黑色破坏者",
		[315] = "斯塔文·密斯特曼托",
		[2520] = "遥控傀儡 <地精工程师>",
		[634] = "迪菲亚监工",
		[1270] = "恶臭的食尸鬼",
		[636] = "迪菲亚黑衣卫兵",
		[10160] = "狂暴的月夜枭兽",
		[40] = "狗头人矿工",
		[639] = "艾德温·范克里夫",
		[2554] = "枯木掷斧者",
		[2556] = "枯木猎头者",
		[641] = "地精木匠",
		[642] = "斯尼德的伐木机",
		[4109] = "雄性风巢飞龙",
		[4117] = "风蛇",
		[645] = "曲奇",
		[14388] = "游荡的黑龙",
		[646] = "重拳先生",
		[647] = "绿皮队长",
		[2586] = "辛迪加路霸",
		[5184] = "塞拉摩哨兵",
		[9377] = "空气漩涡",
		[6239] = "塞克隆尼亚",
		[2618] = "落锤苦工",
		[657] = "迪菲亚海盗",
		[660] = "血顶巫医",
		[4249] = "杂毛嚎叫者",
		[334] = "加塞尔佐格",
		[335] = "森格",
		[671] = "血顶猎头者",
		[4341] = "尘泥鳄鱼",
		[4361] = "黑鳍泥浆鱼人",
		[3725] = "暗滩祭司",
		[1353] = "萨尔图斯",
		[4385] = "枯藤狂暴者",
		[3733] = "亡灵草药师",
		[2714] = "被遗忘者信使",
		[4413] = "暗牙蜘蛛",
		[4417] = "迪菲亚工头",
		[682] = "荆棘谷猛虎",
		[1364] = "邪恶的巴尔加拉斯",
		[171] = "鱼人战士",
		[684] = "深喉猎豹",
		[10928] = "魅魔",
		[686] = "鞭尾迅猛龙",
		[687] = "丛林捕猎者",
		[688] = "石喉蜥蜴",
		[6523] = "黑铁火枪手",
		[345] = "贝利格拉布",
		[691] = "次级水元素",
		[2762] = "雷霆流放者",
		[694] = "血顶掷斧者",
		[1388] = "瓦加什",
		[697] = "血顶萨满祭司",
		[3809] = "灰谷熊",
		[698] = "血顶猛虎 <血顶兽王>",
		[699] = "血顶兽王",
		[1400] = "湿地鳄鱼",
		[3823] = "幽爪奔跑者",
		[702] = "血顶食腐者",
		[703] = "范高雷中尉",
		[1417] = "湿地鳄鱼幼崽",
		[1418] = "蓝腮袭击者",
		[712] = "赤脊山鞭笞者",
		[4665] = "火刃老兵",
		[4673] = "怨怒背叛者",
		[4693] = "恐怖飞鸟",
		[4713] = "滑刃战士",
		[3903] = "灼热图腾 III",
		[11560] = "玛格拉姆鬼魂",
		[728] = "巴尔瑟拉",
		[729] = "辛达尔",
		[731] = "豹",
		[5840] = "黑铁锻造师",
		[732] = "鱼人潜伏者",
		[46] = "鱼人强盗",
		[4841] = "死沼巨鳄",
		[735] = "鱼人士兵",
		[736] = "黑豹",
		[2946] = "赫尔库拉的傀儡",
		[3989] = "风险投资公司樵夫",
		[3991] = "风险投资公司砍树工",
		[4007] = "深苔毒蜘蛛",
		[4969] = "旧城区暴徒",
		[4041] = "炭色石化蜥蜴",
		[95] = "迪菲亚走私者",
		[4065] = "黑石哨兵",
		[3] = "食腐者",
		[5089] = "巴鲁斯·加科因",
		[48] = "骷髅战士",
		[4110] = "雌性风巢飞龙",
		[4118] = "毒性风蛇",
		[2069] = "月夜猛虎",
		[2071] = "月夜雌虎",
		[4150] = "盐石凝视者",
		[4154] = "盐湖食腐鹫",
		[4158] = "盐湖秃鹫",
		[2089] = "巨型湿地鳄鱼",
		[6240] = "挑衅者",
		[98] = "河爪监工",
		[785] = "骷髅看守",
		[11521] = "科多幽灵",
		[787] = "骷髅医师",
		[11561] = "亡灵劫掠者",
		[397] = "莫甘斯",
		[199] = "小碎尸鸟",
		[2157] = "石巨兽",
		[2159] = "砂石断骨者",
		[2163] = "蓟熊",
		[2165] = "灰斑蓟熊",
		[2167] = "黑木探路者",
		[2169] = "黑木图腾师",
		[2171] = "黑木萨满祭司",
		[4342] = "尘泥锐爪鳄鱼",
		[2177] = "挣扎的贵族",
		[2179] = "雷鳞御浪者",
		[4362] = "黑鳍滩行鱼人",
		[2185] = "黑海岸蛇颈龙",
		[2189] = "恶灵劣魔",
		[4378] = "暗雾独行蛛",
		[202] = "恐怖骸骨",
		[2203] = "灰雾先知",
		[2205] = "灰雾战士",
		[2207] = "灰雾智者",
		[4418] = "迪菲亚巫师",
		[203] = "骷髅法师",
		[814] = "玛尔苏斯中士",
		[4462] = "黑石猎人",
		[2237] = "月夜雄虎",
		[2241] = "辛迪加窃贼",
		[2249] = "凶恶的雪人",
		[2251] = "巨型雪人",
		[8996] = "虚空行者",
		[2255] = "寒冰箭",
		[822] = "森林熊幼崽",
		[103] = "加瑞克·帕德弗特",
		[206] = "夜行邪齿狼人",
		[412] = "缝合怪",
		[824] = "迪菲亚掘地工",
		[1663] = "迪克斯特·瓦德",
		[833] = "山狗首领",
		[1666] = "卡姆·深怒",
		[834] = "山狗",
		[2319] = "辛迪加巫师",
		[10323] = "莫克迪普",
		[2333] = "仆从瓦里克",
		[4666] = "火刃魔仆",
		[2337] = "暗滩唤魔师",
		[4674] = "怨怒巡影者",
		[422] = "鱼人食腐者",
		[2349] = "巨型食苔蛛",
		[2351] = "灰熊",
		[423] = "混血赤脊山豺狼人",
		[3382] = "南海炮兵",
		[212] = "裂拳战士",
		[424] = "赤脊山偷猎者",
		[4726] = "暴怒的雷霆蜥蜴",
		[1696] = "可怕的塔格尔",
		[2369] = "刺脊滩行者",
		[2371] = "刺脊海妖",
		[6788] = "雌蓟熊",
		[2375] = "碎鳍滩行鱼人",
		[2377] = "碎鳍潮行鱼人",
		[426] = "赤脊山蛮兵",
		[11562] = "枯钳龙虾人",
		[1706] = "迪菲亚囚徒",
		[1707] = "迪菲亚俘虏",
		[1708] = "迪菲亚狱友",
		[855] = "幼年荆棘谷迅猛龙",
		[428] = "恐鹫",
		[1711] = "迪菲亚罪犯",
		[429] = "暗皮巫师",
		[1715] = "迪菲亚叛军",
		[2407] = "巨型山地狮",
		[215] = "迪菲亚夜行者",
		[430] = "赤脊山秘法师",
		[431] = "暗皮杀手",
		[2421] = "玛克拉克",
		[1725] = "迪菲亚哨兵",
		[1726] = "迪菲亚法师",
		[1727] = "迪菲亚工人",
		[2433] = "赫尔库拉的遗骸",
		[433] = "暗皮豺狼人",
		[1731] = "地精工匠",
		[1732] = "迪菲亚塑风师",
		[217] = "结网毒蜘蛛",
		[434] = "疯狂的暗皮豺狼人",
		[2447] = "纳瑞尔拉萨斯",
		[871] = "盐鳞战士",
		[436] = "黑石暗影法师",
		[873] = "盐鳞智者",
		[437] = "黑石叛节者",
		[875] = "盐鳞首领",
		[4966] = "亨德尔下士",
		[1756] = "奥妮克希亚的精英护卫",
		[440] = "黑石步兵",
		[880] = "埃尔兰·杜德摩尔",
		[441] = "黑龙雏龙",
		[1763] = "基尔尼格",
		[442] = "狼蛛",
		[10036] = "蕨墙执行者",
		[2531] = "莫甘斯的爪牙 <莫甘斯>",
		[6093] = "蛀牙杰克",
		[446] = "赤脊山猛击者",
		[2555] = "枯木巫医",
		[2557] = "枯木暗影猎手",
		[2559] = "高地阔步龙",
		[2563] = "平原狼蛛",
		[2565] = "巨型平原狼蛛",
		[4107] = "风巢双足飞龙",
		[4119] = "风蛇",
		[4139] = "恐蝎",
		[2587] = "辛迪加巡路者",
		[4151] = "盐石水晶蜥蜴",
		[905] = "利齿狂鱼",
		[453] = "河爪秘法师",
		[909] = "迪菲亚夜贼",
		[910] = "迪菲亚附魔师",
		[114] = "看守傀儡",
		[2619] = "落锤步兵",
		[458] = "打猎鱼人",
		[11563] = "枯钳巨螯龙虾人",
		[115] = "收割傀儡",
		[920] = "夜行堕落狼人",
		[921] = "风险投资公司伐木工",
		[923] = "黑色破坏者幼崽",
		[116] = "迪菲亚强盗",
		[4343] = "尘泥钳嘴鳄鱼",
		[4355] = "血沼镰爪龙",
		[930] = "小型黑寡妇蜘蛛",
		[4363] = "黑鳍智者",
		[3728] = "暗滩精兵",
		[3730] = "暗滩挖掘者",
		[3732] = "亡灵搜寻者",
		[3734] = "亡灵暴徒",
		[1871] = "伊莉莎的卫兵",
		[4411] = "暗牙潜伏者",
		[937] = "库尔森丛林战士",
		[12922] = "小鬼爪牙",
		[938] = "库尔森特种兵",
		[939] = "库尔森精英",
		[2733] = "药剂师乔瑞尔",
		[941] = "库尔森精神医师",
		[942] = "库尔森巫医",
		[118] = "觅食的灰狼",
		[4463] = "黑石召唤师",
		[4393] = "酸性沼泽软泥怪",
		[4412] = "暗牙爬行者",
		[4387] = "枯藤沼泽兽",
		[473] = "收货人莫根",
		[946] = "霜鬃巨魔新兵",
		[4376] = "黑雾蜘蛛",
		[2761] = "水浪流放者",
		[1017] = "高地镰爪龙",
		[948] = "腐烂者",
		[597] = "血顶狂战士",
		[949] = "食腐独行蛛",
		[475] = "狗头人隧道工",
		[595] = "血顶猎人",
		[1180] = "莫格罗什蛮兵",
		[2339] = "暮光暴徒",
		[476] = "狗头人地卜师",
		[2338] = "暮光信徒",
		[1169] = "黑铁叛军",
		[518] = "犹勒",
		[445] = "赤脊山突击队员",
		[1907] = "纳迦探险者",
		[4352] = "血沼尖啸龙",
		[4044] = "黑色石化蜥蜴",
		[478] = "河爪豺狼人前锋",
		[1179] = "莫格罗什执行者",
		[1258] = "巨型黑色破坏者",
		[432] = "暗皮蛮兵",
		[30] = "森林蜘蛛",
		[213] = "饥饿的恐狼",
		[598] = "迪菲亚矿工",
		[4101] = "尖啸游荡者",
		[480] = "饮独醉",
		[6250] = "海蟹",
		[1181] = "莫格罗什萨满祭司",
		[548] = "鱼人小招潮者",
		[1922] = "森林灰狼",
		[300] = "扎克乌尔",
		[1032] = "黑色软泥怪",
		[6669] = "机械打手4100型",
		[391] = "老瞎眼",
		[772] = "荆棘谷雌虎",
		[5643] = "泰拉尼斯·玛雷姆",
		[517] = "鱼人智者",
		[3560] = "治疗结界 <黑木图腾师>",
		[1034] = "龙喉袭击者",
		[121] = "迪菲亚巡路者",
		[6412] = "骷髅",
		[1178] = "莫格罗什食人魔",
		[4663] = "火刃预言师",
		[4667] = "火刃暗影法师",
		[4671] = "怨怒欺诈者",
		[485] = "黑石前锋",
		[10373] = "萨巴克希斯",
		[3100] = "菅野松雪",
		[2103] = "龙喉斥候",
		[486] = "萨瑞尔祖恩",
		[4695] = "恐怖腐化鸟",
		[448] = "霍格",
		[1716] = "巴基尔·斯瑞德",
		[11713] = "黑幕追踪者",
		[4711] = "滑刃纳迦",
		[122] = "迪菲亚路霸",
		[4719] = "滑刃海巫",
		[4723] = "工头考兹尔",
		[976] = "库尔森战虎",
		[449] = "迪菲亚拳匪",
		[977] = "库尔森战豹",
		[1027] = "蓝腮战士",
		[6789] = "蓟熊幼崽",
		[898] = "夜行狼人",
		[643] = "斯尼德 <斯尼德的伐木机>",
		[3727] = "暗滩执行者",
		[1030] = "黑色泥浆怪",
		[644] = "拉克佐",
		[1961] = "癞爪",
		[97] = "矮小的河爪豺狼人",
		[6170] = "加特斯比尔",
		[587] = "血顶战士",
		[504] = "迪菲亚捕兽者",
		[2589] = "辛迪加雇佣兵",
		[4675] = "怨怒唤魔者",
		[4679] = "地狱魔女",
		[589] = "迪菲亚抢劫者",
		[4147] = "盐石蜥蜴",
		[327] = "金牙",
		[11714] = "玛洛什",
		[1052] = "黑铁破坏者",
		[2721] = "被遗忘者保镖",
		[456] = "小鱼人智者",
		[4715] = "滑刃刺尾纳迦",
		[4727] = "老迈的雷霆蜥蜴",
		[13019] = "火刃先知",
		[681] = "荆棘谷猛虎幼崽",
		[124] = "河爪蛮兵",
		[12369] = "科拉加鲁",
		[683] = "猎豹幼崽",
		[2356] = "老灰熊",
		[3662] = "被憎恨的德玛尼斯",
		[580] = "赤脊山苦工",
		[701] = "血顶秘法师",
		[210] = "噬骨者",
		[4692] = "恐怖飞扑者",
		[3450] = "迪菲亚鹦鹉",
		[4670] = "怨怒潜行者",
		[1083] = "鱼人巡滩者",
		[1085] = "老年荆棘谷猛虎",
		[1860] = "格拉克诺斯",
		[4696] = "荒土巨钳蝎",
		[1096] = "风险投资公司地质学家",
		[940] = "库尔森药草师",
		[452] = "河爪强盗",
		[685] = "荆棘谷迅猛龙",
		[1114] = "丛林大猩猩",
		[3947] = "地精造船师",
		[943] = "库尔森驯兽师",
		[1121] = "霜鬃雪行者",
		[205] = "夜行黑暗狼人",
		[4006] = "深苔结网蛛",
		[819] = "伊尔加拉的仆从",
		[502] = "本尼·布兰科",
		[588] = "血顶斥候",
		[2253] = "破碎岭蛮兵",
		[11559] = "玛格拉姆通灵师",
		[568] = "暗皮战士",
		[2368] = "刺脊捕猎者",
		[4022] = "血怒鹰身人",
		[1007] = "藓皮豺狼人",
		[4026] = "血怒唤风者",
		[1008] = "樱桃肉丸子",
		[1717] = "哈姆霍克",
		[1009] = "藓皮织雾者",
		[505] = "巨型狼蛛",
		[1010] = "藓皮沼泽行者",
		[4038] = "燃烧的破坏者",
		[1011] = "藓皮捕兽者",
		[832] = "尘魔",
		[1012] = "藓皮蛮兵",
		[579] = "暗皮刺客",
		[709] = "莫什奥格好战者",
		[1163] = "碎石怪击颅者",
		[1014] = "藓皮突击队员",
		[127] = "潮行鱼人",
		[1015] = "高地迅猛龙",
		[6066] = "陷地 <血顶巫医>",
		[1016] = "高地鞭尾龙",
		[4062] = "黑铁投弹手",
		[4064] = "黑石斥候",
		[1729] = "迪菲亚招魂师",
		[689] = "晶背蜥蜴",
		[126] = "滩行鱼人",
		[626] = "工头希斯耐特",
	},
	["death_recap"] = {
		["show_segments"] = false,
		["enabled"] = true,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		[0] = 5,
		["法术反制"] = 8,
		["神圣净化"] = 1,
		["重伤"] = 1,
		["护甲"] = 1,
		["邪恶攻击"] = 4,
		["恢复"] = 5,
		["愈合"] = 11,
		["伏击"] = 4,
		["精神"] = 1,
		["灼热箭"] = 3,
		["速效毒药 II"] = 4,
		["真言术：韧"] = 5,
		["寒冰箭"] = 8,
		["荆棘术"] = 1,
		["喝水"] = 8,
		["感知"] = 1,
		["治疗药水"] = 1,
		["冷酷"] = 4,
		["自动射击"] = 3,
		["制裁之锤"] = 2,
		["新近包扎"] = 1,
		["真言术：盾"] = 5,
		["嘲讽"] = 1,
		["快速治疗"] = 5,
		["雷霆一击"] = 1,
		["重击"] = 11,
		["恐吓"] = "斯尼德的伐木机",
		["闷棍"] = 4,
		["灵猴守护"] = 3,
		["防护恐惧结界"] = 5,
		["割裂"] = 4,
		["搜索"] = 4,
		["闪电吐息"] = 1,
		["圣光审判"] = 1,
		["斧类武器投掷"] = "地精木匠",
		["烈焰风暴"] = "迪菲亚招魂师",
		["切割"] = 1,
		["射击"] = 8,
		["霜寒刺骨"] = 8,
		["冰霜新星"] = 8,
		["生命分流"] = 9,
		["进食充分"] = 8,
		["冰锥术"] = 8,
		["快速烈焰防护结界"] = "迪菲亚招魂师",
		["正义之怒"] = 2,
		["弹出斯尼德"] = "斯尼德的伐木机",
		["猛虎之怒"] = 11,
		["潜行"] = 4,
		["再生"] = 5,
		["厚绒线绷带"] = 1,
		["挑战怒吼"] = 1,
		["挫志怒吼"] = 1,
		["霜甲术"] = 8,
		["痛击"] = "重拳先生",
		["消隐"] = "迪菲亚黑衣卫兵",
		["压制"] = 1,
		["冰冻"] = 8,
		["狂怒"] = "可怕的塔格尔",
		["扫击"] = 11,
		["酸液溅射"] = "曲奇",
		["猎人印记"] = 3,
		["致残毒药"] = 4,
		["打击"] = "迪克斯特·瓦德",
		["战斗命令"] = "迪菲亚监工",
		["闪避"] = 4,
		["召唤遥控傀儡"] = "地精工程师",
		["旅行形态"] = 11,
		["恢复法力"] = 5,
		["唤醒"] = 8,
		["心灵之火"] = 5,
		["火球术"] = 8,
		["盾牌格挡"] = 1,
		["震荡射击"] = 3,
		["诱捕"] = 3,
		["脚踢"] = 4,
		["英勇打击"] = 1,
		["毒蛇钉刺"] = 3,
		["狂暴之怒"] = 1,
		["爪击"] = 11,
		["剑刃乱舞"] = 4,
		["暗影箭"] = 9,
		["快速射击"] = 3,
		["断筋"] = 1,
		["复活宠物"] = 3,
		["血之狂热"] = 1,
		["正义审判"] = 2,
		["命令圣印"] = 2,
		["正义圣印"] = 2,
		["圣洁光环"] = 2,
		["熊形态"] = 11,
		["宁静"] = 11,
		["复活术"] = 5,
		["缴械"] = "斯尼德 <斯尼德的伐木机>",
		["反击风暴"] = 1,
		["狂暴姿态"] = 1,
		["精神鞭笞"] = 5,
		["熔铁之水"] = "基尔尼格",
		["破甲攻击"] = 1,
		["变形术"] = 8,
		["保护祝福"] = 2,
		["闪电链"] = "哈姆霍克",
		["栗色马"] = 4,
		["奥术智慧"] = 8,
		["惩击"] = 5,
		["治疗宠物"] = 3,
		["惩罚光环"] = 2,
		["猛击"] = 1,
		["野性印记"] = 11,
		["雄鹰守护"] = 3,
		["火焰冲击"] = 8,
		["速效毒药"] = 4,
		["瞄准射击"] = 3,
		["法力护盾"] = 8,
		["纠缠根须"] = 11,
		["追踪人型生物"] = 3,
		["熔化矿石"] = "地精工匠",
		["冲锋"] = 1,
		["防御姿态"] = 1,
		["力量"] = 11,
		["敏捷"] = 1,
		["复仇"] = 1,
		["盾击"] = 1,
		["绞喉"] = 1,
		["进食"] = 1,
		["血帆鹦鹉"] = "迪菲亚海盗",
		["战斗怒吼"] = 1,
		["驱散魔法"] = 5,
		["冲锋击昏"] = 1,
		["暗影易伤"] = 5,
		["猎豹守护"] = 3,
		["感染之伤"] = "迪菲亚俘虏",
		["圣光闪现"] = 2,
		["盾牌猛击"] = "卡姆·深怒",
		["暗言术：痛"] = 5,
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		["急速射击"] = 3,
		["精灵之火"] = 11,
		["横扫攻击"] = 1,
		["撕裂"] = 1,
		["乱舞"] = 1,
		["毒蝎钉刺"] = 3,
		["神圣新星"] = 5,
		["审判"] = 2,
		["刺穿护甲"] = "迪菲亚矿工",
		["命令审判"] = 2,
		["智力"] = 5,
		["智慧祝福"] = 2,
		["毒性鱼叉"] = "绿皮队长",
		["怒不可遏"] = 1,
		["猫鼬撕咬"] = 3,
		["Falling"] = "环境伤害 (坠落)",
		["拦截"] = 1,
		["刺骨"] = 4,
		["槌击"] = 11,
		["野兽之眼"] = 3,
		["神圣之火"] = 5,
		["!Autoshot"] = 1,
		["缓落术"] = 8,
		["心灵震爆"] = 5,
		["冰霜陷阱"] = 3,
		["心灵尖啸"] = 5,
		["弩射击"] = 1,
		["魔法抑制"] = 8,
		["奥术飞弹"] = 8,
		["凿击"] = 4,
		["暴风雪"] = 8,
		["冰甲术"] = 8,
		["造水术"] = 8,
		["战斗姿态"] = 1,
		["圣疗术"] = 2,
		["热麦酒"] = 1,
		["挫志咆哮"] = 11,
		["冒险等待着你"] = 1,
		["惩戒痛击"] = 1,
		["脚踢 - 沉默"] = 4,
		["月火术"] = 11,
		["炉石"] = 3,
		["辩护"] = 2,
		["束缚亡灵"] = 5,
		["痛苦诅咒"] = 9,
		["灵魂石复活"] = 9,
		["拦截昏迷"] = 1,
		["拳击"] = 1,
		["奉献"] = 2,
		["炽热火焰"] = 4,
		["吸血鬼的拥抱"] = 5,
		["重拳先生践踏"] = "重拳先生",
		["十字军圣印"] = 2,
		["猎豹形态"] = 11,
		["传送：铁炉堡"] = 8,
		["次级护甲"] = 5,
		["愤怒"] = 11,
		["扰乱之痛"] = "斯尼德的伐木机",
		["纯净术"] = 2,
		["致盲"] = 4,
		["死亡之愿"] = 1,
		["烟雾弹"] = "巴基尔·斯瑞德",
		["喂养宠物"] = 3,
		["破胆怒吼"] = 1,
		["回春术"] = 11,
		["旋风斩"] = 1,
		["冰冻陷阱效果"] = 3,
		["急救"] = 1,
		["恐惧术"] = 9,
		["冰霜陷阱光环"] = 3,
		["虔诚光环"] = 2,
		["野猪冲锋"] = 1,
		["闪现术"] = 8,
		["水下呼吸"] = 1,
		["渐隐术"] = 5,
		["眩晕"] = 3,
		["圣光术"] = 2,
		["次级力量"] = 1,
		["次级治疗术"] = 5,
		["耐力"] = 1,
		["撕扯"] = 11,
		["精神分流"] = 5,
		["血性狂暴"] = 1,
		["背刺"] = 4,
		["还击"] = 4,
		["破甲"] = 4,
		["反手一击"] = "迪菲亚罪犯",
		["驱邪术"] = 2,
		["疾跑"] = 4,
		["游荡瘟疫"] = 3,
		["奥术射击"] = 3,
		["祛病术"] = 5,
		["创造占卜之碗"] = 1,
		["绝望祷言"] = 5,
		["偷袭"] = 4,
		["撕咬"] = 1,
		["多重射击"] = 3,
		["治疗之触"] = 11,
		["肾击"] = 4,
		["低吼"] = 1,
		["奥术冲击"] = 1,
		["拉克佐猛击"] = "拉克佐",
		["魔甲术"] = 9,
		["吸取灵魂"] = 9,
		["心灵专注"] = 5,
		["斩杀"] = 1,
		["无荣誉目标"] = 1,
		["献祭"] = 9,
		["麻痹毒药"] = 4,
		["十字军审判"] = 2,
		["穿刺射击"] = "迪菲亚工头",
		["枪械射击"] = 4,
		["治疗术"] = 5,
		["召唤宠物"] = 3,
		["胁迫"] = 3,
		["!Melee"] = 1,
		["摔绊"] = 3,
		["力量祝福"] = 2,
		["范克里夫的盟友"] = "艾德温·范克里夫",
		["消失"] = 4,
		["嗜血术"] = "哈姆霍克",
		["魔爆术"] = 8,
		["顺劈斩"] = "地精木匠",
		["光明圣印"] = 2,
		["猛禽一击"] = 3,
		["剥皮"] = 11,
		["激怒"] = 11,
		["腐蚀术"] = 9,
		["恶魔皮肤"] = 9,
	},
	["encounter_spell_pool"] = {
		["酸液溅射"] = {
			0, -- [1]
			"曲奇", -- [2]
		},
		["斧类武器投掷"] = {
			0, -- [1]
			"地精木匠", -- [2]
		},
		["射击"] = {
			0, -- [1]
			"迪菲亚哨兵", -- [2]
		},
		["熔化矿石"] = {
			0, -- [1]
			"地精工匠", -- [2]
		},
		["冰霜新星"] = {
			0, -- [1]
			"迪菲亚塑风师", -- [2]
		},
		["毒性鱼叉"] = {
			0, -- [1]
			"绿皮队长", -- [2]
		},
		["召唤遥控傀儡"] = {
			0, -- [1]
			"地精工程师", -- [2]
		},
		["缴械"] = {
			0, -- [1]
			"斯尼德 <斯尼德的伐木机>", -- [2]
		},
		["熔铁之水"] = {
			0, -- [1]
			"基尔尼格", -- [2]
		},
		["拉克佐猛击"] = {
			0, -- [1]
			"拉克佐", -- [2]
		},
		["战斗怒吼"] = {
			0, -- [1]
			"迪菲亚叛军", -- [2]
		},
		["撕裂"] = {
			0, -- [1]
			"迪菲亚狱友", -- [2]
		},
		["挫志怒吼"] = {
			0, -- [1]
			"迪菲亚叛军", -- [2]
		},
		["反手一击"] = {
			0, -- [1]
			"迪菲亚罪犯", -- [2]
		},
		["闪电链"] = {
			0, -- [1]
			"哈姆霍克", -- [2]
		},
		["痛击"] = {
			0, -- [1]
			"重拳先生", -- [2]
		},
		["消隐"] = {
			0, -- [1]
			"迪菲亚黑衣卫兵", -- [2]
		},
		["烟雾弹"] = {
			0, -- [1]
			"巴基尔·斯瑞德", -- [2]
		},
		["弹出斯尼德"] = {
			0, -- [1]
			"斯尼德的伐木机", -- [2]
		},
		["重拳先生践踏"] = {
			0, -- [1]
			"重拳先生", -- [2]
		},
		["防御姿态"] = {
			0, -- [1]
			"卡姆·深怒", -- [2]
		},
		["恐吓"] = {
			0, -- [1]
			"斯尼德的伐木机", -- [2]
		},
		["范克里夫的盟友"] = {
			0, -- [1]
			"艾德温·范克里夫", -- [2]
		},
		["冰冻"] = {
			0, -- [1]
			"迪菲亚塑风师", -- [2]
		},
		["狂怒"] = {
			0, -- [1]
			"可怕的塔格尔", -- [2]
		},
		["打击"] = {
			0, -- [1]
			"迪克斯特·瓦德", -- [2]
		},
		["顺劈斩"] = {
			0, -- [1]
			"地精木匠", -- [2]
		},
		["扰乱之痛"] = {
			0, -- [1]
			"斯尼德的伐木机", -- [2]
		},
		["盾牌猛击"] = {
			0, -- [1]
			"卡姆·深怒", -- [2]
		},
		["!Melee"] = {
			0, -- [1]
			"拉克佐", -- [2]
		},
		["嗜血术"] = {
			0, -- [1]
			"哈姆霍克", -- [2]
		},
		["破胆怒吼"] = {
			0, -- [1]
			"迪克斯特·瓦德", -- [2]
		},
		["火焰冲击"] = {
			0, -- [1]
			"迪菲亚塑风师", -- [2]
		},
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
	},
	["__profiles"] = {
		["特变电工-鱼人摩洛克"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["time_type_original"] = 2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -520.9999389648438,
							["x"] = -419.0000610351563,
							["w"] = 310.0000610351563,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["skin_custom"] = "",
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
					},
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["textAlign"] = 0,
								["timeType"] = 1,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["switch_damager_in_combat"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["show_statusbar"] = false,
					["hide_in_combat_alpha"] = 0,
					["menu_icons_size"] = 0.850000023841858,
					["bars_inverted"] = false,
					["libwindow"] = {
						["y"] = 5.470979158417322e-05,
						["x"] = -419.0001220703125,
						["point"] = "BOTTOM",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["stretch_button_side"] = 1,
					["bars_grow_direction"] = 1,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["backdrop_texture"] = "Details Ground",
					["bars_sort_direction"] = 1,
					["grab_on_top"] = false,
					["switch_tank_in_combat"] = false,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["auto_current"] = true,
					["version"] = 3,
					["clickthrough_rows"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["textR_bracket"] = "(",
						["font_size"] = 16,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["use_spec_icons"] = false,
						["texture_custom"] = "",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["percent_type"] = 1,
						["textL_outline_small"] = true,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["textR_outline_small"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_enable_custom_text"] = false,
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["texture_custom_file"] = "Interface\\",
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -520.9999389648438,
							["x"] = -419.0000610351563,
							["w"] = 310.0000610351563,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["plugins_grow_direction"] = 1,
					["switch_tank"] = false,
					["show_sidebars"] = false,
					["micro_displays_locked"] = true,
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["overall_clear_logout"] = false,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["overall_flag"] = 16,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["broadcaster_enabled"] = false,
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["animation_speed_triggertravel"] = 5,
			["trash_auto_remove"] = true,
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["minimum_combat_time"] = 5,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["clear_ungrouped"] = true,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
		},
	},
	["disable_talent_feature"] = false,
	["spell_school_cache"] = {
		["打击"] = 1,
		["!Melee"] = 1,
		["火焰冲击"] = 4,
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_size"] = 12,
		["damage_taken_shadow"] = true,
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["data_sync"] = false,
	["mobs_data"] = {
	},
	["run_code"] = {
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["report_where"] = "SAY",
	["createauraframe"] = {
	},
	["global_plugin_database"] = {
	},
	["realm_sync"] = true,
	["mobs_data_compiled"] = {
	},
	["item_level_pool"] = {
		["Player-5458-02F6D2A3"] = {
			["time"] = 1638291745,
			["name"] = "特变电工",
			["ilvl"] = 0,
		},
		["Player-5458-02FE01DE"] = {
			["name"] = "安媞",
			["time"] = 1638282253,
			["ilvl"] = 0,
		},
	},
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["update_warning_timeout"] = 10,
	["plugin_window_pos"] = {
		["y"] = 1.52587890625e-05,
		["x"] = 0,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["raid_data"] = {
	},
	["tutorial"] = {
		["unlock_button"] = 0,
		["main_help_button"] = 44,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["logons"] = 44,
		["MIN_COMBAT_TIME"] = true,
		["version_announce"] = 0,
		["ctrl_click_close_tutorial"] = false,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["bookmark_tutorial"] = false,
		["STREAMER_PLUGIN_FIRSTRUN"] = true,
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["switchSaved"] = {
		["slots"] = 4,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
		},
	},
	["savedTimeCaptures"] = {
	},
	["latest_news_saw"] = "",
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["name"] = "有使用药水",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["attribute"] = false,
			["script_version"] = 5,
		}, -- [1]
		{
			["source"] = false,
			["total_script"] = false,
			["author"] = "Details! Team",
			["percent_script"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["spellid"] = false,
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["attribute"] = false,
			["script_version"] = 15,
		}, -- [2]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "				\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["spellid"] = false,
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [3]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "				\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["spellid"] = false,
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the crowd control amount for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["spellid"] = false,
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the amount of crowd control received for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["spellid"] = false,
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [6]
		{
			["source"] = false,
			["desc"] = "在统计中显示你的技能.",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["total_script"] = "local value, top, total, combat, instance = ...\n			local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n			local percent = string.format (\"%.1f\", value/total*100)\n\n			return math.floor (value) .. \" (\" .. dps .. \", \" .. percent .. \"\"",
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["spellid"] = false,
			["name"] = "我的技能",
			["tooltip"] = "				--config:\n				--Background RBG and Alpha:\n				local R, G, B, A = 0, 0, 0, 0.75\n				local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n				\n				--get the parameters passed\n				local spell, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GC = GameCooltip\n				GC:SetOption (\"YSpacingMod\", 2)\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				\n				if (spell.n_dmg) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					local debuff_uptime_total, cast_string = \"\", \"\"\n					local misc_actor = instance.showing (4, _detalhes.playername)\n					if (misc_actor) then\n						local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n						if (debuff_uptime) then\n							debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n						end\n						\n						local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n						\n						if (not spell_cast and misc_actor.spell_cast) then\n							local spellname = GetSpellInfo (spell.id)\n							for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n								local casted_spellname = GetSpellInfo (casted_spellid)\n								if (casted_spellname == spellname) then\n									spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n								end\n							end\n						end\n						if (not spell_cast) then\n							spell_cast = \"(|cFFFFFF00?|r)\"\n						end\n						cast_string = cast_string .. spell_cast\n					end\n					\n					--Cooltip code\n					GC:AddLine (\"Casts:\", cast_string or \"?\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (debuff_uptime_total ~= \"\") then\n						GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n						GC:AddStatusBar (100, 1, R, G, B, A)\n						GC:AddIcon (\"\", 1, 1, 1, 16)\n					end\n					\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local n_average = spell.n_dmg / spell.n_amt\n					local T = (combat_time*spell.n_dmg)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_dmg/spell.c_amt\n						local T = (combat_time*spell.c_dmg)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_dmg / T\n						\n						GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n				elseif (spell.n_curado) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					--Cooltip code\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local n_average = spell.n_curado / spell.n_amt\n					local T = (combat_time*spell.n_curado)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_curado/spell.c_amt\n						local T = (combat_time*spell.c_curado)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_curado / T\n						\n						GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n				end\n\n			",
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 9,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["name"] = "对骷髅标记目标造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 4,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["name"] = "对其它标记目标造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 4,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show overall damage done on the fly.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n				\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n					local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n					OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n				\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n					s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n					s = ToK (_, value) .. \" (\" .. s\n				end\n				\n				return s\n			",
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["spellid"] = false,
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n				\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				local AllSpells = {}\n				\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = spellTable.total\n					end\n				end\n				\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = (AllSpells [spellName] or 0) + (spellTable.total or 0)\n					end\n				end\n				\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n					tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n				\n				local format_func = Details:GetCurrentToKFunction()\n				\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n					local spellID, total = unpack (t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						\n						GameCooltip:AddLine (spellName, format_func (_, total))\n						Details:AddTooltipBackgroundStatusbar()\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n					end\n				end\n			",
			["target"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n				\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				--check if the actor list of overall and current combat is valid\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n					return 0, 0, 0\n				end\n				\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--check if the results from getactorlist is a table and has more than 1 actor on it\n				if (type (damage_container_overall) ~= \"table\") then\n					return 0, 0, 0\n				end\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n					--only player in group\n					if (player and player:IsGroupPlayer()) then\n						instance_container:AddValue (player, player.total)\n					end\n				end\n				\n				--does the player is in combat?\n				--if true need to add the data from the current fight as well\n				if (UnitAffectingCombat(\"player\")) then\n					for _, player in ipairs ( damage_container_current ) do \n						--only player in group\n						if (player and player:IsGroupPlayer()) then\n							instance_container:AddValue (player, player.total)        \n						end\n					end\n				end\n				\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n				\n				--return:\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 6,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["name"] = "对护盾造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["show_totalhitdamage_on_overkill"] = false,
	["lastUpdateWarning"] = 0,
	["always_use_profile"] = false,
}
