
_detalhes_global = {
	["npcid_pool"] = {
		[12236] = "维利塔恩",
		[8318] = "阿塔莱奴隶",
		[1557] = "老迈的迷雾谷猩猩",
		[1561] = "血帆袭击者",
		[1563] = "血帆流氓",
		[1565] = "血帆水手",
		[4249] = "杂毛嚎叫者",
		[397] = "莫甘斯",
		[10717] = "时光寄生虫",
		[4361] = "黑鳍泥浆鱼人",
		[4385] = "枯藤狂暴者",
		[4393] = "酸性沼泽软泥怪",
		[3225] = "野猪",
		[4417] = "迪菲亚工头",
		[3249] = "哈达斯 <天帝龍魂>",
		[8910] = "炽热火焰卫士",
		[4465] = "邪枝标枪手",
		[6520] = "灼热元素",
		[4505] = "血帆桨手",
		[412] = "缝合怪",
		[1653] = "血帆大法师",
		[9166] = "翼手龙",
		[416] = "匹普亚普",
		[4665] = "火刃老兵",
		[4673] = "怨怒背叛者",
		[422] = "鱼人食腐者",
		[423] = "混血赤脊山豺狼人",
		[424] = "赤脊山偷猎者",
		[13596] = "洛特格里普",
		[426] = "赤脊山蛮兵",
		[1707] = "迪菲亚俘虏",
		[3417] = "活火 <迪菲亚法师>",
		[1711] = "迪菲亚罪犯",
		[1715] = "迪菲亚叛军",
		[1717] = "哈姆霍克",
		[430] = "赤脊山秘法师",
		[431] = "暗皮杀手",
		[1725] = "迪菲亚哨兵",
		[432] = "暗皮蛮兵",
		[1729] = "迪菲亚招魂师",
		[1731] = "地精工匠",
		[434] = "疯狂的暗皮豺狼人",
		[436] = "黑石暗影法师",
		[437] = "黑石叛节者",
		[4969] = "旧城区暴徒",
		[440] = "黑石步兵",
		[7040] = "黑色龙人",
		[1763] = "基尔尼格",
		[442] = "狼蛛",
		[445] = "赤脊山突击队员",
		[446] = "赤脊山猛击者",
		[5089] = "巴鲁斯·加科因",
		[1787] = "骷髅刽子手",
		[1789] = "骷髅侍僧",
		[448] = "霍格",
		[1793] = "腐烂的食尸鬼",
		[449] = "迪菲亚拳匪",
		[452] = "河爪强盗",
		[8319] = "噩梦雏龙",
		[453] = "河爪秘法师",
		[7272] = "殉教者塞卡",
		[456] = "小鱼人智者",
		[7320] = "石窟虐待者",
		[5297] = "老年怒痕雪人",
		[5305] = "乱羽鸣天者",
		[5337] = "憎世海妖",
		[7400] = "灼热图腾 V <仙林爱上土鸡>",
		[5361] = "被缩小的波涛巨人",
		[7432] = "未知目标",
		[5401] = "邪恶的卡萨卡兹",
		[3733] = "亡灵草药师",
		[5425] = "饥饿的疱爪土狼",
		[1871] = "伊莉莎的卫兵",
		[5441] = "哈扎里异种蝎",
		[5465] = "陆地暴怒者",
		[8895] = "铁怒军官",
		[5481] = "灌木露水收集者",
		[8927] = "黑暗尖啸者",
		[473] = "收货人莫根",
		[475] = "狗头人隧道工",
		[476] = "狗头人地卜师",
		[3809] = "灰谷熊",
		[1907] = "纳迦探险者",
		[478] = "河爪豺狼人前锋",
		[9167] = "狂怒的翼手龙",
		[30] = "森林蜘蛛",
		[480] = "饮独醉",
		[5649] = "沙怒饮血者",
		[7728] = "被诅咒的基利斯",
		[485] = "黑石前锋",
		[5713] = "加什尔",
		[5721] = "德姆塞卡尔",
		[13533] = "喷涌幼虫",
		[1961] = "癞爪",
		[7856] = "南海劫掠者",
		[5857] = "灼热熔岩蜘蛛",
		[11790] = "腐烂萨特",
		[3989] = "风险投资公司樵夫",
		[502] = "本尼·布兰科",
		[5993] = "地狱野猪",
		[504] = "迪菲亚捕兽者",
		[6017] = "熔岩喷射图腾 <石窟智者>",
		[505] = "巨型狼蛛",
		[4041] = "炭色石化蜥蜴",
		[10079] = "卫兵穆赫·月角",
		[8120] = "苏利萨斯憎恶",
		[4065] = "黑石哨兵",
		[8136] = "沙尔扎鲁",
		[12206] = "原始巨兽",
		[12222] = "爬行污泥怪",
		[511] = "疯狂的食尸鬼",
		[515] = "鱼人袭击者",
		[517] = "鱼人智者",
		[6185] = "木喉战士",
		[4154] = "盐湖食腐鹫",
		[8336] = "哈卡莱挖掘者",
		[8384] = "神庙深渊潜伏者",
		[8400] = "奥比斯顿",
		[531] = "骸骨魔",
		[533] = "夜行织影狼人",
		[539] = "小型结网毒蜘蛛",
		[2158] = "砂石斥候",
		[6377] = "雷首翼鹿",
		[2170] = "黑木巨熊怪",
		[2178] = "哀嚎的贵族",
		[4362] = "黑鳍滩行鱼人",
		[4378] = "暗雾独行蛛",
		[4402] = "污壳硬爪龙虾人",
		[2206] = "灰雾猎人",
		[4418] = "迪菲亚巫师",
		[8896] = "暗炉农夫",
		[8912] = "暮光之锤拷问者",
		[4466] = "邪枝割颅者",
		[6521] = "有生烈焰",
		[2242] = "辛迪加间谍",
		[2246] = "辛迪加刺客",
		[2250] = "山岭雪人",
		[6553] = "格里什劫掠者",
		[565] = "疯狂的恐狼",
		[9056] = "弗诺斯·达克维尔",
		[568] = "暗皮战士",
		[569] = "绿色独行蛛",
		[570] = "食脑者",
		[36] = "麦田傀儡",
		[2306] = "巴隆·瓦杜斯",
		[579] = "暗皮刺客",
		[580] = "赤脊山苦工",
		[4666] = "火刃魔仆",
		[4674] = "怨怒巡影者",
		[587] = "血顶战士",
		[588] = "血顶斥候",
		[2354] = "邪恶的灰熊",
		[590] = "迪菲亚强夺者",
		[2374] = "碎鳍泥浆鱼人",
		[595] = "血顶猎人",
		[597] = "血顶狂战士",
		[598] = "迪菲亚矿工",
		[2406] = "山地狮",
		[604] = "瘟疫食尸鬼",
		[9680] = "火浪杀手",
		[4850] = "石窟潜伏者",
		[6913] = "失落裂隙行者",
		[11791] = "腐烂欺骗者",
		[2462] = "食腐虫",
		[619] = "迪菲亚咒术师",
		[622] = "地精工程师",
		[623] = "骷髅矿工",
		[7033] = "火腹食人魔",
		[7041] = "火鳞龙人",
		[626] = "工头希斯耐特",
		[628] = "黑色破坏者",
		[2530] = "耶尼库",
		[2534] = "流亡者赞吉尔",
		[12207] = "塞萨拉多头怪",
		[12223] = "洞窟潜伏者",
		[12239] = "吉尔克",
		[40] = "狗头人矿工",
		[2562] = "石拳食人魔",
		[642] = "斯尼德的伐木机",
		[643] = "斯尼德 <斯尼德的伐木机>",
		[2574] = "枯须掘地工",
		[645] = "曲奇",
		[646] = "重拳先生",
		[2586] = "辛迪加路霸",
		[2590] = "辛迪咒术师",
		[8337] = "黑铁塑钢师",
		[5226] = "黑暗虫",
		[5234] = "戈杜尼虐待者",
		[657] = "迪菲亚海盗",
		[2630] = "地缚图腾 <兰州拉面>",
		[8497] = "未知目标",
		[2650] = "枯木狂热者",
		[667] = "劈颅战士",
		[669] = "劈颅猎人",
		[670] = "劈颅巫医",
		[5362] = "北泉鹰身人",
		[672] = "劈颅逐灵者",
		[674] = "风险投资公司露天矿工",
		[675] = "风险投资公司工头",
		[676] = "风险投资公司勘探员",
		[677] = "风险投资公司修理工",
		[5426] = "疱爪土狼",
		[2718] = "火烟萨满祭司",
		[681] = "荆棘谷猛虎幼崽",
		[682] = "荆棘谷猛虎",
		[683] = "猎豹幼崽",
		[10928] = "魅魔",
		[5474] = "砂槌蛮兵",
		[8913] = "暮光使者",
		[5490] = "长瘤的灌木兽",
		[688] = "石喉蜥蜴",
		[689] = "晶背蜥蜴",
		[690] = "冷眼蜥蜴",
		[2762] = "雷霆流放者",
		[9025] = "洛考尔",
		[694] = "血顶掷斧者",
		[696] = "劈颅掷斧者",
		[697] = "血顶萨满祭司",
		[698] = "血顶猛虎 <血顶兽王>",
		[699] = "血顶兽王",
		[701] = "血顶秘法师",
		[702] = "血顶食腐者",
		[5618] = "废土强盗",
		[5650] = "沙怒巫医",
		[2830] = "秃鹫",
		[709] = "莫什奥格好战者",
		[712] = "赤脊山鞭笞者",
		[5714] = "洛若尔",
		[7769] = "未知目标",
		[7785] = "祖穆拉恩结界 <巫医祖穆拉恩>",
		[11552] = "木喉秘法师",
		[2894] = "石窟萨满祭司",
		[9537] = "霍尔雷·黑须",
		[2906] = "火烟战士",
		[728] = "巴尔瑟拉",
		[729] = "辛达尔",
		[730] = "泰希斯",
		[731] = "豹",
		[5850] = "炽热元素",
		[5858] = "巨型熔岩蜘蛛",
		[9681] = "贾兹",
		[46] = "鱼人强盗",
		[736] = "黑豹",
		[2946] = "赫尔库拉的傀儡",
		[11792] = "腐烂巡影者",
		[740] = "翠绿幼龙",
		[741] = "睡梦雏龙",
		[742] = "绿色龙族",
		[750] = "沼泽喷墨鱼人",
		[751] = "沼泽食腐鱼人",
		[752] = "沼泽鱼人智者",
		[756] = "劈颅黑豹",
		[757] = "失落者渔夫",
		[6066] = "陷地 <血顶巫医>",
		[760] = "失落定居者",
		[761] = "失落者先知",
		[762] = "失落寻隙者",
		[764] = "沼泽漫步者",
		[765] = "沼泽漫步者长老",
		[12240] = "考尔克",
		[767] = "沼泽虎",
		[768] = "暗影黑豹",
		[4107] = "风巢双足飞龙",
		[772] = "荆棘谷雌虎",
		[4139] = "恐蝎",
		[4147] = "盐石蜥蜴",
		[780] = "劈颅秘法师",
		[781] = "劈颅猎头者",
		[782] = "劈颅斥候",
		[783] = "劈颅狂战士",
		[785] = "骷髅看守",
		[787] = "骷髅医师",
		[8658] = "胡库的小鬼",
		[6386] = "赞吉尔结界 <流亡者赞吉尔>",
		[10737] = "希洛塔姆",
		[4355] = "血沼镰爪龙",
		[4363] = "黑鳍智者",
		[4387] = "枯藤沼泽兽",
		[4411] = "暗牙潜伏者",
		[813] = "库尔森上校",
		[814] = "玛尔苏斯中士",
		[4467] = "邪枝占卜者",
		[819] = "伊尔加拉的仆从",
		[6554] = "格里什毒刺蝎",
		[9026] = "征服者派隆",
		[822] = "森林熊幼崽",
		[824] = "迪菲亚掘地工",
		[832] = "尘魔",
		[833] = "山狗首领",
		[834] = "山狗",
		[4667] = "火刃暗影法师",
		[4675] = "怨怒唤魔者",
		[13456] = "未知目标 <诺克赛恩>",
		[3382] = "南海炮兵",
		[4723] = "工头考兹尔",
		[11521] = "科多幽灵",
		[9554] = "持铁锤的顾客",
		[855] = "幼年荆棘谷迅猛龙",
		[13696] = "诺克赛恩幼体",
		[858] = "沼泽纺丝蛛",
		[861] = "斯通纳德斥候",
		[4851] = "石窟嚼石者",
		[11777] = "暗影碎片巡游者",
		[11793] = "塞雷布拉斯树妖",
		[871] = "盐鳞战士",
		[873] = "盐鳞智者",
		[875] = "盐鳞首领",
		[9938] = "玛格姆斯",
		[880] = "埃尔兰·杜德摩尔",
		[7098] = "猫头鹰",
		[12225] = "被诅咒的塞雷布拉斯",
		[12241] = "玛格拉",
		[898] = "夜行狼人",
		[12369] = "科拉加鲁",
		[7226] = "未知目标 <古代的石头看守者>",
		[905] = "利齿狂鱼",
		[909] = "迪菲亚夜贼",
		[910] = "迪菲亚附魔师",
		[8419] = "暮光崇拜者",
		[7290] = "暗炉狙击手",
		[5259] = "阿塔莱巫医",
		[5267] = "阿塔莱行尸",
		[3662] = "被憎恨的德玛尼斯",
		[5283] = "噩梦游荡者",
		[5291] = "哈卡莱霜翼飞蛇",
		[5299] = "残忍的怒痕雪人",
		[920] = "夜行堕落狼人",
		[921] = "风险投资公司伐木工",
		[923] = "黑色破坏者幼崽",
		[8675] = "地狱兽",
		[930] = "小型黑寡妇蜘蛛",
		[10802] = "守护者希坦亚",
		[3730] = "暗滩挖掘者",
		[3734] = "亡灵暴徒",
		[5427] = "疯狂的疱爪土狼",
		[937] = "库尔森丛林战士",
		[938] = "库尔森特种兵",
		[939] = "库尔森精英",
		[940] = "库尔森药草师",
		[941] = "库尔森精神医师",
		[942] = "库尔森巫医",
		[943] = "库尔森驯兽师",
		[946] = "霜鬃巨魔新兵",
		[948] = "腐烂者",
		[949] = "食腐独行蛛",
		[5643] = "泰拉尼斯·玛雷姆",
		[5715] = "胡库",
		[7786] = "未知目标",
		[976] = "库尔森战虎",
		[977] = "库尔森战豹",
		[978] = "库尔森副首领",
		[979] = "库尔森暗影猎手",
		[7858] = "南海流氓",
		[5843] = "奴隶工",
		[11714] = "玛洛什",
		[9683] = "拉克维的配偶",
		[11778] = "暗影碎片击碎者",
		[11794] = "塞雷布拉斯的姐妹",
		[4006] = "深苔结网蛛",
		[4022] = "血怒鹰身人",
		[1007] = "藓皮豺狼人",
		[1008] = "樱桃肉丸子",
		[1009] = "藓皮织雾者",
		[4038] = "燃烧的破坏者",
		[1011] = "藓皮捕兽者",
		[1012] = "藓皮蛮兵",
		[1014] = "藓皮突击队员",
		[1015] = "高地迅猛龙",
		[4062] = "黑铁投弹手",
		[1017] = "高地镰爪龙",
		[8138] = "苏利萨斯幼崽",
		[1020] = "杂斑迅猛龙",
		[1021] = "杂斑尖啸龙",
		[12242] = "玛拉多斯",
		[12258] = "锐刺鞭笞者",
		[1024] = "蓝腮鱼人",
		[4100] = "尖啸鹰身人",
		[1028] = "蓝腮泥浆鱼人",
		[1030] = "黑色泥浆怪",
		[4124] = "千针石林山狮",
		[1034] = "龙喉袭击者",
		[2071] = "月夜雌虎",
		[6195] = "恶鞭海妖",
		[1040] = "沼泽爬行者",
		[8324] = "阿塔莱骷髅 <阿塔莱高阶祭司>",
		[4196] = "异种蝎群",
		[2103] = "龙喉斥候",
		[1054] = "黑铁爆破手",
		[8580] = "阿塔拉利恩",
		[8596] = "瘟疫幼犬",
		[2159] = "砂石断骨者",
		[2163] = "蓟熊",
		[2167] = "黑木探路者",
		[2171] = "黑木萨满祭司",
		[2179] = "雷鳞御浪者",
		[1096] = "风险投资公司地质学家",
		[4388] = "幼年黑色蛇颈龙",
		[2203] = "灰雾先知",
		[2207] = "灰雾智者",
		[1110] = "骷髅袭击者",
		[1114] = "丛林大猩猩",
		[8932] = "钻孔甲虫",
		[6523] = "黑铁火枪手",
		[2243] = "辛迪加哨兵",
		[1124] = "霜鬃暗法师",
		[8996] = "虚空行者",
		[2255] = "寒冰箭",
		[9028] = "格里兹尔",
		[1144] = "莫什奥格巫医",
		[13282] = "诺克赛恩",
		[1152] = "钳嘴鳄鱼",
		[1158] = "被诅咒的水兵",
		[2319] = "辛迪加巫师",
		[1162] = "碎石怪斥候",
		[1166] = "碎石怪先知",
		[2339] = "暮光暴徒",
		[4684] = "地狱巫女",
		[4692] = "恐怖飞扑者",
		[9396] = "震地者",
		[1178] = "莫格罗什食人魔",
		[4716] = "滑刃潮行者",
		[2371] = "刺脊海妖",
		[2375] = "碎鳍滩行鱼人",
		[11555] = "独眼高恩",
		[1196] = "冰爪熊",
		[1200] = "摩本特·费尔",
		[1202] = "坑道鼠狗头人",
		[2407] = "巨型山地狮",
		[1210] = "卓克苏尔",
		[4844] = "暗炉勘探员",
		[4852] = "石窟智者",
		[2431] = "看守员博胡恩",
		[1222] = "黑铁工兵",
		[2447] = "纳瑞尔拉萨斯",
		[1236] = "狗头人掘地工",
		[7011] = "土灵碎岩者",
		[9956] = "暗炉持火者",
		[10036] = "蕨墙执行者",
		[1258] = "巨型黑色破坏者",
		[7091] = "暗炉伏击者",
		[2531] = "莫甘斯的爪牙 <莫甘斯>",
		[2535] = "“畸形足”玛雷·维尔金斯",
		[1270] = "恶臭的食尸鬼",
		[2547] = "艾隆帕",
		[12243] = "温格",
		[2555] = "枯木巫医",
		[2559] = "高地阔步龙",
		[2563] = "平原狼蛛",
		[2587] = "辛迪加巡路者",
		[2591] = "辛迪加占星师",
		[2595] = "刺脊袭击者",
		[2599] = "奥图",
		[7267] = "乌克兹·沙顶",
		[7275] = "暗影祭司塞瑟斯",
		[2619] = "落锤步兵",
		[7291] = "加加恩·火锤",
		[2635] = "老海鳄",
		[2639] = "邪枝掷斧者",
		[2643] = "邪枝狂战士",
		[5292] = "深痕雪人",
		[2651] = "枯木剥皮者",
		[2655] = "绿色淤泥怪",
		[10644] = "巴拉巴拉",
		[10660] = "深蓝龙崽",
		[5364] = "北泉杀戮者",
		[5420] = "晶鳞凝视者",
		[5428] = "大鹏",
		[2723] = "石头傀儡",
		[2727] = "峭壁山狗",
		[2731] = "山脊巡行者",
		[2735] = "次级石元素",
		[2739] = "暗炉隧道工",
		[2743] = "暗炉战士",
		[10996] = "英雄之魂",
		[2759] = "赫玛图斯",
		[2775] = "刺脊掠夺者",
		[2783] = "玛雷兹·考尔",
		[1400] = "湿地鳄鱼",
		[2831] = "巨型秃鹫",
		[1418] = "蓝腮袭击者",
		[5708] = "哈卡的后代",
		[5716] = "祖罗尔",
		[7787] = "沙怒奴隶",
		[7795] = "水占师维蕾萨",
		[7803] = "沙漠掘洞蝎",
		[9477] = "克隆软泥怪 <原生软泥怪>",
		[9541] = "黑须的亲信",
		[2907] = "火烟秘法师",
		[5828] = "梅川内酷",
		[2919] = "法姆雷托守护者",
		[2923] = "癞皮银鬃狼",
		[5852] = "地狱元素",
		[5860] = "暮光黑暗萨满祭司",
		[92] = "石元素",
		[7995] = "邪恶祭司海克斯",
		[1490] = "赞吉尔巫医",
		[1492] = "高拉什",
		[5988] = "厚甲毒刺蝎",
		[6004] = "魔誓祭司",
		[1514] = "野蛮的莫克",
		[1516] = "康达",
		[95] = "迪菲亚走私者",
		[6116] = "上层精灵的幻影",
		[8179] = "强效治疗结界 <沙怒巫医>",
		[4101] = "尖啸游荡者",
		[4109] = "雄性风巢飞龙",
		[4117] = "风蛇",
		[6188] = "木喉萨满祭司",
		[6196] = "恶鞭侍从",
		[10373] = "萨巴克希斯",
		[1558] = "银背雌猩猩",
		[1562] = "血帆法师",
		[1564] = "血帆术士",
		[98] = "河爪监工",
		[8438] = "哈卡莱护血者",
		[8534] = "腐烂的石像鬼",
		[8566] = "黑铁哨兵",
		[10661] = "噬魔龙崽",
		[6388] = "赞吉尔骷髅",
		[4357] = "血沼鞭尾龙",
		[6412] = "骷髅",
		[4389] = "黑色蛇颈龙",
		[4413] = "暗牙蜘蛛",
		[6516] = "安戈洛大猩猩",
		[103] = "加瑞克·帕德弗特",
		[1666] = "卡姆·深怒",
		[9318] = "熏火龙",
		[4685] = "灵能猎犬",
		[4693] = "恐怖飞鸟",
		[9398] = "暮光之锤刽子手",
		[1696] = "可怕的塔格尔",
		[6788] = "雌蓟熊",
		[11557] = "梅罗什",
		[1706] = "迪菲亚囚徒",
		[1708] = "迪菲亚狱友",
		[9622] = "尤尔查",
		[11685] = "玛洛迪祭司",
		[4845] = "暗炉恶棍",
		[1726] = "迪菲亚法师",
		[4861] = "利齿蝙蝠",
		[1732] = "迪菲亚塑风师",
		[3475] = "豹",
		[7012] = "土灵雕刻者",
		[1756] = "奥妮克希亚的精英护卫",
		[7036] = "索瑞森间谍",
		[7044] = "黑色幼龙",
		[7076] = "土灵守护者",
		[14388] = "游荡的黑龙",
		[7228] = "艾隆纳亚",
		[7268] = "沙怒守护者",
		[114] = "看守傀儡",
		[5253] = "木爪蛮兵",
		[5261] = "被奴役的阿塔莱巨魔",
		[5269] = "阿塔莱祭司",
		[5277] = "噩梦刃鳞龙人",
		[5293] = "暴怒的巨型深痕雪人",
		[115] = "收割傀儡",
		[5333] = "憎世毒蛇守卫",
		[7396] = "土灵破石者",
		[116] = "迪菲亚强盗",
		[1860] = "格拉克诺斯",
		[3727] = "暗滩执行者",
		[5429] = "火鹏",
		[5453] = "哈扎里掘洞蝎",
		[5461] = "海元素",
		[5477] = "木棒诺博鲁",
		[5485] = "灌木塑根者",
		[118] = "觅食的灰狼",
		[8983] = "傀儡统帅阿格曼奇",
		[9031] = "阿努希尔",
		[13141] = "深腐践踏者",
		[7604] = "布莱中士",
		[3823] = "幽爪奔跑者",
		[7668] = "拉瑟莱克的仆从",
		[1922] = "森林灰狼",
		[121] = "迪菲亚巡路者",
		[5709] = "伊兰尼库斯的阴影",
		[5717] = "米杉",
		[7788] = "沙怒苦工",
		[122] = "迪菲亚路霸",
		[3903] = "灼热图腾 III",
		[11558] = "克尔达",
		[9543] = "雷布里·斯库比格特",
		[3947] = "地精造船师",
		[5853] = "温和的作战傀儡",
		[5861] = "暮光火焰卫士",
		[124] = "河爪蛮兵",
		[11782] = "琥珀碎片毁灭者",
		[3991] = "风险投资公司砍树工",
		[7996] = "守护者奇尔加",
		[4007] = "深苔毒蜘蛛",
		[126] = "滩行鱼人",
		[127] = "潮行鱼人",
		[6093] = "蛀牙杰克",
		[8156] = "未知目标 <安图苏尔>",
		[6117] = "上层精灵鬼巫",
		[6125] = "哈达尔萨特",
		[4110] = "雌性风巢飞龙",
		[4118] = "毒性风蛇",
		[6189] = "木喉巨熊怪",
		[4150] = "盐石凝视者",
		[4158] = "盐湖秃鹫",
		[8440] = "哈卡的化身",
		[8504] = "黑铁斥候",
		[8600] = "瘟疫蝙蝠",
		[2156] = "破损的傀儡",
		[2160] = "砂石地占师",
		[2164] = "狂暴蓟熊",
		[2168] = "黑木战士",
		[4342] = "尘泥锐爪鳄鱼",
		[2176] = "被诅咒的贵族",
		[2180] = "雷鳞海妖",
		[2204] = "灰雾撒网者",
		[2208] = "灰雾潮行者",
		[2212] = "戴瑟雷萨特",
		[8904] = "暗炉议员",
		[4462] = "黑石猎人",
		[6517] = "焦油兽",
		[2240] = "辛迪加劫匪",
		[2248] = "洞穴雪人",
		[2252] = "破碎岭食人魔",
		[6557] = "原生软泥怪",
		[9032] = "爬行者赫杜姆",
		[13142] = "深腐纠缠者",
		[6669] = "机械打手4100型",
		[2320] = "纳伽兹",
		[2324] = "黑木风语者",
		[4670] = "怨怒潜行者",
		[6733] = "石窟猛击者",
		[2356] = "老灰熊",
		[4726] = "暴怒的雷霆蜥蜴",
		[2368] = "刺脊捕猎者",
		[6789] = "蓟熊幼崽",
		[2376] = "碎鳍智者",
		[11559] = "玛格拉姆通灵师",
		[2384] = "饥饿的山地狮",
		[13718] = "无名预言者",
		[11687] = "鬼魅袭击者",
		[4846] = "暗炉掘地工",
		[4854] = "格瑞姆洛克",
		[11783] = "瑟莱德丝碎片",
		[154] = "大碎尸鸟",
		[4966] = "亨德尔下士",
		[10040] = "格里什虫巢卫士",
		[7077] = "土灵筑厅师",
		[2520] = "遥控傀儡 <地精工程师>",
		[10120] = "宝库护卫者",
		[2536] = "火柴棍乔乔",
		[2548] = "尼哈鲁船长",
		[2556] = "枯木猎头者",
		[2572] = "枯须狗头人",
		[2580] = "老山地秃鹰",
		[2588] = "辛迪加潜伏者",
		[2592] = "顽石流放者",
		[2596] = "刺脊巫师",
		[5238] = "戈杜尼军官",
		[5254] = "木爪秘法师",
		[5262] = "格罗多克大猩猩",
		[5270] = "阿塔莱食尸者",
		[2640] = "邪枝巫医",
		[5286] = "长牙奔跑者",
		[2648] = "邪枝精英卫兵",
		[2652] = "枯木毒血巨魔",
		[2656] = "玉石软泥怪",
		[2676] = "微型收割机",
		[2680] = "邪枝狼崽",
		[5366] = "北泉唤风者",
		[5422] = "沙漠猎食蝎",
		[2716] = "火烟猎龙者",
		[2728] = "野生峭壁山狗",
		[5462] = "巨型海元素",
		[2736] = "巨型石元素",
		[2740] = "暗炉巫师",
		[8921] = "血犬",
		[2748] = "阿扎达斯",
		[2760] = "烈焰流放者",
		[9017] = "伊森迪奥斯",
		[9033] = "安格弗将军",
		[2776] = "复仇巨浪",
		[7605] = "拉文",
		[5622] = "盎格库尔",
		[7725] = "恐怖图腾袭击者",
		[5710] = "预言者迦玛兰",
		[7789] = "沙怒智障者",
		[7797] = "卢兹鲁",
		[11560] = "玛格拉姆鬼魂",
		[9545] = "恐怖的奴隶主",
		[5846] = "黑铁工头",
		[5854] = "重型作战傀儡",
		[5862] = "暮光地占师",
		[2944] = "索格伦",
		[11784] = "瑟莱德丝卫士",
		[5982] = "黑色屠戮者",
		[6006] = "魔誓专家",
		[10041] = "格里什皇后",
		[12216] = "毒劣魔",
		[6126] = "哈达尔欺诈者",
		[4119] = "风蛇",
		[4151] = "盐石水晶蜥蜴",
		[8442] = "暗影蛛丝偷猎者",
		[199] = "小碎尸鸟",
		[4343] = "尘泥钳嘴鳄鱼",
		[8762] = "林木隐匿者",
		[202] = "恐怖骸骨",
		[203] = "骷髅法师",
		[8890] = "铁怒狱卒",
		[8906] = "狂怒傀儡",
		[8922] = "巨型血犬",
		[6518] = "焦油潜伏者",
		[205] = "夜行黑暗狼人",
		[9018] = "审讯官格斯塔恩",
		[206] = "夜行邪齿狼人",
		[9162] = "幼双帆龙",
		[8597] = "瘟疫犬",
		[1795] = "灼热的食尸鬼",
		[2554] = "枯木掷斧者",
		[8929] = "铁炉堡公主茉艾拉·铜须",
		[8915] = "暮光之锤特使",
		[8925] = "掘泥虫",
		[7796] = "耐克鲁姆",
		[8657] = "胡库的魅魔",
		[6250] = "海蟹",
		[4663] = "火刃预言师",
		[4671] = "怨怒欺诈者",
		[4679] = "地狱魔女",
		[624] = "亡灵挖掘者",
		[4695] = "恐怖腐化鸟",
		[9476] = "卫兵杜格瑞普",
		[4711] = "滑刃纳迦",
		[4719] = "滑刃海巫",
		[4727] = "老迈的雷霆蜥蜴",
		[9027] = "修行者高罗什",
		[8928] = "洞穴雷霆蜥蜴",
		[9436] = "未知目标 <贝尔加>",
		[213] = "饥饿的恐狼",
		[9016] = "贝尔加",
		[8893] = "铁怒士兵",
		[7450] = "蓬毛枭兽",
		[11027] = "幻影怨灵",
		[3424] = "风蛇",
		[2892] = "石窟先知",
		[9319] = "驯犬者格雷布玛尔",
		[215] = "迪菲亚夜行者",
		[1010] = "藓皮沼泽行者",
		[4506] = "血帆水兵",
		[4847] = "暗炉发掘者",
		[4855] = "石窟争斗者",
		[4863] = "玉脊蜥蜴",
		[11785] = "黄眼蜥蜴",
		[8903] = "铁怒上尉",
		[217] = "结网毒蜘蛛",
		[1783] = "骷髅剥皮者",
		[433] = "暗皮豺狼人",
		[7321] = "石窟织炎者",
		[11713] = "黑幕追踪者",
		[5722] = "哈扎斯",
		[1791] = "被奴役的食尸鬼",
		[8901] = "铁怒预备兵",
		[8899] = "厄炉龙骑兵",
		[428] = "恐鹫",
		[11561] = "亡灵劫掠者",
		[7022] = "毒鞭蝎",
		[7030] = "暗炉地质学家",
		[7038] = "索瑞森密探",
		[9042] = "维雷克",
		[9041] = "典狱官斯迪尔基斯",
		[4715] = "滑刃刺尾纳迦",
		[4841] = "死沼巨鳄",
		[7078] = "裂隙沙漠蝎",
		[2924] = "银鬃狼",
		[8914] = "暮光保镖",
		[7883] = "安德雷·费尔比德",
		[2202] = "灰雾滩行者",
		[3560] = "治疗结界 <黑木图腾师>",
		[12201] = "瑟莱德丝公主",
		[12217] = "腐化劣魔",
		[8894] = "铁怒医师",
		[13743] = "腐化的自然之力",
		[6005] = "魔誓暴徒",
		[6170] = "加特斯比尔",
		[4853] = "石窟地占师",
		[212] = "裂拳战士",
		[391] = "老瞎眼",
		[3] = "食腐者",
		[7206] = "古代的石头看守者",
		[5331] = "憎世战士",
		[210] = "噬骨者",
		[12221] = "毒性软泥怪",
		[3450] = "迪菲亚鹦鹉",
		[7246] = "沙怒暗影猎手",
		[6498] = "魔暴龙",
		[5244] = "祖卡什毒刺蝎",
		[97] = "矮小的河爪豺狼人",
		[1160] = "哈林多尔船长",
		[7286] = "祖尔法拉克僵尸",
		[5247] = "祖卡什掘洞蝎",
		[5255] = "木爪劫掠者",
		[5263] = "阿塔莱木乃伊",
		[5271] = "阿塔莱死亡行者",
		[2726] = "烈焰守护者",
		[8898] = "铁怒队长",
		[5295] = "暴怒的深痕雪人",
		[5274] = "铁鬃熊王",
		[4412] = "暗牙爬行者",
		[1488] = "赞吉尔僵尸",
		[5273] = "阿塔莱高阶祭司",
		[5335] = "憎世尖啸者",
		[759] = "失落者猎人",
		[441] = "黑龙雏龙",
		[5359] = "被缩小的海岸巨人",
		[5308] = "游荡的山谷尖啸者",
		[732] = "鱼人潜伏者",
		[4849] = "暗炉考古学家",
		[2926] = "银鬃捕猎者",
		[2742] = "暗炉吟唱者",
		[3728] = "暗滩精兵",
		[3732] = "亡灵搜寻者",
		[4857] = "石头看守者",
		[8900] = "厄炉魔匠",
		[1174] = "坑道鼠地卜师",
		[5268] = "铁鬃熊",
		[5455] = "森提帕尔异种蝎",
		[8891] = "铁怒卫士",
		[5471] = "砂槌食人魔",
		[8907] = "怒锤傀儡",
		[1121] = "霜鬃雪行者",
		[4140] = "恐蝎劫掠者",
		[1188] = "灰斑黑熊",
		[6506] = "疾奔暴掠龙",
		[1388] = "瓦加什",
		[6555] = "格里什掘洞蝎",
		[9019] = "达格兰·索瑞森大帝",
		[3767] = "冷心欺诈者",
		[3099] = "黑子",
		[7606] = "欧罗·血眼",
		[8897] = "厄炉工匠",
		[703] = "范高雷中尉",
		[8437] = "哈卡莱爪牙",
		[5452] = "哈扎里工蝎",
		[2714] = "被遗忘者信使",
		[9163] = "双帆龙",
		[5615] = "废土游荡者",
		[5623] = "废土刺客",
		[518] = "犹勒",
		[7405] = "致命的裂隙沙漠蝎",
		[5647] = "沙怒猎头者",
		[2686] = "枯木巢穴守卫",
		[345] = "贝利格拉布",
		[2644] = "邪枝剥皮者",
		[7726] = "恐怖图腾博学者",
		[10323] = "莫克迪普",
		[13019] = "火刃先知",
		[1085] = "老年荆棘谷猛虎",
		[5711] = "可悲的奥戈姆",
		[5719] = "摩弗拉斯",
		[4352] = "血沼尖啸龙",
		[2733] = "药剂师乔瑞尔",
		[5456] = "森提帕尔毒刺蝎",
		[1095] = "风险投资公司经理",
		[3904] = "灼热图腾 IV",
		[660] = "血顶巫医",
		[9499] = "普拉格",
		[11562] = "枯钳龙虾人",
		[2618] = "落锤苦工",
		[9547] = "醉酒的奴隶主",
		[5807] = "扫荡者",
		[5224] = "黑暗滑行虫",
		[1022] = "杂斑镰爪龙",
		[1727] = "迪菲亚工人",
		[5839] = "黑铁地质学家",
		[1084] = "小盐齿鳄鱼",
		[5855] = "熔岩元素",
		[1032] = "黑色软泥怪",
		[9691] = "毒尖蝎",
		[2570] = "石拳萨满祭司",
		[5360] = "被缩小的深海巨人",
		[11786] = "黄眼掠夺者",
		[641] = "地精木匠",
		[639] = "艾德温·范克里夫",
		[5336] = "憎世巫师",
		[636] = "迪菲亚黑衣卫兵",
		[1052] = "黑铁破坏者",
		[327] = "金牙",
		[634] = "迪菲亚监工",
		[5296] = "狂暴的怒痕雪人",
		[2645] = "邪枝暗影猎手",
		[5280] = "噩梦龙族",
		[3381] = "南海歹徒",
		[5991] = "红石晶鳞蜥蜴",
		[6194] = "恶鞭毒蛇守卫",
		[12046] = "掠夺者格玛洛克",
		[0] = "击倒",
		[1175] = "坑道鼠掘地工",
		[10158] = "月夜枭兽",
		[4044] = "黑色石化蜥蜴",
		[10043] = "雷布里的亲信",
		[8905] = "战斗傀儡",
		[5236] = "戈杜尼萨满祭司",
		[1026] = "蓝腮强盗",
		[4064] = "黑石斥候",
		[1031] = "红色软泥怪",
		[1039] = "沼泽定居者",
		[1035] = "龙喉沼泽行者",
		[12218] = "邪恶幼虫",
		[2070] = "月夜猛虎幼崽",
		[6127] = "哈达尔魔仆",
		[7209] = "未知目标 <黑曜石哨兵>",
		[1025] = "蓝腮污水鱼人",
		[1027] = "蓝腮战士",
		[4112] = "砂齿歹徒",
		[4120] = "雷鸣岩石元素",
		[4128] = "乱齿捕猎者",
		[2069] = "月夜猛虎",
		[6513] = "安戈洛巨猩猩",
		[6199] = "血精灵搜寻者",
		[2351] = "灰熊",
		[522] = "摩拉迪姆",
		[2089] = "巨型湿地鳄鱼",
		[8317] = "阿塔莱死亡行者的灵魂 <阿塔莱死亡行者>",
		[6239] = "塞克隆尼亚",
		[1051] = "黑铁矮人",
		[1053] = "黑铁隧道工",
		[2369] = "刺脊滩行者",
		[1057] = "龙喉白骨守卫",
		[1059] = "残忍的安纳希克",
		[2190] = "野生劣魔",
		[4248] = "杂毛土狼",
		[525] = "癞皮狼",
		[5243] = "被诅咒的阿塔莱巨魔",
		[2102] = "龙喉步兵",
		[5235] = "真菌软泥怪",
		[5239] = "戈杜尼大法师",
		[38] = "迪菲亚暴徒",
		[7273] = "加兹瑞拉",
		[2157] = "石巨兽",
		[8636] = "守护者莫塔加亚",
		[1083] = "鱼人巡滩者",
		[2169] = "黑木图腾师",
		[4344] = "尘泥杂斑鳄鱼",
		[2177] = "挣扎的贵族",
		[4360] = "黑鳍战士",
		[2185] = "黑海岸蛇颈龙",
		[2189] = "恶灵劣魔",
		[1097] = "风险投资公司技工",
		[4392] = "腐蚀性的沼泽软泥怪",
		[5307] = "山谷尖啸者",
		[2205] = "灰雾战士",
		[12922] = "小鬼爪牙",
		[2565] = "巨型平原狼蛛",
		[1109] = "碎尸鸟",
		[8876] = "沙怒侍僧",
		[8892] = "铁怒步兵",
		[1115] = "石腭击颅者",
		[1117] = "石腭断骨者",
		[6519] = "焦油兽王",
		[2241] = "辛迪加窃贼",
		[2245] = "辛迪加破坏者",
		[2249] = "凶恶的雪人",
		[2253] = "破碎岭蛮兵",
		[4512] = "野猪",
		[10160] = "狂暴的月夜枭兽",
		[2338] = "暮光信徒",
		[1082] = "盐齿鳄鱼",
		[7397] = "土灵凿石者",
		[285] = "鱼人",
		[594] = "迪菲亚匪徒",
		[12219] = "尖刺鞭笞者",
		[548] = "鱼人小招潮者",
		[9164] = "老双帆龙",
		[5419] = "晶鳞蜥蜴",
		[4416] = "迪菲亚赤膊矿工",
		[1186] = "老黑熊",
		[5459] = "森提帕尔掘洞蝎",
		[1157] = "被诅咒的水手",
		[1159] = "大副斯涅利格",
		[1161] = "碎石穴居人",
		[1163] = "碎石怪击颅者",
		[1111] = "吸血捕猎者",
		[2333] = "仆从瓦里克",
		[2337] = "暗滩唤魔师",
		[4680] = "末日看守队长",
		[1173] = "坑道鼠斥候",
		[2349] = "巨型食苔蛛",
		[1177] = "坑道鼠勘探员",
		[1179] = "莫格罗什执行者",
		[1181] = "莫格罗什萨满祭司",
		[4728] = "砂腭蜥蜴",
		[1185] = "林木潜伏者",
		[8920] = "武器技师",
		[2377] = "碎鳍潮行鱼人",
		[11563] = "枯钳巨螯龙虾人",
		[6514] = "安戈洛猩猩",
		[1195] = "森林潜伏者",
		[4672] = "怨怒魔仆",
		[300] = "扎克乌尔",
		[1201] = "雪豹",
		[2254] = "破碎岭虐待者",
		[9024] = "控火师罗格雷恩",
		[2546] = "舰队指挥官菲尔拉伦",
		[2350] = "森林食苔蛛",
		[2421] = "玛克拉克",
		[4848] = "暗炉暗法师",
		[4856] = "石窟猎手",
		[2433] = "赫尔库拉的遗骸",
		[4872] = "黑曜石傀儡",
		[1251] = "裂拳好战者",
		[4464] = "黑石角斗士",
		[171] = "鱼人战士",
		[10159] = "小月夜枭兽",
		[2336] = "暗滩狂热者",
		[4696] = "荒土巨钳蝎",
		[5451] = "哈扎里群居蝎",
		[11787] = "岩孔虫",
		[486] = "萨瑞尔祖恩",
		[2318] = "暗影大法师",
		[9916] = "加奎亚",
		[684] = "深喉猎豹",
		[7023] = "黑曜石哨兵",
		[671] = "血顶猎头者",
		[7039] = "战争掠夺者",
		[7047] = "黑色小龙",
		[4664] = "火刃劫掠者",
		[314] = "寒冰箭",
		[1169] = "黑铁叛军",
		[315] = "斯塔文·密斯特曼托",
		[1176] = "坑道鼠征粮官",
		[1172] = "坑道鼠歹徒",
		[1180] = "莫格罗什蛮兵",
		[1183] = "莫格罗什秘法师",
		[2537] = "拇指苏克",
		[12203] = "兰斯利德",
		[2545] = "帅小伙子邓肯",
		[2549] = "加尔·盐蹄",
		[7857] = "南海码头工人",
		[2557] = "枯木暗影猎手",
		[11686] = "鬼魅掠夺者",
		[7175] = "石窟伏击者",
		[8257] = "小软泥怪",
		[2573] = "枯须勘探员",
		[7608] = "穆尔塔",
		[4860] = "石头管理者",
		[6910] = "鲁维罗什",
		[2589] = "辛迪加雇佣兵",
		[5184] = "塞拉摩哨兵",
		[2597] = "法库雷斯特公爵",
		[7247] = "沙怒噬魂者",
		[1150] = "淡水鳄",
		[8889] = "铁怒监军",
		[7271] = "巫医祖穆拉恩",
		[5232] = "戈杜尼蛮兵",
		[5240] = "戈杜尼术士",
		[625] = "亡灵爆破者",
		[5256] = "阿塔莱战士",
		[1120] = "霜鬃巨魔",
		[5272] = "铁鬃灰熊",
		[2641] = "邪枝猎头者",
		[5288] = "疯狂的长牙狼",
		[2649] = "枯木割颅者",
		[2653] = "枯木虐待者",
		[7309] = "土灵管理者",
		[6111] = "火焰新星图腾 II <恐怖图腾萨满祭司>",
		[2550] = "斯蒂沃特船长",
		[334] = "加塞尔佐格",
		[8637] = "黑铁巡逻兵",
		[335] = "森格",
		[2681] = "邪枝巨狼",
		[589] = "迪菲亚抢劫者",
		[644] = "拉克佐",
		[647] = "绿皮队长",
		[2237] = "月夜雄虎",
		[9377] = "空气漩涡",
		[1353] = "萨尔图斯",
		[5228] = "深色软泥怪",
		[5424] = "沙漠疾行蝎",
		[2717] = "火烟虐待者",
		[2721] = "被遗忘者保镖",
		[2725] = "滚烫的雏龙",
		[2729] = "老峭壁山狗",
		[8877] = "沙怒狂热者",
		[5472] = "砂槌执行者",
		[8909] = "火焰卫士",
		[2745] = "因弗努斯大使",
		[2165] = "灰斑蓟熊",
		[5332] = "憎世御浪者",
		[2757] = "布莱克拉什",
		[2761] = "水浪流放者",
		[7274] = "沙怒刽子手",
		[3725] = "暗滩祭司",
		[2773] = "奥卡拉尔",
		[1364] = "邪恶的巴尔加拉斯",
		[5460] = "森提帕尔沙行者",
		[2734] = "山脊雄豹",
		[687] = "丛林捕猎者",
		[6527] = "焦油爬行者",
		[691] = "次级水元素",
		[685] = "荆棘谷迅猛龙",
		[9165] = "小翼手龙",
		[5616] = "废土窃贼",
		[6198] = "血精灵勘测员",
		[7670] = "奥利斯塔的仆从",
		[13323] = "地下双帆龙",
		[5648] = "沙怒暗影法师",
		[4713] = "滑刃战士",
		[1417] = "湿地鳄鱼幼崽",
		[4376] = "黑雾蜘蛛",
		[7727] = "恐怖图腾萨满祭司",
		[2732] = "山脊雌豹",
		[5225] = "黑暗粘液虫",
		[766] = "纠缠恐兽",
		[5712] = "祖罗",
		[5720] = "德拉维沃尔",
		[1122] = "霜鬃剥皮者",
		[4463] = "黑石召唤师",
		[14621] = "工头玛托留斯",
		[4341] = "尘泥鳄鱼",
		[11516] = "木喉游荡者",
		[686] = "鞭尾迅猛龙",
		[1023] = "杂斑刺喉龙",
		[2893] = "石窟断骨者",
		[2992] = "治疗结界 V <失落者先知>",
		[7847] = "卡利夫·斯科比斯汀",
		[7855] = "南海海盗",
		[4026] = "血怒唤风者",
		[458] = "打猎鱼人",
		[12224] = "洞窟游荡者",
		[5840] = "黑铁锻造师",
		[6240] = "挑衅者",
		[5856] = "晶网蜘蛛",
		[9677] = "奥格拉比斯",
		[2937] = "贪婪的达古恩",
		[48] = "骷髅战士",
		[2945] = "莫达洛克",
		[11788] = "岩石虫",
		[5844] = "黑铁奴隶贩子",
		[735] = "鱼人士兵",
		[8391] = "黑衣拉索里克",
		[9684] = "拉克维",
		[2932] = "马格雷甘·深影",
		[3100] = "菅野松雪",
		[1489] = "赞吉尔猎人",
		[1491] = "赞吉尔纳迦",
		[2928] = "远古枭兽",
		[8911] = "火焰驱逐者",
		[5984] = "饥饿的弯牙土狼",
		[5992] = "灰鬃野猪",
		[9678] = "希尔·丁格",
		[8656] = "胡库的虚空行者",
		[5617] = "废土暗法师",
		[1663] = "迪克斯特·瓦德",
		[5454] = "哈扎里沙行者",
		[1511] = "暴怒的银背猩猩",
		[8095] = "苏利萨斯沙行者",
		[9637] = "灼烧图腾 <控火师罗格雷恩>",
		[2247] = "辛迪加执行者",
		[2251] = "巨型雪人",
		[8127] = "安图苏尔",
		[429] = "暗皮巫师",
		[1716] = "巴基尔·斯瑞德",
		[8837] = "泥浆元素",
		[12220] = "蟒藤",
		[1016] = "高地鞭尾龙",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		[0] = 5,
		["法术反制"] = 8,
		["神圣净化"] = 1,
		["重伤"] = 1,
		["护甲"] = 1,
		["酸液喷射"] = "噩梦龙族",
		["昏迷"] = 2,
		["恢复"] = 5,
		["愈合"] = 11,
		["伏击"] = 4,
		["十字军圣印"] = 2,
		["深度沉睡"] = "伊兰尼库斯的阴影",
		["制造魔法红宝石"] = 8,
		["急救"] = 1,
		["速效毒药 II"] = 4,
		["血之契印"] = 9,
		["真言术：韧"] = 5,
		["灰尘力场"] = "瑟莱德丝公主",
		["荆棘术"] = 1,
		["喝水"] = 8,
		["感知"] = 1,
		["冷酷"] = 4,
		["速效毒药 III"] = 4,
		["次级力量"] = 1,
		["清洁术"] = 2,
		["嘲讽"] = 1,
		["灼热武器"] = 3,
		["快速治疗"] = 5,
		["雷霆一击"] = 1,
		["蜥蜴之矢"] = "洞穴雷霆蜥蜴",
		["嗜血"] = 1,
		["火焰爆发"] = "伊森迪奥斯",
		["闷棍"] = 4,
		["灵猴守护"] = 3,
		["闪电吐息"] = 1,
		["巨熊形态"] = 11,
		["斧类武器投掷"] = "地精木匠",
		["烈焰风暴"] = "迪菲亚招魂师",
		["腐烂蛋白"] = "钻孔甲虫",
		["出血"] = 4,
		["战斗狂怒"] = "暮光之锤刽子手",
		["音素爆破"] = "利齿蝙蝠",
		["兽群领袖"] = 11,
		["治疗之触"] = 11,
		["黑暗祭品"] = "沙怒噬魂者",
		["挥砍"] = "乌克兹·沙顶",
		["自毁"] = "石头看守者",
		["冰锥术"] = 8,
		["石拳"] = 2,
		["低吼"] = 1,
		["猛虎之怒"] = 11,
		["火焰之盾"] = "胡库的虚空行者",
		["厚绒线绷带"] = 1,
		["挑战怒吼"] = 1,
		["黑曜石破碎"] = "黑曜石哨兵",
		["红色机械陆行鸟"] = 8,
		["斩杀"] = 1,
		["杂色马"] = 1,
		["压制"] = 1,
		["震荡猛击"] = 1,
		["冰冻"] = 8,
		["毒性震击"] = "爬行污泥怪",
		["熔岩爆裂"] = "控火师罗格雷恩",
		["毒性钉刺"] = "毒鞭蝎",
		["寒冰护体"] = 8,
		["召唤阿塔莱死亡行者的灵魂"] = "阿塔莱死亡行者",
		["枪械射击"] = 4,
		["死亡缠绕"] = 9,
		["毒性箭雨"] = "诺克赛恩",
		["震击"] = "傀儡统帅阿格曼奇",
		["培植种子"] = 4,
		["闪避"] = 4,
		["召唤遥控傀儡"] = "地精工程师",
		["绿色机械陆行鸟"] = 8,
		["恢复法力"] = 5,
		["喂养宠物"] = 3,
		["无情打击效果"] = 4,
		["震荡射击"] = 3,
		["腐烂气息"] = "腐烂巡影者",
		["寒冰屏障"] = 8,
		["脚踢"] = 4,
		["热疫"] = "耐克鲁姆",
		["毒蛇钉刺"] = 3,
		["鬼魅攻击"] = 4,
		["虚弱诅咒"] = "欧罗·血眼",
		["魔法吸收"] = 8,
		["强化震荡射击"] = 3,
		["复活宠物"] = 3,
		["智慧圣印"] = 2,
		["闪电之盾"] = "石窟智者",
		["变形！"] = 1,
		["命令圣印"] = 2,
		["陷地图腾"] = "安图苏尔",
		["正义圣印"] = 2,
		["银色黎明委任徽章"] = 8,
		["合并地图碎片"] = 1,
		["诺格弗格药剂"] = 4,
		["挥击"] = 11,
		["强效智力"] = 2,
		["安图苏尔的爪牙"] = "安图苏尔",
		["急奔"] = 11,
		["缴械"] = "斯尼德 <斯尼德的伐木机>",
		["上钩拳"] = "诺克赛恩",
		["精神鞭笞"] = 5,
		["熔铁之水"] = "基尔尼格",
		["破甲攻击"] = 1,
		["毁坏之痛"] = "暮光之锤拷问者",
		["变形术"] = 8,
		["火焰箭"] = "胡库的小鬼",
		["Warder Despawn"] = "安图苏尔",
		["栗色马"] = 4,
		["圣光击"] = "穆尔塔",
		["灼烧"] = "炽热火焰卫士",
		["刺破"] = "锐刺鞭笞者",
		["召唤阿塔莱骷髅"] = "阿塔莱高阶祭司",
		["击倒"] = "洞窟游荡者",
		["野性回复"] = "洞窟游荡者",
		["猛击"] = 1,
		["野性印记"] = 11,
		["雄鹰守护"] = 3,
		["野性冲锋效果"] = 11,
		["昏阙"] = 5,
		["毒药"] = "裂隙沙漠蝎",
		["专注光环"] = 2,
		["圣佑术"] = 2,
		["守护之刺"] = 3,
		["法力护盾"] = 8,
		["追踪人型生物"] = 3,
		["白山羊"] = 5,
		["炽热火焰"] = 4,
		["喝下治疗药水"] = "卫兵杜格瑞普",
		["拉格纳罗斯之拳"] = "暮光保镖",
		["裂筋"] = "暗炉农夫",
		["冲锋"] = 1,
		["力量"] = 11,
		["敏捷"] = 1,
		["地狱火罩"] = "石窟织炎者",
		["生命虹吸"] = 9,
		["进食"] = 1,
		["血帆鹦鹉"] = "迪菲亚海盗",
		["法力燃烧"] = "暗炉暗法师",
		["救赎"] = 2,
		["战斗怒吼"] = 1,
		["灼热之痛"] = 9,
		["听觉震荡"] = "黑暗尖啸者",
		["哈卡酸液"] = "哈卡的后代",
		["猎豹守护"] = 3,
		["致命毒药"] = "石窟潜伏者",
		["大地震颤"] = "石头管理者",
		["盾牌猛击"] = "卡姆·深怒",
		["毒云术"] = 1,
		["群体打击"] = "奥格拉比斯",
		["急速射击"] = 3,
		["迦玛兰的妖术"] = "预言者迦玛兰",
		["横扫攻击"] = 1,
		["野性冲锋"] = 11,
		["乱舞"] = 1,
		["神圣力量"] = 1,
		["创造占卜之碗"] = 1,
		["偷袭"] = 4,
		["假死"] = 3,
		["智力"] = 5,
		["智慧祝福"] = 2,
		["毒性鱼叉"] = "绿皮队长",
		["猫鼬撕咬"] = 3,
		["制造魔法黄水晶"] = 8,
		["闪现术"] = 8,
		["恐惧嚎叫"] = 9,
		["野兽之眼"] = 3,
		["祖穆拉恩结界"] = "巫医祖穆拉恩",
		["制造维格利的酒桶"] = "维格利",
		["疾跑"] = 4,
		["缓落术"] = 8,
		["心灵震爆"] = 5,
		["冰霜陷阱"] = 3,
		["冲动"] = 4,
		["心灵尖啸"] = 5,
		["弩射击"] = 1,
		["奇特的朗姆酒"] = 4,
		["岩浆喷溅"] = "贝尔加",
		["传送：月光林地"] = 11,
		["召唤黑曜石碎片"] = "黑曜石哨兵",
		["暴风雪"] = 8,
		["爆炸陷阱"] = 3,
		["冰甲术"] = 8,
		["胸闷"] = "温德索尔元帅",
		["战斗姿态"] = 1,
		["灵魂虹吸"] = 9,
		["热麦酒"] = 1,
		["狂野怒火"] = 3,
		["投石"] = "原始巨兽",
		["惩戒痛击"] = 1,
		["月火术"] = 11,
		["炉石"] = 3,
		["致死打击"] = 1,
		["神恩术"] = 2,
		["催眠术"] = "噩梦龙族",
		["召唤瑟莱德丝碎片"] = "瑟莱德丝卫士",
		["召唤宠物"] = 3,
		["灵魂石复活"] = 9,
		["拦截昏迷"] = 1,
		["奉献"] = 2,
		["凶猛撕咬"] = 11,
		["土灵卫士被摧毁"] = "土灵筑厅师",
		["全力一击"] = "伊森迪奥斯",
		["次级护甲"] = 5,
		["暗影之盾"] = "阿塔莱高阶祭司",
		["丝瓜"] = 3,
		["憎恨怒视"] = "瑟莱德丝公主",
		["畏缩"] = 11,
		["水下呼吸"] = 1,
		["十字军审判"] = 2,
		["耐力"] = 1,
		["重建"] = "厄炉工匠",
		["献祭"] = 9,
		["破甲"] = 4,
		["厚魔纹绷带"] = 4,
		["奥术射击"] = 3,
		["造食术"] = 8,
		["Fire"] = "环境伤害 (火烧)",
		["乱射"] = 3,
		["烈焰"] = "达格兰·索瑞森大帝",
		["毒害之云"] = "毒性软泥怪",
		["拉克佐猛击"] = "拉克佐",
		["战争践踏"] = "艾隆纳亚",
		["妖术"] = "沙怒暗影猎手",
		["麻痹毒药"] = 4,
		["生命 II"] = 3,
		["穿刺射击"] = "迪菲亚工头",
		["逃脱"] = 3,
		["旋风斩效果"] = "修行者高罗什",
		["摔绊"] = 3,
		["力量祝福"] = 2,
		["范克里夫的盟友"] = "艾德温·范克里夫",
		["黑马"] = 8,
		["爆炸射击"] = "厄炉龙骑兵",
		["纯净术"] = 2,
		["光明圣印"] = 2,
		["影遁"] = 11,
		["补充法力 II"] = 8,
		["投掷炸弹"] = "暗炉农夫",
		["致命毒药 II"] = 4,
		["狂暴回复"] = 11,
		["献祭陷阱效果"] = 3,
		["盾刺"] = "噩梦刃鳞龙人",
		["自爆绵羊"] = 3,
		["飓风"] = 11,
		["强化断筋"] = 1,
		["荆棘光环"] = "米杉",
		["荆棘箭雨"] = "尖刺鞭笞者",
		["公正圣印"] = 2,
		["寒冰箭"] = 8,
		["强效治疗术"] = 5,
		["治疗药水"] = 1,
		["自动射击"] = 3,
		["制裁之锤"] = 2,
		["眩晕"] = 3,
		["真言术：盾"] = 5,
		["血性狂暴"] = 1,
		["重击"] = 11,
		["恐吓"] = "斯尼德的伐木机",
		["投网"] = "玛拉多斯",
		["烈焰打击"] = "石窟地占师",
		["铁皮手雷"] = 3,
		["割裂"] = 4,
		["搜索"] = 4,
		["圣光审判"] = 1,
		["速效毒药 VI"] = 4,
		["投掷"] = 4,
		["撕咬"] = 1,
		["霜寒刺骨"] = 8,
		["迦萨斯"] = 1,
		["冰霜新星"] = 8,
		["深冬之寒"] = 8,
		["火焰之雨"] = "欧罗·血眼",
		["生命分流"] = 9,
		["进食充分"] = 8,
		["破甲虚弱"] = "巨型血犬",
		["鲁莽"] = "铁怒士兵",
		["正义之怒"] = 2,
		["突进"] = "虎王 <白胖高>",
		["潜行"] = 4,
		["强化摔绊"] = 3,
		["挫志怒吼"] = 1,
		["痛击"] = "重拳先生",
		["消隐"] = "迪菲亚黑衣卫兵",
		["条纹霜刃豹"] = 3,
		["堕落自然之力"] = "被诅咒的塞雷布拉斯",
		["防护冰霜结界"] = "典狱官斯迪尔基斯",
		["狂怒"] = "可怕的塔格尔",
		["扫击"] = 11,
		["启发"] = 2,
		["暗影箭雨"] = "暗炉暗法师",
		["烈焰火炮"] = "怒锤傀儡",
		["酸液溅射"] = "曲奇",
		["扰乱射击"] = 3,
		["圆弧斩"] = "艾隆纳亚",
		["蓝色机械陆行鸟"] = 8,
		["致残毒药"] = 4,
		["烈性炸药"] = 5,
		["治疗术"] = 5,
		["烈焰化身"] = "达格兰·索瑞森大帝",
		["旅行形态"] = 11,
		["唤醒"] = 8,
		["心灵之火"] = 5,
		["火球术"] = 8,
		["盾牌格挡"] = 1,
		["烈焰震击"] = "加加恩·火锤",
		["火焰增效"] = "加加恩·火锤",
		["拯救祝福"] = 2,
		["诱捕"] = 3,
		["原始狂怒"] = 11,
		["神圣震击"] = 2,
		["英勇打击"] = 1,
		["激怒"] = 11,
		["狂暴之怒"] = 1,
		["爪击"] = 11,
		["烈焰尖刺"] = "暗炉地质学家",
		["剑刃乱舞"] = 4,
		["治疗祷言"] = 5,
		["快速射击"] = 3,
		["断筋"] = 1,
		["突袭"] = 11,
		["自律"] = 2,
		["拳击"] = 1,
		["正义审判"] = 2,
		["暗影抗性光环"] = 2,
		["火焰之盾 IV"] = "石窟织炎者",
		["驱除疾病"] = 5,
		["斑点霜刃豹"] = 3,
		["屠杀"] = "暮光之锤刽子手",
		["宁静"] = 11,
		["分离"] = "洞穴雷霆蜥蜴",
		["反击风暴"] = 1,
		["狂暴姿态"] = 1,
		["祈祷之珠"] = 5,
		["暗影灼烧"] = 9,
		["娜玛拉消失"] = "罗克诺特下士",
		["扰乱"] = 4,
		["意志之力"] = 1,
		["闪电链"] = "哈姆霍克",
		["冰霜震击"] = "暮光之锤特使",
		["伤害增效"] = "暮光之锤特使",
		["奥术箭"] = "暮光使者",
		["奥术智慧"] = 8,
		["!Melee"] = 1,
		["减速术"] = "暗炉议员",
		["火焰之盾效果 III"] = "暗炉议员",
		["惩击"] = 5,
		["腐蚀术"] = 9,
		["烈焰之团"] = "铁手卫士",
		["僵化"] = "苏利萨斯沙行者",
		["致伤"] = 1,
		["病弱"] = "掘泥虫",
		["毒液喷吐"] = "掘泥虫",
		["水流喷射"] = "塞萨拉多头怪",
		["传送：铁炉堡"] = 8,
		["治疗结界"] = "石窟智者",
		["火焰冲击"] = 8,
		["恐怖低吼"] = "血犬",
		["火息术"] = "霍尔雷·黑须",
		["冰霜凝固"] = "加兹瑞拉",
		["唤醒地灵宝库守卫"] = "阿扎达斯",
		["醉酒怒气"] = "霍尔雷·黑须",
		["连珠火球"] = "火焰驱逐者",
		["瞄准射击"] = 3,
		["召唤贝尔加的产物"] = "贝尔加",
		["包围之网"] = "阿努希尔",
		["胁迫"] = 3,
		["潜伏"] = "豹 <朝阳嗜水>",
		["纠缠根须"] = 11,
		["火焰弹"] = 3,
		["洛丹伦的回响"] = 1,
		["火焰抗性光环"] = 2,
		["熔化矿石"] = "地精工匠",
		["沉默"] = "暗炉发掘者",
		["冰霜射击"] = "武器技师",
		["放逐术"] = 9,
		["恐惧术"] = 9,
		["拍翼"] = "德姆塞卡尔",
		["防御姿态"] = 1,
		["元素领主的诅咒"] = "伊森迪奥斯",
		["石鳞鳕鱼"] = 4,
		["精神分流"] = 5,
		["反射"] = "玉脊蜥蜴",
		["精灵之火（野性）"] = 11,
		["魔爆术"] = 8,
		["冲锋击昏"] = 1,
		["解散野兽"] = 3,
		["盾击"] = 1,
		["圣盾术"] = 2,
		["绞喉"] = 1,
		["灼烧图腾"] = "控火师罗格雷恩",
		["速效毒药"] = 4,
		["炸弹"] = "维格利",
		["游荡瘟疫"] = 3,
		["击退"] = "艾隆纳亚",
		["治疗宠物"] = 3,
		["幼虫粘液"] = "邪恶幼虫",
		["麻痹之毒"] = "爬行者赫杜姆",
		["召唤小鬼"] = 9,
		["驱邪术"] = 2,
		["还击"] = 4,
		["无荣誉目标"] = 1,
		["制造初级灵魂石"] = 9,
		["地狱烈焰效果"] = 9,
		["暗影易伤"] = 5,
		["践踏"] = "石头看守者",
		["暗影冥思"] = 9,
		["感染之伤"] = "迪菲亚俘虏",
		["相位变换"] = "塔纳尔 <落翼之痕>",
		["毒液箭"] = "毒劣魔",
		["熔岩喷射图腾"] = "石窟智者",
		["暗言术：痛"] = 5,
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		["召唤诺克赛恩产物"] = "诺克赛恩",
		["沙尘风暴"] = "古代的石头看守者",
		["逃命专家"] = 8,
		["钩网"] = "铁怒狱卒",
		["加速光环"] = "铁怒监军",
		["棕山羊"] = 3,
		["撕裂"] = 1,
		["暗影形态"] = 5,
		["神圣打击"] = "弗诺斯·达克维尔",
		["爆炸陷阱效果"] = 3,
		["召唤小软泥怪"] = "深色软泥怪",
		["绝望祷言"] = 5,
		["重铸"] = "土灵筑厅师",
		["恶魔皮肤"] = 9,
		["强击光环"] = 3,
		["祛病术"] = 5,
		["瘟疫之云"] = "圣甲虫",
		["地精暗雷"] = "维格利",
		["强化格挡"] = "噩梦刃鳞龙人",
		["邪恶攻击"] = 4,
		["审判"] = 2,
		["酸息术"] = "德姆塞卡尔",
		["条纹夜刃豹"] = 3,
		["命令审判"] = 2,
		["暗影箭"] = 9,
		["强效智慧祝福"] = 2,
		["伺机待发"] = 4,
		["致密炸弹"] = 1,
		["棕马"] = 1,
		["怒不可遏"] = 1,
		["安格弗的剑"] = 1,
		["Falling"] = "环境伤害 (坠落)",
		["拦截"] = 1,
		["强效水下呼吸"] = 1,
		["豹群守护"] = 3,
		["次级治疗术"] = 5,
		["刺骨"] = 4,
		["速效毒药 V"] = 4,
		["速效毒药 IV"] = 4,
		["树皮术"] = 11,
		["槌击"] = 11,
		["强效力量祝福"] = 2,
		["守护效果"] = 1,
		["复仇"] = 1,
		["神圣之火"] = 5,
		["打击"] = "迪克斯特·瓦德",
		["战斗命令"] = "迪菲亚监工",
		["扰乱之痛"] = "斯尼德的伐木机",
		["盾牌专精"] = 1,
		["鞭笞"] = "哈卡的化身",
		["烟雾弹"] = "巴基尔·斯瑞德",
		["吸取生命"] = 9,
		["拉格纳罗斯之怒"] = "暮光使者",
		["!Autoshot"] = 1,
		["精灵之火"] = 11,
		["熊形态"] = 11,
		["蝰蛇钉刺"] = 3,
		["致盲"] = 4,
		["祸害之毒"] = "爬行者赫杜姆",
		["圣光闪现"] = 2,
		["魔暴龙之怒"] = 3,
		["忏悔"] = 2,
		["冰冻陷阱效果"] = 3,
		["黑暗契约"] = 9,
		["吸血鬼的拥抱"] = 5,
		["攻击"] = "灼烧图腾 <控火师罗格雷恩>",
		["蛛网爆炸"] = "爬行者赫杜姆",
		["再生"] = 5,
		["快速烈焰防护结界"] = "迪菲亚招魂师",
		["回春术"] = 11,
		["死亡之愿"] = 1,
		["重拳先生践踏"] = "重拳先生",
		["魔法抑制"] = 8,
		["减速毒药"] = "塞雷布拉斯树妖",
		["奥术飞弹"] = 8,
		["腐肉大餐"] = 4,
		["精神"] = 1,
		["凿击"] = 4,
		["灼热箭"] = 3,
		["冰霜陷阱光环"] = 3,
		["惩罚光环"] = 2,
		["召唤传送门"] = "未知目标",
		["渐隐术"] = 5,
		["Lava"] = "环境伤害 (岩浆)",
		["造水术"] = 8,
		["新近包扎"] = 1,
		["王者祝福"] = 2,
		["毒害之灾"] = "诺克赛恩幼体",
		["天选印记效果"] = 3,
		["圣疗术"] = 2,
		["节能施法"] = 8,
		["横扫猛击"] = "阿塔拉利恩",
		["自由祝福"] = 2,
		["冒险等待着你"] = 1,
		["哈卡之焰"] = "阿塔莱塑像",
		["驱毒术"] = 11,
		["侦测隐形"] = 9,
		["防护恐惧结界"] = 5,
		["猎人印记"] = 3,
		["速度"] = 1,
		["脚踢 - 沉默"] = 4,
		["困兽之爪"] = "巨型血犬",
		["颅骨爆裂"] = "战斗傀儡",
		["辩护"] = 2,
		["刺耳怒吼"] = 1,
		["撕扯"] = 11,
		["束缚亡灵"] = 5,
		["盾墙"] = 1,
		["射击"] = 8,
		["清晰预兆"] = 11,
		["奥术冲击"] = 1,
		["切割"] = 1,
		["烈焰鞭笞"] = "加加恩·火锤",
		["补充法力"] = 8,
		["痛苦诅咒"] = 9,
		["冰柱"] = "加兹瑞拉",
		["灵感"] = 5,
		["挑战咆哮"] = 11,
		["次级智力"] = 9,
		["召唤哈卡"] = "哈卡的阴影",
		["清算圣印"] = "弗诺斯·达克维尔",
		["加兹瑞拉猛击"] = "加兹瑞拉",
		["阿塔莱毒药"] = "阿塔莱塑像",
		["猎豹形态"] = 11,
		["弹出斯尼德"] = "斯尼德的伐木机",
		["光明祝福"] = 2,
		["愤怒"] = 11,
		["吸取灵魂"] = 9,
		["侦测次级隐形"] = 9,
		["石像形态"] = 2,
		["刺穿护甲"] = "迪菲亚矿工",
		["霜甲术"] = 8,
		["冰冻陷阱"] = 3,
		["毒蝎钉刺"] = 3,
		["挫志咆哮"] = 11,
		["自爆"] = "地精暗雷 <维格利>",
		["驱散射击"] = 3,
		["超度亡灵"] = 2,
		["麻痹毒药 III"] = 4,
		["免疫定身/缠绕/昏迷"] = 1,
		["虔诚光环"] = 2,
		["召唤碎片"] = "兰斯利德",
		["激活"] = 11,
		["地狱烈焰"] = 9,
		["地震术"] = "安图苏尔",
		["愤怒之锤"] = 2,
		["圣光术"] = 2,
		["神圣愤怒"] = 2,
		["撕碎"] = 11,
		["防护暗影"] = 5,
		["召唤军马"] = 2,
		["扭曲"] = "厄炉工匠",
		["防护火焰结界"] = 8,
		["背刺"] = 4,
		["血之诅咒"] = "维雷克",
		["血袭"] = 11,
		["嗜血术"] = "哈姆霍克",
		["脆弱"] = "祖罗尔",
		["多重射击"] = 3,
		["血之狂热"] = 1,
		["唤醒地灵守护者"] = "阿扎达斯",
		["心灵专注"] = 5,
		["佯攻"] = 4,
		["肾击"] = 4,
		["牺牲圣印"] = "暮光保镖",
		["圣洁光环"] = 2,
		["水晶沉睡"] = "玉脊蜥蜴",
		["神圣新星"] = 5,
		["俯冲"] = "风蛇 <当时我就火了>",
		["破釜沉舟"] = 1,
		["猛禽一击"] = 3,
		["照明弹"] = 3,
		["魔甲术"] = 9,
		["魔纹绷带"] = 3,
		["火焰新星"] = "加加恩·火锤",
		["旋风斩"] = 1,
		["保护祝福"] = 2,
		["剥皮"] = 11,
		["急速冷却"] = 8,
		["火焰之盾效果 IV"] = "石窟织炎者",
		["野猪冲锋"] = 1,
		["闪电箭"] = "鲁维罗什",
		["巨石之力"] = 1,
		["复活术"] = 5,
		["火焰风暴"] = "伊森迪奥斯",
		["倒钩"] = "尖刺鞭笞者",
		["吸血术"] = "沙怒饮血者",
		["破胆怒吼"] = 1,
		["厚丝质绷带"] = 4,
		["火焰之盾 III"] = "暗炉议员",
		["智慧审判"] = 11,
		["消失"] = 4,
		["顺劈斩"] = "地精木匠",
		["召唤地狱战马"] = 9,
		["解除次级诅咒"] = 8,
		["反手一击"] = "迪菲亚罪犯",
		["驱散魔法"] = 5,
		["毁灭"] = 11,
		["治疗波"] = "石窟智者",
	},
	["encounter_spell_pool"] = {
		["毒药"] = {
			0, -- [1]
			"雷布里的亲信", -- [2]
		},
		["冰霜凝固"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["唤醒地灵宝库守卫"] = {
			0, -- [1]
			"阿扎达斯", -- [2]
		},
		["邪恶攻击"] = {
			0, -- [1]
			"黑须的亲信", -- [2]
		},
		["酸息术"] = {
			0, -- [1]
			"德姆塞卡尔", -- [2]
		},
		["恢复"] = {
			0, -- [1]
			"暗影祭司塞瑟斯", -- [2]
		},
		["纠缠根须"] = {
			0, -- [1]
			"被诅咒的塞雷布拉斯", -- [2]
		},
		["熔化矿石"] = {
			0, -- [1]
			"地精工匠", -- [2]
		},
		["深度沉睡"] = {
			0, -- [1]
			"伊兰尼库斯的阴影", -- [2]
		},
		["拍翼"] = {
			0, -- [1]
			"德姆塞卡尔", -- [2]
		},
		["防御姿态"] = {
			0, -- [1]
			"卡姆·深怒", -- [2]
		},
		["灰尘力场"] = {
			0, -- [1]
			"瑟莱德丝公主", -- [2]
		},
		["荆棘光环"] = {
			0, -- [1]
			"米杉", -- [2]
		},
		["复仇"] = {
			0, -- [1]
			"布莱中士", -- [2]
		},
		["盾击"] = {
			0, -- [1]
			"暗炉伏击者", -- [2]
		},
		["炸弹"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["火焰之盾效果 IV"] = {
			0, -- [1]
			"土灵雕刻者", -- [2]
		},
		["击退"] = {
			0, -- [1]
			"艾隆纳亚", -- [2]
		},
		["法力燃烧"] = {
			0, -- [1]
			"暗炉暗法师", -- [2]
		},
		["烈焰之团"] = {
			0, -- [1]
			"铁手卫士", -- [2]
		},
		["战斗怒吼"] = {
			0, -- [1]
			"迪菲亚叛军", -- [2]
		},
		["真言术：盾"] = {
			0, -- [1]
			"穆尔塔", -- [2]
		},
		["快速治疗"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["反手一击"] = {
			0, -- [1]
			"迪菲亚罪犯", -- [2]
		},
		["践踏"] = {
			0, -- [1]
			"兰斯利德", -- [2]
		},
		["大地震颤"] = {
			0, -- [1]
			"阿扎达斯", -- [2]
		},
		["恐吓"] = {
			0, -- [1]
			"斯尼德的伐木机", -- [2]
		},
		["熔岩喷射图腾"] = {
			0, -- [1]
			"石窟智者", -- [2]
		},
		["暗言术：痛"] = {
			0, -- [1]
			"沙怒智障者", -- [2]
		},
		["加速光环"] = {
			0, -- [1]
			"铁怒监军", -- [2]
		},
		["烈焰打击"] = {
			0, -- [1]
			"土灵雕刻者", -- [2]
		},
		["沙尘风暴"] = {
			0, -- [1]
			"古代的石头看守者", -- [2]
		},
		["迦玛兰的妖术"] = {
			0, -- [1]
			"预言者迦玛兰", -- [2]
		},
		["撕裂"] = {
			0, -- [1]
			"迪菲亚狱友", -- [2]
		},
		["割裂"] = {
			0, -- [1]
			"黑须的亲信", -- [2]
		},
		["重铸"] = {
			0, -- [1]
			"土灵筑厅师", -- [2]
		},
		["斧类武器投掷"] = {
			0, -- [1]
			"地精木匠", -- [2]
		},
		["烈焰风暴"] = {
			0, -- [1]
			"预言者迦玛兰", -- [2]
		},
		["烈焰鞭笞"] = {
			0, -- [1]
			"加加恩·火锤", -- [2]
		},
		["多重射击"] = {
			0, -- [1]
			"维利塔恩", -- [2]
		},
		["冰霜新星"] = {
			0, -- [1]
			"迪菲亚塑风师", -- [2]
		},
		["毒性鱼叉"] = {
			0, -- [1]
			"绿皮队长", -- [2]
		},
		["反射"] = {
			0, -- [1]
			"玉脊蜥蜴", -- [2]
		},
		["挥砍"] = {
			0, -- [1]
			"乌克兹·沙顶", -- [2]
		},
		["闪现术"] = {
			0, -- [1]
			"维利塔恩", -- [2]
		},
		["弹出斯尼德"] = {
			0, -- [1]
			"斯尼德的伐木机", -- [2]
		},
		["祖穆拉恩结界"] = {
			0, -- [1]
			"巫医祖穆拉恩", -- [2]
		},
		["火焰之盾"] = {
			0, -- [1]
			"胡库的虚空行者", -- [2]
		},
		["黑曜石破碎"] = {
			0, -- [1]
			"黑曜石哨兵", -- [2]
		},
		["霜甲术"] = {
			0, -- [1]
			"典狱官斯迪尔基斯", -- [2]
		},
		["痛击"] = {
			0, -- [1]
			"重拳先生", -- [2]
		},
		["消隐"] = {
			0, -- [1]
			"迪菲亚黑衣卫兵", -- [2]
		},
		["心灵震爆"] = {
			0, -- [1]
			"铁怒医师", -- [2]
		},
		["祸害之毒"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["脆弱"] = {
			0, -- [1]
			"祖罗尔", -- [2]
		},
		["冰冻"] = {
			0, -- [1]
			"迪菲亚塑风师", -- [2]
		},
		["心灵尖啸"] = {
			0, -- [1]
			"暗影祭司塞瑟斯", -- [2]
		},
		["熔岩爆裂"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["狂怒"] = {
			0, -- [1]
			"可怕的塔格尔", -- [2]
		},
		["岩浆喷溅"] = {
			0, -- [1]
			"贝尔加", -- [2]
		},
		["火焰新星"] = {
			0, -- [1]
			"加加恩·火锤", -- [2]
		},
		["召唤黑曜石碎片"] = {
			0, -- [1]
			"黑曜石哨兵", -- [2]
		},
		["凿击"] = {
			0, -- [1]
			"拉文", -- [2]
		},
		["酸液溅射"] = {
			0, -- [1]
			"曲奇", -- [2]
		},
		["圆弧斩"] = {
			0, -- [1]
			"艾隆纳亚", -- [2]
		},
		["拉格纳罗斯之怒"] = {
			0, -- [1]
			"暮光使者", -- [2]
		},
		["放逐术"] = {
			0, -- [1]
			"普拉格", -- [2]
		},
		["召唤碎片"] = {
			0, -- [1]
			"兰斯利德", -- [2]
		},
		["震击"] = {
			0, -- [1]
			"傀儡统帅阿格曼奇", -- [2]
		},
		["奥术射击"] = {
			0, -- [1]
			"Sheila", -- [2]
		},
		["闪避"] = {
			0, -- [1]
			"腐烂巡影者", -- [2]
		},
		["召唤遥控傀儡"] = {
			0, -- [1]
			"地精工程师", -- [2]
		},
		["!Autoshot"] = {
			0, -- [1]
			"Sheila", -- [2]
		},
		["烈焰化身"] = {
			0, -- [1]
			"达格兰·索瑞森大帝", -- [2]
		},
		["治疗术"] = {
			0, -- [1]
			"暗影祭司塞瑟斯", -- [2]
		},
		["元素领主的诅咒"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["刺骨"] = {
			0, -- [1]
			"雷布里的亲信", -- [2]
		},
		["火息术"] = {
			0, -- [1]
			"霍尔雷·黑须", -- [2]
		},
		["颅骨爆裂"] = {
			0, -- [1]
			"战斗傀儡", -- [2]
		},
		["致死打击"] = {
			0, -- [1]
			"修行者高罗什", -- [2]
		},
		["刺破"] = {
			0, -- [1]
			"锐刺鞭笞者", -- [2]
		},
		["喝下治疗药水"] = {
			0, -- [1]
			"卫兵杜格瑞普", -- [2]
		},
		["防护冰霜结界"] = {
			0, -- [1]
			"典狱官斯迪尔基斯", -- [2]
		},
		["火焰风暴"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["盾牌格挡"] = {
			0, -- [1]
			"铁怒卫士", -- [2]
		},
		["烈焰震击"] = {
			0, -- [1]
			"加加恩·火锤", -- [2]
		},
		["奥术箭"] = {
			0, -- [1]
			"暮光使者", -- [2]
		},
		["火焰增效"] = {
			0, -- [1]
			"加加恩·火锤", -- [2]
		},
		["旋风斩"] = {
			0, -- [1]
			"修行者高罗什", -- [2]
		},
		["火焰爆发"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["痛苦诅咒"] = {
			0, -- [1]
			"醉酒的奴隶主", -- [2]
		},
		["魔爆术"] = {
			0, -- [1]
			"暮光使者", -- [2]
		},
		["灼烧图腾"] = {
			0, -- [1]
			"控火师罗格雷恩", -- [2]
		},
		["制造维格利的酒桶"] = {
			0, -- [1]
			"维格利", -- [2]
		},
		["召唤贝尔加的产物"] = {
			0, -- [1]
			"贝尔加", -- [2]
		},
		["脚踢"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["清算圣印"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["加兹瑞拉猛击"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["破甲虚弱"] = {
			0, -- [1]
			"巨型血犬", -- [2]
		},
		["全力一击"] = {
			0, -- [1]
			"伊森迪奥斯", -- [2]
		},
		["挫志怒吼"] = {
			0, -- [1]
			"迪菲亚叛军", -- [2]
		},
		["蛛网爆炸"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["虚弱诅咒"] = {
			0, -- [1]
			"沙怒侍僧", -- [2]
		},
		["烈焰尖刺"] = {
			0, -- [1]
			"暗炉地质学家", -- [2]
		},
		["扰乱之痛"] = {
			0, -- [1]
			"斯尼德的伐木机", -- [2]
		},
		["暗影箭"] = {
			0, -- [1]
			"巫医祖穆拉恩", -- [2]
		},
		["治疗波"] = {
			0, -- [1]
			"预言者迦玛兰", -- [2]
		},
		["恐怖低吼"] = {
			0, -- [1]
			"血犬", -- [2]
		},
		["嗜血术"] = {
			0, -- [1]
			"哈姆霍克", -- [2]
		},
		["憎恨怒视"] = {
			0, -- [1]
			"瑟莱德丝公主", -- [2]
		},
		["神圣打击"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["虔诚光环"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["醉酒怒气"] = {
			0, -- [1]
			"霍尔雷·黑须", -- [2]
		},
		["闪电箭"] = {
			0, -- [1]
			"鲁维罗什", -- [2]
		},
		["麻痹之毒"] = {
			0, -- [1]
			"爬行者赫杜姆", -- [2]
		},
		["盾牌猛击"] = {
			0, -- [1]
			"卡姆·深怒", -- [2]
		},
		["地震术"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["瘟疫之云"] = {
			0, -- [1]
			"圣甲虫", -- [2]
		},
		["重拳先生践踏"] = {
			0, -- [1]
			"重拳先生", -- [2]
		},
		["暗影箭雨"] = {
			0, -- [1]
			"暗炉暗法师", -- [2]
		},
		["毒性箭雨"] = {
			0, -- [1]
			"诺克赛恩", -- [2]
		},
		["恶魔皮肤"] = {
			0, -- [1]
			"沙怒智障者", -- [2]
		},
		["圣光术"] = {
			0, -- [1]
			"弗诺斯·达克维尔", -- [2]
		},
		["陷地图腾"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["火焰之盾 IV"] = {
			0, -- [1]
			"土灵雕刻者", -- [2]
		},
		["打击"] = {
			0, -- [1]
			"迪克斯特·瓦德", -- [2]
		},
		["重建"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["扭曲"] = {
			0, -- [1]
			"厄炉工匠", -- [2]
		},
		["Warder Despawn"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["献祭"] = {
			0, -- [1]
			"普拉格", -- [2]
		},
		["水晶沉睡"] = {
			0, -- [1]
			"玉脊蜥蜴", -- [2]
		},
		["寒冰箭"] = {
			0, -- [1]
			"暮光使者", -- [2]
		},
		["闪电之盾"] = {
			0, -- [1]
			"石窟智者", -- [2]
		},
		["土灵卫士被摧毁"] = {
			0, -- [1]
			"土灵筑厅师", -- [2]
		},
		["暗影之盾"] = {
			0, -- [1]
			"审讯官格斯塔恩", -- [2]
		},
		["冰柱"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["唤醒地灵守护者"] = {
			0, -- [1]
			"阿扎达斯", -- [2]
		},
		["烈焰火炮"] = {
			0, -- [1]
			"怒锤傀儡", -- [2]
		},
		["缴械"] = {
			0, -- [1]
			"斯尼德 <斯尼德的伐木机>", -- [2]
		},
		["钩网"] = {
			0, -- [1]
			"铁怒狱卒", -- [2]
		},
		["射击"] = {
			0, -- [1]
			"迪菲亚哨兵", -- [2]
		},
		["狂暴姿态"] = {
			0, -- [1]
			"卢兹鲁", -- [2]
		},
		["拉克佐猛击"] = {
			0, -- [1]
			"拉克佐", -- [2]
		},
		["烈焰"] = {
			0, -- [1]
			"达格兰·索瑞森大帝", -- [2]
		},
		["攻击"] = {
			0, -- [1]
			"灼烧图腾 <控火师罗格雷恩>", -- [2]
		},
		["熔铁之水"] = {
			0, -- [1]
			"基尔尼格", -- [2]
		},
		["困兽之爪"] = {
			0, -- [1]
			"巨型血犬", -- [2]
		},
		["召唤诺克赛恩产物"] = {
			0, -- [1]
			"诺克赛恩", -- [2]
		},
		["魔甲术"] = {
			0, -- [1]
			"阿努希尔", -- [2]
		},
		["火球术"] = {
			0, -- [1]
			"石窟地占师", -- [2]
		},
		["战争践踏"] = {
			0, -- [1]
			"艾隆纳亚", -- [2]
		},
		["投石"] = {
			0, -- [1]
			"瑟莱德丝公主", -- [2]
		},
		["破甲攻击"] = {
			0, -- [1]
			"安格弗将军", -- [2]
		},
		["火焰箭"] = {
			0, -- [1]
			"胡库的小鬼", -- [2]
		},
		["堕落自然之力"] = {
			0, -- [1]
			"被诅咒的塞雷布拉斯", -- [2]
		},
		["上钩拳"] = {
			0, -- [1]
			"诺克赛恩", -- [2]
		},
		["闪电链"] = {
			0, -- [1]
			"哈姆霍克", -- [2]
		},
		["愤怒"] = {
			0, -- [1]
			"被诅咒的塞雷布拉斯", -- [2]
		},
		["安图苏尔的爪牙"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["旋风斩效果"] = {
			0, -- [1]
			"修行者高罗什", -- [2]
		},
		["横扫猛击"] = {
			0, -- [1]
			"阿塔拉利恩", -- [2]
		},
		["热疫"] = {
			0, -- [1]
			"耐克鲁姆", -- [2]
		},
		["圣光击"] = {
			0, -- [1]
			"穆尔塔", -- [2]
		},
		["破胆怒吼"] = {
			0, -- [1]
			"迪克斯特·瓦德", -- [2]
		},
		["范克里夫的盟友"] = {
			0, -- [1]
			"艾德温·范克里夫", -- [2]
		},
		["包围之网"] = {
			0, -- [1]
			"阿努希尔", -- [2]
		},
		["断筋"] = {
			0, -- [1]
			"腐烂巡影者", -- [2]
		},
		["僵化"] = {
			0, -- [1]
			"安图苏尔的仆从 <安图苏尔>", -- [2]
		},
		["顺劈斩"] = {
			0, -- [1]
			"地精木匠", -- [2]
		},
		["!Melee"] = {
			0, -- [1]
			"拉克佐", -- [2]
		},
		["血之诅咒"] = {
			0, -- [1]
			"维雷克", -- [2]
		},
		["真言术：韧"] = {
			0, -- [1]
			"铁怒医师", -- [2]
		},
		["烟雾弹"] = {
			0, -- [1]
			"巴基尔·斯瑞德", -- [2]
		},
		["治疗结界"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["火焰冲击"] = {
			0, -- [1]
			"迪菲亚塑风师", -- [2]
		},
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [1]
	},
	["__profiles"] = {
		["特变电工-鱼人摩洛克"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = false,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -520.9999389648438,
							["x"] = -419.0000610351563,
							["w"] = 310.0000610351563,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["skin_custom"] = "",
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["enabled"] = true,
						["enable_custom_text"] = false,
						["text_size"] = 12,
					},
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["timeType"] = 1,
								["textXMod"] = 6,
								["textAlign"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["switch_damager_in_combat"] = false,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["show_statusbar"] = false,
					["hide_in_combat_alpha"] = 0,
					["menu_icons_size"] = 0.850000023841858,
					["bars_inverted"] = false,
					["libwindow"] = {
						["y"] = 5.470979158417322e-05,
						["x"] = -419.0001220703125,
						["point"] = "BOTTOM",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["stretch_button_side"] = 1,
					["bars_grow_direction"] = 1,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["backdrop_texture"] = "Details Ground",
					["bars_sort_direction"] = 1,
					["grab_on_top"] = false,
					["switch_tank_in_combat"] = false,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["auto_current"] = true,
					["version"] = 3,
					["clickthrough_rows"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["font_size"] = 16,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["height"] = 21,
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["textR_bracket"] = "(",
						["textR_enable_custom_text"] = false,
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textL_outline_small"] = true,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["texture_custom"] = "",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["use_spec_icons"] = false,
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -520.9999389648438,
							["x"] = -419.0000610351563,
							["w"] = 310.0000610351563,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["plugins_grow_direction"] = 1,
					["switch_tank"] = false,
					["show_sidebars"] = false,
					["micro_displays_locked"] = true,
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["overall_clear_newboss"] = true,
			["minimum_combat_time"] = 5,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["standard_skin"] = false,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["trash_auto_remove"] = true,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["default_bg_color"] = 0.0941,
			["segments_amount_to_save"] = 18,
			["total_abbreviation"] = 2,
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["time_type_original"] = 2,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
		},
	},
	["disable_talent_feature"] = false,
	["spell_school_cache"] = {
		["闪电吐息"] = 8,
		["暗影箭雨"] = 32,
		["射击"] = 1,
		["痛击"] = 1,
		["冰霜新星"] = 16,
		["心灵震爆"] = 32,
		["打击"] = 1,
		["噬灵瘟疫"] = 32,
		["!Autoshot"] = 1,
		["暗言术：痛"] = 32,
		["奥术射击"] = 64,
		["!Melee"] = 1,
		["精灵之火"] = 8,
		["火球术"] = 4,
		["寒冰箭"] = 16,
		["冰冻"] = 16,
		["火焰冲击"] = 4,
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["damage_taken_shadow"] = true,
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_size"] = 12,
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["always_use_profile"] = false,
	["mobs_data"] = {
	},
	["run_code"] = {
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["show_totalhitdamage_on_overkill"] = false,
	["mobs_data_compiled"] = {
	},
	["item_level_pool"] = {
		["Player-5458-02EB6C0F"] = {
			["time"] = 1639818857,
			["name"] = "温柔帅哥",
			["ilvl"] = 0,
		},
		["Player-5458-03010C60"] = {
			["time"] = 1639824077,
			["name"] = "坦克泡泡",
			["ilvl"] = 0,
		},
		["Player-5458-02F6D2A3"] = {
			["time"] = 1639824077,
			["name"] = "特变电工",
			["ilvl"] = 0,
		},
		["Player-5458-02FA8830"] = {
			["time"] = 1639811652,
			["name"] = "哎呦喂哦",
			["ilvl"] = 0,
		},
	},
	["realm_sync"] = true,
	["createauraframe"] = {
	},
	["global_plugin_database"] = {
	},
	["update_warning_timeout"] = 10,
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["latest_news_saw"] = "",
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["raid_data"] = {
	},
	["switchSaved"] = {
		["slots"] = 4,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
		},
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["tutorial"] = {
		["bookmark_tutorial"] = false,
		["main_help_button"] = 93,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["ATTRIBUTE_SELECT_TUTORIAL1"] = true,
		["MIN_COMBAT_TIME"] = true,
		["logons"] = 93,
		["version_announce"] = 0,
		["ctrl_click_close_tutorial"] = false,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["unlock_button"] = 0,
		["STREAMER_PLUGIN_FIRSTRUN"] = true,
	},
	["savedTimeCaptures"] = {
	},
	["plugin_window_pos"] = {
		["y"] = 1.52587890625e-05,
		["x"] = 0,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["attribute"] = false,
			["name"] = "有使用药水",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["script_version"] = 5,
		}, -- [1]
		{
			["source"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["author"] = "Details! Team",
			["percent_script"] = false,
			["total_script"] = false,
			["attribute"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["script_version"] = 15,
		}, -- [2]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["script_version"] = 2,
		}, -- [3]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["script_version"] = 2,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the crowd control amount for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the amount of crowd control received for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["script_version"] = 3,
		}, -- [6]
		{
			["source"] = false,
			["total_script"] = "local value, top, total, combat, instance = ...\n			local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n			local percent = string.format (\"%.1f\", value/total*100)\n\n			return math.floor (value) .. \" (\" .. dps .. \", \" .. percent .. \"\"",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "在统计中显示你的技能.",
			["attribute"] = false,
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["name"] = "我的技能",
			["tooltip"] = "				--config:\n				--Background RBG and Alpha:\n				local R, G, B, A = 0, 0, 0, 0.75\n				local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n				\n				--get the parameters passed\n				local spell, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GC = GameCooltip\n				GC:SetOption (\"YSpacingMod\", 2)\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				\n				if (spell.n_dmg) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					local debuff_uptime_total, cast_string = \"\", \"\"\n					local misc_actor = instance.showing (4, _detalhes.playername)\n					if (misc_actor) then\n						local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n						if (debuff_uptime) then\n							debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n						end\n						\n						local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n						\n						if (not spell_cast and misc_actor.spell_cast) then\n							local spellname = GetSpellInfo (spell.id)\n							for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n								local casted_spellname = GetSpellInfo (casted_spellid)\n								if (casted_spellname == spellname) then\n									spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n								end\n							end\n						end\n						if (not spell_cast) then\n							spell_cast = \"(|cFFFFFF00?|r)\"\n						end\n						cast_string = cast_string .. spell_cast\n					end\n					\n					--Cooltip code\n					GC:AddLine (\"Casts:\", cast_string or \"?\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (debuff_uptime_total ~= \"\") then\n						GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n						GC:AddStatusBar (100, 1, R, G, B, A)\n						GC:AddIcon (\"\", 1, 1, 1, 16)\n					end\n					\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local n_average = spell.n_dmg / spell.n_amt\n					local T = (combat_time*spell.n_dmg)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_dmg/spell.c_amt\n						local T = (combat_time*spell.c_dmg)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_dmg / T\n						\n						GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n				elseif (spell.n_curado) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					--Cooltip code\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local n_average = spell.n_curado / spell.n_amt\n					local T = (combat_time*spell.n_curado)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_curado/spell.c_amt\n						local T = (combat_time*spell.c_curado)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_curado / T\n						\n						GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n				end\n\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["script_version"] = 9,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对骷髅标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["script_version"] = 4,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "对其它标记目标造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["script_version"] = 4,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n				\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n					local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n					OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n				\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n					s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n					s = ToK (_, value) .. \" (\" .. s\n				end\n				\n				return s\n			",
			["desc"] = "Show overall damage done on the fly.",
			["attribute"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n				\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				--check if the actor list of overall and current combat is valid\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n					return 0, 0, 0\n				end\n				\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--check if the results from getactorlist is a table and has more than 1 actor on it\n				if (type (damage_container_overall) ~= \"table\") then\n					return 0, 0, 0\n				end\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n					--only player in group\n					if (player and player:IsGroupPlayer()) then\n						instance_container:AddValue (player, player.total)\n					end\n				end\n				\n				--does the player is in combat?\n				--if true need to add the data from the current fight as well\n				if (UnitAffectingCombat(\"player\")) then\n					for _, player in ipairs ( damage_container_current ) do \n						--only player in group\n						if (player and player:IsGroupPlayer()) then\n							instance_container:AddValue (player, player.total)        \n						end\n					end\n				end\n				\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n				\n				--return:\n				return total, top, amount\n			",
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n				\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				local AllSpells = {}\n				\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = spellTable.total\n					end\n				end\n				\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = (AllSpells [spellName] or 0) + (spellTable.total or 0)\n					end\n				end\n				\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n					tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n				\n				local format_func = Details:GetCurrentToKFunction()\n				\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n					local spellID, total = unpack (t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						\n						GameCooltip:AddLine (spellName, format_func (_, total))\n						Details:AddTooltipBackgroundStatusbar()\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n					end\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["script_version"] = 6,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["attribute"] = false,
			["name"] = "对护盾造成的伤害",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["script_version"] = 2,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["report_where"] = "PARTY",
	["lastUpdateWarning"] = 0,
	["data_sync"] = false,
}
