
MEETINGHORN_DB = {
	["profileKeys"] = {
		["顶级程序员 - 鱼人摩洛克"] = "顶级程序员 - 鱼人摩洛克",
		["特变电工 - 鱼人摩洛克"] = "特变电工 - 鱼人摩洛克",
		["Javascript - 鱼人摩洛克"] = "Javascript - 鱼人摩洛克",
	},
	["profiles"] = {
		["顶级程序员 - 鱼人摩洛克"] = {
		},
		["特变电工 - 鱼人摩洛克"] = {
			["cache"] = {
				["cooldown"] = {
					["start"] = 1640267414,
					["duration"] = 50,
				},
			},
			["window"] = {
				["databroker"] = {
					["y"] = -20.3333740234375,
					["x"] = 194.2217407226563,
					["scale"] = 1,
				},
			},
		},
		["Javascript - 鱼人摩洛克"] = {
		},
	},
}
