
WIM3_Data = {
	["escapeToHide"] = true,
	["hoverLinks"] = false,
	["pop_rules"] = {
		["whisper"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = true,
			["resting"] = {
				["keepfocus"] = true,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = true,
				["onReceive"] = true,
			},
			["alwaysOther"] = false,
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
		},
		["chat"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["bn"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = false,
			["resting"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["alwaysOther"] = true,
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
		},
	},
	["timeStampFormat"] = "%H:%M",
	["windowAlpha"] = 80,
	["sounds"] = {
		["force_game_sound"] = false,
		["whispers"] = {
			["msgout_sml"] = "IM",
			["msgout"] = false,
			["guild"] = false,
			["bnet_sml"] = "IM",
			["msgin_sml"] = "IM",
			["msgin"] = true,
			["friend_sml"] = "IM",
			["guild_sml"] = "IM",
			["bnet"] = false,
			["friend"] = false,
		},
		["chat"] = {
			["msgout_sml"] = "Chat Blip",
			["msgout"] = false,
			["world_sml"] = "Chat Blip",
			["msgin_sml"] = "Chat Blip",
			["msgin"] = true,
			["party_sml"] = "Chat Blip",
			["custom_sml"] = "Chat Blip",
			["say_sml"] = "Chat Blip",
			["raid_sml"] = "Chat Blip",
			["officer_sml"] = "Chat Blip",
			["guild_sml"] = "Chat Blip",
			["raidleader_sml"] = "Chat Blip",
			["battlegroundleader_sml"] = "Chat Blip",
			["battleground_sml"] = "Chat Blip",
		},
	},
	["formatting"] = {
		["bracketing"] = {
			["enabled"] = true,
			["type"] = 1,
		},
	},
	["keepFocusRested"] = true,
	["wordwrap_indent"] = false,
	["enabled"] = true,
	["keepFocus"] = true,
	["alertedPrivateServer"] = false,
	["autoFocus"] = false,
	["winCascade"] = {
		["enabled"] = true,
		["direction"] = 8,
	},
	["lastState"] = "other",
	["displayColors"] = {
		["wispOut"] = {
			["b"] = 0.9882352941176471,
			["g"] = 0.0784313725490196,
			["r"] = 1,
		},
		["wispIn"] = {
			["b"] = 0.7607843137254902,
			["g"] = 0.03137254901960784,
			["r"] = 0.5607843137254902,
		},
		["sysMsg"] = {
			["b"] = 0,
			["g"] = 0.6627450980392157,
			["r"] = 1,
		},
		["BNwispOut"] = {
			["b"] = 1,
			["g"] = 0.6352941176470588,
			["r"] = 0.1725490196078431,
		},
		["historyIn"] = {
			["b"] = 0.4705882352941176,
			["g"] = 0.4705882352941176,
			["r"] = 0.4705882352941176,
		},
		["errorMsg"] = {
			["b"] = 0,
			["g"] = 0,
			["r"] = 1,
		},
		["webAddress"] = {
			["b"] = 1,
			["g"] = 1,
			["r"] = 1,
		},
		["BNwispIn"] = {
			["b"] = 0.6549019607843137,
			["g"] = 0.4862745098039216,
			["r"] = 0,
		},
		["historyOut"] = {
			["b"] = 0.7058823529411764,
			["g"] = 0.7058823529411764,
			["r"] = 0.7058823529411764,
		},
		["useSkin"] = true,
	},
	["fontSize"] = 12,
	["showToolTips"] = true,
	["minimap"] = {
		["free_position"] = {
			["y"] = -119.9890033406945,
			["x"] = -161.5500472187982,
			["point"] = "TOPRIGHT",
		},
		["free"] = false,
		["rightClickNew"] = false,
		["position"] = 200,
	},
	["winAnimation"] = true,
	["expose"] = {
		["protect"] = 1,
		["borderSize"] = 20,
		["combat"] = true,
		["groupOnly"] = false,
		["border"] = false,
		["direction"] = 1,
	},
	["alias"] = {
		["title_string"] = "{n} - {a}",
	},
	["menuSortActivity"] = true,
	["whoLookups"] = true,
	["modules"] = {
		["ChatSounds"] = {
			["enabled"] = true,
		},
		["ShortcutBar"] = {
			["enabled"] = true,
		},
		["Emoticons"] = {
			["enabled"] = true,
		},
		["ChatAlerts"] = {
			["enabled"] = true,
		},
		["Sounds"] = {
			["enabled"] = true,
		},
		["Expose"] = {
			["enabled"] = true,
		},
		["WhisperEngine"] = {
			["enabled"] = true,
		},
		["MinimapIcon"] = {
			["enabled"] = true,
		},
		["TimeStamps"] = {
			["enabled"] = true,
		},
		["OffScreenTracker"] = {
			["enabled"] = true,
		},
		["History"] = {
			["enabled"] = true,
		},
		["LDB"] = {
			["enabled"] = true,
		},
		["URLHandler"] = {
			["enabled"] = true,
		},
		["Tabs"] = {
			["enabled"] = true,
		},
		["ClickControl"] = {
			["enabled"] = true,
		},
		["Menu"] = {
			["enabled"] = true,
		},
		["Filters"] = {
			["enabled"] = true,
		},
	},
	["chat"] = {
		["bn"] = {
			["showAlerts"] = true,
		},
		["guild"] = {
			["showAlerts"] = true,
		},
		["party"] = {
			["showAlerts"] = true,
		},
		["custom"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
		["say"] = {
		},
		["battleground"] = {
		},
		["raid"] = {
			["showAlerts"] = true,
		},
		["officer"] = {
			["showAlerts"] = true,
		},
		["world"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
	},
	["ClickControl"] = {
		["clickSensitivity"] = 0.2,
	},
	["tabs"] = {
		["sortBy"] = 2,
		["whispers"] = {
			["enabled"] = false,
			["guild"] = false,
			["friends"] = false,
		},
		["chat"] = {
			["enabled"] = false,
			["aswhisper"] = false,
		},
	},
	["history"] = {
		["ageLimit"] = true,
		["previewCount"] = 25,
		["maxPer"] = true,
		["whispers"] = {
			["friends"] = true,
			["all"] = false,
			["guild"] = true,
		},
		["maxAge"] = 1209600,
		["preview"] = true,
		["maxCount"] = 500,
		["chat"] = {
			["ageLimit"] = true,
			["maxAge"] = 1209600,
			["previewCount"] = 25,
			["preview"] = true,
			["maxCount"] = 500,
			["maxPer"] = true,
		},
	},
	["skin"] = {
		["font_outline"] = "",
		["selected"] = "WIM Classic",
		["font"] = "ChatFontNormal",
		["suggest"] = true,
	},
	["winFade"] = true,
	["stats"] = {
		["startDate"] = "",
		["versions"] = 1,
		["whispers"] = 0,
		["mostConvos"] = 0,
	},
	["clampToScreen"] = true,
	["winLoc"] = {
		["left"] = 217,
		["top"] = 664,
	},
	["coloredNames"] = true,
	["ignoreArrowKeys"] = true,
	["tabAdvance"] = false,
	["windowOnTop"] = true,
	["winSize"] = {
		["height"] = 220,
		["strata"] = "DIALOG",
		["scale"] = 100,
		["width"] = 333,
	},
}
WIM3_Cache = {
	["鱼人摩洛克"] = {
		["Dwac"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["|Kq22|k"] = 2,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq3|k"] = 2,
				["|Kq23|k"] = 2,
				["|Kq1|k"] = 2,
				["|Kq11|k"] = 2,
				["|Kq17|k"] = 2,
				["|Kq14|k"] = 2,
				["|Kq18|k"] = 2,
				["|Kq8|k"] = 2,
				["|Kq21|k"] = 2,
				["|Kq4|k"] = 2,
				["|Kq20|k"] = 2,
				["|Kq13|k"] = 2,
				["|Kq15|k"] = 2,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["|Kq16|k"] = 2,
				["|Kq5|k"] = 2,
			},
		},
		["特变电工"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["|Kq28|k"] = 2,
				["|Kq16|k"] = 2,
				["姞青"] = 1,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq3|k"] = 2,
				["|Kq23|k"] = 2,
				["|Kq11|k"] = 2,
				["命不由天定"] = 1,
				["|Kq14|k"] = 2,
				["|Kq4|k"] = 2,
				["幽雅"] = 1,
				["天元邓刚"] = 1,
				["面包一箩筐"] = 1,
				["|Kq20|k"] = 2,
				["|Kq15|k"] = 2,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["战山河"] = 1,
				["灬鳯灬"] = 1,
				["阡祈"] = 1,
				["云江月"] = 1,
				["|Kq22|k"] = 2,
				["Sylvania"] = 1,
				["雪中飞"] = 1,
				["阿摇"] = 1,
				["爱你"] = 1,
				["茅台酒"] = 1,
				["神奇灬女侠"] = 1,
				["|Kq1|k"] = 2,
				["社区送温暖"] = 1,
				["盖伦的小宝剑"] = 1,
				["|Kq17|k"] = 2,
				["Alei"] = 1,
				["冯一刀"] = 1,
				["卡卡汐"] = 1,
				["|Kq8|k"] = 2,
				["审判"] = 1,
				["|Kq21|k"] = 2,
				["我给你跪下了"] = 1,
				["挖煤的小伙伴"] = 1,
				["|Kq13|k"] = 2,
				["戒之在灶"] = 1,
				["求心"] = 1,
				["|Kq5|k"] = 2,
				["|Kq18|k"] = 2,
				["德陛"] = 1,
			},
			["guildList"] = {
				["白酒壹斤半"] = 151,
				["樂山大佛"] = 314,
				["乱羽"] = 370,
				["丨悟空丶"] = 357,
				["团长没了"] = 181,
				["户呀呀"] = 216,
				["有丶绿"] = 562,
				["义乌彭于晏"] = 365,
				["刘甜甜"] = 197,
				["唯一"] = 811,
				["管泽元"] = 669,
				["丢丢大魔王"] = 110,
				["气球"] = 592,
				["法诗诗"] = 94,
				["冲锋在右"] = 301,
				["熊壮壮"] = 625,
				["沐萌"] = 105,
				["就叫帅比吧丶"] = 827,
				["克拉雷特"] = 382,
				["沐羽橙风"] = 598,
				["曦风"] = 280,
				["记忆灬格式化"] = 16,
				["土豆忒好吃"] = 432,
				["魔幻使者"] = 766,
				["断肠人"] = 543,
				["丧丨彪"] = 356,
				["听话"] = 303,
				["胖小德"] = 876,
				["妮妹"] = 467,
				["毛头超鱼水"] = 848,
				["Playeriuwur"] = 339,
				["杀戮梦魇"] = 567,
				["神行百变"] = 106,
				["煎饼来一套"] = 623,
				["胖小圣骑"] = 692,
				["茶恬恬"] = 880,
				["风掣"] = 758,
				["克洛普"] = 132,
				["罗小牧"] = 874,
				["身法有一套"] = 888,
				["加百利"] = 27,
				["熊猫软绵绵"] = 171,
				["和牛"] = 423,
				["夜幕祈祷"] = 444,
				["哎呦不错噢"] = 202,
				["If"] = 333,
				["无面者"] = 549,
				["滑滑梯"] = 227,
				["Amar"] = 113,
				["怒帕拉丁"] = 49,
				["丨萧何丨"] = 153,
				["清扬骑士"] = 855,
				["小叮噹丶"] = 821,
				["知麻膏"] = 657,
				["三岁会撩妹"] = 21,
				["箭無虚髪"] = 671,
				["安黛尔"] = 74,
				["小皮鞭抽他"] = 493,
				["北嶋流年"] = 407,
				["嘉城"] = 203,
				["叶赫那拉未央"] = 201,
				["子木子也"] = 469,
				["丶晴天"] = 362,
				["丶青衫"] = 364,
				["夜空的流星"] = 84,
				["永恒丶圣骑"] = 19,
				["牛牛妞"] = 628,
				["七彩雲飘飘"] = 350,
				["养乐多丶"] = 194,
				["Kouki"] = 271,
				["Diong"] = 775,
				["修玛丶"] = 378,
				["骁得"] = 157,
				["风涧德"] = 42,
				["你真高丶"] = 377,
				["鯊魚哥"] = 767,
				["小护士"] = 489,
				["流浪"] = 120,
				["王权没有永恒"] = 640,
				["疯狂小法"] = 646,
				["Malahidiel"] = 138,
				["地獄之花"] = 146,
				["酒意入桃枝"] = 98,
				["神教教主"] = 662,
				["土豆粉"] = 433,
				["叶辰"] = 416,
				["奔波儿菲兹"] = 307,
				["牛海王"] = 86,
				["开水"] = 517,
				["天神下凡"] = 296,
				["朝先"] = 837,
				["雁塔牛铁蛋"] = 64,
				["德意洋洋"] = 525,
				["诗雨"] = 723,
				["Szr"] = 185,
				["天地乖离"] = 455,
				["Tenveo"] = 342,
				["夜班保安"] = 445,
				["莫待季"] = 128,
				["跳跳乃波万"] = 121,
				["坦克泡泡"] = 813,
				["剑之初"] = 198,
				["古月"] = 911,
				["要求相信接受"] = 279,
				["Sakura"] = 781,
				["没茅台"] = 599,
				["密斯酷"] = 819,
				["麦丁"] = 134,
				["安格玛污王"] = 475,
				["美好时光海苔"] = 241,
				["雷达网带鱼"] = 179,
				["芜湖小司马"] = 696,
				["天公不作美"] = 454,
				["带血的眼泪"] = 510,
				["丨残丶箭丨"] = 787,
				["暮色晚秋"] = 221,
				["一老实人一"] = 71,
				["吉安纳丨语风"] = 115,
				["朵儿不哭"] = 566,
				["丿叶光寒"] = 80,
				["华尔街之狼"] = 89,
				["我的月亮"] = 831,
				["强得过份"] = 213,
				["护花使者"] = 538,
				["四季大发财"] = 431,
				["劝君秃鸡"] = 404,
				["裁决者"] = 15,
				["腥辰"] = 693,
				["暴躁的小笼包"] = 557,
				["馋奶兔"] = 123,
				["汉唐"] = 851,
				["风行"] = 287,
				["手一挥"] = 31,
				["伊心懿意"] = 373,
				["清疙瘩"] = 610,
				["天然莼丶"] = 306,
				["石沟权丶铠坚"] = 236,
				["狐狸麻糖"] = 635,
				["史莱姆"] = 47,
				["无须多言"] = 175,
				["鬼影步"] = 96,
				["米开朗骑螺"] = 672,
				["战争与和平"] = 913,
				["Aicc"] = 325,
				["浪浪的空空"] = 226,
				["孵你一脚"] = 473,
				["十三君"] = 154,
				["找寻记忆"] = 537,
				["大母龙丶"] = 449,
				["喔嚯"] = 428,
				["猫姐在寂寞"] = 638,
				["爱保健的浴霸"] = 626,
				["霜木"] = 900,
				["红发飘飘"] = 871,
				["来抓我呀"] = 570,
				["射手不太行"] = 483,
				["又是大晴天"] = 411,
				["控方证人"] = 119,
				["七号技师左右"] = 59,
				["圣光之子"] = 263,
				["就此别过"] = 277,
				["小雨儿"] = 495,
				["张韶涵"] = 212,
				["莫尛筱"] = 3,
				["Frozenkaipio"] = 332,
				["卓玛"] = 145,
				["花落思量错"] = 878,
				["神之太烦"] = 267,
				["伯爵"] = 374,
				["黑白"] = 290,
				["Shadanz"] = 910,
				["大力给力"] = 28,
				["咿呀咿呀"] = 425,
				["井星邦邦猎"] = 189,
				["勇氣"] = 406,
				["凛风丿"] = 397,
				["Rpen"] = 139,
				["八佰狼"] = 801,
				["鬼迷"] = 907,
				["悍将孤影"] = 266,
				["罗小小"] = 682,
				["香蕉超人"] = 906,
				["风涧落"] = 905,
				["风涧芯"] = 904,
				["Luckyy"] = 6,
				["清风悠悠"] = 612,
				["上酒"] = 114,
				["Rxl"] = 45,
				["风涧牧"] = 903,
				["非诺"] = 902,
				["楚记"] = 581,
				["萌丶小鬼"] = 70,
				["東风"] = 843,
				["听风屮"] = 419,
				["雨老爷"] = 897,
				["三胞胎他们爹"] = 188,
				["雏田丿"] = 896,
				["少年不再年邵"] = 30,
				["伊甸星原"] = 190,
				["阿摇"] = 895,
				["正面硬刚"] = 116,
				["一颗小虎牙"] = 349,
				["银叶草丶"] = 893,
				["重生之六哥哥"] = 892,
				["十三画"] = 408,
				["Eastwood"] = 122,
				["古惑仔"] = 276,
				["貓小烦"] = 887,
				["豆蔻梢头"] = 885,
				["香蕉嗝巴拉"] = 18,
				["青衣缺德"] = 901,
				["哈宁"] = 810,
				["月色"] = 168,
				["蒸籽蛋"] = 883,
				["菠萝怪"] = 55,
				["姥田"] = 468,
				["督军山克"] = 654,
				["玉树临風"] = 158,
				["谷大川"] = 56,
				["菜菜騒丶"] = 882,
				["莫奈"] = 881,
				["就不上防恐"] = 147,
				["光明之手"] = 191,
				["霜术"] = 76,
				["红波浪"] = 873,
				["默然灬"] = 771,
				["狮驼居士"] = 149,
				["搞鬼阿"] = 219,
				["牛攵"] = 859,
				["西厢娇客"] = 718,
				["红叶丶"] = 872,
				["轩辕忘尘"] = 1,
				["小浪浪"] = 823,
				["岁月如歌"] = 310,
				["海狗永不为奴"] = 606,
				["擎天柱"] = 836,
				["布莱恩灬铜须"] = 507,
				["甜甜的"] = 643,
				["冲锋下线"] = 195,
				["看门大爷"] = 866,
				["盾牌猛击"] = 865,
				["逐风而去"] = 736,
				["刘秀"] = 302,
				["非一般的炮台"] = 322,
				["水泥一号"] = 594,
				["小尾巴猫"] = 487,
				["甜甜糖"] = 864,
				["春色未曾看丶"] = 552,
				["朝思暮想"] = 565,
				["狂风"] = 37,
				["烈風"] = 268,
				["冰川十度"] = 394,
				["丶丶神"] = 360,
				["小笼包"] = 825,
				["小黃人"] = 497,
				["海鸟跟鱼相爱"] = 853,
				["江城第一深情"] = 50,
				["梅闻花"] = 845,
				["Jumbajump"] = 777,
				["羽风"] = 875,
				["丘比特之枪"] = 355,
				["瞳睛迷乀"] = 867,
				["振刀啊"] = 217,
				["冷月葬花魂"] = 25,
				["浪子无家"] = 225,
				["嗨呀"] = 429,
				["冬雨"] = 392,
				["Adele"] = 773,
				["椰蓉面包"] = 580,
				["毛毛猪"] = 849,
				["毛头分水鱼"] = 847,
				["森类滴话"] = 846,
				["石头的发神"] = 81,
				["雪山忆思缘"] = 898,
				["宽老三"] = 482,
				["无敌暗影箭"] = 546,
				["小丶法"] = 484,
				["杜鹃花"] = 841,
				["来玩啊有发票"] = 842,
				["木子又土"] = 839,
				["一九七九"] = 348,
				["朝思暮欢"] = 838,
				["黑木耳上仙"] = 770,
				["魂殇"] = 275,
				["一氘"] = 9,
				["暮光星灵"] = 555,
				["小尾巴海"] = 208,
				["大葱一枚"] = 453,
				["稳阿"] = 869,
				["袁阿满"] = 884,
				["Tough"] = 344,
				["挥腊肠的女孩"] = 834,
				["拉风板车"] = 833,
				["别惹我"] = 804,
				["辛多雷怒火"] = 733,
				["比你跑的快"] = 315,
				["亦不立芳名"] = 8,
				["鱼肠剑"] = 323,
				["张星彩"] = 829,
				["西西子"] = 721,
				["天降丷正義"] = 459,
				["羽瑜"] = 242,
				["小小芳姐"] = 486,
				["斯奎"] = 544,
				["無糖"] = 622,
				["落叶无尘"] = 245,
				["白小术"] = 647,
				["酱油半咕咚"] = 740,
				["王一一"] = 265,
				["初恋丶"] = 402,
				["明月灬"] = 312,
				["山月不知事"] = 828,
				["凉雨初夏"] = 396,
				["箖鳩"] = 870,
				["四岁就很帅"] = 292,
				["小哥"] = 822,
				["Naq"] = 780,
				["寻蝶舞沧海"] = 820,
				["戦鬥熋"] = 311,
				["只影向谁去"] = 807,
				["宝石蓝绿"] = 480,
				["武冰"] = 587,
				["奥义千年杀"] = 817,
				["楚歌"] = 34,
				["烧锅炉"] = 619,
				["天真无鞋"] = 816,
				["复仇心切"] = 814,
				["杰爷"] = 573,
				["欲眠"] = 584,
				["喵喵灬猫猫"] = 812,
				["鹿森"] = 99,
				["关一里姬"] = 387,
				["吾家有小哥"] = 809,
				["發丶搜捕鸟"] = 234,
				["不学巫术"] = 353,
				["嗷力给"] = 430,
				["消毒的风"] = 607,
				["妖言"] = 309,
				["千灬山"] = 805,
				["画画的贝贝"] = 645,
				["呐个矮子牧"] = 11,
				["孤舟寒蝉"] = 206,
				["小肉墩"] = 494,
				["薰大圣"] = 129,
				["冰冷之泉"] = 180,
				["冬天难熬"] = 803,
				["含泪自愿加班"] = 4,
				["神话归来"] = 663,
				["老歌丶"] = 689,
				["铁头妹妹"] = 164,
				["繁星璀璨"] = 38,
				["天堂在左"] = 815,
				["其实很安静"] = 802,
				["魔龙灵宿"] = 908,
				["清嵐"] = 609,
				["清风寒月"] = 169,
				["仙喵"] = 798,
				["群演百事可乐"] = 684,
				["湖中"] = 615,
				["亿米八大长腿"] = 796,
				["亚巴顿"] = 795,
				["亚尔特留斯"] = 794,
				["莉村花"] = 707,
				["表哥我出来啦"] = 717,
				["鱼人牧"] = 131,
				["清风一缕灬"] = 611,
				["蝶舞沧海"] = 716,
				["沉之默"] = 596,
				["紫霄依韵丶"] = 678,
				["中医疗法"] = 788,
				["一锅卤肉饭"] = 786,
				["小僵尸绿了"] = 182,
				["一神丶"] = 784,
				["元贞"] = 381,
				["Nicolekidman"] = 338,
				["一号技师"] = 783,
				["宝宝你在哪"] = 477,
				["馒头仔"] = 762,
				["淡淡的忧愁"] = 608,
				["惊骑队长"] = 529,
				["我不会奶不上"] = 830,
				["诸暨炮神"] = 247,
				["無情哈拉少"] = 621,
				["Micoo"] = 779,
				["胜天半子丶"] = 244,
				["潜行波比"] = 228,
				["Kaka"] = 778,
				["捅死你丫的"] = 218,
				["夏虫不可语冰"] = 441,
				["Meinv"] = 335,
				["小时候的光"] = 294,
				["Amor"] = 774,
				["醉啸千山"] = 88,
				["追忆丶雪山"] = 891,
				["法夜"] = 600,
				["峰林火山"] = 211,
				["Minami"] = 184,
				["骚气贼"] = 765,
				["骄傲的光头"] = 764,
				["空之境界"] = 288,
				["冬天的冰棒棒"] = 391,
				["德天独厚"] = 524,
				["妞头德"] = 466,
				["Xxim"] = 782,
				["飞丶"] = 761,
				["风铃月"] = 44,
				["风脸小旋风"] = 760,
				["杰克信仰"] = 572,
				["怡宝"] = 214,
				["标准近战猎"] = 844,
				["玩你个蛋"] = 641,
				["雷锋叔叔"] = 753,
				["零陵邢道荣"] = 752,
				["南城旧事"] = 199,
				["雨天的彩虹"] = 751,
				["热带鱼"] = 620,
				["焦糖玛奇朵"] = 289,
				["大豆"] = 170,
				["隐秘的战神"] = 748,
				["狮心斩杀者"] = 77,
				["隐子猎手"] = 747,
				["随机起名字"] = 41,
				["茅臺"] = 83,
				["钢丝套餐"] = 742,
				["人小能量大"] = 372,
				["紫涵"] = 676,
				["瓦夫"] = 284,
				["重拾山河"] = 741,
				["里予"] = 40,
				["郑俗人"] = 739,
				["那不是爱情"] = 737,
				["牧马人"] = 632,
				["追猫猫"] = 734,
				["孤舟"] = 472,
				["战山河"] = 832,
				["Whitegods"] = 915,
				["美娟"] = 683,
				["赵德嵀"] = 730,
				["皮卡"] = 235,
				["孜然"] = 470,
				["天才小熊猫"] = 457,
				["追忆丶小雪"] = 320,
				["齐德隆冬强"] = 135,
				["超毛分水鱼"] = 731,
				["吧唧"] = 418,
				["貂蝉姐姐"] = 886,
				["乐心"] = 367,
				["老李来开会"] = 687,
				["蓝色小药片"] = 713,
				["谁也挡不了"] = 725,
				["说的好"] = 724,
				["西门大脚"] = 722,
				["老爷快来呀"] = 690,
				["西索的牙"] = 720,
				["西池未央"] = 719,
				["小康家"] = 12,
				["薇薇酱"] = 715,
				["特效治疗"] = 633,
				["蓝色的丶大海"] = 714,
				["且听雨落丶"] = 22,
				["豚杆"] = 727,
				["蒙塔基钢弹"] = 712,
				["血麒麟"] = 130,
				["萬剣人踪灭"] = 709,
				["小养由基"] = 29,
				["莼蓝色"] = 708,
				["茉莉绿茶"] = 706,
				["米彩"] = 673,
				["苹果十四"] = 705,
				["苦苦冲锋"] = 704,
				["宝石骑士"] = 481,
				["洪琻寶"] = 601,
				["骑士水大叔"] = 272,
				["開心心"] = 743,
				["若如初见"] = 702,
				["苗战"] = 701,
				["花解语蝴蝶"] = 699,
				["靈靈怪"] = 754,
				["今年二十八"] = 278,
				["比目鱼吻"] = 591,
				["大徐州"] = 448,
				["睡的香香"] = 14,
				["三只小德"] = 117,
				["花心儿大萝卜"] = 698,
				["清扬小小牧"] = 67,
				["大佛丶"] = 79,
				["低调的保镖"] = 111,
				["月光下"] = 142,
				["肉佳馍"] = 691,
				["老歌"] = 688,
				["红色幻刺"] = 681,
				["帝王丶"] = 509,
				["伊莉莎丶"] = 78,
				["炮泡糖"] = 618,
				["Dragoncity"] = 329,
				["猎艳轰唇"] = 286,
				["落晨"] = 152,
				["凤舞离殇"] = 399,
				["丶桃子"] = 789,
				["紫衣云梦"] = 677,
				["阿咘"] = 744,
				["大胡子钢须"] = 452,
				["糖可爱"] = 675,
				["米莱狄"] = 674,
				["箫声咽"] = 670,
				["宝子"] = 476,
				["你的老婆"] = 262,
				["星尘斗士"] = 125,
				["简简单单丶"] = 667,
				["奥优给"] = 464,
				["普罗米修斯丶"] = 553,
				["竭尽所能"] = 317,
				["一粒沙"] = 785,
				["稳稳的爱"] = 665,
				["宝石绿蓝"] = 479,
				["沐雨聆风"] = 133,
				["习惯孤独"] = 369,
				["林丷"] = 575,
				["神圣道标"] = 661,
				["白胡子三娘"] = 649,
				["祖奶奶"] = 660,
				["破晓残月"] = 658,
				["朕赦你无罪"] = 564,
				["Playerkpmdxk"] = 340,
				["白小腰"] = 648,
				["有事我先走"] = 563,
				["我瞅你像猪"] = 534,
				["加菲猫"] = 405,
				["皇室节奏"] = 651,
				["剑舞丶丶魅影"] = 403,
				["电耗子"] = 644,
				["唐十伍"] = 141,
				["夜丶凌乱"] = 443,
				["吹风渠里冷"] = 421,
				["流水无痕"] = 852,
				["王大志"] = 639,
				["猫头鹰密涅瓦"] = 637,
				["猎爹大魔王"] = 636,
				["似故人来"] = 375,
				["可乐小浅"] = 413,
				["橘子汽水"] = 282,
				["芝芝奶芙"] = 877,
				["部落卡德甲"] = 274,
				["天水伯约"] = 458,
				["狂奔的蜗牛"] = 634,
				["那个朮士"] = 249,
				["牧丨無王法"] = 630,
				["牛莽夫"] = 629,
				["Dtfs"] = 330,
				["爱如空气"] = 627,
				["妖狐"] = 465,
				["雨人码头"] = 750,
				["杨十一"] = 571,
				["烦恼即菩提"] = 858,
				["Wish"] = 346,
				["临时工冯宝宝"] = 2,
				["潘潘木睛子"] = 36,
				["猪是定念着倒"] = 230,
				["潇瑟"] = 856,
				["清扬小德"] = 854,
				["福熙"] = 237,
				["佳儿"] = 24,
				["海岸"] = 604,
				["大帅哥"] = 447,
				["浩哥"] = 603,
				["浅柔"] = 602,
				["槑槑呆槑槑"] = 582,
				["大漠映残阳"] = 450,
				["沐潇潇"] = 597,
				["沈奕琳"] = 595,
				["白鷺"] = 54,
				["奔跑吧小卤蛋"] = 308,
				["凝霜"] = 398,
				["老柰"] = 39,
				["毒药多"] = 590,
				["大个一米八六"] = 446,
				["每天都要玩"] = 589,
				["风涧骑"] = 43,
				["罗晋"] = 112,
				["每天都做梦"] = 588,
				["蘇察哈尔灿"] = 75,
				["小矮牧"] = 258,
				["龍叔"] = 144,
				["赦天琴箕团长"] = 63,
				["枫华林"] = 33,
				["日向丶雏田"] = 220,
				["狂爆"] = 52,
				["丷乄丷"] = 790,
				["小树根"] = 491,
				["小小酒缸"] = 207,
				["皮哥"] = 653,
				["基努里维斯"] = 97,
				["贺清云"] = 166,
				["安澜秀"] = 818,
				["铁堡城主"] = 57,
				["武丶大郎"] = 586,
				["正方形的圆"] = 585,
				["欢乐明哥"] = 583,
				["殺氣"] = 91,
				["基本無解"] = 440,
				["雪雨星風"] = 899,
				["山河无恙"] = 502,
				["荊軻"] = 318,
				["椰子球"] = 579,
				["梨叔"] = 578,
				["西克"] = 269,
				["桑塔纳"] = 577,
				["花非花梦非梦"] = 879,
				["枕刀歌"] = 574,
				["李老师归来"] = 569,
				["小玲噹"] = 209,
				["不良熊"] = 354,
				["李老头"] = 568,
				["琉璃"] = 862,
				["瞅你个熊色儿"] = 655,
				["好大的奶"] = 174,
				["月墨夕寒"] = 560,
				["曹婴"] = 559,
				["醉红唇"] = 321,
				["曲晓晓"] = 558,
				["暴哥"] = 556,
				["落地九八壳"] = 710,
				["刘三"] = 401,
				["甄丑"] = 863,
				["冬天熙雨"] = 390,
				["八级大狂风丶"] = 384,
				["无敌治疗术"] = 548,
				["负饿贷"] = 319,
				["血暗影"] = 162,
				["柒天鲜活"] = 66,
				["牛海皇"] = 87,
				["高里"] = 255,
				["无敌最俊朗丶"] = 547,
				["老刘的髮丝"] = 686,
				["无冷却"] = 545,
				["夙愿"] = 205,
				["匣里龙吟"] = 140,
				["青丰"] = 755,
				["搞毛啊"] = 541,
				["布呐呐"] = 506,
				["一葉知秋"] = 46,
				["捌零玖零"] = 540,
				["拟态"] = 539,
				["音浪"] = 253,
				["月小倩"] = 561,
				["Shurrik"] = 341,
				["皇家玛德里"] = 652,
				["我的头发呢"] = 533,
				["五月天"] = 298,
				["愤怒得小鸟"] = 530,
				["悠闲的杀戮"] = 528,
				["吃的饱饱"] = 10,
				["快剑格蕾"] = 527,
				["忘了出门带刀"] = 526,
				["德义双馨"] = 523,
				["圣光归来"] = 434,
				["微笑星星"] = 522,
				["微微一笑"] = 521,
				["澄心"] = 616,
				["攻其不备"] = 261,
				["Mx"] = 337,
				["铁索囚徒"] = 251,
				["小馋"] = 7,
				["等风也等你"] = 666,
				["影沉寒水"] = 519,
				["水叶"] = 593,
				["狂丶战"] = 229,
				["暴风障壁"] = 222,
				["Ex"] = 331,
				["软炮炮"] = 17,
				["倾冷月"] = 379,
				["庄亮亮"] = 513,
				["上允尢虍"] = 352,
				["红手套"] = 61,
				["雨下一整晚"] = 252,
				["咖啡沫"] = 424,
				["名将灬法"] = 417,
				["希尔纳"] = 508,
				["捅尼付死"] = 835,
				["瞳睛迷彡"] = 868,
				["巴托里"] = 505,
				["巨人追猎者"] = 504,
				["Amer"] = 124,
				["大鸟不会飞"] = 100,
				["尸不过三"] = 501,
				["天鹰翔星曲"] = 461,
				["少一个请字"] = 498,
				["耗子违之"] = 243,
				["温柔帅哥"] = 613,
				["尘世行"] = 499,
				["大萝卜的萝"] = 48,
				["青衣白发"] = 756,
				["小柒丿"] = 490,
				["瓶中小人"] = 232,
				["红杉树"] = 680,
				["井星邦邦骑"] = 793,
				["木鱼戮"] = 840,
				["宝宝我在这"] = 478,
				["临时工肖自在"] = 359,
				["事过人迁"] = 791,
				["季如枫"] = 471,
				["煜老爷"] = 624,
				["葬爱郭德纲"] = 711,
				["奎托利亚"] = 463,
				["夫子"] = 462,
				["常驻力量谷"] = 512,
				["天降正義"] = 460,
				["谈谈理想"] = 260,
				["圣大力"] = 437,
				["大狗警长"] = 451,
				["坏笑的天使"] = 439,
				["圣域丶甯"] = 436,
				["邵云"] = 738,
				["黑暗与黎明"] = 165,
				["地里热瓜"] = 438,
				["小伢"] = 485,
				["麦子大叔"] = 769,
				["可爱屁"] = 173,
				["道道盗盗到"] = 143,
				["铁盗乂在云端"] = 250,
				["卡米啦"] = 806,
				["艾因斯坦"] = 270,
				["Agile"] = 324,
				["减肥大王"] = 26,
				["特变电工"] = 860,
				["啦拉拉"] = 427,
				["吾皇"] = 422,
				["吸湮的鱼"] = 420,
				["迦城"] = 890,
				["贼嘻嘻"] = 729,
				["无忌哥哥"] = 32,
				["小飞象拉拉啦"] = 496,
				["叶落苍穹"] = 415,
				["台州丶大潘"] = 414,
				["牧遥"] = 51,
				["天山六阳掌"] = 456,
				["发光使我快乐"] = 412,
				["緋色月下"] = 5,
				["千亦丶刹"] = 410,
				["九针"] = 368,
				["峨眉居士"] = 503,
				["咕噜姆"] = 85,
				["白衣染霜华"] = 650,
				["刁爆了"] = 196,
				["开来家居"] = 516,
				["白色头像"] = 909,
				["艾格雯"] = 695,
				["窃梦者"] = 101,
				["共死"] = 193,
				["小铃噹"] = 826,
				["Usop"] = 345,
				["花开如火"] = 697,
				["西柚子"] = 68,
				["冷言"] = 395,
				["冯一刀"] = 393,
				["时间不等人"] = 551,
				["农村混血妞"] = 389,
				["兽仁战"] = 388,
				["谁同意谁反对"] = 726,
				["深卿"] = 58,
				["兰兰"] = 385,
				["日月之行"] = 550,
				["剑梦灵心"] = 161,
				["就问你快不快"] = 500,
				["免费盗底"] = 383,
				["荒野丶"] = 176,
				["十二宫"] = 409,
				["共享"] = 386,
				["纯情小浣熊"] = 238,
				["圣剑阿拉贡"] = 435,
				["强壯壯"] = 518,
				["多情"] = 912,
				["互勉"] = 371,
				["秦歌"] = 664,
				["贤斌珐师"] = 728,
				["丶大聪明"] = 361,
				["深山里板蓝根"] = 92,
				["潮汐海灵"] = 857,
				["中原大呲花"] = 358,
				["银鞍照白马"] = 894,
				["灵梦丶小贼儿"] = 617,
				["嘿壮壮"] = 204,
				["牧贵妃"] = 631,
				["瓦丝琪"] = 150,
				["罗小宁"] = 240,
				["羽西"] = 685,
				["Torr"] = 343,
				["花重锦官城"] = 295,
				["水水更健康"] = 224,
				["手抽筋了"] = 535,
				["傲笑红尘"] = 299,
				["台南"] = 200,
				["Heratl"] = 776,
				["Kele"] = 334,
				["Cpg"] = 328,
				["王丶兰花"] = 62,
				["沈鱼"] = 156,
				["Arcane"] = 326,
				["小痞子"] = 492,
				["位面灬天使"] = 376,
				["趴趴熊"] = 732,
				["小赵子"] = 155,
				["一起哩哩醉"] = 186,
				["丨风为我狂丨"] = 108,
				["徐州小霸王"] = 520,
				["圣光奶你"] = 304,
				["樱桃子"] = 914,
				["瞬间快感"] = 316,
				["石头的法神"] = 82,
				["星落"] = 313,
				["君莫笑丨"] = 808,
				["夜歌不带刀"] = 305,
				["小萝卜的萝"] = 210,
				["风华血月"] = 177,
				["三级自爆卡车"] = 65,
				["联盟舰队司令"] = 159,
				["青客"] = 160,
				["一页书叔"] = 102,
				["鱼人王多鱼"] = 768,
				["Gogo"] = 20,
				["康桑阿米达丶"] = 514,
				["暗影随风"] = 554,
				["慈悲喜舍"] = 531,
				["疯子捷哥"] = 233,
				["Attacker"] = 297,
				["唐十五"] = 426,
				["夏夜浅酌"] = 60,
				["山炮"] = 291,
				["丽娅怒风"] = 23,
				["马铁花"] = 763,
				["九江月"] = 285,
				["心灵之美"] = 283,
				["洋芋坨坨"] = 13,
				["软泡泡"] = 889,
				["英雄漠"] = 273,
				["四岁就很酷"] = 293,
				["葬爱灬野子"] = 246,
				["菜菜德丶"] = 95,
				["疯狂小牧"] = 137,
				["苦海种青莲"] = 703,
				["猫小烦"] = 861,
				["欧煌史迪仔"] = 264,
				["管我叫胖娇"] = 668,
				["天风"] = 256,
				["顶梁柱"] = 254,
				["社区扛把子"] = 659,
				["帮主任"] = 511,
				["超凶的"] = 248,
				["维斯特利"] = 239,
				["丶白胡子法神"] = 363,
				["小怪"] = 488,
				["猫是傲娇的"] = 231,
				["游人"] = 614,
				["惹不起"] = 215,
				["龘龖龍龖龘"] = 772,
				["Cococoing"] = 327,
				["黑白影子"] = 107,
				["三十四亿"] = 351,
				["八个贝壳"] = 192,
				["Missriddle"] = 336,
				["偏偏意气用事"] = 380,
				["乍见之欢"] = 366,
				["Xit"] = 347,
				["一起喝啤酒"] = 187,
				["漫步雨落"] = 35,
				["瞄秂缝"] = 259,
				["清欢与酒"] = 183,
				["毒药贰"] = 223,
				["我是你们的神"] = 178,
				["打你吐血"] = 536,
				["隔壁的红裤衩"] = 749,
				["啊船"] = 167,
				["众神老王"] = 799,
				["發丶麦发啧"] = 53,
				["超级大黑狗"] = 163,
				["红三爷"] = 679,
				["小七月"] = 148,
				["跳跳瓏"] = 281,
				["放鸽子的大猴"] = 542,
				["自豪的光头"] = 694,
				["凶残的光头"] = 400,
				["凉森婈梦"] = 69,
				["慵懒症"] = 532,
				["多听相声爱国"] = 442,
				["受伤丶小豆丁"] = 73,
				["剑剑锋"] = 172,
				["东哥丶"] = 136,
				["学友"] = 127,
				["陌狄"] = 257,
				["自我催眠"] = 126,
				["向前冲呀"] = 118,
				["小冰雨"] = 109,
				["元芳"] = 800,
				["德憨憨"] = 104,
				["九幺丶杨先生"] = 103,
				["天火天火"] = 93,
				["延边战神"] = 515,
				["桐秋"] = 576,
				["圣光会脏死你"] = 90,
				["姬战"] = 72,
				["永恒灬圣骑"] = 850,
				["珈百璃"] = 642,
				["小猫打扑克"] = 824,
				["仍是少年"] = 797,
				["风礼"] = 759,
				["顶天立地"] = 757,
				["冰火丶两重天"] = 300,
				["阿阮"] = 746,
				["守猪逮兔"] = 474,
				["阿尔塞纳"] = 745,
				["苏拉"] = 700,
				["瞳睛迷丶"] = 656,
				["逃出绝命镇"] = 735,
				["井星邦邦"] = 792,
				["海是海洋的洋"] = 605,
			},
		},
	},
}
WIM3_Filters = {
	{
		"^OQ[,S]", -- [1]
		["enabled"] = true,
		["type"] = 1,
		["pattern"] = "^<T>PartyQuests[^A-Z]+\n^<M_N>\n^ItemDB-Request:\n^LVBM\n^YOU ARE BEING WATCHED!\n^YOU ARE MARKED!\n^YOU ARE CURSED!\n^YOU HAVE THE PLAGUE!\n^YOU ARE BURNING!\n^YOU ARE THE BOMB!\nVOLATILE INFECTION\n^/^GA[^A-Z]+\n^<METAMAP\n^<CT",
		["sent"] = true,
		["name"] = "由插件发送的悄悄话",
		["received"] = true,
		["action"] = 2,
		["stats"] = 0,
		["protected"] = true,
		["tag"] = "addons",
	}, -- [1]
	{
		["enabled"] = false,
		["type"] = 2,
		["action"] = 1,
		["friend"] = true,
		["party"] = true,
		["name"] = "悄悄话选择区1",
		["guild"] = true,
		["raid"] = true,
		["received"] = true,
		["stats"] = 0,
	}, -- [2]
	{
		["enabled"] = false,
		["type"] = 2,
		["name"] = "悄悄话选择区2",
		["action"] = 2,
		["all"] = true,
		["received"] = true,
		["stats"] = 0,
	}, -- [3]
}
WIM3_History = {
	["鱼人摩洛克"] = {
		["特变电工"] = {
			["一锅卤肉饭"] = {
				{
					["type"] = 1,
					["time"] = 1642602167,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "一锅卤肉饭",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642602177,
					["from"] = "特变电工",
					["msg"] = "输出战",
					["inbound"] = false,
					["convo"] = "一锅卤肉饭",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642602227,
					["from"] = "特变电工",
					["msg"] = "还缺近战不",
					["inbound"] = false,
					["convo"] = "一锅卤肉饭",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642602235,
					["from"] = "一锅卤肉饭",
					["msg"] = "你有组 半天了",
					["inbound"] = true,
					["convo"] = "一锅卤肉饭",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642602241,
					["from"] = "一锅卤肉饭",
					["msg"] = "大哥你不看么",
					["inbound"] = true,
					["convo"] = "一锅卤肉饭",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1642602245,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "一锅卤肉饭",
				}, -- [6]
				["info"] = {
				},
			},
			["手抽筋了"] = {
				{
					["type"] = 1,
					["time"] = 1642309510,
					["from"] = "特变电工",
					["msg"] = "我他么被你砍死了",
					["inbound"] = false,
					["convo"] = "手抽筋了",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642309514,
					["from"] = "特变电工",
					["msg"] = "擦。。",
					["inbound"] = false,
					["convo"] = "手抽筋了",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642309524,
					["from"] = "手抽筋了",
					["msg"] = "我一直被心控",
					["inbound"] = true,
					["convo"] = "手抽筋了",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642309583,
					["from"] = "手抽筋了",
					["msg"] = "你被盗贼砍死的",
					["inbound"] = true,
					["convo"] = "手抽筋了",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642309591,
					["from"] = "手抽筋了",
					["msg"] = "|cfffff468micoo|r",
					["inbound"] = true,
					["convo"] = "手抽筋了",
				}, -- [5]
				["info"] = {
				},
			},
			["毒药多"] = {
				{
					["type"] = 1,
					["time"] = 1642314664,
					["from"] = "毒药多",
					["msg"] = "咱俩  我先  然后你打断",
					["inbound"] = true,
					["convo"] = "毒药多",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642314675,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "毒药多",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642314675,
					["from"] = "毒药多",
					["msg"] = "别重复了",
					["inbound"] = true,
					["convo"] = "毒药多",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642314895,
					["from"] = "毒药多",
					["msg"] = "重复了吧",
					["inbound"] = true,
					["convo"] = "毒药多",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642314913,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "毒药多",
				}, -- [5]
				["info"] = {
				},
			},
			["小新新#5827"] = {
				{
					["type"] = 1,
					["time"] = 1642442010,
					["from"] = "特变电工",
					["msg"] = "python",
					["inbound"] = false,
					["convo"] = "小新新#5827",
				}, -- [1]
				["info"] = {
				},
			},
			["哈宁"] = {
				{
					["type"] = 1,
					["time"] = 1642316471,
					["from"] = "特变电工",
					["msg"] = "第二争夺战",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642316476,
					["from"] = "特变电工",
					["msg"] = "我刚才没毛狗",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642316488,
					["from"] = "哈宁",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "哈宁",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642316495,
					["from"] = "特变电工",
					["msg"] = "我看你全程毛",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642316500,
					["from"] = "特变电工",
					["msg"] = "差点举报你",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1642316501,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1642316530,
					["from"] = "特变电工",
					["msg"] = "那个狗会给一个DEBUFF 很痛",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1642316548,
					["from"] = "哈宁",
					["msg"] = "没办法啊，boss 没得打，只能毛狗了",
					["inbound"] = true,
					["convo"] = "哈宁",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1642316573,
					["from"] = "特变电工",
					["msg"] = "我当时是领先你3万 开打前",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1642316587,
					["from"] = "特变电工",
					["msg"] = "然后打完之后你超过我1万",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1642316598,
					["from"] = "哈宁",
					["msg"] = "毛呀，毛的厉害哈哈",
					["inbound"] = true,
					["convo"] = "哈宁",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1642316609,
					["from"] = "特变电工",
					["msg"] = "等会结算你要扣4万 哈哈",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1642316655,
					["from"] = "特变电工",
					["msg"] = "元素磨刀石 我忘带了",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1642316668,
					["from"] = "哈宁",
					["msg"] = "我也是后面 换的",
					["inbound"] = true,
					["convo"] = "哈宁",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1642318517,
					["from"] = "特变电工",
					["msg"] = "半路杀出来一个程咬金",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1642318523,
					["from"] = "特变电工",
					["msg"] = "我们都没补助了",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1642318524,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1642318535,
					["from"] = "特变电工",
					["msg"] = "老10不敢猛打",
					["inbound"] = false,
					["convo"] = "哈宁",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1642318537,
					["from"] = "哈宁",
					["msg"] = "哈哈，没办法",
					["inbound"] = true,
					["convo"] = "哈宁",
				}, -- [19]
				["info"] = {
				},
			},
			["小馋"] = {
				{
					["type"] = 1,
					["time"] = 1641915490,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "小馋",
				}, -- [1]
				["info"] = {
				},
			},
			["中原大呲花"] = {
				{
					["type"] = 1,
					["time"] = 1641617746,
					["from"] = "中原大呲花",
					["msg"] = "你好 我通过工会群里面加你微信了",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641618710,
					["from"] = "特变电工",
					["msg"] = "退组",
					["inbound"] = false,
					["convo"] = "中原大呲花",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641618717,
					["from"] = "中原大呲花",
					["msg"] = "1111",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641618750,
					["from"] = "特变电工",
					["msg"] = "什么翼",
					["inbound"] = false,
					["convo"] = "中原大呲花",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641618757,
					["from"] = "中原大呲花",
					["msg"] = "恩",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641618762,
					["from"] = "中原大呲花",
					["msg"] = "张",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641618785,
					["from"] = "特变电工",
					["msg"] = "谢",
					["inbound"] = false,
					["convo"] = "中原大呲花",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641618788,
					["from"] = "中原大呲花",
					["msg"] = "客气",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [8]
				["info"] = {
				},
			},
			["Kaka"] = {
				{
					["type"] = 1,
					["time"] = 1642235739,
					["from"] = "Kaka",
					["msg"] = "<大脚团队提示>欢迎加入本团队，希望我们合作愉快，拥有一次快乐的冒险旅程。",
					["inbound"] = true,
					["convo"] = "Kaka",
				}, -- [1]
				["info"] = {
				},
			},
			["阿摇"] = {
				{
					["type"] = 1,
					["time"] = 1641640396,
					["from"] = "特变电工",
					["msg"] = "已经起飞了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641640407,
					["from"] = "阿摇",
					["msg"] = "哈哈哈 这几天在约会 都没看- -",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641640411,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [3]
				["info"] = {
				},
			},
			["子木子也"] = {
				{
					["type"] = 1,
					["time"] = 1641718847,
					["from"] = "子木子也",
					["msg"] = "老哥 才冲击多少啊",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641718854,
					["from"] = "特变电工",
					["msg"] = "9900",
					["inbound"] = false,
					["convo"] = "子木子也",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641718869,
					["from"] = "子木子也",
					["msg"] = "叶子呢",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641718874,
					["from"] = "子木子也",
					["msg"] = "我参考下价格- - ",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641718876,
					["from"] = "特变电工",
					["msg"] = "3000",
					["inbound"] = false,
					["convo"] = "子木子也",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641718880,
					["from"] = "子木子也",
					["msg"] = "谢谢",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [6]
				["info"] = {
				},
			},
			["芜湖小司马"] = {
				{
					["type"] = 1,
					["time"] = 1641720936,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641720943,
					["from"] = "特变电工",
					["msg"] = "你的泰坦怎么还有2消失",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641720954,
					["from"] = "特变电工",
					["msg"] = "点错了？",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641723341,
					["from"] = "芜湖小司马",
					["msg"] = "什么？",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641723358,
					["from"] = "芜湖小司马",
					["msg"] = "刚才 MC你没吃第二瓶泰坦啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641723373,
					["from"] = "特变电工",
					["msg"] = "吃了啊",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641723380,
					["from"] = "特变电工",
					["msg"] = "我还剩1分钟",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641723381,
					["from"] = "特变电工",
					["msg"] = "现在",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641723387,
					["from"] = "芜湖小司马",
					["msg"] = "我也1分钟啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641723391,
					["from"] = "芜湖小司马",
					["msg"] = "一样  哈哈",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641723393,
					["from"] = "特变电工",
					["msg"] = "那就是插件BUG",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641723429,
					["from"] = "芜湖小司马",
					["msg"] = "下了 吃饭去 ",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641723443,
					["from"] = "特变电工",
					["msg"] = "嗯嗯 ",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1642309219,
					["from"] = "芜湖小司马",
					["msg"] = "怒气药水多吗 兄弟 要是有多的卖我一组",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1642309227,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1642309231,
					["from"] = "特变电工",
					["msg"] = "我从来不吃",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1642309236,
					["from"] = "芜湖小司马",
					["msg"] = "啊 你不吃啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1642309247,
					["from"] = "芜湖小司马",
					["msg"] = "你真狠 ",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1642309247,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1642309251,
					["from"] = "特变电工",
					["msg"] = "一样起飞",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1642309260,
					["from"] = "芜湖小司马",
					["msg"] = "我打不出来 输出 手法不行",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1642320266,
					["from"] = "特变电工",
					["msg"] = "|Hgarrmission:weakauras|h|cFF8800FF[特变电工-鱼.人.摩.洛.克 |r|cFF8800FF- 狂暴戰]|h|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1642320296,
					["from"] = "芜湖小司马",
					["msg"] = "那个WA 怎么弄啊 放在哪",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1642320301,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1642320303,
					["from"] = "芜湖小司马",
					["msg"] = "我不太会 你教教我",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1642320313,
					["from"] = "特变电工",
					["msg"] = " /wa",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1642320313,
					["from"] = "芜湖小司马",
					["msg"] = "我经常是 打不到小怪",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1642320335,
					["from"] = "芜湖小司马",
					["msg"] = "啥意思",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1642320338,
					["from"] = "特变电工",
					["msg"] = "百度搜教程把",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1642320342,
					["from"] = "特变电工",
					["msg"] = "简单的一批",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1642320343,
					["from"] = "芜湖小司马",
					["msg"] = "你怎么给我啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1642320352,
					["from"] = "芜湖小司马",
					["msg"] = "加个QQ吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1642320353,
					["from"] = "特变电工",
					["msg"] = "WA是一个通用的插件",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1642320370,
					["from"] = "特变电工",
					["msg"] = "你下好了 游戏导给你",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1642320377,
					["from"] = "特变电工",
					["msg"] = "点击就可以自动导入了",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1642320419,
					["from"] = "芜湖小司马",
					["msg"] = "=下啊 我现在 应该先去百度 搜什么。。",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1642320423,
					["from"] = "芜湖小司马",
					["msg"] = "我太逆天了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1642320475,
					["from"] = "特变电工",
					["msg"] = "怀旧服 WA",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1642320485,
					["from"] = "特变电工",
					["msg"] = "你要多研究",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1642320491,
					["from"] = "特变电工",
					["msg"] = "那个插件无敌",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1642320503,
					["from"] = "芜湖小司马",
					["msg"] = "行 我先去百度 搜怀旧服WA对吧",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1642320511,
					["from"] = "特变电工",
					["msg"] = "BUG般的存在",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1642320853,
					["from"] = "芜湖小司马",
					["msg"] = "你下线吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1642320860,
					["from"] = "特变电工",
					["msg"] = "补",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1642320937,
					["from"] = "芜湖小司马",
					["msg"] = "行 我线研究研究怎么下载 ",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1642321028,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1642321057,
					["from"] = "特变电工",
					["msg"] = "你下一个黑盒工坊",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1642321069,
					["from"] = "特变电工",
					["msg"] = "里面插件集随便装",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1642321077,
					["from"] = "特变电工",
					["msg"] = "中国顶级程序员兼全球顶级投资家",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1642321082,
					["from"] = "特变电工",
					["msg"] = "带你起飞",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1642321128,
					["from"] = "芜湖小司马",
					["msg"] = "我下完黑盒工坊 还用下WA吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1642321135,
					["from"] = "特变电工",
					["msg"] = "里面下WA",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1642321175,
					["from"] = "芜湖小司马",
					["msg"] = "你有官网吗 我怕我点错了 点那些流氓网站",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1642321209,
					["from"] = "芜湖小司马",
					["msg"] = "之前下点单机游戏 电脑就宕机了。。",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1642326273,
					["from"] = "芜湖小司马",
					["msg"] = "兄弟 我那个WA要下载到哪里啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1642326343,
					["from"] = "特变电工",
					["msg"] = "黑盒工坊会自动下到游戏里",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1642326352,
					["from"] = "芜湖小司马",
					["msg"] = "我直接下载就可以是吧",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1642326354,
					["from"] = "特变电工",
					["msg"] = "你是第一次玩魔兽吗",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1642326355,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1642326356,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1642326358,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1642326366,
					["from"] = "芜湖小司马",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1642326374,
					["from"] = "芜湖小司马",
					["msg"] = "要让我选择路径",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1642326381,
					["from"] = "芜湖小司马",
					["msg"] = "不是啊 只是之前没用过WA",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1642326387,
					["from"] = "特变电工",
					["msg"] = "你先选赛季服的",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1642326513,
					["from"] = "芜湖小司马",
					["msg"] = "我多少有点弄不明白 哈哈。。",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1642326622,
					["from"] = "特变电工",
					["msg"] = "我真的是",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1642326783,
					["from"] = "芜湖小司马",
					["msg"] = "没事 我这有人给弄  哈哈",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1642326797,
					["from"] = "芜湖小司马",
					["msg"] = "一会 我弄下你那个WA",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1642326832,
					["from"] = "特变电工",
					["msg"] = "我自己写的 独创",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1642326838,
					["from"] = "特变电工",
					["msg"] = "最佳解决方案",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1642326861,
					["from"] = "芜湖小司马",
					["msg"] = "就直接导入 然后我什么都不用弄是吧",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1642326870,
					["from"] = "芜湖小司马",
					["msg"] = "我感觉 你这个 肯定很牛逼",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1642326881,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1642326888,
					["from"] = "芜湖小司马",
					["msg"] = "你每次都前五 我好多时候 打不到小怪",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1642326895,
					["from"] = "芜湖小司马",
					["msg"] = "你战歌 是国家队吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1642326900,
					["from"] = "特变电工",
					["msg"] = "不是",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1642327045,
					["from"] = "特变电工",
					["msg"] = "那个不解决打不到怪的问题",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1642327268,
					["from"] = "芜湖小司马",
					["msg"] = "嗯 没事 那应该也比我这个什么都没有的强",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1642327287,
					["from"] = "芜湖小司马",
					["msg"] = "我这个真是 太吓人了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1642327302,
					["from"] = "芜湖小司马",
					["msg"] = "你战歌 单排 1刷荣誉还是声望啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1642327315,
					["from"] = "特变电工",
					["msg"] = "砍人就为了",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1642327387,
					["from"] = "芜湖小司马",
					["msg"] = "哈哈 可以",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1642330940,
					["from"] = "芜湖小司马",
					["msg"] = "老哥 那个WA 我弄好了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1642330957,
					["from"] = "特变电工",
					["msg"] = "|Hgarrmission:weakauras|h|cFF8800FF[特变电工-鱼.人.摩.洛.克 |r|cFF8800FF- 狂暴戰]|h|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1642331546,
					["from"] = "芜湖小司马",
					["msg"] = "老哥 吃饭去了吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1642331570,
					["from"] = "特变电工",
					["msg"] = "我发你了啊",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1642331573,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1642331575,
					["from"] = "特变电工",
					["msg"] = "|Hgarrmission:weakauras|h|cFF8800FF[特变电工-鱼.人.摩.洛.克 |r|cFF8800FF- 狂暴戰]|h|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1642331578,
					["from"] = "芜湖小司马",
					["msg"] = "啊？",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1642331582,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1642331583,
					["from"] = "芜湖小司马",
					["msg"] = "那我 怎么接受",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1642331587,
					["from"] = "特变电工",
					["msg"] = "点击",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1642331591,
					["from"] = "特变电工",
					["msg"] = "链接",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1642331598,
					["from"] = "特变电工",
					["msg"] = "等他传输完",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1642331665,
					["from"] = "芜湖小司马",
					["msg"] = "我 /wa 这样 对吧",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1642331676,
					["from"] = "特变电工",
					["msg"] = "你先/wa",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1642331683,
					["from"] = "芜湖小司马",
					["msg"] = "嗯 然后呢",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1642331715,
					["from"] = "特变电工",
					["msg"] = "有出来框框马",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1642331720,
					["from"] = "芜湖小司马",
					["msg"] = "有的",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1642331725,
					["from"] = "特变电工",
					["msg"] = "|Hgarrmission:weakauras|h|cFF8800FF[特变电工-鱼.人.摩.洛.克 |r|cFF8800FF- 狂暴戰]|h|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1642331733,
					["from"] = "特变电工",
					["msg"] = "我发你了链接",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1642331738,
					["from"] = "特变电工",
					["msg"] = "点一下看见没",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1642331749,
					["from"] = "芜湖小司马",
					["msg"] = "右边 有好多东西",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1642331759,
					["from"] = "特变电工",
					["msg"] = "导入了没",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1642331768,
					["from"] = "芜湖小司马",
					["msg"] = "点导入 然后什么都没有",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1642331789,
					["from"] = "特变电工",
					["msg"] = "然后/wa 能看见狂暴战那个群组马",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1642331875,
					["from"] = "芜湖小司马",
					["msg"] = "老哥 这样 你看你方便吗 要不我加你个QQ你远程 帮我弄下行吗 我太笨了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1642331916,
					["from"] = "特变电工",
					["msg"] = "向日葵",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1642331917,
					["from"] = "特变电工",
					["msg"] = "下一个",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1642332110,
					["from"] = "特变电工",
					["msg"] = "30962088 加我吧 ",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1642332205,
					["from"] = "芜湖小司马",
					["msg"] = "老哥 我加你了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1642332339,
					["from"] = "特变电工",
					["msg"] = "|Hgarrmission:weakauras|h|cFF8800FF[特变电工-鱼.人.摩.洛.克 |r|cFF8800FF- 狂暴戰]|h|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1642332354,
					["from"] = "特变电工",
					["msg"] = "|Hgarrmission:weakauras|h|cFF8800FF[特变电工-鱼.人.摩.洛.克 |r|cFF8800FF- 狂暴戰]|h|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1642333561,
					["from"] = "芜湖小司马",
					["msg"] = "你打战歌了啊？",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1642333578,
					["from"] = "芜湖小司马",
					["msg"] = "行 那我先组别先打着",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1642333587,
					["from"] = "芜湖小司马",
					["msg"] = "你打奥山吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1642333595,
					["from"] = "芜湖小司马",
					["msg"] = "你要是打 给你留个坑一块大",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1642333601,
					["from"] = "特变电工",
					["msg"] = "都打 你不管我",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1642333605,
					["from"] = "特变电工",
					["msg"] = "你排",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1642333622,
					["from"] = "芜湖小司马",
					["msg"] = "行 那我排啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1642335639,
					["from"] = "芜湖小司马",
					["msg"] = "战歌荣誉多吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1642335670,
					["from"] = "特变电工",
					["msg"] = "还行",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1642335672,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1642335743,
					["from"] = "芜湖小司马",
					["msg"] = "1小时能打多少啊 1W有吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1642336597,
					["from"] = "芜湖小司马",
					["msg"] = "现在奥山 太坑了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [126]
				["info"] = {
				},
			},
			["大个一米八六"] = {
				{
					["type"] = 1,
					["time"] = 1641702731,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641703634,
					["from"] = "特变电工",
					["msg"] = "2队近战需要一个光环猎人",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641718032,
					["from"] = "特变电工",
					["msg"] = "卖我点",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642307467,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [4]
				["info"] = {
				},
			},
			["审判"] = {
				{
					["type"] = 1,
					["time"] = 1641642204,
					["from"] = "审判",
					["msg"] = "求换个位面，谢谢！",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641642208,
					["from"] = "特变电工",
					["msg"] = "满了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641642214,
					["from"] = "特变电工",
					["msg"] = "在奥山",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641642216,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641642222,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r|cffa335ee|Hitem:19325::::::::60:::::::::|h[胡里奥指环]|h|r",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641642224,
					["from"] = "审判",
					["msg"] = "好的。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641728487,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641728493,
					["from"] = "审判",
					["msg"] = "怎么了？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641728494,
					["from"] = "特变电工",
					["msg"] = "冲击腰带9900 我P了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641728502,
					["from"] = "特变电工",
					["msg"] = "太贵",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641728509,
					["from"] = "审判",
					["msg"] = "过万正常啊。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641728517,
					["from"] = "特变电工",
					["msg"] = "不正常",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641728528,
					["from"] = "审判",
					["msg"] = "有1W8买的。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1642001353,
					["from"] = "特变电工",
					["msg"] = "跟我战场起飞",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1642001358,
					["from"] = "特变电工",
					["msg"] = "我太强",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1642001361,
					["from"] = "审判",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1642001363,
					["from"] = "特变电工",
					["msg"] = "每场都是第一",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1642001370,
					["from"] = "特变电工",
					["msg"] = "带你起飞",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1642001381,
					["from"] = "审判",
					["msg"] = "你是40人排队啊？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1642001393,
					["from"] = "特变电工",
					["msg"] = "不是",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1642001395,
					["from"] = "特变电工",
					["msg"] = "单排",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1642001406,
					["from"] = "审判",
					["msg"] = "我刷声望。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1642001426,
					["from"] = "特变电工",
					["msg"] = "PVP好玩",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1642001454,
					["from"] = "特变电工",
					["msg"] = "阿拉希 战歌都打",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1642001460,
					["from"] = "审判",
					["msg"] = "我刷奥山。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1642254304,
					["from"] = "特变电工",
					["msg"] = "还在刷小本",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1642254310,
					["from"] = "审判",
					["msg"] = "做合计",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1642254311,
					["from"] = "特变电工",
					["msg"] = "赶紧来跟我战歌 奥山起飞",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1642254312,
					["from"] = "审判",
					["msg"] = "合剂。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1642254326,
					["from"] = "审判",
					["msg"] = "我刷声望啊，晚点。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1642254346,
					["from"] = "特变电工",
					["msg"] = "啥合剂",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1642254351,
					["from"] = "特变电工",
					["msg"] = "泰坦会做吗",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1642254353,
					["from"] = "审判",
					["msg"] = "精炼",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1642254359,
					["from"] = "审判",
					["msg"] = "泰坦在收配方。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1642254373,
					["from"] = "特变电工",
					["msg"] = "自由行动呢。",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1642254381,
					["from"] = "审判",
					["msg"] = "那个简单。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1642254384,
					["from"] = "特变电工",
					["msg"] = "现在太贵了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1642254395,
					["from"] = "特变电工",
					["msg"] = "我已经很久没吃过了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1642254396,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1642254406,
					["from"] = "审判",
					["msg"] = "哈哈，去钓鱼",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1642254430,
					["from"] = "特变电工",
					["msg"] = "特变电工的亏了我100万瓶自由行动",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1642254450,
					["from"] = "审判",
					["msg"] = "怎么又亏了？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1642254559,
					["from"] = "特变电工",
					["msg"] = "回调",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [43]
				["info"] = {
				},
			},
			["命不由天定"] = {
				{
					["type"] = 1,
					["time"] = 1641394866,
					["from"] = "特变电工",
					["msg"] = "起飞吗",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641394913,
					["from"] = "命不由天定",
					["msg"] = "不是本人，{龇牙}",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641403756,
					["from"] = "命不由天定",
					["msg"] = "我来了哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641403759,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641403763,
					["from"] = "特变电工",
					["msg"] = "已经开始了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641403773,
					["from"] = "特变电工",
					["msg"] = "最后一把睡觉了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641403784,
					["from"] = "命不由天定",
					["msg"] = "嗯嗯 我到2点睡哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641487203,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641487208,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641487469,
					["from"] = "命不由天定",
					["msg"] = "有BL守",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641487526,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641487627,
					["from"] = "特变电工",
					["msg"] = "我在南塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641487629,
					["from"] = "特变电工",
					["msg"] = "你没看见。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641487646,
					["from"] = "命不由天定",
					["msg"] = "死了，过不去有BL",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1642090842,
					["from"] = "命不由天定",
					["msg"] = "怎么又打战歌了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1642090847,
					["from"] = "特变电工",
					["msg"] = "好玩",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1642090851,
					["from"] = "特变电工",
					["msg"] = "奥山不好玩",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1642091132,
					["from"] = "特变电工",
					["msg"] = "我是真的强",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1642091141,
					["from"] = "特变电工",
					["msg"] = "场场COVER全场",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1642091149,
					["from"] = "命不由天定",
					["msg"] = "厉害",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1642348728,
					["from"] = "命不由天定",
					["msg"] = "你到多少了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1642348734,
					["from"] = "特变电工",
					["msg"] = "7",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1642348740,
					["from"] = "命不由天定",
					["msg"] = "好慢",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1642348898,
					["from"] = "特变电工",
					["msg"] = ".",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1642348905,
					["from"] = "特变电工",
					["msg"] = "一周一次",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [25]
				["info"] = {
				},
			},
			["古月"] = {
				{
					["type"] = 1,
					["time"] = 1641827485,
					["from"] = "特变电工",
					["msg"] = "第二午夜团是周几几点",
					["inbound"] = false,
					["convo"] = "古月",
				}, -- [1]
				["info"] = {
				},
			},
			["茅台酒"] = {
				{
					["type"] = 1,
					["time"] = 1642326488,
					["from"] = "特变电工",
					["msg"] = "起飞了没有",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642326496,
					["from"] = "茅台酒",
					["msg"] = "什么起飞",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642326499,
					["from"] = "特变电工",
					["msg"] = "装备",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642326515,
					["from"] = "茅台酒",
					["msg"] = "可以打工MC",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642326555,
					["from"] = "特变电工",
					["msg"] = "贵死人",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1642326561,
					["from"] = "特变电工",
					["msg"] = "赛季服战士装备",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1642326571,
					["from"] = "特变电工",
					["msg"] = "冲击腰带1W起步",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1642326578,
					["from"] = "特变电工",
					["msg"] = "削骨1.5W起步价",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [8]
				["info"] = {
				},
			},
			["德陛"] = {
				{
					["type"] = 1,
					["time"] = 1642096533,
					["from"] = "特变电工",
					["msg"] = "just beat it",
					["inbound"] = false,
					["convo"] = "德陛",
				}, -- [1]
				["info"] = {
				},
			},
			["卡卡汐"] = {
				{
					["type"] = 1,
					["time"] = 1642270396,
					["from"] = "特变电工",
					["msg"] = "3",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642270408,
					["from"] = "卡卡汐",
					["msg"] = "？",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642270410,
					["from"] = "特变电工",
					["msg"] = "加基森一别 多少天了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642270428,
					["from"] = "卡卡汐",
					["msg"] = "20天左右",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642270431,
					["from"] = "特变电工",
					["msg"] = "毛",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1642270434,
					["from"] = "特变电工",
					["msg"] = "至少一个月",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1642270441,
					["from"] = "卡卡汐",
					["msg"] = "DPS 第一要来标下不",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1642270446,
					["from"] = "特变电工",
					["msg"] = "我超强",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1642270451,
					["from"] = "特变电工",
					["msg"] = "铁炉堡门口插旗",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1642270458,
					["from"] = "卡卡汐",
					["msg"] = "来",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1642270466,
					["from"] = "卡卡汐",
					["msg"] = "等下我交个任务 ",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1642270472,
					["from"] = "特变电工",
					["msg"] = "你法师打不过战士就搞笑二零",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1642270485,
					["from"] = "卡卡汐",
					["msg"] = "打ZS  别说我欺负你",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1642270512,
					["from"] = "卡卡汐",
					["msg"] = "等下",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1642270523,
					["from"] = "卡卡汐",
					["msg"] = "我把BUFF点掉了",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1642270527,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1642270533,
					["from"] = "特变电工",
					["msg"] = "我战场出来了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1642270534,
					["from"] = "特变电工",
					["msg"] = "88",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1642270545,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1642270547,
					["from"] = "卡卡汐",
					["msg"] = "别 我欺负一下你",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1642270548,
					["from"] = "特变电工",
					["msg"] = "战歌",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1642270557,
					["from"] = "特变电工",
					["msg"] = "我把把都是第一杀",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1642270565,
					["from"] = "特变电工",
					["msg"] = "无奶把把第一",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1642270573,
					["from"] = "特变电工",
					["msg"] = "你敢信吗",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1642270576,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1642270581,
					["from"] = "卡卡汐",
					["msg"] = "什么 ZS 都是渣渣",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1642270601,
					["from"] = "特变电工",
					["msg"] = "你等会跟我一起排 你看我是不是把把第一",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1642270706,
					["from"] = "卡卡汐",
					["msg"] = "我完了 10年ZS  我会不知道",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1642270741,
					["from"] = "特变电工",
					["msg"] = "那你是太菜",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1642270743,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1642270752,
					["from"] = "特变电工",
					["msg"] = "你来跟我排你就知道我好强",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1642270780,
					["from"] = "卡卡汐",
					["msg"] = "单挑",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1642270802,
					["from"] = "卡卡汐",
					["msg"] = "群架 都可以脸呀",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1642270830,
					["from"] = "卡卡汐",
					["msg"] = "武器战天赋没错",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1642271217,
					["from"] = "卡卡汐",
					["msg"] = "铁炉堡等你",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1642271252,
					["from"] = "卡卡汐",
					["msg"] = "来来",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1642271421,
					["from"] = "特变电工",
					["msg"] = "来",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1642271438,
					["from"] = "卡卡汐",
					["msg"] = "门口",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1642271514,
					["from"] = "特变电工",
					["msg"] = "抽根烟",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1642271516,
					["from"] = "特变电工",
					["msg"] = "马上",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1642271526,
					["from"] = "卡卡汐",
					["msg"] = "JJ我下本呢",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1642271541,
					["from"] = "卡卡汐",
					["msg"] = "我也抽烟不影响",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1642271548,
					["from"] = "卡卡汐",
					["msg"] = "速度",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1642271650,
					["from"] = "特变电工",
					["msg"] = "菜鸡",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1642271658,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1642271663,
					["from"] = "卡卡汐",
					["msg"] = "让你打的",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1642271672,
					["from"] = "卡卡汐",
					["msg"] = "想逗下你",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1642271675,
					["from"] = "特变电工",
					["msg"] = "我自由行动都没喝冰反都没用",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1642271685,
					["from"] = "特变电工",
					["msg"] = "让了你2招",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1642271692,
					["from"] = "卡卡汐",
					["msg"] = "切",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1642271694,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1642271696,
					["from"] = "特变电工",
					["msg"] = "真的菜",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1642271704,
					["from"] = "特变电工",
					["msg"] = "上来直接贴脸养我",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1642271707,
					["from"] = "特变电工",
					["msg"] = "笑死我了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1642271720,
					["from"] = "卡卡汐",
					["msg"] = "让你破盾",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1642271741,
					["from"] = "特变电工",
					["msg"] = "见识到我的厉害了没",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1642271750,
					["from"] = "卡卡汐",
					["msg"] = "一般",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1642271762,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:18634::::::::60:::::::::|h[超低温寒冰偏斜器]|h|r|cff0070dd|Hitem:18854::::::::60:::::::::|h[联盟徽记]|h|r",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1642271768,
					["from"] = "特变电工",
					["msg"] = "没用 让你打我",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1642271783,
					["from"] = "卡卡汐",
					["msg"] = "老实ZS说就是你大元帅也不需你的",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1642271796,
					["from"] = "特变电工",
					["msg"] = "你输了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1642271799,
					["from"] = "卡卡汐",
					["msg"] = "R14的ZS我都杀 过  希利苏斯",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1642271808,
					["from"] = "卡卡汐",
					["msg"] = "不辩解",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1642271813,
					["from"] = "特变电工",
					["msg"] = "R14的战士我随便杀",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1642271819,
					["from"] = "特变电工",
					["msg"] = "我战士经常杀",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1642271824,
					["from"] = "特变电工",
					["msg"] = "R14的法师我都一样杀",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1642271829,
					["from"] = "卡卡汐",
					["msg"] = "输了 就是输了 你厉害",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1642271844,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1642271846,
					["from"] = "特变电工",
					["msg"] = "兄弟",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1642271857,
					["from"] = "特变电工",
					["msg"] = "一起打战场",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1642271872,
					["from"] = "卡卡汐",
					["msg"] = "我个人喜好副本",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1642271879,
					["from"] = "卡卡汐",
					["msg"] = "战场 枯燥",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1642271908,
					["from"] = "卡卡汐",
					["msg"] = "一般插旗 我都会给ZS破盾我在出手",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1642271938,
					["from"] = "卡卡汐",
					["msg"] = "要不ZS 根本没机会  卡8码",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1642271979,
					["from"] = "卡卡汐",
					["msg"] = "防战士 我一套可以带走他",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1642272057,
					["from"] = "特变电工",
					["msg"] = "副本没意思",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1642272073,
					["from"] = "卡卡汐",
					["msg"] = "我两个号换着下",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1642272088,
					["from"] = "卡卡汐",
					["msg"] = "P2要开了",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1642272105,
					["from"] = "卡卡汐",
					["msg"] = "后面的世界很精彩",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1642272119,
					["from"] = "特变电工",
					["msg"] = "我副本都是为了拿PVP装",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1642272135,
					["from"] = "特变电工",
					["msg"] = "随便打打都是第一DPS",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1642272147,
					["from"] = "卡卡汐",
					["msg"] = "PVP 装备只能PVP",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1642272163,
					["from"] = "特变电工",
					["msg"] = "我拿PVP打战场",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1642272167,
					["from"] = "卡卡汐",
					["msg"] = "问题这游戏主流 野外没BL杀那个 ",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1642272177,
					["from"] = "卡卡汐",
					["msg"] = "以后去堵门 一起",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1642272229,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1642272394,
					["from"] = "特变电工",
					["msg"] = "睡觉",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1642272397,
					["from"] = "特变电工",
					["msg"] = "坑了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1642272458,
					["from"] = "卡卡汐",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [89]
				["info"] = {
				},
			},
			["海鸟跟鱼相爱"] = {
				{
					["type"] = 1,
					["time"] = 1641719209,
					["from"] = "特变电工",
					["msg"] = "1个有限无敌 害我没打第一",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641719221,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "~啊。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641719226,
					["from"] = "特变电工",
					["msg"] = "老1全程地板",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641719228,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641719232,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我本来第二。。。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641719241,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "然后老10躺尸了",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641719245,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "血崩。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641719254,
					["from"] = "特变电工",
					["msg"] = "我全程基本上没用英勇",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641719268,
					["from"] = "特变电工",
					["msg"] = "全程顺劈",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641719274,
					["from"] = "特变电工",
					["msg"] = "仇恨太低了",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641719276,
					["from"] = "特变电工",
					["msg"] = "T的",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641720483,
					["from"] = "特变电工",
					["msg"] = "下次",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641720490,
					["from"] = "特变电工",
					["msg"] = "我们商量好",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641720494,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "好的= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641720499,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "= =你要啥",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641720503,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我只要艾古了",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641720504,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "~~~~~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641720505,
					["from"] = "特变电工",
					["msg"] = "提前拍",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641720520,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "艾古我都不是很想要。。。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641720522,
					["from"] = "特变电工",
					["msg"] = "我们先提前拍 然后不要的",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641720526,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "你要风脸不= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641720534,
					["from"] = "特变电工",
					["msg"] = "给差价的70%",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641720541,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "OJBK",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641720557,
					["from"] = "特变电工",
					["msg"] = "我不要艾古",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641720563,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我也不要= =那你要啥",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641720566,
					["from"] = "特变电工",
					["msg"] = "我要橙锤和削骨",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641720576,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "  = =削骨~~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641720579,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我也想要~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641720580,
					["from"] = "特变电工",
					["msg"] = "我是PVP选手",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641720584,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我也是~~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641720588,
					["from"] = "特变电工",
					["msg"] = "你是个锤子",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641720591,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "算了 无所谓了= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641720596,
					["from"] = "特变电工",
					["msg"] = "你买艾古",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641720602,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我不想要 艾古= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641720602,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641720618,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "= =算了 不顶你",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641720623,
					["from"] = "特变电工",
					["msg"] = "顶我我就P",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641720624,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641720628,
					["from"] = "特变电工",
					["msg"] = "我去按摩",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641720631,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "= =你不要骗我",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641720633,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "走了 按摩去",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641720636,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "拜拜",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641720639,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641720655,
					["from"] = "特变电工",
					["msg"] = "冲击下次这几个人顶到6000我就P",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641720682,
					["from"] = "特变电工",
					["msg"] = "然后按摩+1",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641720683,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641720692,
					["from"] = "特变电工",
					["msg"] = "削骨你要不要",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641720707,
					["from"] = "特变电工",
					["msg"] = "冲击对PVP的提升不是很大",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [48]
				["info"] = {
				},
			},
			["Aicc"] = {
				{
					["type"] = 1,
					["time"] = 1641703906,
					["from"] = "特变电工",
					["msg"] = "问下你这边天赋出光环了么",
					["inbound"] = false,
					["convo"] = "Aicc",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641704055,
					["from"] = "Aicc",
					["msg"] = "出了",
					["inbound"] = true,
					["convo"] = "Aicc",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642308401,
					["from"] = "特变电工",
					["msg"] = "光环谢谢",
					["inbound"] = false,
					["convo"] = "Aicc",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642308402,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "Aicc",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642308416,
					["from"] = "Aicc",
					["msg"] = "别急  知道开。",
					["inbound"] = true,
					["convo"] = "Aicc",
				}, -- [5]
				["info"] = {
				},
			},
			["求心"] = {
				{
					["type"] = 1,
					["time"] = 1641622145,
					["from"] = "特变电工",
					["msg"] = "好啊",
					["inbound"] = false,
					["convo"] = "求心",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641622181,
					["from"] = "特变电工",
					["msg"] = "小德T0.5如何",
					["inbound"] = false,
					["convo"] = "求心",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641622194,
					["from"] = "特变电工",
					["msg"] = "战士T0.5 跟R10差不多",
					["inbound"] = false,
					["convo"] = "求心",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641622196,
					["from"] = "求心",
					["msg"] = "不如R10，",
					["inbound"] = true,
					["convo"] = "求心",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641622207,
					["from"] = "求心",
					["msg"] = "战场有个移动加成",
					["inbound"] = true,
					["convo"] = "求心",
				}, -- [5]
				["info"] = {
				},
			},
			["天元邓刚"] = {
				{
					["type"] = 1,
					["time"] = 1641640948,
					["from"] = "特变电工",
					["msg"] = "一人守一个吧",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641640954,
					["from"] = "特变电工",
					["msg"] = "你北塔",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641640955,
					["from"] = "天元邓刚",
					["msg"] = "不用 ",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641640961,
					["from"] = "天元邓刚",
					["msg"] = "早晚得别开",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641640964,
					["from"] = "天元邓刚",
					["msg"] = "就杀人",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641640997,
					["from"] = "特变电工",
					["msg"] = "他们进不来了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641641215,
					["from"] = "天元邓刚",
					["msg"] = "战斗贼。",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641641426,
					["from"] = "天元邓刚",
					["msg"] = "人多了 守旗子吧",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641641437,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641641480,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641641485,
					["from"] = "特变电工",
					["msg"] = "挡了这么久",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641641494,
					["from"] = "特变电工",
					["msg"] = "前面太慢",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641641516,
					["from"] = "特变电工",
					["msg"] = "毛",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641641519,
					["from"] = "特变电工",
					["msg"] = "雷矛",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641641660,
					["from"] = "特变电工",
					["msg"] = "爽",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641641668,
					["from"] = "特变电工",
					["msg"] = "8杀",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641641670,
					["from"] = "天元邓刚",
					["msg"] = "哈哈 ",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641641680,
					["from"] = "特变电工",
					["msg"] = "墓地",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641641685,
					["from"] = "特变电工",
					["msg"] = "杀复活的",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641641689,
					["from"] = "天元邓刚",
					["msg"] = "来不及了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641641779,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641641780,
					["from"] = "特变电工",
					["msg"] = "一群",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641641788,
					["from"] = "特变电工",
					["msg"] = "我还吃了有限无敌",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641641816,
					["from"] = "天元邓刚",
					["msg"] = "复活的太多了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641641967,
					["from"] = "特变电工",
					["msg"] = "我刚才1V3",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641641974,
					["from"] = "特变电工",
					["msg"] = "战贼猎",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641641978,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641641979,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641642012,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641642031,
					["from"] = "特变电工",
					["msg"] = "刚才1V23",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641642034,
					["from"] = "特变电工",
					["msg"] = "1V3",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641642036,
					["from"] = "特变电工",
					["msg"] = "在直播",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641642042,
					["from"] = "特变电工",
					["msg"] = "我朋友都惊呆了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641642063,
					["from"] = "天元邓刚",
					["msg"] = "等会啊，我去帮朋友做个头盔",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641642066,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641642066,
					["from"] = "天元邓刚",
					["msg"] = "1分钟",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641642069,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641642092,
					["from"] = "天元邓刚",
					["msg"] = "不是一个位面",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641642166,
					["from"] = "天元邓刚",
					["msg"] = "1111",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641642179,
					["from"] = "特变电工",
					["msg"] = "能拍到码",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641642532,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641642535,
					["from"] = "特变电工",
					["msg"] = "单聊",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641642539,
					["from"] = "特变电工",
					["msg"] = "很多人看不惯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641642544,
					["from"] = "特变电工",
					["msg"] = "我们这种单齿垢",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641642549,
					["from"] = "天元邓刚",
					["msg"] = "对",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641642558,
					["from"] = "特变电工",
					["msg"] = "我们骑士就喜欢杀人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641642578,
					["from"] = "天元邓刚",
					["msg"] = "我的意思 中场太容易 造坑了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641642604,
					["from"] = "特变电工",
					["msg"] = "不会",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641642606,
					["from"] = "特变电工",
					["msg"] = "杀几个人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641642609,
					["from"] = "特变电工",
					["msg"] = "后回家",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641642618,
					["from"] = "特变电工",
					["msg"] = "被杀的人也不会防守",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641642670,
					["from"] = "特变电工",
					["msg"] = "塔",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641642855,
					["from"] = "特变电工",
					["msg"] = "回不去了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641642858,
					["from"] = "天元邓刚",
					["msg"] = "守的太明显了。",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641642866,
					["from"] = "天元邓刚",
					["msg"] = "去前线狗洞",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641642887,
					["from"] = "天元邓刚",
					["msg"] = "来了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641642934,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641642938,
					["from"] = "特变电工",
					["msg"] = "雷矛墓地",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641643141,
					["from"] = "天元邓刚",
					["msg"] = "去石路",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641643143,
					["from"] = "天元邓刚",
					["msg"] = "拦路",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641643529,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641643553,
					["from"] = "特变电工",
					["msg"] = "我在台服风暴毒蛇",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641643564,
					["from"] = "天元邓刚",
					["msg"] = "牛",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641643966,
					["from"] = "特变电工",
					["msg"] = "看你去单杀 我要去跟大团了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641643990,
					["from"] = "天元邓刚",
					["msg"] = "恩 ，挂机啊，我就最后 去杀他们LR",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641644018,
					["from"] = "天元邓刚",
					["msg"] = "不能让他们拉走将领 强杀将军",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641644024,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641644066,
					["from"] = "特变电工",
					["msg"] = "直接變繁體字",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641644067,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641644077,
					["from"] = "特变电工",
					["msg"] = "一個月2張月卡",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641644088,
					["from"] = "特变电工",
					["msg"] = "血虧",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641644098,
					["from"] = "特变电工",
					["msg"] = "臺服他們賽季服沒人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641644112,
					["from"] = "特变电工",
					["msg"] = "開服的時候最高在綫100人 聯盟",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641644116,
					["from"] = "特变电工",
					["msg"] = "部落10人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641644126,
					["from"] = "特变电工",
					["msg"] = "慘烈",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641644140,
					["from"] = "天元邓刚",
					["msg"] = "排骨人少",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641644145,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641644148,
					["from"] = "特变电工",
					["msg"] = "體驗很好",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641644161,
					["from"] = "特变电工",
					["msg"] = "文明 禮貌 有愛",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641644175,
					["from"] = "特变电工",
					["msg"] = "進組 安安 退組感恩 ",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641644182,
					["from"] = "天元邓刚",
					["msg"] = "...",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641644195,
					["from"] = "天元邓刚",
					["msg"] = "做任务 都排队拿任务物品啊",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641644198,
					["from"] = "特变电工",
					["msg"] = "野外練級都會幫上BUFF",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641644652,
					["from"] = "天元邓刚",
					["msg"] = "要坑。。BL前线全死回家了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641644663,
					["from"] = "特变电工",
					["msg"] = "無所謂了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641645078,
					["from"] = "天元邓刚",
					["msg"] = "出场了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641646522,
					["from"] = "天元邓刚",
					["msg"] = "出了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641646554,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641646972,
					["from"] = "天元邓刚",
					["msg"] = "打完这场 我歇了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641646982,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641646984,
					["from"] = "特变电工",
					["msg"] = "好的",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641647000,
					["from"] = "天元邓刚",
					["msg"] = "你要冲个大元帅？",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641647063,
					["from"] = "特变电工",
					["msg"] = "不",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641647066,
					["from"] = "特变电工",
					["msg"] = "10",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641647078,
					["from"] = "特变电工",
					["msg"] = "我等T2.5",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641647081,
					["from"] = "天元邓刚",
					["msg"] = "我现在9了 冲不动了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641647086,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641647106,
					["from"] = "天元邓刚",
					["msg"] = "冲10 一周至少50个小时打战场",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641647134,
					["from"] = "天元邓刚",
					["msg"] = "我上周45万 刚吃到16000的线",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641647150,
					["from"] = "特变电工",
					["msg"] = "。。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641647175,
					["from"] = "天元邓刚",
					["msg"] = "衰减15000",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641647186,
					["from"] = "天元邓刚",
					["msg"] = "能磨上去",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641647219,
					["from"] = "特变电工",
					["msg"] = "說好的全民大元帥",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641647231,
					["from"] = "天元邓刚",
					["msg"] = "真的。",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641647243,
					["from"] = "特变电工",
					["msg"] = "10吧",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641647245,
					["from"] = "特变电工",
					["msg"] = "剛好過年",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641647249,
					["from"] = "特变电工",
					["msg"] = "那時候有時間",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641744351,
					["from"] = "特变电工",
					["msg"] = "邓刚",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641744415,
					["from"] = "特变电工",
					["msg"] = "阿刚",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1642329202,
					["from"] = "特变电工",
					["msg"] = "阿刚",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1642515541,
					["from"] = "天元邓刚",
					["msg"] = "灼热峡谷 好多BL，去不去杀人？",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1642515546,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1642515560,
					["from"] = "特变电工",
					["msg"] = "排战场空隙去",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1642515564,
					["from"] = "特变电工",
					["msg"] = "哪个位面",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1642515575,
					["from"] = "天元邓刚",
					["msg"] = "这群LM 都是傻子 ，过路都不还手",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1642515588,
					["from"] = "天元邓刚",
					["msg"] = "我刚才玩小号 碰到的",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1642515650,
					["from"] = "天元邓刚",
					["msg"] = "你升到几了？",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1642515658,
					["from"] = "特变电工",
					["msg"] = "7",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1642515683,
					["from"] = "天元邓刚",
					["msg"] = "这周升8没问题啊，我这周没刷，要掉了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1642515690,
					["from"] = "特变电工",
					["msg"] = "没问题吧",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1642515726,
					["from"] = "特变电工",
					["msg"] = "我超强",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1642515729,
					["from"] = "特变电工",
					["msg"] = "战场杀人魔王",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1642515736,
					["from"] = "特变电工",
					["msg"] = "大元帅都被我轻松单挑",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1642515745,
					["from"] = "天元邓刚",
					["msg"] = "就我这",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1642515749,
					["from"] = "特变电工",
					["msg"] = "完全不把他们放在眼里",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1642515755,
					["from"] = "天元邓刚",
					["msg"] = "人很多",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1642515779,
					["from"] = "特变电工",
					["msg"] = "位面几",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1642515790,
					["from"] = "天元邓刚",
					["msg"] = "我也不知道，，，",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1642515845,
					["from"] = "天元邓刚",
					["msg"] = "我组你啊",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1642515868,
					["from"] = "天元邓刚",
					["msg"] = "你知道我位面几？",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1642515880,
					["from"] = "天元邓刚",
					["msg"] = "好多 ，，，",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1642515887,
					["from"] = "特变电工",
					["msg"] = "组",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1642515895,
					["from"] = "特变电工",
					["msg"] = "队长给我",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1642515902,
					["from"] = "天元邓刚",
					["msg"] = "有 10个左右",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1642598614,
					["from"] = "特变电工",
					["msg"] = "阿刚",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1642598621,
					["from"] = "天元邓刚",
					["msg"] = "啊",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1642598682,
					["from"] = "天元邓刚",
					["msg"] = "组",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1642598685,
					["from"] = "天元邓刚",
					["msg"] = "给我队长",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [138]
				["info"] = {
				},
			},
			["我给你跪下了"] = {
				{
					["type"] = 1,
					["time"] = 1641745700,
					["from"] = "特变电工",
					["msg"] = "咋了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641745715,
					["from"] = "我给你跪下了",
					["msg"] = "那背面是不是没有必中",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641745730,
					["from"] = "特变电工",
					["msg"] = "背面100%缴械",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641745777,
					["from"] = "我给你跪下了",
					["msg"] = "那还行 断筋绕背也还可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641745845,
					["from"] = "我给你跪下了",
					["msg"] = "你战场有要拿的装备吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641745891,
					["from"] = "特变电工",
					["msg"] = "啥装",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641745894,
					["from"] = "特变电工",
					["msg"] = "R10",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641745905,
					["from"] = "我给你跪下了",
					["msg"] = "R10比副本的好吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641745907,
					["from"] = "特变电工",
					["msg"] = "60级很恶心",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641745921,
					["from"] = "特变电工",
					["msg"] = "有个肩膀和腿可以用 不过我就是为了打架",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641745933,
					["from"] = "特变电工",
					["msg"] = "我副本PVE装备我不会花很多前",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641745940,
					["from"] = "特变电工",
					["msg"] = "PVP装备 我会不惜一切代价",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641745948,
					["from"] = "特变电工",
					["msg"] = "PVE随便打打就起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641745958,
					["from"] = "特变电工",
					["msg"] = "比如AL 削骨 橙锤",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641745966,
					["from"] = "特变电工",
					["msg"] = "谁来谁死",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641745990,
					["from"] = "特变电工",
					["msg"] = "副本一周就打几个小时",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641745994,
					["from"] = "我给你跪下了",
					["msg"] = "那我要躲着点",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641745996,
					["from"] = "特变电工",
					["msg"] = "大部分时间都泡在战场杀人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641746005,
					["from"] = "特变电工",
					["msg"] = "性价比高的多",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641746054,
					["from"] = "我给你跪下了",
					["msg"] = "下次我玩个战士 感觉战士挺萌的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641746057,
					["from"] = "我给你跪下了",
					["msg"] = "猛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641746066,
					["from"] = "特变电工",
					["msg"] = "没治疗就是个垃圾",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641746066,
					["from"] = "我给你跪下了",
					["msg"] = "但我不会",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641746071,
					["from"] = "我给你跪下了",
					["msg"] = "得慢慢摸索",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641746089,
					["from"] = "特变电工",
					["msg"] = "遇到法师只有脚爸爸",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641746090,
					["from"] = "我给你跪下了",
					["msg"] = "战士我感觉血又多输出又高",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641746093,
					["from"] = "我给你跪下了",
					["msg"] = "那曲市",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641746095,
					["from"] = "我给你跪下了",
					["msg"] = "确实",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641746107,
					["from"] = "特变电工",
					["msg"] = "跟个骑士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641746111,
					["from"] = "特变电工",
					["msg"] = "天下无敌",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641746141,
					["from"] = "我给你跪下了",
					["msg"] = "还有那暗牧 真肉",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641746152,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641746153,
					["from"] = "我给你跪下了",
					["msg"] = "就给你挂DOT我就死了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641746164,
					["from"] = "特变电工",
					["msg"] = "必须要有治疗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641746168,
					["from"] = "特变电工",
					["msg"] = "不然只有打猎人 盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641746183,
					["from"] = "特变电工",
					["msg"] = "玩的好的盗贼也很蛋疼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641746184,
					["from"] = "我给你跪下了",
					["msg"] = "LR能打吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641746188,
					["from"] = "特变电工",
					["msg"] = "猎人100%胜算",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641746190,
					["from"] = "我给你跪下了",
					["msg"] = "感觉猎人不太怕",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641746191,
					["from"] = "特变电工",
					["msg"] = "我就没输过",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641746195,
					["from"] = "我给你跪下了",
					["msg"] = "好吧‘",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641746205,
					["from"] = "特变电工",
					["msg"] = "盗贼我单挑输过不少",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641746214,
					["from"] = "特变电工",
					["msg"] = "85%胜算把",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641746252,
					["from"] = "我给你跪下了",
					["msg"] = "盗贼一套不行两套 技能全先手的话还是可以的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641746315,
					["from"] = "特变电工",
					["msg"] = "玩的好的盗贼 知道战士技能 然后卡好技能 战士很容易输",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641746340,
					["from"] = "我给你跪下了",
					["msg"] = "嗯是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641746361,
					["from"] = "我给你跪下了",
					["msg"] = "盗贼玩得好还是可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641746363,
					["from"] = "特变电工",
					["msg"] = "如果你是武器姿态就凿 ",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641746377,
					["from"] = "特变电工",
					["msg"] = "然后走元 进潜",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641746412,
					["from"] = "特变电工",
					["msg"] = "如果凿不了血量危险就致盲 进潜 闷棍 绷带",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641746437,
					["from"] = "特变电工",
					["msg"] = "然后在进潜 偷袭 肾",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641746449,
					["from"] = "特变电工",
					["msg"] = "然后在凿",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641746458,
					["from"] = "特变电工",
					["msg"] = "很难受",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641746481,
					["from"] = "我给你跪下了",
					["msg"] = "差不多 盗贼两套技能全在控到死",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641746499,
					["from"] = "特变电工",
					["msg"] = "但是我有章的话",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641746509,
					["from"] = "特变电工",
					["msg"] = "他们节奏就会段",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641746517,
					["from"] = "我给你跪下了",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641746525,
					["from"] = "特变电工",
					["msg"] = "‘",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641746582,
					["from"] = "特变电工",
					["msg"] = "你明天不上班？",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641746599,
					["from"] = "我给你跪下了",
					["msg"] = "我等下休息了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641746613,
					["from"] = "我给你跪下了",
					["msg"] = "趁双倍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641746620,
					["from"] = "特变电工",
					["msg"] = "一样的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641746628,
					["from"] = "特变电工",
					["msg"] = "大家都双倍",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641746657,
					["from"] = "我给你跪下了",
					["msg"] = "但是今天他们打二十四小时 不双倍了就要四十八小时才能追",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641746667,
					["from"] = "特变电工",
					["msg"] = "对了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641746670,
					["from"] = "特变电工",
					["msg"] = "周一结束？",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641746672,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641746675,
					["from"] = "特变电工",
					["msg"] = "哦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641746677,
					["from"] = "特变电工",
					["msg"] = "也是",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641746711,
					["from"] = "我给你跪下了",
					["msg"] = "感觉下周R10还是不太行。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641746713,
					["from"] = "我给你跪下了",
					["msg"] = "我的肝",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641746714,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641746716,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641746738,
					["from"] = "特变电工",
					["msg"] = "那你不会觉得 都R10了 不刷可惜了 直接R13",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641746747,
					["from"] = "特变电工",
					["msg"] = "然后R13觉得亏 然后R14",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641746749,
					["from"] = "我给你跪下了",
					["msg"] = "我这排名够不上",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641746761,
					["from"] = "我给你跪下了",
					["msg"] = "R13每周都要前三四十",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641746770,
					["from"] = "我给你跪下了",
					["msg"] = "100多万啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641746808,
					["from"] = "我给你跪下了",
					["msg"] = "那得一天十二小时还得场场单吃",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641746822,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641746836,
					["from"] = "特变电工",
					["msg"] = "24小时",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641746845,
					["from"] = "特变电工",
					["msg"] = "不就是第一了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641746860,
					["from"] = "我给你跪下了",
					["msg"] = "是啊 第一上周150w",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641746867,
					["from"] = "我给你跪下了",
					["msg"] = "咋打出来的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641746968,
					["from"] = "特变电工",
					["msg"] = "正常",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641746976,
					["from"] = "特变电工",
					["msg"] = "我在N服 第一名也差不多这个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641746983,
					["from"] = "特变电工",
					["msg"] = "不过很严格",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641746990,
					["from"] = "特变电工",
					["msg"] = "超过16个小时就会被封号",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641747451,
					["from"] = "特变电工",
					["msg"] = "你要自己装",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641747550,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641747559,
					["from"] = "特变电工",
					["msg"] = "我们要不要互助一下啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641747572,
					["from"] = "我给你跪下了",
					["msg"] = "啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641747574,
					["from"] = "我给你跪下了",
					["msg"] = "啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641747577,
					["from"] = "特变电工",
					["msg"] = "你觉得呢",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641747578,
					["from"] = "我给你跪下了",
					["msg"] = "尴尬采煤在",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641747580,
					["from"] = "特变电工",
					["msg"] = "我不在的时候",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641747582,
					["from"] = "我给你跪下了",
					["msg"] = "刚才没在",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641747583,
					["from"] = "特变电工",
					["msg"] = "你帮我",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641747588,
					["from"] = "特变电工",
					["msg"] = "你不在的时候 我帮你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641747597,
					["from"] = "我给你跪下了",
					["msg"] = "奥山？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641747600,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641747615,
					["from"] = "我给你跪下了",
					["msg"] = "你啥时候不在",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641747634,
					["from"] = "特变电工",
					["msg"] = "我是晚上10点到凌晨3点",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641747658,
					["from"] = "我给你跪下了",
					["msg"] = "你这不是正常作息啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641747661,
					["from"] = "我给你跪下了",
					["msg"] = "在国外？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641747665,
					["from"] = "特变电工",
					["msg"] = "没有啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641747672,
					["from"] = "特变电工",
					["msg"] = "我早上一般10点半到公司",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641747676,
					["from"] = "特变电工",
					["msg"] = "9点40起床",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641747679,
					["from"] = "特变电工",
					["msg"] = "不打卡 晚点也没事",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1641747716,
					["from"] = "我给你跪下了",
					["msg"] = "我下午六点到12点",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1641747719,
					["from"] = "我给你跪下了",
					["msg"] = "可以帮你",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1641747731,
					["from"] = "特变电工",
					["msg"] = "那就是6点到凌晨3点",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1641747741,
					["from"] = "特变电工",
					["msg"] = "7个小时",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1641747749,
					["from"] = "特变电工",
					["msg"] = "加我微信",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1641747753,
					["from"] = "特变电工",
					["msg"] = "我加你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1641747766,
					["from"] = "我给你跪下了",
					["msg"] = "13131653113",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1641747792,
					["from"] = "我给你跪下了",
					["msg"] = "我先帮你搞吧 我看看下周没到R10的话你再来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1641747837,
					["from"] = "特变电工",
					["msg"] = "我擦 你在廊坊啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1641747842,
					["from"] = "特变电工",
					["msg"] = "我在北京 很近",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1641747849,
					["from"] = "我给你跪下了",
					["msg"] = "。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1641747852,
					["from"] = "我给你跪下了",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1641747891,
					["from"] = "特变电工",
					["msg"] = "这样效率最高",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1641747908,
					["from"] = "我给你跪下了",
					["msg"] = "你现在R几",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1641747913,
					["from"] = "特变电工",
					["msg"] = "5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1641747917,
					["from"] = "特变电工",
					["msg"] = "5 91%",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1641747924,
					["from"] = "我给你跪下了",
					["msg"] = "那搞得快两周可以了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1641747968,
					["from"] = "特变电工",
					["msg"] = "你等会下了 微信我帮你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1641747974,
					["from"] = "特变电工",
					["msg"] = "明天你帮我",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1641747975,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1641747977,
					["from"] = "特变电工",
					["msg"] = "安逸的很",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1641747991,
					["from"] = "特变电工",
					["msg"] = "其实最好的策略是3个人互帮",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1641748037,
					["from"] = "我给你跪下了",
					["msg"] = "。。那得真有个在国外的了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1641748124,
					["from"] = "我给你跪下了",
					["msg"] = "下周开始搞吧 这周我自己打长一点时间下周可以多帮你搞会",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1641748142,
					["from"] = "特变电工",
					["msg"] = "我说的是shuang kai",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1641748147,
					["from"] = "我给你跪下了",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1641748148,
					["from"] = "我给你跪下了",
					["msg"] = "擦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1641748151,
					["from"] = "我给你跪下了",
					["msg"] = "理解错了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1641748153,
					["from"] = "我给你跪下了",
					["msg"] = "那可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [138]
				{
					["type"] = 1,
					["time"] = 1641748154,
					["from"] = "特变电工",
					["msg"] = "你在想啥",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [139]
				{
					["type"] = 1,
					["time"] = 1641748155,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [140]
				{
					["type"] = 1,
					["time"] = 1641748161,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [141]
				{
					["type"] = 1,
					["time"] = 1641748170,
					["from"] = "我给你跪下了",
					["msg"] = "我的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [142]
				{
					["type"] = 1,
					["time"] = 1641748174,
					["from"] = "我给你跪下了",
					["msg"] = "我没转过来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [143]
				{
					["type"] = 1,
					["time"] = 1641748176,
					["from"] = "特变电工",
					["msg"] = "不然怎么脚互助",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [144]
				{
					["type"] = 1,
					["time"] = 1641748183,
					["from"] = "我给你跪下了",
					["msg"] = "那我爽歪歪了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [145]
				{
					["type"] = 1,
					["time"] = 1641748192,
					["from"] = "我给你跪下了",
					["msg"] = "直接用你的砍人",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [146]
				{
					["type"] = 1,
					["time"] = 1641748198,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [147]
				{
					["type"] = 1,
					["time"] = 1641748203,
					["from"] = "特变电工",
					["msg"] = "你可以联系一下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [148]
				{
					["type"] = 1,
					["time"] = 1641748204,
					["from"] = "我给你跪下了",
					["msg"] = "我隐身吃荣誉",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [149]
				{
					["type"] = 1,
					["time"] = 1641748217,
					["from"] = "特变电工",
					["msg"] = "键位随便调",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [150]
				{
					["type"] = 1,
					["time"] = 1641748224,
					["from"] = "特变电工",
					["msg"] = "我有插件复原",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [151]
				{
					["type"] = 1,
					["time"] = 1641748231,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [152]
				{
					["type"] = 1,
					["time"] = 1641748241,
					["from"] = "特变电工",
					["msg"] = "不要吃合计",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [153]
				{
					["type"] = 1,
					["time"] = 1641748243,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [154]
				{
					["type"] = 1,
					["time"] = 1641748245,
					["from"] = "我给你跪下了",
					["msg"] = "不吃",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [155]
				{
					["type"] = 1,
					["time"] = 1641748250,
					["from"] = "我给你跪下了",
					["msg"] = "喔药都不用",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [156]
				{
					["type"] = 1,
					["time"] = 1641748254,
					["from"] = "我给你跪下了",
					["msg"] = "对冲",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [157]
				{
					["type"] = 1,
					["time"] = 1641748257,
					["from"] = "我给你跪下了",
					["msg"] = "不需要打人",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [158]
				{
					["type"] = 1,
					["time"] = 1641748264,
					["from"] = "特变电工",
					["msg"] = "大红随便吃",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [159]
				{
					["type"] = 1,
					["time"] = 1641748369,
					["from"] = "特变电工",
					["msg"] = "这样",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [160]
				{
					["type"] = 1,
					["time"] = 1641748373,
					["from"] = "特变电工",
					["msg"] = "我们就起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [161]
				{
					["type"] = 1,
					["time"] = 1641748381,
					["from"] = "特变电工",
					["msg"] = "你在找一个白天的朋友",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [162]
				{
					["type"] = 1,
					["time"] = 1641748384,
					["from"] = "特变电工",
					["msg"] = "3人互助",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [163]
				{
					["type"] = 1,
					["time"] = 1641748385,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [164]
				{
					["type"] = 1,
					["time"] = 1641748388,
					["from"] = "特变电工",
					["msg"] = "R14有望",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [165]
				{
					["type"] = 1,
					["time"] = 1641748391,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [166]
				{
					["type"] = 1,
					["time"] = 1641748395,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [167]
				{
					["type"] = 1,
					["time"] = 1641748410,
					["from"] = "特变电工",
					["msg"] = "我们有冲突",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [168]
				{
					["type"] = 1,
					["time"] = 1641748431,
					["from"] = "特变电工",
					["msg"] = "如果你是15-22就完美了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [169]
				{
					["type"] = 1,
					["time"] = 1641748445,
					["from"] = "特变电工",
					["msg"] = "16-22",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [170]
				{
					["type"] = 1,
					["time"] = 1641748449,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [171]
				{
					["type"] = 1,
					["time"] = 1641748455,
					["from"] = "特变电工",
					["msg"] = "完美衔接",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [172]
				{
					["type"] = 1,
					["time"] = 1641748492,
					["from"] = "我给你跪下了",
					["msg"] = "确实 这样可以R13",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [173]
				{
					["type"] = 1,
					["time"] = 1641748499,
					["from"] = "我给你跪下了",
					["msg"] = "一天二十万",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [174]
				{
					["type"] = 1,
					["time"] = 1641748513,
					["from"] = "我给你跪下了",
					["msg"] = "R14",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [175]
				{
					["type"] = 1,
					["time"] = 1641748527,
					["from"] = "特变电工",
					["msg"] = "你在找个朋友",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [176]
				{
					["type"] = 1,
					["time"] = 1641748531,
					["from"] = "特变电工",
					["msg"] = "有木有",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [177]
				{
					["type"] = 1,
					["time"] = 1641748557,
					["from"] = "我给你跪下了",
					["msg"] = "没有",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [178]
				{
					["type"] = 1,
					["time"] = 1641748560,
					["from"] = "我给你跪下了",
					["msg"] = "哪有那种",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [179]
				{
					["type"] = 1,
					["time"] = 1641749162,
					["from"] = "特变电工",
					["msg"] = "我练慢了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [180]
				{
					["type"] = 1,
					["time"] = 1641749164,
					["from"] = "特变电工",
					["msg"] = "满了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [181]
				{
					["type"] = 1,
					["time"] = 1641749166,
					["from"] = "特变电工",
					["msg"] = "305",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [182]
				{
					["type"] = 1,
					["time"] = 1641749176,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [183]
				{
					["type"] = 1,
					["time"] = 1641749180,
					["from"] = "我给你跪下了",
					["msg"] = "可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [184]
				{
					["type"] = 1,
					["time"] = 1641749187,
					["from"] = "特变电工",
					["msg"] = "我发现打人默认是305",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [185]
				{
					["type"] = 1,
					["time"] = 1641749199,
					["from"] = "特变电工",
					["msg"] = "我之前只有85点一样砍人痛",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [186]
				{
					["type"] = 1,
					["time"] = 1641749229,
					["from"] = "我给你跪下了",
					["msg"] = "好像是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [187]
				{
					["type"] = 1,
					["time"] = 1641749242,
					["from"] = "特变电工",
					["msg"] = "不过有时候ADD到NPC打不过",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [188]
				{
					["type"] = 1,
					["time"] = 1641749244,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [189]
				{
					["type"] = 1,
					["time"] = 1641749257,
					["from"] = "特变电工",
					["msg"] = "我发现武器战没有狂暴战凶",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [190]
				{
					["type"] = 1,
					["time"] = 1641749260,
					["from"] = "我给你跪下了",
					["msg"] = "确实 我练匕首的时候打弓箭手不掉血",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [191]
				{
					["type"] = 1,
					["time"] = 1641750264,
					["from"] = "特变电工",
					["msg"] = "你下一个myslot",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [192]
				{
					["type"] = 1,
					["time"] = 1641750266,
					["from"] = "特变电工",
					["msg"] = "插件",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [193]
				{
					["type"] = 1,
					["time"] = 1641750274,
					["from"] = "特变电工",
					["msg"] = "保存键位",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [194]
				{
					["type"] = 1,
					["time"] = 1641751315,
					["from"] = "特变电工",
					["msg"] = "好想不上班了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [195]
				{
					["type"] = 1,
					["time"] = 1641751319,
					["from"] = "特变电工",
					["msg"] = "然后天天刷",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [196]
				{
					["type"] = 1,
					["time"] = 1641751320,
					["from"] = "特变电工",
					["msg"] = "到14",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [197]
				{
					["type"] = 1,
					["time"] = 1641751326,
					["from"] = "特变电工",
					["msg"] = "安逸的很",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [198]
				{
					["type"] = 1,
					["time"] = 1641751368,
					["from"] = "特变电工",
					["msg"] = "我16年5月去廊坊看了草莓音乐节",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [199]
				{
					["type"] = 1,
					["time"] = 1641751396,
					["from"] = "我给你跪下了",
					["msg"] = "。。那太远了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [200]
				{
					["type"] = 1,
					["time"] = 1641751407,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [201]
				{
					["type"] = 1,
					["time"] = 1641751411,
					["from"] = "我给你跪下了",
					["msg"] = "时间太久了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [202]
				{
					["type"] = 1,
					["time"] = 1641751420,
					["from"] = "特变电工",
					["msg"] = "不知不觉6年了快",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [203]
				{
					["type"] = 1,
					["time"] = 1641751454,
					["from"] = "特变电工",
					["msg"] = "有个什么中国城",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [204]
				{
					["type"] = 1,
					["time"] = 1641751460,
					["from"] = "特变电工",
					["msg"] = "古城",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [205]
				{
					["type"] = 1,
					["time"] = 1641751468,
					["from"] = "特变电工",
					["msg"] = "在那里举办的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [206]
				{
					["type"] = 1,
					["time"] = 1641751502,
					["from"] = "我给你跪下了",
					["msg"] = "我看一个骑士一刀把法师秒了 这也太",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [207]
				{
					["type"] = 1,
					["time"] = 1641751565,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [208]
				{
					["type"] = 1,
					["time"] = 1641751600,
					["from"] = "特变电工",
					["msg"] = "我之前T2.5加R12加眼球服",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [209]
				{
					["type"] = 1,
					["time"] = 1641751603,
					["from"] = "特变电工",
					["msg"] = "一刀一个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [210]
				{
					["type"] = 1,
					["time"] = 1641751611,
					["from"] = "特变电工",
					["msg"] = "平砍法师满血",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [211]
				{
					["type"] = 1,
					["time"] = 1641751616,
					["from"] = "特变电工",
					["msg"] = "带盾",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [212]
				{
					["type"] = 1,
					["time"] = 1641751620,
					["from"] = "我给你跪下了",
					["msg"] = "他就现在 一刀就秒了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [213]
				{
					["type"] = 1,
					["time"] = 1641751623,
					["from"] = "特变电工",
					["msg"] = "我朋友在我旁边都惊呆了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [214]
				{
					["type"] = 1,
					["time"] = 1641751628,
					["from"] = "特变电工",
					["msg"] = "平砍",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [215]
				{
					["type"] = 1,
					["time"] = 1641751654,
					["from"] = "我给你跪下了",
					["msg"] = "那他还是用技能了的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [216]
				{
					["type"] = 1,
					["time"] = 1641751660,
					["from"] = "我给你跪下了",
					["msg"] = "不光平砍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [217]
				{
					["type"] = 1,
					["time"] = 1641751689,
					["from"] = "我给你跪下了",
					["msg"] = "然后把一个R12贼砍掉80血",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [218]
				{
					["type"] = 1,
					["time"] = 1641751696,
					["from"] = "我给你跪下了",
					["msg"] = "也太猛了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [219]
				{
					["type"] = 1,
					["time"] = 1641822605,
					["from"] = "特变电工",
					["msg"] = "我擦。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [220]
				{
					["type"] = 1,
					["time"] = 1641822613,
					["from"] = "我给你跪下了",
					["msg"] = "咋了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [221]
				{
					["type"] = 1,
					["time"] = 1641822629,
					["from"] = "特变电工",
					["msg"] = "你练习一下战士砍人 很有快感",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [222]
				{
					["type"] = 1,
					["time"] = 1641822635,
					["from"] = "特变电工",
					["msg"] = "我也练习一下盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [223]
				{
					["type"] = 1,
					["time"] = 1641822640,
					["from"] = "特变电工",
					["msg"] = "你下一个myslot插件",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [224]
				{
					["type"] = 1,
					["time"] = 1641822651,
					["from"] = "特变电工",
					["msg"] = "键位保存一下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [225]
				{
					["type"] = 1,
					["time"] = 1641822658,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [226]
				{
					["type"] = 1,
					["time"] = 1641822827,
					["from"] = "特变电工",
					["msg"] = "进了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [227]
				{
					["type"] = 1,
					["time"] = 1641822902,
					["from"] = "特变电工",
					["msg"] = "擦 忘记买面包",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [228]
				{
					["type"] = 1,
					["time"] = 1641822907,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [229]
				{
					["type"] = 1,
					["time"] = 1641822912,
					["from"] = "特变电工",
					["msg"] = "等会要去铁桥买",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [230]
				{
					["type"] = 1,
					["time"] = 1641822917,
					["from"] = "我给你跪下了",
					["msg"] = "没事死了复活",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [231]
				{
					["type"] = 1,
					["time"] = 1641822926,
					["from"] = "特变电工",
					["msg"] = "KD很难看",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [232]
				{
					["type"] = 1,
					["time"] = 1641822952,
					["from"] = "特变电工",
					["msg"] = "这周能到60万",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [233]
				{
					["type"] = 1,
					["time"] = 1641822968,
					["from"] = "特变电工",
					["msg"] = "石炉哨塔",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [234]
				{
					["type"] = 1,
					["time"] = 1641822972,
					["from"] = "我给你跪下了",
					["msg"] = "那可能R8",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [235]
				{
					["type"] = 1,
					["time"] = 1641822982,
					["from"] = "特变电工",
					["msg"] = "直接砍人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [236]
				{
					["type"] = 1,
					["time"] = 1641822984,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [237]
				{
					["type"] = 1,
					["time"] = 1641822996,
					["from"] = "我给你跪下了",
					["msg"] = "我害怕坑了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [238]
				{
					["type"] = 1,
					["time"] = 1641823011,
					["from"] = "我给你跪下了",
					["msg"] = "赌狗洞爸还是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [239]
				{
					["type"] = 1,
					["time"] = 1641823960,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [240]
				{
					["type"] = 1,
					["time"] = 1641823962,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [241]
				{
					["type"] = 1,
					["time"] = 1641823972,
					["from"] = "特变电工",
					["msg"] = "我微信发你视频",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [242]
				{
					["type"] = 1,
					["time"] = 1641823980,
					["from"] = "特变电工",
					["msg"] = "手机魔兽",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [243]
				{
					["type"] = 1,
					["time"] = 1641824008,
					["from"] = "我给你跪下了",
					["msg"] = "看了。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [244]
				{
					["type"] = 1,
					["time"] = 1641824270,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [245]
				{
					["type"] = 1,
					["time"] = 1641824274,
					["from"] = "特变电工",
					["msg"] = "8个单杀",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [246]
				{
					["type"] = 1,
					["time"] = 1641824281,
					["from"] = "特变电工",
					["msg"] = "爽歪歪",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [247]
				{
					["type"] = 1,
					["time"] = 1641824304,
					["from"] = "我给你跪下了",
					["msg"] = "可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [248]
				{
					["type"] = 1,
					["time"] = 1641825244,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [249]
				{
					["type"] = 1,
					["time"] = 1641825248,
					["from"] = "特变电工",
					["msg"] = "392名才能进R10",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [250]
				{
					["type"] = 1,
					["time"] = 1641825264,
					["from"] = "我给你跪下了",
					["msg"] = "你这周R10不了啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [251]
				{
					["type"] = 1,
					["time"] = 1641825273,
					["from"] = "我给你跪下了",
					["msg"] = "最多R8",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [252]
				{
					["type"] = 1,
					["time"] = 1641825274,
					["from"] = "特变电工",
					["msg"] = "才有资格冲进R10",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [253]
				{
					["type"] = 1,
					["time"] = 1641825277,
					["from"] = "特变电工",
					["msg"] = "最多R7",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [254]
				{
					["type"] = 1,
					["time"] = 1641825284,
					["from"] = "我给你跪下了",
					["msg"] = "差不多吧 比较慢",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [255]
				{
					["type"] = 1,
					["time"] = 1641826133,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈哈 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [256]
				{
					["type"] = 1,
					["time"] = 1641826138,
					["from"] = "我给你跪下了",
					["msg"] = "你看人家说你妹",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [257]
				{
					["type"] = 1,
					["time"] = 1641826139,
					["from"] = "我给你跪下了",
					["msg"] = "没",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [258]
				{
					["type"] = 1,
					["time"] = 1641826153,
					["from"] = "特变电工",
					["msg"] = "管得着",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [259]
				{
					["type"] = 1,
					["time"] = 1641826156,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [260]
				{
					["type"] = 1,
					["time"] = 1641826183,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [261]
				{
					["type"] = 1,
					["time"] = 1641826200,
					["from"] = "我给你跪下了",
					["msg"] = "你要出名了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [262]
				{
					["type"] = 1,
					["time"] = 1641826202,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [263]
				{
					["type"] = 1,
					["time"] = 1641826205,
					["from"] = "特变电工",
					["msg"] = "我一直都很出名",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [264]
				{
					["type"] = 1,
					["time"] = 1641826208,
					["from"] = "特变电工",
					["msg"] = "从N服的时候",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [265]
				{
					["type"] = 1,
					["time"] = 1641826218,
					["from"] = "特变电工",
					["msg"] = "部落红色通缉令",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [266]
				{
					["type"] = 1,
					["time"] = 1641826226,
					["from"] = "特变电工",
					["msg"] = "被20多人坑杀墓地",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [267]
				{
					["type"] = 1,
					["time"] = 1641826237,
					["from"] = "特变电工",
					["msg"] = "还塔小王子",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [268]
				{
					["type"] = 1,
					["time"] = 1641826245,
					["from"] = "特变电工",
					["msg"] = "哈哈哈",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [269]
				{
					["type"] = 1,
					["time"] = 1641826265,
					["from"] = "特变电工",
					["msg"] = "感觉R10都好难",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [270]
				{
					["type"] = 1,
					["time"] = 1641826272,
					["from"] = "特变电工",
					["msg"] = "我都想放弃了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [271]
				{
					["type"] = 1,
					["time"] = 1641826278,
					["from"] = "我给你跪下了",
					["msg"] = "现在刷的人太多了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [272]
				{
					["type"] = 1,
					["time"] = 1641826279,
					["from"] = "特变电工",
					["msg"] = "太难了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [273]
				{
					["type"] = 1,
					["time"] = 1641826282,
					["from"] = "我给你跪下了",
					["msg"] = "好多耍一天的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [274]
				{
					["type"] = 1,
					["time"] = 1641826291,
					["from"] = "我给你跪下了",
					["msg"] = "肯定刷不过",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [275]
				{
					["type"] = 1,
					["time"] = 1641826294,
					["from"] = "特变电工",
					["msg"] = "太内卷了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [276]
				{
					["type"] = 1,
					["time"] = 1641826298,
					["from"] = "特变电工",
					["msg"] = "感觉要找GZS了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [277]
				{
					["type"] = 1,
					["time"] = 1641826321,
					["from"] = "我给你跪下了",
					["msg"] = "R10有必要找吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [278]
				{
					["type"] = 1,
					["time"] = 1641826343,
					["from"] = "特变电工",
					["msg"] = "R10都到了 感觉不打R14有点血亏",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [279]
				{
					["type"] = 1,
					["time"] = 1641826366,
					["from"] = "我给你跪下了",
					["msg"] = "。。R14得找GS",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [280]
				{
					["type"] = 1,
					["time"] = 1641826369,
					["from"] = "我给你跪下了",
					["msg"] = "GZS",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [281]
				{
					["type"] = 1,
					["time"] = 1641826370,
					["from"] = "特变电工",
					["msg"] = "我去问下R14多少R",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [282]
				{
					["type"] = 1,
					["time"] = 1641826373,
					["from"] = "我给你跪下了",
					["msg"] = "一个人真不行",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [283]
				{
					["type"] = 1,
					["time"] = 1641826401,
					["from"] = "我给你跪下了",
					["msg"] = "你认识GZS？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [284]
				{
					["type"] = 1,
					["time"] = 1641826415,
					["from"] = "特变电工",
					["msg"] = "淘宝问下就知道了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [285]
				{
					["type"] = 1,
					["time"] = 1641826433,
					["from"] = "我给你跪下了",
					["msg"] = "估计要几万",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [286]
				{
					["type"] = 1,
					["time"] = 1641826508,
					["from"] = "特变电工",
					["msg"] = "蛋疼了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [287]
				{
					["type"] = 1,
					["time"] = 1641827349,
					["from"] = "我给你跪下了",
					["msg"] = "弄会别的 先撤了我",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [288]
				{
					["type"] = 1,
					["time"] = 1641827355,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [289]
				{
					["type"] = 1,
					["time"] = 1641827356,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [290]
				{
					["type"] = 1,
					["time"] = 1641829312,
					["from"] = "特变电工",
					["msg"] = "想通了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [291]
				{
					["type"] = 1,
					["time"] = 1641829330,
					["from"] = "我给你跪下了",
					["msg"] = "？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [292]
				{
					["type"] = 1,
					["time"] = 1641829574,
					["from"] = "特变电工",
					["msg"] = "不刷了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [293]
				{
					["type"] = 1,
					["time"] = 1641829579,
					["from"] = "特变电工",
					["msg"] = "我觉得R10没啥乱用",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [294]
				{
					["type"] = 1,
					["time"] = 1641829583,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [295]
				{
					["type"] = 1,
					["time"] = 1641829583,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 差不多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [296]
				{
					["type"] = 1,
					["time"] = 1641829589,
					["from"] = "特变电工",
					["msg"] = "太累了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [297]
				{
					["type"] = 1,
					["time"] = 1641829594,
					["from"] = "特变电工",
					["msg"] = "我这几天心力交瘁",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [298]
				{
					["type"] = 1,
					["time"] = 1641829595,
					["from"] = "我给你跪下了",
					["msg"] = "还一个月黑翼了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [299]
				{
					["type"] = 1,
					["time"] = 1641829599,
					["from"] = "我给你跪下了",
					["msg"] = "装备比R10hao",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [300]
				{
					["type"] = 1,
					["time"] = 1641829602,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [301]
				{
					["type"] = 1,
					["time"] = 1641829605,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [302]
				{
					["type"] = 1,
					["time"] = 1641829614,
					["from"] = "我给你跪下了",
					["msg"] = "跟R13比也差不了几个",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [303]
				{
					["type"] = 1,
					["time"] = 1641829619,
					["from"] = "我给你跪下了",
					["msg"] = "所以确实没必要",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [304]
				{
					["type"] = 1,
					["time"] = 1641829630,
					["from"] = "特变电工",
					["msg"] = "TAQ T2.5 全力以赴",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [305]
				{
					["type"] = 1,
					["time"] = 1641829635,
					["from"] = "特变电工",
					["msg"] = "拿了去奥山砍人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [306]
				{
					["type"] = 1,
					["time"] = 1641829659,
					["from"] = "我给你跪下了",
					["msg"] = "现在拿个削骨 战场碰见R13照样砍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [307]
				{
					["type"] = 1,
					["time"] = 1641829669,
					["from"] = "特变电工",
					["msg"] = "橙锤",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [308]
				{
					["type"] = 1,
					["time"] = 1641829689,
					["from"] = "我给你跪下了",
					["msg"] = "橙锤几率小啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [309]
				{
					["type"] = 1,
					["time"] = 1641829701,
					["from"] = "我给你跪下了",
					["msg"] = "开黑翼拿AL",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [310]
				{
					["type"] = 1,
					["time"] = 1641829718,
					["from"] = "我给你跪下了",
					["msg"] = "R10确实没必要",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [311]
				{
					["type"] = 1,
					["time"] = 1641831503,
					["from"] = "特变电工",
					["msg"] = "双倍结束了把",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [312]
				{
					["type"] = 1,
					["time"] = 1641831520,
					["from"] = "特变电工",
					["msg"] = "突然好无聊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [313]
				{
					["type"] = 1,
					["time"] = 1641831539,
					["from"] = "我给你跪下了",
					["msg"] = "。。早点休息 明天开始新目标",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [314]
				{
					["type"] = 1,
					["time"] = 1641833411,
					["from"] = "特变电工",
					["msg"] = "我直接打阿拉希和战歌了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [315]
				{
					["type"] = 1,
					["time"] = 1641833417,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [316]
				{
					["type"] = 1,
					["time"] = 1641833419,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:22672::::::::60:::::::::|h[哨兵的板甲护腿]|h|r|cffa335ee|Hitem:19578::::::::60:::::::::|h[狂暴者护腕]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [317]
				{
					["type"] = 1,
					["time"] = 1641833435,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:16479::::::::60:::::::::|h[统帅的板甲护腿]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [318]
				{
					["type"] = 1,
					["time"] = 1641909415,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [319]
				{
					["type"] = 1,
					["time"] = 1641909422,
					["from"] = "特变电工",
					["msg"] = "我打战歌 阿拉希好玩",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [320]
				{
					["type"] = 1,
					["time"] = 1641914487,
					["from"] = "特变电工",
					["msg"] = "阿拉希 战歌 奥山 牌子一起交",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [321]
				{
					["type"] = 1,
					["time"] = 1641914500,
					["from"] = "我给你跪下了",
					["msg"] = "有啥用",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [322]
				{
					["type"] = 1,
					["time"] = 1641914508,
					["from"] = "特变电工",
					["msg"] = "荣誉杠杠的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [323]
				{
					["type"] = 1,
					["time"] = 1641914537,
					["from"] = "我给你跪下了",
					["msg"] = "多少",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [324]
				{
					["type"] = 1,
					["time"] = 1641915828,
					["from"] = "特变电工",
					["msg"] = "2450",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [325]
				{
					["type"] = 1,
					["time"] = 1641915840,
					["from"] = "特变电工",
					["msg"] = "三线作战",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [326]
				{
					["type"] = 1,
					["time"] = 1641915842,
					["from"] = "特变电工",
					["msg"] = "荣誉起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [327]
				{
					["type"] = 1,
					["time"] = 1641915846,
					["from"] = "特变电工",
					["msg"] = "奥山不行",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [328]
				{
					["type"] = 1,
					["time"] = 1641917999,
					["from"] = "特变电工",
					["msg"] = "战歌好好玩",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [329]
				{
					["type"] = 1,
					["time"] = 1641918000,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [330]
				{
					["type"] = 1,
					["time"] = 1641918002,
					["from"] = "特变电工",
					["msg"] = "一群砍人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [331]
				{
					["type"] = 1,
					["time"] = 1641918047,
					["from"] = "我给你跪下了",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [332]
				{
					["type"] = 1,
					["time"] = 1641998979,
					["from"] = "特变电工",
					["msg"] = "111",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [333]
				{
					["type"] = 1,
					["time"] = 1641998981,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [334]
				{
					["type"] = 1,
					["time"] = 1641999147,
					["from"] = "我给你跪下了",
					["msg"] = "没双倍每把都坑",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [335]
				{
					["type"] = 1,
					["time"] = 1641999154,
					["from"] = "特变电工",
					["msg"] = "..",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [336]
				{
					["type"] = 1,
					["time"] = 1641999159,
					["from"] = "特变电工",
					["msg"] = "我在战歌起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [337]
				{
					["type"] = 1,
					["time"] = 1642000876,
					["from"] = "特变电工",
					["msg"] = "坑惨了啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [338]
				{
					["type"] = 1,
					["time"] = 1642000890,
					["from"] = "特变电工",
					["msg"] = "打战歌阿拉希一小时有8000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [339]
				{
					["type"] = 1,
					["time"] = 1642000892,
					["from"] = "特变电工",
					["msg"] = "还不错啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [340]
				{
					["type"] = 1,
					["time"] = 1642000930,
					["from"] = "我给你跪下了",
					["msg"] = "挺多的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [341]
				{
					["type"] = 1,
					["time"] = 1642086233,
					["from"] = "特变电工",
					["msg"] = "R7",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [342]
				{
					["type"] = 1,
					["time"] = 1642086246,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 R8以后难",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [343]
				{
					["type"] = 1,
					["time"] = 1642086350,
					["from"] = "特变电工",
					["msg"] = "昨天一个大元帅战士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [344]
				{
					["type"] = 1,
					["time"] = 1642086355,
					["from"] = "特变电工",
					["msg"] = "完全不是我的对手",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [345]
				{
					["type"] = 1,
					["time"] = 1642086407,
					["from"] = "我给你跪下了",
					["msg"] = "是吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [346]
				{
					["type"] = 1,
					["time"] = 1642086411,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [347]
				{
					["type"] = 1,
					["time"] = 1642086422,
					["from"] = "特变电工",
					["msg"] = "直接一个缴械 他就死了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [348]
				{
					["type"] = 1,
					["time"] = 1642086429,
					["from"] = "我给你跪下了",
					["msg"] = "牛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [349]
				{
					["type"] = 1,
					["time"] = 1642086434,
					["from"] = "特变电工",
					["msg"] = "都不附魔武器链",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [350]
				{
					["type"] = 1,
					["time"] = 1642223880,
					["from"] = "特变电工",
					["msg"] = "开始刷T0.5了吗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [351]
				{
					["type"] = 1,
					["time"] = 1642223890,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [352]
				{
					["type"] = 1,
					["time"] = 1642223894,
					["from"] = "我给你跪下了",
					["msg"] = "最后两斤了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [353]
				{
					["type"] = 1,
					["time"] = 1642223896,
					["from"] = "我给你跪下了",
					["msg"] = "两件",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [354]
				{
					["type"] = 1,
					["time"] = 1642223897,
					["from"] = "特变电工",
					["msg"] = "盗贼的太贵了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [355]
				{
					["type"] = 1,
					["time"] = 1642223901,
					["from"] = "特变电工",
					["msg"] = "黑上",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [356]
				{
					["type"] = 1,
					["time"] = 1642223904,
					["from"] = "特变电工",
					["msg"] = "胸",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [357]
				{
					["type"] = 1,
					["time"] = 1642223909,
					["from"] = "特变电工",
					["msg"] = "我的衣服50G",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [358]
				{
					["type"] = 1,
					["time"] = 1642223935,
					["from"] = "我给你跪下了",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [359]
				{
					["type"] = 1,
					["time"] = 1642223943,
					["from"] = "我给你跪下了",
					["msg"] = "500排不上号",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [360]
				{
					["type"] = 1,
					["time"] = 1642223946,
					["from"] = "我给你跪下了",
					["msg"] = "买的人太多了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [361]
				{
					["type"] = 1,
					["time"] = 1642223976,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [362]
				{
					["type"] = 1,
					["time"] = 1642223989,
					["from"] = "特变电工",
					["msg"] = "战士T0.5 衣服 和 头是PVP的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [363]
				{
					["type"] = 1,
					["time"] = 1642223992,
					["from"] = "特变电工",
					["msg"] = "没人要的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [364]
				{
					["type"] = 1,
					["time"] = 1642224000,
					["from"] = "特变电工",
					["msg"] = "盗贼PVP PVE都是极品",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [365]
				{
					["type"] = 1,
					["time"] = 1642224018,
					["from"] = "我给你跪下了",
					["msg"] = "感觉PVPT1更好点啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [366]
				{
					["type"] = 1,
					["time"] = 1642224029,
					["from"] = "特变电工",
					["msg"] = "盗贼吗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [367]
				{
					["type"] = 1,
					["time"] = 1642224034,
					["from"] = "我给你跪下了",
					["msg"] = "恩啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [368]
				{
					["type"] = 1,
					["time"] = 1642225252,
					["from"] = "我给你跪下了",
					["msg"] = "那食人魔珠串 我打了一天真吐了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [369]
				{
					["type"] = 1,
					["time"] = 1642225388,
					["from"] = "特变电工",
					["msg"] = "..",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [370]
				{
					["type"] = 1,
					["time"] = 1642225393,
					["from"] = "特变电工",
					["msg"] = "黑下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [371]
				{
					["type"] = 1,
					["time"] = 1642225407,
					["from"] = "特变电工",
					["msg"] = "找刷天空护腿的法师",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [372]
				{
					["type"] = 1,
					["time"] = 1642225420,
					["from"] = "特变电工",
					["msg"] = "1个5G",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [373]
				{
					["type"] = 1,
					["time"] = 1642225436,
					["from"] = "我给你跪下了",
					["msg"] = "那要100多G啊还挺贵",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [374]
				{
					["type"] = 1,
					["time"] = 1642225447,
					["from"] = "特变电工",
					["msg"] = "或者组一个1，2宝石队",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [375]
				{
					["type"] = 1,
					["time"] = 1642225456,
					["from"] = "特变电工",
					["msg"] = "后面不好组人我就找法师刷了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [376]
				{
					["type"] = 1,
					["time"] = 1642225467,
					["from"] = "我给你跪下了",
					["msg"] = "是难组",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [377]
				{
					["type"] = 1,
					["time"] = 1642258446,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [378]
				{
					["type"] = 1,
					["time"] = 1642258452,
					["from"] = "特变电工",
					["msg"] = "战歌 阿拉希荣誉比奥山多的多",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [379]
				{
					["type"] = 1,
					["time"] = 1642258477,
					["from"] = "我给你跪下了",
					["msg"] = "多少啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [380]
				{
					["type"] = 1,
					["time"] = 1642258483,
					["from"] = "特变电工",
					["msg"] = "1小时8千",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [381]
				{
					["type"] = 1,
					["time"] = 1642258493,
					["from"] = "特变电工",
					["msg"] = "奥山太慢了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [382]
				{
					["type"] = 1,
					["time"] = 1642258511,
					["from"] = "我给你跪下了",
					["msg"] = " 你今天打了多少",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [383]
				{
					["type"] = 1,
					["time"] = 1642258520,
					["from"] = "特变电工",
					["msg"] = "7万",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [384]
				{
					["type"] = 1,
					["time"] = 1642258530,
					["from"] = "特变电工",
					["msg"] = "一顿杀人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [385]
				{
					["type"] = 1,
					["time"] = 1642258530,
					["from"] = "我给你跪下了",
					["msg"] = "一天？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [386]
				{
					["type"] = 1,
					["time"] = 1642258538,
					["from"] = "特变电工",
					["msg"] = "下午2点到现在把",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [387]
				{
					["type"] = 1,
					["time"] = 1642258543,
					["from"] = "特变电工",
					["msg"] = "10个小时",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [388]
				{
					["type"] = 1,
					["time"] = 1642258550,
					["from"] = "我给你跪下了",
					["msg"] = "没奥山多啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [389]
				{
					["type"] = 1,
					["time"] = 1642258560,
					["from"] = "我给你跪下了",
					["msg"] = "奥山得9 万左右",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [390]
				{
					["type"] = 1,
					["time"] = 1642258566,
					["from"] = "特变电工",
					["msg"] = "坑场多",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [391]
				{
					["type"] = 1,
					["time"] = 1642258579,
					["from"] = "我给你跪下了",
					["msg"] = "组队啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [392]
				{
					["type"] = 1,
					["time"] = 1642258588,
					["from"] = "特变电工",
					["msg"] = "一样坑",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [393]
				{
					["type"] = 1,
					["time"] = 1642258603,
					["from"] = "特变电工",
					["msg"] = "奥山真不行",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [394]
				{
					["type"] = 1,
					["time"] = 1642258610,
					["from"] = "特变电工",
					["msg"] = "杀人体验太差",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [395]
				{
					["type"] = 1,
					["time"] = 1642258614,
					["from"] = "特变电工",
					["msg"] = "荣誉不多",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [396]
				{
					["type"] = 1,
					["time"] = 1642258639,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [397]
				{
					["type"] = 1,
					["time"] = 1642258663,
					["from"] = "特变电工",
					["msg"] = "我去奥山都是混牌子",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [398]
				{
					["type"] = 1,
					["time"] = 1642258674,
					["from"] = "特变电工",
					["msg"] = "3*3*3 一起交2600",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [399]
				{
					["type"] = 1,
					["time"] = 1642258678,
					["from"] = "特变电工",
					["msg"] = "多了一倍",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [400]
				{
					["type"] = 1,
					["time"] = 1642259219,
					["from"] = "特变电工",
					["msg"] = "成功的造一坑",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [401]
				{
					["type"] = 1,
					["time"] = 1642259228,
					["from"] = "特变电工",
					["msg"] = "我一个人在雷矛干了5个人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [402]
				{
					["type"] = 1,
					["time"] = 1642259234,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [403]
				{
					["type"] = 1,
					["time"] = 1642259244,
					["from"] = "我给你跪下了",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [404]
				{
					["type"] = 1,
					["time"] = 1642263001,
					["from"] = "特变电工",
					["msg"] = "我今天吃了100瓶",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [405]
				{
					["type"] = 1,
					["time"] = 1642263005,
					["from"] = "特变电工",
					["msg"] = "大红",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [406]
				{
					["type"] = 1,
					["time"] = 1642263058,
					["from"] = "我给你跪下了",
					["msg"] = "可以 打他个措手不及",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [407]
				{
					["type"] = 1,
					["time"] = 1642263073,
					["from"] = "特变电工",
					["msg"] = "刚才战歌打部落国家队",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [408]
				{
					["type"] = 1,
					["time"] = 1642263080,
					["from"] = "特变电工",
					["msg"] = "10人全部归家",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [409]
				{
					["type"] = 1,
					["time"] = 1642263092,
					["from"] = "特变电工",
					["msg"] = "然后把他们打惨了 杀人荣誉爽歪歪",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [410]
				{
					["type"] = 1,
					["time"] = 1642263103,
					["from"] = "特变电工",
					["msg"] = "将军队",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [411]
				{
					["type"] = 1,
					["time"] = 1642263121,
					["from"] = "特变电工",
					["msg"] = "他们就只吃了棋子荣誉",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [412]
				{
					["type"] = 1,
					["time"] = 1642263123,
					["from"] = "我给你跪下了",
					["msg"] = "那你们很猛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [413]
				{
					["type"] = 1,
					["time"] = 1642263133,
					["from"] = "特变电工",
					["msg"] = "我杀第一",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [414]
				{
					["type"] = 1,
					["time"] = 1642263139,
					["from"] = "特变电工",
					["msg"] = "我杀了20个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [415]
				{
					["type"] = 1,
					["time"] = 1642263144,
					["from"] = "特变电工",
					["msg"] = "爽歪歪",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [416]
				{
					["type"] = 1,
					["time"] = 1642263314,
					["from"] = "我给你跪下了",
					["msg"] = "好多在战歌互刷的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [417]
				{
					["type"] = 1,
					["time"] = 1642263360,
					["from"] = "特变电工",
					["msg"] = "不可能",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [418]
				{
					["type"] = 1,
					["time"] = 1642263363,
					["from"] = "特变电工",
					["msg"] = "撞不到一起",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [419]
				{
					["type"] = 1,
					["time"] = 1642263373,
					["from"] = "特变电工",
					["msg"] = "都是国家队",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [420]
				{
					["type"] = 1,
					["time"] = 1642263376,
					["from"] = "我给你跪下了",
					["msg"] = "他们很多都认识",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [421]
				{
					["type"] = 1,
					["time"] = 1642265806,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [422]
				{
					["type"] = 1,
					["time"] = 1642265909,
					["from"] = "特变电工",
					["msg"] = "微信给你法了一个视频",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [423]
				{
					["type"] = 1,
					["time"] = 1642265914,
					["from"] = "特变电工",
					["msg"] = "黑G跑路了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [424]
				{
					["type"] = 1,
					["time"] = 1642265918,
					["from"] = "特变电工",
					["msg"] = "有个MC团",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [425]
				{
					["type"] = 1,
					["time"] = 1642265924,
					["from"] = "特变电工",
					["msg"] = "确实流弊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [426]
				{
					["type"] = 1,
					["time"] = 1642265925,
					["from"] = "我给你跪下了",
					["msg"] = "昨天吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [427]
				{
					["type"] = 1,
					["time"] = 1642265930,
					["from"] = "特变电工",
					["msg"] = "好像是",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [428]
				{
					["type"] = 1,
					["time"] = 1642265934,
					["from"] = "我给你跪下了",
					["msg"] = "我知道那个",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [429]
				{
					["type"] = 1,
					["time"] = 1642265937,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [430]
				{
					["type"] = 1,
					["time"] = 1642265939,
					["from"] = "特变电工",
					["msg"] = "你咋知道的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [431]
				{
					["type"] = 1,
					["time"] = 1642265941,
					["from"] = "我给你跪下了",
					["msg"] = "我在那个会里",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [432]
				{
					["type"] = 1,
					["time"] = 1642265949,
					["from"] = "我给你跪下了",
					["msg"] = "第一时间就知道了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [433]
				{
					["type"] = 1,
					["time"] = 1642265959,
					["from"] = "特变电工",
					["msg"] = "你来我们公会报名啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [434]
				{
					["type"] = 1,
					["time"] = 1642265960,
					["from"] = "我给你跪下了",
					["msg"] = "那个会就三十几人",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [435]
				{
					["type"] = 1,
					["time"] = 1642265966,
					["from"] = "我给你跪下了",
					["msg"] = "都被毛了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [436]
				{
					["type"] = 1,
					["time"] = 1642266036,
					["from"] = "我给你跪下了",
					["msg"] = "那个团长有前科",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [437]
				{
					["type"] = 1,
					["time"] = 1642266040,
					["from"] = "我给你跪下了",
					["msg"] = "之前就黑过",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [438]
				{
					["type"] = 1,
					["time"] = 1642266108,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [439]
				{
					["type"] = 1,
					["time"] = 1642318622,
					["from"] = "特变电工",
					["msg"] = "2个小时全通",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [440]
				{
					["type"] = 1,
					["time"] = 1642318628,
					["from"] = "特变电工",
					["msg"] = "出毁灭了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [441]
				{
					["type"] = 1,
					["time"] = 1642318634,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18816::::::::60:::::::::|h[毁灭之刃]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [442]
				{
					["type"] = 1,
					["time"] = 1642318641,
					["from"] = "我给你跪下了",
					["msg"] = "挺快的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [443]
				{
					["type"] = 1,
					["time"] = 1642319183,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:17071::::::::60:::::::::|h[血腥撕裂者]|h|r没人要",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [444]
				{
					["type"] = 1,
					["time"] = 1642319184,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [445]
				{
					["type"] = 1,
					["time"] = 1642319200,
					["from"] = "我给你跪下了",
					["msg"] = "要的人确实不多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [446]
				{
					["type"] = 1,
					["time"] = 1642319203,
					["from"] = "特变电工",
					["msg"] = "这个拿来PVP不香吗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [447]
				{
					["type"] = 1,
					["time"] = 1642319223,
					["from"] = "我给你跪下了",
					["msg"] = "PVP都不拿匕首",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [448]
				{
					["type"] = 1,
					["time"] = 1642320026,
					["from"] = "特变电工",
					["msg"] = "一人分780",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [449]
				{
					["type"] = 1,
					["time"] = 1642320040,
					["from"] = "特变电工",
					["msg"] = "毁灭拍了1W5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [450]
				{
					["type"] = 1,
					["time"] = 1642320387,
					["from"] = "我给你跪下了",
					["msg"] = "贵啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [451]
				{
					["type"] = 1,
					["time"] = 1642320392,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [452]
				{
					["type"] = 1,
					["time"] = 1642320426,
					["from"] = "我给你跪下了",
					["msg"] = "你们团有钱的多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [453]
				{
					["type"] = 1,
					["time"] = 1642320437,
					["from"] = "特变电工",
					["msg"] = "除了橙锤喝削骨",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [454]
				{
					["type"] = 1,
					["time"] = 1642320444,
					["from"] = "特变电工",
					["msg"] = "我&*!@#$就要跟他们血拼了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [455]
				{
					["type"] = 1,
					["time"] = 1642320448,
					["from"] = "特变电工",
					["msg"] = "其他随便",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [456]
				{
					["type"] = 1,
					["time"] = 1642320481,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈那DZpvp就比战士便宜太多了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [457]
				{
					["type"] = 1,
					["time"] = 1642320493,
					["from"] = "我给你跪下了",
					["msg"] = "武器双刀就能用到BWL",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [458]
				{
					["type"] = 1,
					["time"] = 1642322329,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [459]
				{
					["type"] = 1,
					["time"] = 1642322337,
					["from"] = "特变电工",
					["msg"] = "刚才阿拉希5开 直接坑杀墓地",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [460]
				{
					["type"] = 1,
					["time"] = 1642322343,
					["from"] = "特变电工",
					["msg"] = "赛季服第一次",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [461]
				{
					["type"] = 1,
					["time"] = 1642322348,
					["from"] = "特变电工",
					["msg"] = "爽歪歪",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [462]
				{
					["type"] = 1,
					["time"] = 1642322356,
					["from"] = "我给你跪下了",
					["msg"] = "啥叫五开",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [463]
				{
					["type"] = 1,
					["time"] = 1642322363,
					["from"] = "特变电工",
					["msg"] = "棋子全开了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [464]
				{
					["type"] = 1,
					["time"] = 1642322366,
					["from"] = "特变电工",
					["msg"] = "2分钟结束",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [465]
				{
					["type"] = 1,
					["time"] = 1642322368,
					["from"] = "我给你跪下了",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [466]
				{
					["type"] = 1,
					["time"] = 1642322370,
					["from"] = "我给你跪下了",
					["msg"] = "懂了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [467]
				{
					["type"] = 1,
					["time"] = 1642326441,
					["from"] = "特变电工",
					["msg"] = "我游戏时间14天",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [468]
				{
					["type"] = 1,
					["time"] = 1642326458,
					["from"] = "特变电工",
					["msg"] = "等于说不吃不喝要玩14天",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [469]
				{
					["type"] = 1,
					["time"] = 1642326500,
					["from"] = "我给你跪下了",
					["msg"] = "都差不多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [470]
				{
					["type"] = 1,
					["time"] = 1642326512,
					["from"] = "特变电工",
					["msg"] = "难以置信",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [471]
				{
					["type"] = 1,
					["time"] = 1642326528,
					["from"] = "特变电工",
					["msg"] = "一个996互联网人有这么多时间玩",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [472]
				{
					["type"] = 1,
					["time"] = 1642326570,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈不知不觉就",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [473]
				{
					["type"] = 1,
					["time"] = 1642333149,
					["from"] = "特变电工",
					["msg"] = "刷到了没",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [474]
				{
					["type"] = 1,
					["time"] = 1642333161,
					["from"] = "我给你跪下了",
					["msg"] = "还没",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [475]
				{
					["type"] = 1,
					["time"] = 1642333164,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [476]
				{
					["type"] = 1,
					["time"] = 1642333345,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [477]
				{
					["type"] = 1,
					["time"] = 1642333350,
					["from"] = "特变电工",
					["msg"] = "直接包马",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [478]
				{
					["type"] = 1,
					["time"] = 1642333356,
					["from"] = "我给你跪下了",
					["msg"] = "是啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [479]
				{
					["type"] = 1,
					["time"] = 1642333359,
					["from"] = "特变电工",
					["msg"] = "多少钱",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [480]
				{
					["type"] = 1,
					["time"] = 1642333409,
					["from"] = "我给你跪下了",
					["msg"] = "500",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [481]
				{
					["type"] = 1,
					["time"] = 1642333417,
					["from"] = "特变电工",
					["msg"] = "可以 都是这个价格",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [482]
				{
					["type"] = 1,
					["time"] = 1642333440,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 感觉快出了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [483]
				{
					["type"] = 1,
					["time"] = 1642333445,
					["from"] = "特变电工",
					["msg"] = "头呢",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [484]
				{
					["type"] = 1,
					["time"] = 1642333449,
					["from"] = "特变电工",
					["msg"] = "出了没",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [485]
				{
					["type"] = 1,
					["time"] = 1642333453,
					["from"] = "我给你跪下了",
					["msg"] = "头有了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [486]
				{
					["type"] = 1,
					["time"] = 1642333462,
					["from"] = "特变电工",
					["msg"] = "任务也到最后了？",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [487]
				{
					["type"] = 1,
					["time"] = 1642333465,
					["from"] = "我给你跪下了",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [488]
				{
					["type"] = 1,
					["time"] = 1642333469,
					["from"] = "特变电工",
					["msg"] = "起飞了 准备",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [489]
				{
					["type"] = 1,
					["time"] = 1642333477,
					["from"] = "我给你跪下了",
					["msg"] = "人家MC都毕业了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [490]
				{
					["type"] = 1,
					["time"] = 1642333482,
					["from"] = "我给你跪下了",
					["msg"] = "我起飞啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [491]
				{
					["type"] = 1,
					["time"] = 1642333493,
					["from"] = "我给你跪下了",
					["msg"] = "混混就完事了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [492]
				{
					["type"] = 1,
					["time"] = 1642333495,
					["from"] = "特变电工",
					["msg"] = "T0.5的盗贼我看都没有要T1",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [493]
				{
					["type"] = 1,
					["time"] = 1642333511,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 0.5输出比T2还要高一点",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [494]
				{
					["type"] = 1,
					["time"] = 1642333517,
					["from"] = "我给你跪下了",
					["msg"] = "都是拿散件",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [495]
				{
					["type"] = 1,
					["time"] = 1642333520,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [496]
				{
					["type"] = 1,
					["time"] = 1642333538,
					["from"] = "特变电工",
					["msg"] = "所以盗贼套装没人要 以前都是很贵的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [497]
				{
					["type"] = 1,
					["time"] = 1642333546,
					["from"] = "特变电工",
					["msg"] = "不超过300",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [498]
				{
					["type"] = 1,
					["time"] = 1642333599,
					["from"] = "我给你跪下了",
					["msg"] = "原来买T1的钱现在买T0",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [499]
				{
					["type"] = 1,
					["time"] = 1642333602,
					["from"] = "我给你跪下了",
					["msg"] = "啊哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [500]
				["info"] = {
				},
			},
			["豚杆"] = {
				{
					["type"] = 1,
					["time"] = 1641998980,
					["from"] = "豚杆",
					["msg"] = "我想问你个问题",
					["inbound"] = true,
					["convo"] = "豚杆",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641998986,
					["from"] = "特变电工",
					["msg"] = "啥",
					["inbound"] = false,
					["convo"] = "豚杆",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641999012,
					["from"] = "豚杆",
					["msg"] = "海狗永不为奴是不是也是你呀。",
					["inbound"] = true,
					["convo"] = "豚杆",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641999023,
					["from"] = "特变电工",
					["msg"] = "？",
					["inbound"] = false,
					["convo"] = "豚杆",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641999034,
					["from"] = "特变电工",
					["msg"] = "不认识",
					["inbound"] = false,
					["convo"] = "豚杆",
				}, -- [5]
				["info"] = {
				},
			},
			["乐心"] = {
				{
					["type"] = 1,
					["time"] = 1641709562,
					["from"] = "特变电工",
					["msg"] = "战士拯救补一个",
					["inbound"] = false,
					["convo"] = "乐心",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641709674,
					["from"] = "特变电工",
					["msg"] = "战士的拯救",
					["inbound"] = false,
					["convo"] = "乐心",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641718052,
					["from"] = "特变电工",
					["msg"] = "0.13",
					["inbound"] = false,
					["convo"] = "乐心",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641718067,
					["from"] = "乐心",
					["msg"] = "0.13可以给你5000",
					["inbound"] = true,
					["convo"] = "乐心",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641718075,
					["from"] = "乐心",
					["msg"] = "0.135可以再给你5000",
					["inbound"] = true,
					["convo"] = "乐心",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641718087,
					["from"] = "乐心",
					["msg"] = "因为我有5000是0.135收的",
					["inbound"] = true,
					["convo"] = "乐心",
				}, -- [6]
				["info"] = {
				},
			},
			["Jumbajump"] = {
				{
					["type"] = 1,
					["time"] = 1641709634,
					["from"] = "特变电工",
					["msg"] = "5队伍的爪子帮忙不一个",
					["inbound"] = false,
					["convo"] = "Jumbajump",
				}, -- [1]
				["info"] = {
				},
			},
			["吴涛#5287"] = {
				{
					["type"] = 1,
					["time"] = 1642428949,
					["from"] = "特变电工",
					["msg"] = "速度",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642515507,
					["from"] = "特变电工",
					["msg"] = "上号",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642515509,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642515511,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642515523,
					["from"] = "吴涛#5287",
					["msg"] = "哦哦",
					["inbound"] = true,
					["convo"] = "吴涛#5287",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1642515642,
					["from"] = "特变电工",
					["msg"] = "你有组",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1642598609,
					["from"] = "特变电工",
					["msg"] = "老YY",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1642598634,
					["from"] = "吴涛#5287",
					["msg"] = "24046515？",
					["inbound"] = true,
					["convo"] = "吴涛#5287",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1642605745,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1642605748,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1642605825,
					["from"] = "吴涛#5287",
					["msg"] = "他们说不打了",
					["inbound"] = true,
					["convo"] = "吴涛#5287",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1642605831,
					["from"] = "特变电工",
					["msg"] = "你上",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1642605841,
					["from"] = "吴涛#5287",
					["msg"] = "我也快下了",
					["inbound"] = true,
					["convo"] = "吴涛#5287",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1642605852,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1642605857,
					["from"] = "吴涛#5287",
					["msg"] = "今天算了",
					["inbound"] = true,
					["convo"] = "吴涛#5287",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1642605862,
					["from"] = "吴涛#5287",
					["msg"] = "早点休息吧",
					["inbound"] = true,
					["convo"] = "吴涛#5287",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1642605865,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "吴涛#5287",
				}, -- [17]
				["info"] = {
				},
			},
			["小哥"] = {
				{
					["type"] = 1,
					["time"] = 1641651608,
					["from"] = "特变电工",
					["msg"] = "1",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642308263,
					["from"] = "小哥",
					["msg"] = "老哥，你是锻造吗",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642308270,
					["from"] = "特变电工",
					["msg"] = "对",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1642308276,
					["from"] = "特变电工",
					["msg"] = "你咋知道",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1642308288,
					["from"] = "小哥",
					["msg"] = "|cff1eff00|Hitem:7969::::::::60:::::::::|h[秘银马刺]|h|rbang棒我装个这个吧？我买了不能用",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1642308304,
					["from"] = "特变电工",
					["msg"] = "我只有200",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1642308307,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1642308312,
					["from"] = "小哥",
					["msg"] = "...",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1642308312,
					["from"] = "特变电工",
					["msg"] = "还能帮装啊",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1642308319,
					["from"] = "特变电工",
					["msg"] = "我武器链附魔",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1642308323,
					["from"] = "特变电工",
					["msg"] = "为了",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1642308326,
					["from"] = "特变电工",
					["msg"] = "战场PVP",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1642308327,
					["from"] = "小哥",
					["msg"] = "只能锻造装",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1642308342,
					["from"] = "小哥",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1642314048,
					["from"] = "特变电工",
					["msg"] = "|cfffff468小哥|r",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1642314052,
					["from"] = "小哥",
					["msg"] = "怎么了",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1642314053,
					["from"] = "特变电工",
					["msg"] = "我是老哥",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1642315261,
					["from"] = "特变电工",
					["msg"] = "老哥是R11哦",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1642315268,
					["from"] = "小哥",
					["msg"] = "|cfffff468小哥|r",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1642315268,
					["from"] = "特变电工",
					["msg"] = "等会铁炉堡门口等你",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1642315272,
					["from"] = "特变电工",
					["msg"] = "|cfffff468小哥|r",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1642320632,
					["from"] = "小哥",
					["msg"] = "你那里显示，咱们2个谁是第2",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1642320638,
					["from"] = "特变电工",
					["msg"] = "你",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1642320640,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1642320645,
					["from"] = "特变电工",
					["msg"] = "门口单脚",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1642320648,
					["from"] = "小哥",
					["msg"] = "不打",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1642320656,
					["from"] = "特变电工",
					["msg"] = "老10我不敢打",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1642320657,
					["from"] = "小哥",
					["msg"] = "我是朋友给我刷的",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1642320665,
					["from"] = "小哥",
					["msg"] = "R11",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1642320670,
					["from"] = "特变电工",
					["msg"] = "被你弯道超车",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1642321033,
					["from"] = "小哥",
					["msg"] = "老10DZ退后能回能量，你们ZS不砍没怒气",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [31]
				["info"] = {
				},
			},
			["随便的青枣"] = {
				{
					["type"] = 1,
					["time"] = 1641620146,
					["from"] = "随便的青枣",
					["msg"] = "你在几微米",
					["inbound"] = true,
					["convo"] = "随便的青枣",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641620149,
					["from"] = "随便的青枣",
					["msg"] = "你在几位面",
					["inbound"] = true,
					["convo"] = "随便的青枣",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641620181,
					["from"] = "随便的青枣",
					["msg"] = "发吧 ",
					["inbound"] = true,
					["convo"] = "随便的青枣",
				}, -- [3]
				["info"] = {
				},
			},
			["樱桃子"] = {
				{
					["type"] = 1,
					["time"] = 1642308417,
					["from"] = "特变电工",
					["msg"] = "樱桃子多多关照啊。。",
					["inbound"] = false,
					["convo"] = "樱桃子",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1642308427,
					["from"] = "樱桃子",
					["msg"] = "嗯啊",
					["inbound"] = true,
					["convo"] = "樱桃子",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1642315337,
					["from"] = "特变电工",
					["msg"] = "估下我",
					["inbound"] = false,
					["convo"] = "樱桃子",
				}, -- [3]
				["info"] = {
				},
			},
			["塞北第一贼"] = {
				{
					["type"] = 1,
					["time"] = 1641824866,
					["from"] = "塞北第一贼",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "塞北第一贼",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641824879,
					["from"] = "特变电工",
					["msg"] = "有排到吗",
					["inbound"] = false,
					["convo"] = "塞北第一贼",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641824882,
					["from"] = "塞北第一贼",
					["msg"] = "you ",
					["inbound"] = true,
					["convo"] = "塞北第一贼",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641825234,
					["from"] = "特变电工",
					["msg"] = "392名才能进R10",
					["inbound"] = false,
					["convo"] = "塞北第一贼",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641825241,
					["from"] = "特变电工",
					["msg"] = "发错",
					["inbound"] = false,
					["convo"] = "塞北第一贼",
				}, -- [5]
				["info"] = {
				},
			},
		},
	},
}
WIM3_ChatFilters = {
}
WIM3_Alias = nil
