
WIM3_Data = {
	["escapeToHide"] = true,
	["hoverLinks"] = false,
	["pop_rules"] = {
		["whisper"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = true,
			["resting"] = {
				["keepfocus"] = true,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = true,
				["onReceive"] = true,
			},
			["alwaysOther"] = false,
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
		},
		["chat"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["bn"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = false,
			["resting"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["alwaysOther"] = true,
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
		},
	},
	["timeStampFormat"] = "%H:%M",
	["windowAlpha"] = 80,
	["sounds"] = {
		["force_game_sound"] = false,
		["whispers"] = {
			["msgout_sml"] = "IM",
			["msgout"] = false,
			["guild"] = false,
			["bnet_sml"] = "IM",
			["msgin_sml"] = "IM",
			["msgin"] = true,
			["friend_sml"] = "IM",
			["guild_sml"] = "IM",
			["bnet"] = false,
			["friend"] = false,
		},
		["chat"] = {
			["msgout_sml"] = "Chat Blip",
			["msgout"] = false,
			["world_sml"] = "Chat Blip",
			["msgin_sml"] = "Chat Blip",
			["msgin"] = true,
			["party_sml"] = "Chat Blip",
			["custom_sml"] = "Chat Blip",
			["say_sml"] = "Chat Blip",
			["raid_sml"] = "Chat Blip",
			["officer_sml"] = "Chat Blip",
			["guild_sml"] = "Chat Blip",
			["raidleader_sml"] = "Chat Blip",
			["battlegroundleader_sml"] = "Chat Blip",
			["battleground_sml"] = "Chat Blip",
		},
	},
	["formatting"] = {
		["bracketing"] = {
			["enabled"] = true,
			["type"] = 1,
		},
	},
	["keepFocusRested"] = true,
	["wordwrap_indent"] = false,
	["enabled"] = true,
	["keepFocus"] = true,
	["alertedPrivateServer"] = false,
	["autoFocus"] = false,
	["winCascade"] = {
		["enabled"] = true,
		["direction"] = 8,
	},
	["lastState"] = "other",
	["displayColors"] = {
		["wispOut"] = {
			["b"] = 0.9882352941176471,
			["g"] = 0.0784313725490196,
			["r"] = 1,
		},
		["wispIn"] = {
			["b"] = 0.7607843137254902,
			["g"] = 0.03137254901960784,
			["r"] = 0.5607843137254902,
		},
		["sysMsg"] = {
			["b"] = 0,
			["g"] = 0.6627450980392157,
			["r"] = 1,
		},
		["BNwispOut"] = {
			["b"] = 1,
			["g"] = 0.6352941176470588,
			["r"] = 0.1725490196078431,
		},
		["historyIn"] = {
			["b"] = 0.4705882352941176,
			["g"] = 0.4705882352941176,
			["r"] = 0.4705882352941176,
		},
		["errorMsg"] = {
			["b"] = 0,
			["g"] = 0,
			["r"] = 1,
		},
		["webAddress"] = {
			["b"] = 1,
			["g"] = 1,
			["r"] = 1,
		},
		["BNwispIn"] = {
			["b"] = 0.6549019607843137,
			["g"] = 0.4862745098039216,
			["r"] = 0,
		},
		["historyOut"] = {
			["b"] = 0.7058823529411764,
			["g"] = 0.7058823529411764,
			["r"] = 0.7058823529411764,
		},
		["useSkin"] = true,
	},
	["fontSize"] = 12,
	["showToolTips"] = true,
	["minimap"] = {
		["free_position"] = {
			["y"] = -119.9890033406945,
			["x"] = -161.5500472187982,
			["point"] = "TOPRIGHT",
		},
		["free"] = false,
		["rightClickNew"] = false,
		["position"] = 200,
	},
	["winAnimation"] = true,
	["expose"] = {
		["protect"] = 1,
		["borderSize"] = 20,
		["combat"] = true,
		["groupOnly"] = false,
		["border"] = false,
		["direction"] = 1,
	},
	["alias"] = {
		["title_string"] = "{n} - {a}",
	},
	["menuSortActivity"] = true,
	["whoLookups"] = true,
	["modules"] = {
		["ChatSounds"] = {
			["enabled"] = true,
		},
		["ShortcutBar"] = {
			["enabled"] = true,
		},
		["Emoticons"] = {
			["enabled"] = true,
		},
		["ChatAlerts"] = {
			["enabled"] = true,
		},
		["Sounds"] = {
			["enabled"] = true,
		},
		["Expose"] = {
			["enabled"] = true,
		},
		["WhisperEngine"] = {
			["enabled"] = true,
		},
		["MinimapIcon"] = {
			["enabled"] = true,
		},
		["TimeStamps"] = {
			["enabled"] = true,
		},
		["OffScreenTracker"] = {
			["enabled"] = true,
		},
		["History"] = {
			["enabled"] = true,
		},
		["LDB"] = {
			["enabled"] = true,
		},
		["URLHandler"] = {
			["enabled"] = true,
		},
		["Tabs"] = {
			["enabled"] = true,
		},
		["ClickControl"] = {
			["enabled"] = true,
		},
		["Menu"] = {
			["enabled"] = true,
		},
		["Filters"] = {
			["enabled"] = true,
		},
	},
	["chat"] = {
		["bn"] = {
			["showAlerts"] = true,
		},
		["guild"] = {
			["showAlerts"] = true,
		},
		["party"] = {
			["showAlerts"] = true,
		},
		["custom"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
		["say"] = {
		},
		["battleground"] = {
		},
		["raid"] = {
			["showAlerts"] = true,
		},
		["officer"] = {
			["showAlerts"] = true,
		},
		["world"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
	},
	["ClickControl"] = {
		["clickSensitivity"] = 0.2,
	},
	["tabs"] = {
		["sortBy"] = 2,
		["whispers"] = {
			["enabled"] = false,
			["guild"] = false,
			["friends"] = false,
		},
		["chat"] = {
			["enabled"] = false,
			["aswhisper"] = false,
		},
	},
	["history"] = {
		["ageLimit"] = true,
		["previewCount"] = 25,
		["maxPer"] = true,
		["whispers"] = {
			["friends"] = true,
			["all"] = false,
			["guild"] = true,
		},
		["maxAge"] = 1209600,
		["preview"] = true,
		["maxCount"] = 500,
		["chat"] = {
			["ageLimit"] = true,
			["maxAge"] = 1209600,
			["previewCount"] = 25,
			["preview"] = true,
			["maxCount"] = 500,
			["maxPer"] = true,
		},
	},
	["skin"] = {
		["font_outline"] = "",
		["selected"] = "WIM Classic",
		["font"] = "ChatFontNormal",
		["suggest"] = true,
	},
	["winFade"] = true,
	["stats"] = {
		["startDate"] = "",
		["versions"] = 1,
		["whispers"] = 0,
		["mostConvos"] = 0,
	},
	["clampToScreen"] = true,
	["winLoc"] = {
		["left"] = 217,
		["top"] = 664,
	},
	["coloredNames"] = true,
	["ignoreArrowKeys"] = true,
	["tabAdvance"] = false,
	["windowOnTop"] = true,
	["winSize"] = {
		["height"] = 220,
		["strata"] = "DIALOG",
		["scale"] = 100,
		["width"] = 333,
	},
}
WIM3_Cache = {
	["鱼人摩洛克"] = {
		["Dwac"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["|Kq22|k"] = 2,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq3|k"] = 2,
				["|Kq23|k"] = 2,
				["|Kq1|k"] = 2,
				["|Kq11|k"] = 2,
				["|Kq17|k"] = 2,
				["|Kq14|k"] = 2,
				["|Kq18|k"] = 2,
				["|Kq8|k"] = 2,
				["|Kq21|k"] = 2,
				["|Kq4|k"] = 2,
				["|Kq20|k"] = 2,
				["|Kq13|k"] = 2,
				["|Kq15|k"] = 2,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["|Kq16|k"] = 2,
				["|Kq5|k"] = 2,
			},
		},
		["特变电工"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["雪中飞"] = 1,
				["|Kq22|k"] = 2,
				["姞青"] = 1,
				["阿摇"] = 1,
				["德陛"] = 1,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq5|k"] = 2,
				["|Kq7|k"] = 2,
				["审判"] = 1,
				["命不由天定"] = 1,
				["|Kq14|k"] = 2,
				["|Kq18|k"] = 2,
				["幽雅"] = 1,
				["面包一箩筐"] = 1,
				["天元邓刚"] = 1,
				["|Kq20|k"] = 2,
				["盖伦的小宝剑"] = 1,
				["|Kq15|k"] = 2,
				["|Kq10|k"] = 2,
				["冯一刀"] = 1,
				["|Kq6|k"] = 2,
				["战山河"] = 1,
				["灬鳯灬"] = 1,
				["戒之在灶"] = 1,
				["云江月"] = 1,
				["Sylvania"] = 1,
				["阡祈"] = 1,
				["茅台酒"] = 1,
				["|Kq1|k"] = 2,
				["神奇灬女侠"] = 1,
				["社区送温暖"] = 1,
				["|Kq17|k"] = 2,
				["Alei"] = 1,
				["卡卡汐"] = 1,
				["|Kq8|k"] = 2,
				["|Kq16|k"] = 2,
				["挖煤的小伙伴"] = 1,
				["|Kq21|k"] = 2,
				["我给你跪下了"] = 1,
				["|Kq13|k"] = 2,
				["求心"] = 1,
				["|Kq11|k"] = 2,
				["|Kq3|k"] = 2,
				["|Kq4|k"] = 2,
			},
			["guildList"] = {
				["沉之默"] = 665,
				["大夫"] = 133,
				["乱羽"] = 239,
				["丨悟空丶"] = 432,
				["血麒麟"] = 160,
				["圣域丶甯"] = 247,
				["有丶绿"] = 632,
				["红杉树"] = 276,
				["道道盗盗到"] = 171,
				["向前冲呀"] = 146,
				["管泽元"] = 732,
				["丢丢大魔王"] = 140,
				["呆呆的贼丶"] = 205,
				["法诗诗"] = 116,
				["冲锋在右"] = 392,
				["熊壮壮"] = 689,
				["石头的发神"] = 96,
				["呆萌兔子"] = 170,
				["择主而事"] = 110,
				["九针"] = 12,
				["森类滴话"] = 892,
				["大鸟不会飞"] = 122,
				["吾家有小哥"] = 862,
				["魔幻使者"] = 821,
				["断肠人"] = 614,
				["丧丨彪"] = 431,
				["听话"] = 492,
				["胖小德"] = 916,
				["妮妹"] = 544,
				["萌萌大鲸鱼"] = 124,
				["毛头超鱼水"] = 660,
				["Playeriuwur"] = 411,
				["杀戮梦魇"] = 636,
				["神行百变"] = 131,
				["十二宫"] = 483,
				["胖小圣骑"] = 748,
				["茶恬恬"] = 920,
				["风掣"] = 812,
				["克洛普"] = 162,
				["罗小牧"] = 915,
				["身法有一套"] = 928,
				["加百利"] = 478,
				["熊猫软绵绵"] = 183,
				["和牛"] = 496,
				["夜幕祈祷"] = 517,
				["哎呦不错噢"] = 245,
				["If"] = 406,
				["无面者"] = 619,
				["滑滑梯"] = 264,
				["Amar"] = 144,
				["怒帕拉丁"] = 47,
				["丨萧何丨"] = 180,
				["清扬骑士"] = 678,
				["小叮噹丶"] = 5,
				["一锅卤肉饭"] = 841,
				["三岁会撩妹"] = 425,
				["箭無虚髪"] = 734,
				["安黛尔"] = 85,
				["北嶋流年"] = 481,
				["嘉城"] = 246,
				["子木子也"] = 546,
				["小刀手"] = 79,
				["丶青衫"] = 438,
				["尼哥"] = 358,
				["臭寳"] = 282,
				["牛牛妞"] = 270,
				["司徒小秘"] = 63,
				["Minami"] = 236,
				["Kouki"] = 320,
				["Diong"] = 831,
				["修玛丶"] = 451,
				["骁得"] = 187,
				["风涧德"] = 813,
				["你真高丶"] = 241,
				["鯊魚哥"] = 822,
				["小护士"] = 565,
				["流浪喵"] = 670,
				["流浪"] = 120,
				["王权没有永恒"] = 702,
				["疯狂小法"] = 708,
				["Malahidiel"] = 172,
				["地獄之花"] = 186,
				["微光角落"] = 163,
				["爆炸小拿铁"] = 375,
				["神教教主"] = 724,
				["土豆粉"] = 507,
				["叶辰"] = 488,
				["奔波儿菲兹"] = 538,
				["牛海王"] = 106,
				["开水"] = 585,
				["天神下凡"] = 389,
				["四月私语"] = 865,
				["朝先"] = 883,
				["雁塔牛铁蛋"] = 71,
				["德意洋洋"] = 593,
				["诗雨"] = 777,
				["Amor"] = 830,
				["天地乖离"] = 528,
				["老歌"] = 32,
				["夜班保安"] = 15,
				["莫待季"] = 158,
				["跳跳乃波万"] = 150,
				["坦克泡泡"] = 44,
				["剑之初"] = 242,
				["古月"] = 948,
				["要求相信接受"] = 342,
				["Sakura"] = 836,
				["神话归来"] = 725,
				["没茅台"] = 667,
				["密斯酷"] = 873,
				["麦丁"] = 166,
				["安格玛污王"] = 16,
				["吸湮的鱼"] = 494,
				["美好时光海苔"] = 278,
				["雷达网带鱼"] = 227,
				["小冰雨"] = 134,
				["曲晓晓"] = 19,
				["芜湖小司马"] = 753,
				["天公不作美"] = 527,
				["巴托里"] = 575,
				["带血的眼泪"] = 579,
				["丨残丶箭丨"] = 842,
				["稳稳的爱"] = 727,
				["樱桃子"] = 951,
				["暮色晚秋"] = 231,
				["一老实人一"] = 59,
				["花重锦官城"] = 388,
				["吉安纳丨语风"] = 145,
				["Shadanz"] = 947,
				["丁香枝上"] = 423,
				["阿摇"] = 934,
				["段坤"] = 259,
				["Frozenkaipio"] = 405,
				["丿叶光寒"] = 94,
				["郑俗人"] = 36,
				["华尔街之狼"] = 83,
				["我的月亮"] = 48,
				["冷言"] = 466,
				["夜风凛凛丶"] = 310,
				["四季大发财"] = 504,
				["劝君秃鸡"] = 477,
				["香蕉超人"] = 943,
				["丶大江东去"] = 343,
				["射手不太行"] = 559,
				["腥辰"] = 750,
				["风涧落"] = 942,
				["暴躁的小笼包"] = 628,
				["风涧芯"] = 941,
				["风涧牧"] = 940,
				["馋奶兔"] = 135,
				["汉唐"] = 897,
				["雷锋叔叔"] = 807,
				["瞄秂缝"] = 299,
				["木公子"] = 129,
				["团队支柱"] = 113,
				["手一挥"] = 605,
				["丶雅木茶丶"] = 304,
				["伊心懿意"] = 445,
				["清疙瘩"] = 679,
				["天然莼丶"] = 532,
				["雪山忆思缘"] = 937,
				["雨老爷"] = 936,
				["石沟权丶铠坚"] = 273,
				["狐狸麻糖"] = 697,
				["雏田丿"] = 935,
				["史莱姆"] = 43,
				["无须多言"] = 220,
				["银叶草丶"] = 932,
				["不打工"] = 428,
				["重生之六哥哥"] = 931,
				["胡子乱了"] = 335,
				["忘了出门带刀"] = 594,
				["战争与和平"] = 950,
				["Aicc"] = 398,
				["貓小烦"] = 927,
				["破晓残月"] = 720,
				["豆蔻梢头"] = 925,
				["蓝色小药片"] = 233,
				["十三君"] = 194,
				["千山暮雪"] = 328,
				["蒸籽蛋"] = 923,
				["找寻记忆"] = 608,
				["大母龙丶"] = 230,
				["菜菜騒丶"] = 922,
				["喔嚯"] = 502,
				["猫姐在寂寞"] = 699,
				["爱保健的浴霸"] = 26,
				["霜木"] = 939,
				["姬战"] = 78,
				["芝芝奶芙"] = 917,
				["来抓我呀"] = 639,
				["羽风"] = 54,
				["神术妙法"] = 155,
				["清风寒月"] = 211,
				["七号技师左右"] = 61,
				["红波浪"] = 914,
				["一号技师"] = 838,
				["小雨儿"] = 568,
				["何处不青山"] = 376,
				["莫尛筱"] = 149,
				["红发飘飘"] = 912,
				["卓玛"] = 185,
				["花落思量错"] = 918,
				["看门大爷"] = 910,
				["盾牌猛击"] = 909,
				["黑白"] = 373,
				["甜甜糖"] = 906,
				["小丶法"] = 560,
				["咿呀咿呀"] = 498,
				["永恒明月"] = 339,
				["勇氣"] = 480,
				["琉璃"] = 904,
				["Rpen"] = 173,
				["搞毛啊"] = 612,
				["雨天的彩虹"] = 805,
				["悍将孤影"] = 311,
				["江城第一深情"] = 898,
				["王丶兰花"] = 69,
				["毛毛猪"] = 895,
				["毛头分水鱼"] = 894,
				["三禾穆"] = 136,
				["龙妹"] = 336,
				["布莱恩灬铜须"] = 206,
				["烈風"] = 313,
				["Rxl"] = 42,
				["空城"] = 331,
				["逍遥贼"] = 91,
				["樂山大佛"] = 893,
				["尸不过三"] = 572,
				["骄傲的光头"] = 819,
				["听风屮"] = 493,
				["杜鹃花"] = 887,
				["三胞胎他们爹"] = 238,
				["五月天"] = 443,
				["少年不再年邵"] = 571,
				["伊甸星原"] = 240,
				["木子又土"] = 885,
				["清风一缕灬"] = 263,
				["朝思暮欢"] = 884,
				["大芃熊"] = 382,
				["挥腊肠的女孩"] = 881,
				["十三画"] = 482,
				["Eastwood"] = 151,
				["竭尽所能"] = 728,
				["张星彩"] = 879,
				["就叫帅比吧丶"] = 46,
				["齐德隆冬强"] = 132,
				["青衣缺德"] = 40,
				["哈宁"] = 863,
				["月色"] = 209,
				["孵你一脚"] = 550,
				["菠萝怪"] = 55,
				["姥田"] = 545,
				["督军山克"] = 715,
				["洋葱肥牛飯"] = 105,
				["谷大川"] = 56,
				["小浪浪"] = 875,
				["清澜"] = 176,
				["英雄漠"] = 326,
				["德义双馨"] = 591,
				["奥义千年杀"] = 871,
				["季如枫"] = 548,
				["默然灬"] = 827,
				["狮驼居士"] = 190,
				["天堂在左"] = 869,
				["伊本瓦利德"] = 301,
				["西厢娇客"] = 772,
				["复仇心切"] = 868,
				["匣里龙吟"] = 174,
				["塞北第一贼"] = 867,
				["德憨憨"] = 128,
				["海狗永不为奴"] = 675,
				["塞北第一法"] = 866,
				["喵喵灬猫猫"] = 864,
				["甜甜的"] = 705,
				["Wish"] = 418,
				["冬天难熬"] = 857,
				["其实很安静"] = 856,
				["逐风而去"] = 790,
				["刘秀"] = 474,
				["非一般的炮台"] = 396,
				["八佰狼"] = 855,
				["圣潜德"] = 188,
				["仙喵"] = 852,
				["仍是少年"] = 851,
				["亿米八大长腿"] = 850,
				["狂风"] = 28,
				["亚巴顿"] = 849,
				["亚尔特留斯"] = 848,
				["伯爵"] = 446,
				["小笼包"] = 877,
				["落地九八壳"] = 766,
				["沐羽橙风"] = 666,
				["一粒沙"] = 840,
				["梅闻花"] = 891,
				["古惑仔"] = 333,
				["一神丶"] = 839,
				["丘比特之枪"] = 430,
				["瞳睛迷乀"] = 718,
				["流水无痕"] = 899,
				["冷月葬花魂"] = 465,
				["丶丶神"] = 434,
				["Micoo"] = 834,
				["Jumbajump"] = 41,
				["武冰"] = 654,
				["椰蓉面包"] = 649,
				["九江月"] = 353,
				["Adele"] = 829,
				["龘龖龍龖龘"] = 828,
				["风涧骑"] = 814,
				["豌豆尖尖"] = 103,
				["帕斯卡"] = 80,
				["无敌暗影箭"] = 616,
				["称职奶爸"] = 356,
				["骚气贼"] = 820,
				["来玩啊有发票"] = 888,
				["凹凸撸凸凹"] = 152,
				["一九七九"] = 420,
				["马儿闯天涯"] = 818,
				["黑木耳上仙"] = 290,
				["魂殇"] = 330,
				["神之太烦"] = 312,
				["暮光星灵"] = 626,
				["馒头仔"] = 39,
				["大葱一枚"] = 526,
				["稳阿"] = 53,
				["袁阿满"] = 924,
				["Tough"] = 416,
				["飞丶"] = 817,
				["风脸小旋风"] = 816,
				["别惹我"] = 858,
				["风礼"] = 815,
				["石原莉奈"] = 325,
				["海岸"] = 673,
				["鱼肠剑"] = 824,
				["顶天立地"] = 811,
				["西西子"] = 775,
				["天降丷正義"] = 533,
				["羽瑜"] = 279,
				["小小芳姐"] = 563,
				["斯奎"] = 256,
				["無糖"] = 268,
				["韩跑跑"] = 810,
				["瞳睛迷丶"] = 8,
				["酱油半咕咚"] = 793,
				["谁也挡不了"] = 779,
				["初恋丶"] = 475,
				["明月灬"] = 621,
				["免费盗底"] = 455,
				["天降正義"] = 534,
				["箖鳩"] = 911,
				["四岁就很帅"] = 383,
				["零陵邢道荣"] = 806,
				["Naq"] = 835,
				["日月之行"] = 620,
				["戦鬥熋"] = 604,
				["只影向谁去"] = 861,
				["山炮"] = 377,
				["玉树临風"] = 198,
				["隐秘的战神"] = 802,
				["楚歌"] = 22,
				["烧锅炉"] = 266,
				["梦寻千古醉"] = 329,
				["隐子猎手"] = 801,
				["杰爷"] = 642,
				["欲眠"] = 651,
				["阿阮"] = 37,
				["鹿森"] = 1,
				["战神赤"] = 322,
				["你爱吃香菜吗"] = 137,
				["發丶搜捕鸟"] = 272,
				["不学巫术"] = 427,
				["阿尔塞纳"] = 799,
				["寻蝶舞沧海"] = 250,
				["妖言"] = 543,
				["水泥一号"] = 663,
				["画画的贝贝"] = 707,
				["呐个矮子牧"] = 4,
				["钢丝套餐"] = 796,
				["小肉墩"] = 567,
				["薰大圣"] = 159,
				["冰冷之泉"] = 228,
				["重拾山河"] = 795,
				["含泪自愿加班"] = 175,
				["糖可爱"] = 738,
				["老歌丶"] = 33,
				["神圣道标"] = 723,
				["月墨夕寒"] = 630,
				["Arcane"] = 399,
				["你行你来"] = 386,
				["魔龙灵宿"] = 945,
				["邵云"] = 792,
				["那不是爱情"] = 791,
				["追猫猫"] = 788,
				["群演百事可乐"] = 744,
				["湖中"] = 683,
				["迷璐"] = 361,
				["小猫打扑克"] = 876,
				["超毛分水鱼"] = 784,
				["莉村花"] = 763,
				["Shurrik"] = 413,
				["鱼人牧"] = 161,
				["伽利略"] = 118,
				["蝶舞沧海"] = 284,
				["里予"] = 794,
				["宝宝我在这"] = 553,
				["说的好"] = 778,
				["西门大脚"] = 776,
				["小僵尸绿了"] = 215,
				["西索的牙"] = 774,
				["元贞"] = 453,
				["Nicolekidman"] = 410,
				["西池未央"] = 773,
				["宝宝你在哪"] = 552,
				["虾撸相逢"] = 771,
				["淡淡的忧愁"] = 677,
				["惊骑队长"] = 597,
				["我不会奶不上"] = 600,
				["诸暨炮神"] = 226,
				["無情哈拉少"] = 688,
				["叶小菡"] = 181,
				["胜天半子丶"] = 281,
				["薇薇酱"] = 770,
				["蓝色的丶大海"] = 769,
				["蓓蓓般强壮"] = 768,
				["夏虫不可语冰"] = 514,
				["开车不踩刹车"] = 141,
				["小时候的光"] = 387,
				["蒙塔基钢弹"] = 767,
				["醉啸千山"] = 100,
				["追忆丶雪山"] = 930,
				["萬剣人踪灭"] = 765,
				["苹果十四"] = 761,
				["憨憨的奶锤"] = 334,
				["苗战"] = 758,
				["苏拉"] = 757,
				["花解语蝴蝶"] = 756,
				["小哥"] = 874,
				["怀旧时间双绝"] = 164,
				["花心儿大萝卜"] = 755,
				["Xxim"] = 837,
				["艾格雯"] = 752,
				["东哥丶"] = 167,
				["肉佳馍"] = 747,
				["千灬山"] = 859,
				["起舞弄清影"] = 294,
				["标准近战猎"] = 890,
				["玩你个蛋"] = 703,
				["知麻膏"] = 719,
				["四岁就很酷"] = 384,
				["愤怒得小鸟"] = 255,
				["红色幻刺"] = 742,
				["落晨"] = 177,
				["焦糖玛奇朵"] = 371,
				["云隐鹤乡"] = 354,
				["紫霄依韵丶"] = 740,
				["狮心斩杀者"] = 90,
				["紫衣云梦"] = 739,
				["米莱狄"] = 737,
				["茅臺"] = 99,
				["米彩"] = 736,
				["人小能量大"] = 444,
				["米开朗骑螺"] = 735,
				["瓦夫"] = 352,
				["箫声咽"] = 733,
				["王一一"] = 308,
				["霸王爱上弓"] = 82,
				["嗜血的米勒"] = 362,
				["笨果果丶"] = 729,
				["鄙人不善奔跑"] = 70,
				["孤舟"] = 549,
				["战山河"] = 880,
				["Whitegods"] = 952,
				["美娟"] = 743,
				["赵德嵀"] = 285,
				["皮卡"] = 222,
				["孜然"] = 547,
				["天才小熊猫"] = 530,
				["武林萌主"] = 258,
				["小七月"] = 189,
				["祖奶奶"] = 722,
				["苦苦冲锋"] = 34,
				["貂蝉姐姐"] = 926,
				["明德"] = 316,
				["老李来开会"] = 746,
				["Kele"] = 407,
				["瞅你个熊色儿"] = 716,
				["莼蓝色"] = 764,
				["皇室节奏"] = 713,
				["老爷快来呀"] = 232,
				["Mx"] = 409,
				["白胡子三娘"] = 711,
				["白小术"] = 709,
				["电耗子"] = 706,
				["特效治疗"] = 695,
				["夏夜浅酌"] = 62,
				["王大志"] = 701,
				["夜雨沁人心"] = 357,
				["猫头鹰密涅瓦"] = 698,
				["猎爹大魔王"] = 29,
				["狂奔的蜗牛"] = 696,
				["小养由基"] = 562,
				["牧丨無王法"] = 694,
				["牛莽夫"] = 693,
				["永泰"] = 379,
				["熟悉的陌生人"] = 690,
				["牛攵"] = 692,
				["宝石骑士"] = 556,
				["洪琻寶"] = 262,
				["爱如空气"] = 691,
				["骑士水大叔"] = 324,
				["丶晴天"] = 436,
				["烦恼即菩提"] = 687,
				["法狂如雷"] = 669,
				["靈靈怪"] = 38,
				["混乱风暴"] = 340,
				["比目鱼吻"] = 659,
				["大徐州"] = 521,
				["天风"] = 295,
				["三只小德"] = 112,
				["关一里姬"] = 458,
				["清扬小小牧"] = 75,
				["大佛丶"] = 92,
				["清风悠悠"] = 680,
				["消毒的风"] = 676,
				["佳儿"] = 450,
				["浩哥"] = 672,
				["浅柔"] = 671,
				["帝王丶"] = 578,
				["伊莉莎丶"] = 89,
				["炮泡糖"] = 686,
				["Dragoncity"] = 9,
				["猎艳轰唇"] = 355,
				["法夜"] = 668,
				["凤舞离殇"] = 471,
				["丶桃子"] = 844,
				["沈奕琳"] = 664,
				["阿咘"] = 798,
				["大胡子钢须"] = 524,
				["夏洛不明"] = 153,
				["叶落苍穹"] = 487,
				["气球"] = 661,
				["宝子"] = 551,
				["比你跑的快"] = 658,
				["星尘斗士"] = 154,
				["毒药多"] = 657,
				["奥优给"] = 540,
				["普罗米修斯丶"] = 624,
				["每天都要玩"] = 656,
				["欧煌史迪仔"] = 306,
				["每天都做梦"] = 655,
				["宝石绿蓝"] = 554,
				["沐雨聆风"] = 165,
				["澳洲野玫瑰"] = 345,
				["林丷"] = 644,
				["正方形的圆"] = 652,
				["海鸟跟鱼相爱"] = 900,
				["我瞅你像猪"] = 602,
				["微醺人生"] = 338,
				["朕赦你无罪"] = 634,
				["Playerkpmdxk"] = 412,
				["白小腰"] = 710,
				["楚记"] = 650,
				["丶初秋丶"] = 88,
				["加菲猫"] = 479,
				["枕刀歌"] = 643,
				["李老师归来"] = 638,
				["李老头"] = 637,
				["唐十伍"] = 127,
				["夜丶凌乱"] = 516,
				["吹风渠里冷"] = 14,
				["朝思暮想"] = 635,
				["土鲁鲁"] = 147,
				["有事我先走"] = 633,
				["坏笑的天使"] = 512,
				["似故人来"] = 447,
				["可乐小浅"] = 13,
				["橘子汽水"] = 347,
				["凛风丿"] = 469,
				["部落卡德甲"] = 327,
				["小暮雪"] = 68,
				["曹婴"] = 629,
				["爱你两世丶"] = 269,
				["暴哥"] = 627,
				["暗影随风"] = 625,
				["Dtfs"] = 403,
				["春色未曾看丶"] = 623,
				["星落"] = 622,
				["雨人码头"] = 804,
				["简简单单丶"] = 730,
				["无敌治疗术"] = 618,
				["无敌最俊朗丶"] = 617,
				["无冷却"] = 615,
				["小肥子"] = 102,
				["百年老腰"] = 169,
				["潇瑟"] = 901,
				["捌零玖零"] = 611,
				["福熙"] = 274,
				["护花使者"] = 609,
				["叨锣酿帝"] = 201,
				["大帅哥"] = 520,
				["東风"] = 889,
				["空之境界"] = 369,
				["槑槑呆槑槑"] = 23,
				["大漠映残阳"] = 522,
				["黑铁铁"] = 826,
				["我的头发呢"] = 601,
				["是与非爱与恨"] = 351,
				["杰尼"] = 21,
				["奔跑吧小卤蛋"] = 539,
				["一起喝啤酒"] = 237,
				["红叶丶"] = 913,
				["奶奶灰"] = 541,
				["大个一米八六"] = 519,
				["快剑格蕾"] = 595,
				["大豆"] = 214,
				["罗晋"] = 143,
				["德天独厚"] = 592,
				["蘇察哈尔灿"] = 86,
				["小矮牧"] = 297,
				["龍叔"] = 184,
				["惹不起"] = 254,
				["枫华林"] = 645,
				["日向丶雏田"] = 197,
				["狂爆"] = 52,
				["丷乄丷"] = 439,
				["Cpg"] = 402,
				["小小酒缸"] = 251,
				["山月不知事"] = 878,
				["基努里维斯"] = 119,
				["擎天柱"] = 49,
				["安澜秀"] = 872,
				["铁堡城主"] = 58,
				["微笑星星"] = 590,
				["微微一笑"] = 589,
				["影沉寒水"] = 587,
				["殺氣"] = 111,
				["基本無解"] = 513,
				["雪雨星風"] = 938,
				["山河无恙"] = 573,
				["荊軻"] = 390,
				["酒意入桃枝"] = 121,
				["庄亮亮"] = 582,
				["西克"] = 314,
				["皮哥"] = 212,
				["花非花梦非梦"] = 919,
				["希尔纳"] = 577,
				["大狗警长"] = 523,
				["小玲噹"] = 235,
				["不良熊"] = 429,
				["沐萌"] = 130,
				["卜贱卜散"] = 332,
				["辛多雷怒火"] = 786,
				["八级大狂风丶"] = 456,
				["小黃人"] = 569,
				["小柒丿"] = 566,
				["醉红唇"] = 395,
				["你的老婆"] = 302,
				["超凶的"] = 207,
				["清扬小德"] = 210,
				["刘三"] = 473,
				["甄丑"] = 905,
				["宽老三"] = 558,
				["审判"] = 557,
				["宝石蓝绿"] = 555,
				["负饿贷"] = 781,
				["血暗影"] = 200,
				["柒天鲜活"] = 73,
				["牛海皇"] = 107,
				["天真无鞋"] = 870,
				["妖狐"] = 542,
				["奎托利亚"] = 537,
				["夫子"] = 536,
				["夙愿"] = 248,
				["农村混血妞"] = 460,
				["青丰"] = 808,
				["天水伯约"] = 531,
				["布呐呐"] = 576,
				["一葉知秋"] = 421,
				["夜歌不带刀"] = 518,
				["学友"] = 157,
				["音浪"] = 287,
				["月小倩"] = 631,
				["地里热瓜"] = 511,
				["皇家玛德里"] = 714,
				["大鱼海棠"] = 359,
				["剑舞丶丶魅影"] = 476,
				["土豆忒好吃"] = 506,
				["回归者帝陨"] = 505,
				["一箭破云"] = 309,
				["嗷力给"] = 503,
				["啦拉拉"] = 501,
				["唯一"] = 500,
				["圣光归来"] = 508,
				["吾皇"] = 495,
				["吧唧"] = 491,
				["澄心"] = 265,
				["攻其不备"] = 298,
				["竹取彝族"] = 193,
				["清欢与酒"] = 216,
				["小馋"] = 202,
				["等风也等你"] = 30,
				["自我催眠"] = 156,
				["水叶"] = 662,
				["天火天火"] = 114,
				["暴风障壁"] = 221,
				["角色扮演"] = 293,
				["软炮炮"] = 2,
				["台州丶大潘"] = 486,
				["发光使我快乐"] = 485,
				["上允尢虍"] = 426,
				["红手套"] = 66,
				["千亦丶刹"] = 484,
				["咖啡沫"] = 497,
				["名将灬法"] = 489,
				["凉雨初夏"] = 467,
				["捅尼付死"] = 882,
				["鬼迷"] = 944,
				["元芳"] = 854,
				["冯一刀"] = 463,
				["Amer"] = 108,
				["冬天的冰棒棒"] = 462,
				["冬天熙雨"] = 461,
				["天鹰翔星曲"] = 535,
				["兽仁战"] = 459,
				["耗子违之"] = 280,
				["温柔帅哥"] = 681,
				["尘世行"] = 17,
				["大萝卜的萝"] = 525,
				["青衣白发"] = 809,
				["克拉雷特"] = 454,
				["欢乐明哥"] = 24,
				["杰克信仰"] = 641,
				["井星邦邦骑"] = 847,
				["木鱼戮"] = 886,
				["习惯孤独"] = 442,
				["乐心"] = 441,
				["事过人迁"] = 845,
				["漫步雨落"] = 684,
				["煜老爷"] = 25,
				["葬爱郭德纲"] = 35,
				["潇乄飞"] = 360,
				["丶大聪明"] = 435,
				["常驻力量谷"] = 581,
				["中原大呲花"] = 433,
				["谈谈理想"] = 300,
				["圣大力"] = 510,
				["七彩雲飘飘"] = 424,
				["我是垃圾"] = 81,
				["战不旋踵"] = 168,
				["作曲大师"] = 449,
				["黑暗与黎明"] = 204,
				["团长没了"] = 229,
				["小伢"] = 561,
				["麦子大叔"] = 825,
				["可爱屁"] = 218,
				["又是大晴天"] = 244,
				["少一个请字"] = 570,
				["卡米啦"] = 860,
				["艾因斯坦"] = 317,
				["若如初见"] = 759,
				["减肥大王"] = 468,
				["特变电工"] = 903,
				["Torr"] = 415,
				["Tenveo"] = 414,
				["泽丶火"] = 323,
				["迦城"] = 787,
				["贼嘻嘻"] = 783,
				["无忌哥哥"] = 18,
				["小飞象拉拉啦"] = 252,
				["天呐我真菜"] = 249,
				["椰壳"] = 319,
				["牧遥"] = 51,
				["天山六阳掌"] = 529,
				["未媛"] = 385,
				["胖揍王月娇"] = 749,
				["钟正秋"] = 381,
				["紫涵"] = 275,
				["峨眉居士"] = 574,
				["Meinv"] = 408,
				["白衣染霜华"] = 712,
				["瞬间快感"] = 717,
				["开来家居"] = 584,
				["白色头像"] = 946,
				["一颗小虎牙"] = 422,
				["一只沫沫"] = 93,
				["钻石武力"] = 797,
				["小铃噹"] = 45,
				["Usop"] = 417,
				["花开如火"] = 754,
				["Ex"] = 404,
				["顶梁柱"] = 288,
				["Attacker"] = 400,
				["时间不等人"] = 257,
				["Resume"] = 318,
				["Agile"] = 397,
				["谁同意谁反对"] = 780,
				["深卿"] = 60,
				["热带鱼"] = 267,
				["冬天的柚子"] = 349,
				["剑梦灵心"] = 196,
				["追忆丶小雪"] = 394,
				["波波糖"] = 65,
				["荒野丶"] = 219,
				["豚杆"] = 6,
				["悠闲的杀戮"] = 596,
				["中医疗法"] = 843,
				["圣剑阿拉贡"] = 509,
				["强壯壯"] = 586,
				["多情"] = 949,
				["開心心"] = 223,
				["秦歌"] = 726,
				["贤斌珐师"] = 782,
				["潘西无情"] = 142,
				["深山里板蓝根"] = 95,
				["潮汐海灵"] = 50,
				["白鷺"] = 908,
				["银鞍照白马"] = 933,
				["灵梦丶小贼儿"] = 685,
				["大鱼吃小鱼"] = 380,
				["牧贵妃"] = 27,
				["瓦丝琪"] = 191,
				["拟态"] = 610,
				["羽西"] = 745,
				["岁月如歌"] = 378,
				["在你身后射箭"] = 374,
				["水水更健康"] = 261,
				["手抽筋了"] = 606,
				["傲笑红尘"] = 391,
				["莫奈"] = 921,
				["Heratl"] = 832,
				["王子不是我"] = 370,
				["我要开车了"] = 603,
				["Kaka"] = 833,
				["沈鱼"] = 179,
				["执念"] = 368,
				["一米八四"] = 367,
				["位面灬天使"] = 448,
				["趴趴熊"] = 785,
				["风尘女子"] = 366,
				["一起哩哩醉"] = 3,
				["风行"] = 364,
				["徐州小霸王"] = 588,
				["圣光奶你"] = 393,
				["趁虚而入"] = 315,
				["夜空的流星"] = 101,
				["石头的法神"] = 97,
				["此岸的风"] = 363,
				["君莫笑丨"] = 490,
				["白酒壹斤半"] = 192,
				["随机起名字"] = 800,
				["风华血月"] = 213,
				["三级自爆卡车"] = 72,
				["联盟舰队司令"] = 199,
				["青客"] = 195,
				["一页书叔"] = 126,
				["鱼人王多鱼"] = 823,
				["Gogo"] = 10,
				["康桑阿米达丶"] = 583,
				["牧马人"] = 902,
				["慈悲喜舍"] = 598,
				["疯子捷哥"] = 271,
				["心灵之美"] = 350,
				["唐十五"] = 499,
				["茉莉绿茶"] = 762,
				["杨十一"] = 640,
				["丽娅怒风"] = 440,
				["马铁花"] = 289,
				["曦风"] = 344,
				["今年二十八"] = 341,
				["就此别过"] = 337,
				["软泡泡"] = 929,
				["霜术"] = 87,
				["小灬灬树"] = 292,
				["葬爱灬野子"] = 283,
				["菜菜德丶"] = 117,
				["疯狂小牧"] = 138,
				["苦海种青莲"] = 760,
				["猫小烦"] = 700,
				["我是小强"] = 321,
				["管我叫胖娇"] = 731,
				["火师战"] = 307,
				["凝霜"] = 470,
				["社区扛把子"] = 721,
				["帮主任"] = 580,
				["圣光之子"] = 305,
				["上单卧龙"] = 303,
				["丶白胡子法神"] = 437,
				["小怪"] = 564,
				["朵儿不哭"] = 20,
				["游人"] = 682,
				["王小淘"] = 291,
				["弑神白起"] = 64,
				["Cococoing"] = 401,
				["好大的奶"] = 148,
				["三十四亿"] = 234,
				["铁盗乂在云端"] = 286,
				["罗小宁"] = 277,
				["偏偏意气用事"] = 452,
				["乍见之欢"] = 11,
				["Xit"] = 419,
				["南城旧事"] = 243,
				["维斯特利"] = 225,
				["武丶大郎"] = 653,
				["我是你们的神"] = 224,
				["毒药贰"] = 260,
				["超级大黑狗"] = 203,
				["打你吐血"] = 607,
				["隔壁的红裤衩"] = 803,
				["啊船"] = 208,
				["众神老王"] = 853,
				["發丶麦发啧"] = 907,
				["晓德德"] = 182,
				["红三爷"] = 741,
				["澜雪"] = 348,
				["跳跳瓏"] = 346,
				["放鸽子的大猴"] = 613,
				["自豪的光头"] = 751,
				["凶残的光头"] = 472,
				["凉森婈梦"] = 76,
				["慵懒症"] = 599,
				["多听相声爱国"] = 515,
				["受伤丶小豆丁"] = 84,
				["剑剑锋"] = 217,
				["萌萌小猫咪"] = 139,
				["大胡子丶铜须"] = 372,
				["陌狄"] = 296,
				["拉怪劣人"] = 74,
				["永恒丶圣骑"] = 365,
				["黑白影子"] = 125,
				["桑塔纳"] = 647,
				["窃梦者"] = 123,
				["咕噜姆"] = 104,
				["正面硬刚"] = 98,
				["延边战神"] = 253,
				["桐秋"] = 646,
				["圣光会脏死你"] = 109,
				["萌丶小鬼"] = 77,
				["永恒灬圣骑"] = 896,
				["珈百璃"] = 704,
				["非诺"] = 57,
				["月光下"] = 115,
				["兰兰"] = 457,
				["冰火丶两重天"] = 464,
				["椰子球"] = 648,
				["守猪逮兔"] = 7,
				["不空君"] = 178,
				["依落花"] = 67,
				["繁星璀璨"] = 31,
				["逃出绝命镇"] = 789,
				["井星邦邦"] = 846,
				["海是海洋的洋"] = 674,
			},
		},
	},
}
WIM3_Filters = {
	{
		"^OQ[,S]", -- [1]
		["enabled"] = true,
		["type"] = 1,
		["pattern"] = "^<T>PartyQuests[^A-Z]+\n^<M_N>\n^ItemDB-Request:\n^LVBM\n^YOU ARE BEING WATCHED!\n^YOU ARE MARKED!\n^YOU ARE CURSED!\n^YOU HAVE THE PLAGUE!\n^YOU ARE BURNING!\n^YOU ARE THE BOMB!\nVOLATILE INFECTION\n^/^GA[^A-Z]+\n^<METAMAP\n^<CT",
		["sent"] = true,
		["name"] = "由插件发送的悄悄话",
		["received"] = true,
		["action"] = 2,
		["stats"] = 0,
		["protected"] = true,
		["tag"] = "addons",
	}, -- [1]
	{
		["enabled"] = false,
		["type"] = 2,
		["action"] = 1,
		["friend"] = true,
		["party"] = true,
		["name"] = "悄悄话选择区1",
		["guild"] = true,
		["raid"] = true,
		["received"] = true,
		["stats"] = 0,
	}, -- [2]
	{
		["enabled"] = false,
		["type"] = 2,
		["name"] = "悄悄话选择区2",
		["action"] = 2,
		["all"] = true,
		["received"] = true,
		["stats"] = 0,
	}, -- [3]
}
WIM3_History = {
	["鱼人摩洛克"] = {
		["特变电工"] = {
			["中原大呲花"] = {
				{
					["type"] = 1,
					["time"] = 1641617746,
					["from"] = "中原大呲花",
					["msg"] = "你好 我通过工会群里面加你微信了",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641618710,
					["from"] = "特变电工",
					["msg"] = "退组",
					["inbound"] = false,
					["convo"] = "中原大呲花",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641618717,
					["from"] = "中原大呲花",
					["msg"] = "1111",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641618750,
					["from"] = "特变电工",
					["msg"] = "什么翼",
					["inbound"] = false,
					["convo"] = "中原大呲花",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641618757,
					["from"] = "中原大呲花",
					["msg"] = "恩",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641618762,
					["from"] = "中原大呲花",
					["msg"] = "张",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641618785,
					["from"] = "特变电工",
					["msg"] = "谢",
					["inbound"] = false,
					["convo"] = "中原大呲花",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641618788,
					["from"] = "中原大呲花",
					["msg"] = "客气",
					["inbound"] = true,
					["convo"] = "中原大呲花",
				}, -- [8]
				["info"] = {
				},
			},
			["吧唧"] = {
				{
					["type"] = 1,
					["time"] = 1641101826,
					["from"] = "特变电工",
					["msg"] = "毛的一手好伤害。。。",
					["inbound"] = false,
					["convo"] = "吧唧",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641101828,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "吧唧",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641101860,
					["from"] = "吧唧",
					["msg"] = "- -无尽黑暗不毛不合适",
					["inbound"] = true,
					["convo"] = "吧唧",
				}, -- [3]
				["info"] = {
				},
			},
			["无忌哥哥"] = {
				{
					["type"] = 1,
					["time"] = 1641131782,
					["from"] = "无忌哥哥",
					["msg"] = "你们通灵多久打完",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641131795,
					["from"] = "无忌哥哥",
					["msg"] = "我想去收个cd 做点药剂",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641131805,
					["from"] = "特变电工",
					["msg"] = "马上",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641131816,
					["from"] = "特变电工",
					["msg"] = "5分钟",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641131856,
					["from"] = "无忌哥哥",
					["msg"] = "好的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641131856,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 讲师玛丽希亚交战，（当前12%，5/5存活）",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641131859,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 讲师玛丽希亚的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641132015,
					["from"] = "特变电工",
					["msg"] = "来吗",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641132028,
					["from"] = "无忌哥哥",
					["msg"] = "来的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641132034,
					["from"] = "特变电工",
					["msg"] = "块",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641132034,
					["from"] = "无忌哥哥",
					["msg"] = "组我吧",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641132036,
					["from"] = "特变电工",
					["msg"] = "我要走了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641132040,
					["from"] = "无忌哥哥",
					["msg"] = "实验室那边的怪你打 了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641132057,
					["from"] = "无忌哥哥",
					["msg"] = "做药剂台子边上的那波 ",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641132067,
					["from"] = "特变电工",
					["msg"] = "不清楚哦",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641132068,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641132085,
					["from"] = "特变电工",
					["msg"] = "正常全通",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641132086,
					["from"] = "特变电工",
					["msg"] = "路线",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132096,
					["from"] = "特变电工",
					["msg"] = "传令",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132119,
					["from"] = "无忌哥哥",
					["msg"] = "我是说霜雨房间",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641132125,
					["from"] = "特变电工",
					["msg"] = "打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641132131,
					["from"] = "特变电工",
					["msg"] = "没清完",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641132154,
					["from"] = "特变电工",
					["msg"] = "BOSS打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641132159,
					["from"] = "特变电工",
					["msg"] = "打了一波怪",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641132162,
					["from"] = "无忌哥哥",
					["msg"] = "那估计完了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641134021,
					["from"] = "无忌哥哥",
					["msg"] = "你还在刷么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641134025,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641134030,
					["from"] = "无忌哥哥",
					["msg"] = "也是全通么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641134032,
					["from"] = "特变电工",
					["msg"] = "刚才那个CD没去？",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641134040,
					["from"] = "无忌哥哥",
					["msg"] = "那个那波怪没清",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641134046,
					["from"] = "无忌哥哥",
					["msg"] = "这次你能清下么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641134048,
					["from"] = "特变电工",
					["msg"] = "要全清？",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641134061,
					["from"] = "无忌哥哥",
					["msg"] = "就霜语房间，右手边那一波 要清",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641134071,
					["from"] = "无忌哥哥",
					["msg"] = "你们只清了左手边的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641134090,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641134094,
					["from"] = "无忌哥哥",
					["msg"] = "谢谢拉",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641135477,
					["from"] = "特变电工",
					["msg"] = "清完了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641135482,
					["from"] = "特变电工",
					["msg"] = "你10分钟后飞本",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641135485,
					["from"] = "无忌哥哥",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641136294,
					["from"] = "特变电工",
					["msg"] = "飞了没",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641136298,
					["from"] = "无忌哥哥",
					["msg"] = "嗯 到了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641136489,
					["from"] = "无忌哥哥",
					["msg"] = "在副本门口了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641136495,
					["from"] = "特变电工",
					["msg"] = "等5分钟",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641136497,
					["from"] = "特变电工",
					["msg"] = "马上好",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641136505,
					["from"] = "无忌哥哥",
					["msg"] = "嗯好",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641136648,
					["from"] = "特变电工",
					["msg"] = "$%^&*!@#$。。",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641136650,
					["from"] = "特变电工",
					["msg"] = "灭了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641136652,
					["from"] = "特变电工",
					["msg"] = "稍等",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641136653,
					["from"] = "无忌哥哥",
					["msg"] = "..",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641136656,
					["from"] = "特变电工",
					["msg"] = "有个%^&*!@猎人",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641136658,
					["from"] = "无忌哥哥",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641136660,
					["from"] = "特变电工",
					["msg"] = "各种ADD",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641137211,
					["from"] = "无忌哥哥",
					["msg"] = "队长能给我么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641137231,
					["from"] = "无忌哥哥",
					["msg"] = "感谢 感谢",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641137235,
					["from"] = "特变电工",
					["msg"] = "好了嘛",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641142170,
					["from"] = "无忌哥哥",
					["msg"] = "你后来又打了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641142174,
					["from"] = "特变电工",
					["msg"] = "打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641142175,
					["from"] = "特变电工",
					["msg"] = "出了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641142177,
					["from"] = "特变电工",
					["msg"] = "毕业了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641142181,
					["from"] = "无忌哥哥",
					["msg"] = "额额",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641142182,
					["from"] = "特变电工",
					["msg"] = "所有副本都毕业",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641142184,
					["from"] = "无忌哥哥",
					["msg"] = "cz 了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [62]
				["info"] = {
				},
			},
			["乐心"] = {
				{
					["type"] = 1,
					["time"] = 1641709562,
					["from"] = "特变电工",
					["msg"] = "战士拯救补一个",
					["inbound"] = false,
					["convo"] = "乐心",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641709674,
					["from"] = "特变电工",
					["msg"] = "战士的拯救",
					["inbound"] = false,
					["convo"] = "乐心",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641718052,
					["from"] = "特变电工",
					["msg"] = "0.13",
					["inbound"] = false,
					["convo"] = "乐心",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641718067,
					["from"] = "乐心",
					["msg"] = "0.13可以给你5000",
					["inbound"] = true,
					["convo"] = "乐心",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641718075,
					["from"] = "乐心",
					["msg"] = "0.135可以再给你5000",
					["inbound"] = true,
					["convo"] = "乐心",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641718087,
					["from"] = "乐心",
					["msg"] = "因为我有5000是0.135收的",
					["inbound"] = true,
					["convo"] = "乐心",
				}, -- [6]
				["info"] = {
				},
			},
			["阿摇"] = {
				{
					["type"] = 1,
					["time"] = 1641640396,
					["from"] = "特变电工",
					["msg"] = "已经起飞了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641640407,
					["from"] = "阿摇",
					["msg"] = "哈哈哈 这几天在约会 都没看- -",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641640411,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [3]
				["info"] = {
				},
			},
			["刘人杰#5854"] = {
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "刘人杰#5854",
					["msg"] = "噢 哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "特变电工",
					["msg"] = "总共A股",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "刘人杰#5854",
					["msg"] = "可以了 很 牛 比了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641010277,
					["from"] = "刘人杰#5854",
					["msg"] = "不能追求最高点最低点 哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641010278,
					["from"] = "特变电工",
					["msg"] = "回撤没控制好 没办法",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641010310,
					["from"] = "刘人杰#5854",
					["msg"] = "一波主升浪结束 还是要出来下  回头马后炮看",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641010341,
					["from"] = "特变电工",
					["msg"] = "是 长线满仓一支是这样的结果",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641010344,
					["from"] = "刘人杰#5854",
					["msg"] = "没主升浪就不动 主升浪了   外面那些追涨的老鼠!@# 全进来了  ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641010356,
					["from"] = "刘人杰#5854",
					["msg"] = "捣乱",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641010366,
					["from"] = "刘人杰#5854",
					["msg"] = "已经很牛 比了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641010376,
					["from"] = "特变电工",
					["msg"] = "现在特变筹码获利比例10%",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641010398,
					["from"] = "刘人杰#5854",
					["msg"] = "但是让我马后炮 旁观者 说话不腰疼  就是暴涨后  先离场",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641010413,
					["from"] = "刘人杰#5854",
					["msg"] = "因为外面那些捣乱资金追进去了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641010430,
					["from"] = "刘人杰#5854",
					["msg"] = "150W 美滋滋啊 ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641010449,
					["from"] = "特变电工",
					["msg"] = "刚好跟税后工资收入差不多",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641010459,
					["from"] = "刘人杰#5854",
					["msg"] = "你是高收入",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641010465,
					["from"] = "特变电工",
					["msg"] = "相当于副业跟主业一样",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641010467,
					["from"] = "刘人杰#5854",
					["msg"] = "一半人 就20 30W 上班族",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641010472,
					["from"] = "刘人杰#5854",
					["msg"] = "一般人",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641010518,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641010535,
					["from"] = "特变电工",
					["msg"] = "但是不知道还有几年红利期",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641010542,
					["from"] = "特变电工",
					["msg"] = "互联网今年太惨了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641010561,
					["from"] = "特变电工",
					["msg"] = "还好公司发的股票我都抛了买了特变 ",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641010566,
					["from"] = "特变电工",
					["msg"] = "不然今年要被锤惨",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641010586,
					["from"] = "特变电工",
					["msg"] = "今年我跟我们同行业同事的收入差距拉开了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641010590,
					["from"] = "特变电工",
					["msg"] = "选择比努力重要",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641010596,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641010615,
					["from"] = "特变电工",
					["msg"] = "想想还是知足了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641010648,
					["from"] = "刘人杰#5854",
					["msg"] = "一口吃不了胖子  志向高远 也要慢慢来",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641010670,
					["from"] = "刘人杰#5854",
					["msg"] = "你这条件 已经甩开   95%以上的人了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641010688,
					["from"] = "特变电工",
					["msg"] = "今年有个最失误的选择",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641010729,
					["from"] = "特变电工",
					["msg"] = "就是我朋友叫我帮他打理十几亿的资产 给我底薪100万加提成 我没去 然后走的时候套我话以10块钱买了8000万的特变",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641010736,
					["from"] = "特变电工",
					["msg"] = "我太谨慎了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641010761,
					["from"] = "刘人杰#5854",
					["msg"] = "人家赚发了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641010766,
					["from"] = "特变电工",
					["msg"] = "还好",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641010774,
					["from"] = "刘人杰#5854",
					["msg"] = "他还没卖？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641010776,
					["from"] = "特变电工",
					["msg"] = "没",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641010785,
					["from"] = "特变电工",
					["msg"] = "大游资",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641010793,
					["from"] = "刘人杰#5854",
					["msg"] = "啥席位？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641010826,
					["from"] = "特变电工",
					["msg"] = "现在持仓1.8个亿吧",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641010850,
					["from"] = "特变电工",
					["msg"] = "流通股东肯定看不到他",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641010857,
					["from"] = "刘人杰#5854",
					["msg"] = "那肯定啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641010857,
					["from"] = "特变电工",
					["msg"] = "特变市值高",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641010862,
					["from"] = "刘人杰#5854",
					["msg"] = "特变多大的盘子",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641010867,
					["from"] = "特变电工",
					["msg"] = "更不用说举牌了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641010890,
					["from"] = "特变电工",
					["msg"] = "而且他是多账号买入",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641010904,
					["from"] = "特变电工",
					["msg"] = "我第一次看他的股票资金",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641010907,
					["from"] = "特变电工",
					["msg"] = "吓死我了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641010917,
					["from"] = "特变电工",
					["msg"] = "一个子账户 1个多亿",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641010924,
					["from"] = "特变电工",
					["msg"] = "看着特别像模拟盘",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641010925,
					["from"] = "刘人杰#5854",
					["msg"] = "他全是长线？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641010928,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641010933,
					["from"] = "特变电工",
					["msg"] = "他很聪明的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641010943,
					["from"] = "特变电工",
					["msg"] = "不然怎么能赚十多个亿",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641010946,
					["from"] = "特变电工",
					["msg"] = "土老板",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641010949,
					["from"] = "特变电工",
					["msg"] = "做房地产的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641010958,
					["from"] = "特变电工",
					["msg"] = "最近2年都不做 在撤了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641010976,
					["from"] = "特变电工",
					["msg"] = "也是选择比努力重要的典范",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641010977,
					["from"] = "刘人杰#5854",
					["msg"] = "你是在北京？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641010982,
					["from"] = "刘人杰#5854",
					["msg"] = "百度是在北京吗？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641010984,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641010994,
					["from"] = "刘人杰#5854",
					["msg"] = "北京房子贵啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641011000,
					["from"] = "特变电工",
					["msg"] = "我租房",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641011009,
					["from"] = "刘人杰#5854",
					["msg"] = "好点地段10W一平有吧？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641011019,
					["from"] = "特变电工",
					["msg"] = "我今年能买一个不错的房子",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641011021,
					["from"] = "特变电工",
					["msg"] = "但是我不买",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641011044,
					["from"] = "特变电工",
					["msg"] = "作为全球顶级投资家怎么会去买房子",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641011049,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641011050,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641011059,
					["from"] = "特变电工",
					["msg"] = "我特鄙视买房行为",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641011061,
					["from"] = "特变电工",
					["msg"] = "不知道为啥",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641011070,
					["from"] = "特变电工",
					["msg"] = "觉得很不值",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641011077,
					["from"] = "刘人杰#5854",
					["msg"] = "买房躺赢时代结束了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641011082,
					["from"] = "刘人杰#5854",
					["msg"] = "这波!@#$%^房价的上涨",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641011087,
					["from"] = "刘人杰#5854",
					["msg"] = "泡沫太大了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641011099,
					["from"] = "刘人杰#5854",
					["msg"] = "已经透支玩了 ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641011132,
					["from"] = "特变电工",
					["msg"] = "我16年在重庆买的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641011139,
					["from"] = "刘人杰#5854",
					["msg"] = "老家重庆的？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641011143,
					["from"] = "特变电工",
					["msg"] = "投资收益700%",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641011150,
					["from"] = "特变电工",
					["msg"] = "完爆我的股票收益",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641011155,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641011159,
					["from"] = "特变电工",
					["msg"] = "我还瞧不上",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641011160,
					["from"] = "刘人杰#5854",
					["msg"] = "那时候躺赢 房产",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641011166,
					["from"] = "刘人杰#5854",
					["msg"] = "现在这波可以说 已经没了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641011183,
					["from"] = "刘人杰#5854",
					["msg"] = "我这三线小城  房子早就没流动性了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641011195,
					["from"] = "刘人杰#5854",
					["msg"] = "买了就是套",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641011196,
					["from"] = "特变电工",
					["msg"] = "北京生活体验太差",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641011211,
					["from"] = "刘人杰#5854",
					["msg"] = "不增值就相当于 钱糟蹋了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641011211,
					["from"] = "特变电工",
					["msg"] = "绝对的全国倒数",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641011241,
					["from"] = "刘人杰#5854",
					["msg"] = "但是好公司多啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641011241,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641011260,
					["from"] = "刘人杰#5854",
					["msg"] = "不过有钱人还是往上海跑",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641011263,
					["from"] = "刘人杰#5854",
					["msg"] = "估计还是因为环境",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641011302,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641011310,
					["from"] = "特变电工",
					["msg"] = "上海比北京生活体验好太多",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641011329,
					["from"] = "刘人杰#5854",
					["msg"] = "还是地理位置好",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641011334,
					["from"] = "刘人杰#5854",
					["msg"] = "靠海 有在长三角",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [97]
				["info"] = {
				},
			},
			["位面灬天使"] = {
				{
					["type"] = 1,
					["time"] = 1641141785,
					["from"] = "特变电工",
					["msg"] = "。。你要多少代工费",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641141795,
					["from"] = "位面灬天使",
					["msg"] = "看着给吧 3K买的图纸",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641141809,
					["from"] = "位面灬天使",
					["msg"] = "随便 一个会的",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641141818,
					["from"] = "位面灬天使",
					["msg"] = "成本慢慢收",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641141821,
					["from"] = "特变电工",
					["msg"] = "30？",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641141835,
					["from"] = "位面灬天使",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641141866,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641141868,
					["from"] = "特变电工",
					["msg"] = "铁炉堡？",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641141870,
					["from"] = "位面灬天使",
					["msg"] = "我去冬泉谷交任务 马上回",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641141879,
					["from"] = "位面灬天使",
					["msg"] = "黑龙门任务 交了就回了",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641141926,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641141931,
					["from"] = "特变电工",
					["msg"] = "材料准备好了 等你起飞",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641141940,
					["from"] = "位面灬天使",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641141980,
					["from"] = "位面灬天使",
					["msg"] = "回了",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641142033,
					["from"] = "位面灬天使",
					["msg"] = "ok",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641142044,
					["from"] = "位面灬天使",
					["msg"] = "8~",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [16]
				["info"] = {
				},
			},
			["审判"] = {
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为所有数据",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  938,871 (449.1, 5.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "2. |cfffff468Naq|r  934,089 (428.6, 5.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "3. |cfffff468别惹我|r  927,812 (425.2, 5%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "4. |cffc69b6d追风中年|r  ^&*,340 (498.9, 4.8%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "5. |cff3fc6ea宝石大哥|r  873,386 (791.3, 4.7%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "6. |cff3fc6ea银叶草丶|r  844,724 (701.4, 4.6%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "7. |cff3fc6ea吧唧|r  803,216 (712.8, 4.4%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "8. |cffc69b6d芜湖小司马|r  792,247 (409.0, 4.3%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "9. |cffaad372夏虫不可语冰|r  780,309 (485.5, 4.2%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641106546,
					["from"] = "特变电工",
					["msg"] = "10. |cff3fc6ea杰克信仰|r  755,940 (701.7, 4.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641106578,
					["from"] = "审判",
					["msg"] = "打完了？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641106582,
					["from"] = "特变电工",
					["msg"] = "没",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641106598,
					["from"] = "特变电工",
					["msg"] = "轻松打第一ia",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641642204,
					["from"] = "审判",
					["msg"] = "求换个位面，谢谢！",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641642208,
					["from"] = "特变电工",
					["msg"] = "满了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641642214,
					["from"] = "特变电工",
					["msg"] = "在奥山",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641642216,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641642222,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r|cffa335ee|Hitem:19325::::::::60:::::::::|h[胡里奥指环]|h|r",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641642224,
					["from"] = "审判",
					["msg"] = "好的。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641728487,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641728493,
					["from"] = "审判",
					["msg"] = "怎么了？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641728494,
					["from"] = "特变电工",
					["msg"] = "冲击腰带9900 我P了",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641728502,
					["from"] = "特变电工",
					["msg"] = "太贵",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641728509,
					["from"] = "审判",
					["msg"] = "过万正常啊。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641728517,
					["from"] = "特变电工",
					["msg"] = "不正常",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641728528,
					["from"] = "审判",
					["msg"] = "有1W8买的。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1642001353,
					["from"] = "特变电工",
					["msg"] = "跟我战场起飞",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1642001358,
					["from"] = "特变电工",
					["msg"] = "我太强",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1642001361,
					["from"] = "审判",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1642001363,
					["from"] = "特变电工",
					["msg"] = "每场都是第一",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1642001370,
					["from"] = "特变电工",
					["msg"] = "带你起飞",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1642001381,
					["from"] = "审判",
					["msg"] = "你是40人排队啊？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1642001393,
					["from"] = "特变电工",
					["msg"] = "不是",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1642001395,
					["from"] = "特变电工",
					["msg"] = "单排",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1642001406,
					["from"] = "审判",
					["msg"] = "我刷声望。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1642001426,
					["from"] = "特变电工",
					["msg"] = "PVP好玩",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1642001454,
					["from"] = "特变电工",
					["msg"] = "阿拉希 战歌都打",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1642001460,
					["from"] = "审判",
					["msg"] = "我刷奥山。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [39]
				["info"] = {
				},
			},
			["爱吃鱼的猫"] = {
				{
					["type"] = 1,
					["time"] = 1641016915,
					["from"] = "特变电工",
					["msg"] = "换位面？",
					["inbound"] = false,
					["convo"] = "爱吃鱼的猫",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641016919,
					["from"] = "爱吃鱼的猫",
					["msg"] = "嗯 别急我组你",
					["inbound"] = true,
					["convo"] = "爱吃鱼的猫",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641019436,
					["from"] = "爱吃鱼的猫",
					["msg"] = "与[特变电工]交易成功。 (收到)50g",
					["inbound"] = true,
					["convo"] = "爱吃鱼的猫",
				}, -- [3]
				["info"] = {
				},
			},
			["别惹我"] = {
				{
					["type"] = 1,
					["time"] = 1640954743,
					["from"] = "特变电工",
					["msg"] = "次级体质多少钱",
					["inbound"] = false,
					["convo"] = "别惹我",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640954751,
					["from"] = "别惹我",
					["msg"] = "90",
					["inbound"] = true,
					["convo"] = "别惹我",
				}, -- [2]
				["info"] = {
				},
			},
			["幽雅"] = {
				{
					["type"] = 1,
					["time"] = 1640949803,
					["from"] = "幽雅",
					["msg"] = "哪",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640949824,
					["from"] = "特变电工",
					["msg"] = "奥山",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640949835,
					["from"] = "特变电工",
					["msg"] = "你来铁炉堡",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640949837,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640949839,
					["from"] = "幽雅",
					["msg"] = "。。暴风",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640949845,
					["from"] = "幽雅",
					["msg"] = "我从铁过去 暴风鲁甸",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640949847,
					["from"] = "特变电工",
					["msg"] = "铁路等你起飞",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640949854,
					["from"] = "特变电工",
					["msg"] = "我在铁炉堡排的",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640949865,
					["from"] = "特变电工",
					["msg"] = "你来 我AFK出来",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640949874,
					["from"] = "特变电工",
					["msg"] = "坑了",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640949875,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640949965,
					["from"] = "幽雅",
					["msg"] = "我找到了个大哥开门",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640949972,
					["from"] = "幽雅",
					["msg"] = "大哥一个传送 自己去铁炉堡了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640949974,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640949975,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640950008,
					["from"] = "幽雅",
					["msg"] = "我到了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640950170,
					["from"] = "特变电工",
					["msg"] = "你们黑上不开了吗",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640950171,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [18]
				["info"] = {
				},
			},
			["天元邓刚"] = {
				{
					["type"] = 1,
					["time"] = 1641640948,
					["from"] = "特变电工",
					["msg"] = "一人守一个吧",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641640954,
					["from"] = "特变电工",
					["msg"] = "你北塔",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641640955,
					["from"] = "天元邓刚",
					["msg"] = "不用 ",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641640961,
					["from"] = "天元邓刚",
					["msg"] = "早晚得别开",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641640964,
					["from"] = "天元邓刚",
					["msg"] = "就杀人",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641640997,
					["from"] = "特变电工",
					["msg"] = "他们进不来了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641641215,
					["from"] = "天元邓刚",
					["msg"] = "战斗贼。",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641641426,
					["from"] = "天元邓刚",
					["msg"] = "人多了 守旗子吧",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641641437,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641641480,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641641485,
					["from"] = "特变电工",
					["msg"] = "挡了这么久",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641641494,
					["from"] = "特变电工",
					["msg"] = "前面太慢",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641641516,
					["from"] = "特变电工",
					["msg"] = "毛",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641641519,
					["from"] = "特变电工",
					["msg"] = "雷矛",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641641660,
					["from"] = "特变电工",
					["msg"] = "爽",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641641668,
					["from"] = "特变电工",
					["msg"] = "8杀",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641641670,
					["from"] = "天元邓刚",
					["msg"] = "哈哈 ",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641641680,
					["from"] = "特变电工",
					["msg"] = "墓地",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641641685,
					["from"] = "特变电工",
					["msg"] = "杀复活的",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641641689,
					["from"] = "天元邓刚",
					["msg"] = "来不及了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641641779,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641641780,
					["from"] = "特变电工",
					["msg"] = "一群",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641641788,
					["from"] = "特变电工",
					["msg"] = "我还吃了有限无敌",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641641816,
					["from"] = "天元邓刚",
					["msg"] = "复活的太多了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641641967,
					["from"] = "特变电工",
					["msg"] = "我刚才1V3",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641641974,
					["from"] = "特变电工",
					["msg"] = "战贼猎",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641641978,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641641979,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641642012,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641642031,
					["from"] = "特变电工",
					["msg"] = "刚才1V23",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641642034,
					["from"] = "特变电工",
					["msg"] = "1V3",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641642036,
					["from"] = "特变电工",
					["msg"] = "在直播",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641642042,
					["from"] = "特变电工",
					["msg"] = "我朋友都惊呆了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641642063,
					["from"] = "天元邓刚",
					["msg"] = "等会啊，我去帮朋友做个头盔",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641642066,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641642066,
					["from"] = "天元邓刚",
					["msg"] = "1分钟",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641642069,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641642092,
					["from"] = "天元邓刚",
					["msg"] = "不是一个位面",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641642166,
					["from"] = "天元邓刚",
					["msg"] = "1111",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641642179,
					["from"] = "特变电工",
					["msg"] = "能拍到码",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641642532,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641642535,
					["from"] = "特变电工",
					["msg"] = "单聊",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641642539,
					["from"] = "特变电工",
					["msg"] = "很多人看不惯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641642544,
					["from"] = "特变电工",
					["msg"] = "我们这种单齿垢",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641642549,
					["from"] = "天元邓刚",
					["msg"] = "对",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641642558,
					["from"] = "特变电工",
					["msg"] = "我们骑士就喜欢杀人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641642578,
					["from"] = "天元邓刚",
					["msg"] = "我的意思 中场太容易 造坑了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641642604,
					["from"] = "特变电工",
					["msg"] = "不会",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641642606,
					["from"] = "特变电工",
					["msg"] = "杀几个人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641642609,
					["from"] = "特变电工",
					["msg"] = "后回家",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641642618,
					["from"] = "特变电工",
					["msg"] = "被杀的人也不会防守",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641642670,
					["from"] = "特变电工",
					["msg"] = "塔",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641642855,
					["from"] = "特变电工",
					["msg"] = "回不去了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641642858,
					["from"] = "天元邓刚",
					["msg"] = "守的太明显了。",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641642866,
					["from"] = "天元邓刚",
					["msg"] = "去前线狗洞",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641642887,
					["from"] = "天元邓刚",
					["msg"] = "来了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641642934,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641642938,
					["from"] = "特变电工",
					["msg"] = "雷矛墓地",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641643141,
					["from"] = "天元邓刚",
					["msg"] = "去石路",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641643143,
					["from"] = "天元邓刚",
					["msg"] = "拦路",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641643529,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641643553,
					["from"] = "特变电工",
					["msg"] = "我在台服风暴毒蛇",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641643564,
					["from"] = "天元邓刚",
					["msg"] = "牛",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641643966,
					["from"] = "特变电工",
					["msg"] = "看你去单杀 我要去跟大团了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641643990,
					["from"] = "天元邓刚",
					["msg"] = "恩 ，挂机啊，我就最后 去杀他们LR",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641644018,
					["from"] = "天元邓刚",
					["msg"] = "不能让他们拉走将领 强杀将军",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641644024,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641644066,
					["from"] = "特变电工",
					["msg"] = "直接變繁體字",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641644067,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641644077,
					["from"] = "特变电工",
					["msg"] = "一個月2張月卡",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641644088,
					["from"] = "特变电工",
					["msg"] = "血虧",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641644098,
					["from"] = "特变电工",
					["msg"] = "臺服他們賽季服沒人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641644112,
					["from"] = "特变电工",
					["msg"] = "開服的時候最高在綫100人 聯盟",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641644116,
					["from"] = "特变电工",
					["msg"] = "部落10人",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641644126,
					["from"] = "特变电工",
					["msg"] = "慘烈",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641644140,
					["from"] = "天元邓刚",
					["msg"] = "排骨人少",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641644145,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641644148,
					["from"] = "特变电工",
					["msg"] = "體驗很好",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641644161,
					["from"] = "特变电工",
					["msg"] = "文明 禮貌 有愛",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641644175,
					["from"] = "特变电工",
					["msg"] = "進組 安安 退組感恩 ",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641644182,
					["from"] = "天元邓刚",
					["msg"] = "...",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641644195,
					["from"] = "天元邓刚",
					["msg"] = "做任务 都排队拿任务物品啊",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641644198,
					["from"] = "特变电工",
					["msg"] = "野外練級都會幫上BUFF",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641644652,
					["from"] = "天元邓刚",
					["msg"] = "要坑。。BL前线全死回家了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641644663,
					["from"] = "特变电工",
					["msg"] = "無所謂了",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641645078,
					["from"] = "天元邓刚",
					["msg"] = "出场了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641646522,
					["from"] = "天元邓刚",
					["msg"] = "出了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641646554,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641646972,
					["from"] = "天元邓刚",
					["msg"] = "打完这场 我歇了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641646982,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641646984,
					["from"] = "特变电工",
					["msg"] = "好的",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641647000,
					["from"] = "天元邓刚",
					["msg"] = "你要冲个大元帅？",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641647063,
					["from"] = "特变电工",
					["msg"] = "不",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641647066,
					["from"] = "特变电工",
					["msg"] = "10",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641647078,
					["from"] = "特变电工",
					["msg"] = "我等T2.5",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641647081,
					["from"] = "天元邓刚",
					["msg"] = "我现在9了 冲不动了",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641647086,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641647106,
					["from"] = "天元邓刚",
					["msg"] = "冲10 一周至少50个小时打战场",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641647134,
					["from"] = "天元邓刚",
					["msg"] = "我上周45万 刚吃到16000的线",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641647150,
					["from"] = "特变电工",
					["msg"] = "。。。",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641647175,
					["from"] = "天元邓刚",
					["msg"] = "衰减15000",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641647186,
					["from"] = "天元邓刚",
					["msg"] = "能磨上去",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641647219,
					["from"] = "特变电工",
					["msg"] = "說好的全民大元帥",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641647231,
					["from"] = "天元邓刚",
					["msg"] = "真的。",
					["inbound"] = true,
					["convo"] = "天元邓刚",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641647243,
					["from"] = "特变电工",
					["msg"] = "10吧",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641647245,
					["from"] = "特变电工",
					["msg"] = "剛好過年",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641647249,
					["from"] = "特变电工",
					["msg"] = "那時候有時間",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641744351,
					["from"] = "特变电工",
					["msg"] = "邓刚",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641744415,
					["from"] = "特变电工",
					["msg"] = "阿刚",
					["inbound"] = false,
					["convo"] = "天元邓刚",
				}, -- [109]
				["info"] = {
				},
			},
			["面包一箩筐"] = {
				{
					["type"] = 1,
					["time"] = 1641045745,
					["from"] = "特变电工",
					["msg"] = "謝謝",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641132281,
					["from"] = "特变电工",
					["msg"] = "1G 面包",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641132302,
					["from"] = "特变电工",
					["msg"] = "谢",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641132308,
					["from"] = "面包一箩筐",
					["msg"] = "客气",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641132317,
					["from"] = "特变电工",
					["msg"] = "上线第一件时间就是找你",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641132321,
					["from"] = "特变电工",
					["msg"] = "每天",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641132326,
					["from"] = "面包一箩筐",
					["msg"] = "啊   哈哈 ",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641132329,
					["from"] = "特变电工",
					["msg"] = "1天1G 一年365G",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641132334,
					["from"] = "面包一箩筐",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641132338,
					["from"] = "特变电工",
					["msg"] = "10年3650G",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641132341,
					["from"] = "面包一箩筐",
					["msg"] = "每天都上线吗",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641132347,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641132362,
					["from"] = "特变电工",
					["msg"] = "你每天啥都不干就搓面包啊",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641132369,
					["from"] = "特变电工",
					["msg"] = "官方NPC",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641132386,
					["from"] = "面包一箩筐",
					["msg"] = "不想刷其他的  挂会机  看看电视",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641132397,
					["from"] = "面包一箩筐",
					["msg"] = "这个多舒服  哈哈",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641132398,
					["from"] = "特变电工",
					["msg"] = "很休闲嘛",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641132413,
					["from"] = "面包一箩筐",
					["msg"] = "要不太累了  ",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132426,
					["from"] = "面包一箩筐",
					["msg"] = "这样卖个十几天  大马就有了",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132429,
					["from"] = "特变电工",
					["msg"] = "你这个能赚回月卡钱么。。",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641132453,
					["from"] = "面包一箩筐",
					["msg"] = "肯定能啊   一个大妈两张月卡",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641132460,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641132464,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641132501,
					["from"] = "面包一箩筐",
					["msg"] = "这样也好  不然好多人上线都没吃喝",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [24]
				["info"] = {
				},
			},
			["神奇灬女侠"] = {
				{
					["type"] = 1,
					["time"] = 1641188929,
					["from"] = "特变电工",
					["msg"] = "彻底起飞了",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641188937,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641188942,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21998:927:::::::60:::::::::|h[英勇护手]|h|r|cffa335ee|Hitem:21995:1887:::::::60:::::::::|h[英勇长靴]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641188943,
					["from"] = "神奇灬女侠",
					["msg"] = "哇",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641188952,
					["from"] = "特变电工",
					["msg"] = "PVP一霸",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641188969,
					["from"] = "神奇灬女侠",
					["msg"] = "你这收获不少呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641188975,
					["from"] = "特变电工",
					["msg"] = "对了 你们损失了一名大将。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641188982,
					["from"] = "特变电工",
					["msg"] = "我MC黑龙每次都是第一",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641188987,
					["from"] = "特变电工",
					["msg"] = "暴力DPS",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641188992,
					["from"] = "特变电工",
					["msg"] = "很轻松",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641188992,
					["from"] = "神奇灬女侠",
					["msg"] = "..  ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641188993,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641189003,
					["from"] = "特变电工",
					["msg"] = "不用吹灰之力",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641189005,
					["from"] = "神奇灬女侠",
					["msg"] = "我也退会了 换了个会",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641189008,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641189019,
					["from"] = "神奇灬女侠",
					["msg"] = "你们走了之后 没人聊天了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641189023,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641189030,
					["from"] = "神奇灬女侠",
					["msg"] = "团也打不起  ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641189162,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641189176,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641189177,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠正在与普通 - 指挥官沃恩交战，（当前98%，5/5存活）",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641189191,
					["from"] = "神奇灬女侠",
					["msg"] = "多少G买的",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641189207,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠已在普通 - 指挥官沃恩的战斗中取得胜利！",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641189210,
					["from"] = "特变电工",
					["msg"] = "1700",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641189359,
					["from"] = "神奇灬女侠",
					["msg"] = "大佬V5",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641189368,
					["from"] = "特变电工",
					["msg"] = "便宜啊",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641189372,
					["from"] = "特变电工",
					["msg"] = "可以用到NAXX",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641189418,
					["from"] = "神奇灬女侠",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641189437,
					["from"] = "特变电工",
					["msg"] = "2顿中午饭。。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641189500,
					["from"] = "神奇灬女侠",
					["msg"] = "对 有时候要等好久  碰到别错过",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641189837,
					["from"] = "特变电工",
					["msg"] = "主要是PVP也用",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641191441,
					["from"] = "特变电工",
					["msg"] = "除了法师 暗牧 其他职业看到我都要叫我爸爸",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641191443,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641191457,
					["from"] = "特变电工",
					["msg"] = "一个砍2个",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641191463,
					["from"] = "神奇灬女侠",
					["msg"] = ".. ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641191463,
					["from"] = "特变电工",
					["msg"] = "起飞起飞",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641191471,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641191477,
					["from"] = "特变电工",
					["msg"] = "我现在还是双持",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641191484,
					["from"] = "特变电工",
					["msg"] = "还没有单手武器",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641191486,
					["from"] = "特变电工",
					["msg"] = "双手武器",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641191500,
					["from"] = "特变电工",
					["msg"] = "那个削骨或者AL",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641191512,
					["from"] = "神奇灬女侠",
					["msg"] = "AL好",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641191514,
					["from"] = "特变电工",
					["msg"] = "直接垂直立体原地爆炸螺旋起飞",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641191516,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641191523,
					["from"] = "特变电工",
					["msg"] = "这个版本应该便宜",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641191529,
					["from"] = "神奇灬女侠",
					["msg"] = "静待BWL",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641191534,
					["from"] = "特变电工",
					["msg"] = "去BWL都是PVE玩家",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641191544,
					["from"] = "特变电工",
					["msg"] = "拿那个除了装逼没啥用",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641191562,
					["from"] = "特变电工",
					["msg"] = "AL 1WG我都要拿下来",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641191562,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠正在与普通 - 军需官兹格雷斯交战，（当前93%，5/5存活）",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641191575,
					["from"] = "神奇灬女侠",
					["msg"] = "应该要不了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641191581,
					["from"] = "特变电工",
					["msg"] = "最多2千",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641191583,
					["from"] = "特变电工",
					["msg"] = "你信不",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641191586,
					["from"] = "神奇灬女侠",
					["msg"] = "现在装备都不贵",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641191590,
					["from"] = "神奇灬女侠",
					["msg"] = "我信",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641191590,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠已在普通 - 军需官兹格雷斯的战斗中取得胜利！",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641308715,
					["from"] = "特变电工",
					["msg"] = "对了",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641308716,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641308723,
					["from"] = "特变电工",
					["msg"] = "来跟我奥山2人小分队啊",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641308737,
					["from"] = "神奇灬女侠",
					["msg"] = "大哥想打奥山？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641308747,
					["from"] = "特变电工",
					["msg"] = "昨天包养了一个骑士",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641308757,
					["from"] = "特变电工",
					["msg"] = "2个人守南塔杀了13个人",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641308767,
					["from"] = "特变电工",
					["msg"] = "然后直接变坑场",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641308768,
					["from"] = "神奇灬女侠",
					["msg"] = "强呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641308780,
					["from"] = "特变电工",
					["msg"] = "来暴风城",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641308791,
					["from"] = "特变电工",
					["msg"] = "龙头要来了",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641308796,
					["from"] = "特变电工",
					["msg"] = "[[60] 联盟的胜利 (7495)]",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641308816,
					["from"] = "神奇灬女侠",
					["msg"] = "太远了  BUFF不要了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641308832,
					["from"] = "特变电工",
					["msg"] = "1500",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641308835,
					["from"] = "特变电工",
					["msg"] = "刚买的",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641308846,
					["from"] = "神奇灬女侠",
					["msg"] = "龙头就1000吧",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641308855,
					["from"] = "特变电工",
					["msg"] = "哪有",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641308858,
					["from"] = "特变电工",
					["msg"] = "每次都到1500",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641308863,
					["from"] = "神奇灬女侠",
					["msg"] = "我打的团就是1000",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641308870,
					["from"] = "特变电工",
					["msg"] = "我每次都是1500",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641308877,
					["from"] = "神奇灬女侠",
					["msg"] = "{大笑}.",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641308880,
					["from"] = "特变电工",
					["msg"] = "我今天赔了10万",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641308886,
					["from"] = "特变电工",
					["msg"] = "可以买多少个龙头",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641308893,
					["from"] = "特变电工",
					["msg"] = "500个",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641308897,
					["from"] = "神奇灬女侠",
					["msg"] = "怎么？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641308911,
					["from"] = "特变电工",
					["msg"] = "跌了2.5%",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641308931,
					["from"] = "神奇灬女侠",
					["msg"] = "...",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641308970,
					["from"] = "神奇灬女侠",
					["msg"] = "这到年底了要分红了呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [83]
				["info"] = {
				},
			},
			["德陛"] = {
				{
					["type"] = 1,
					["time"] = 1642096533,
					["from"] = "特变电工",
					["msg"] = "just beat it",
					["inbound"] = false,
					["convo"] = "德陛",
				}, -- [1]
				["info"] = {
				},
			},
			["塞北第一贼"] = {
				{
					["type"] = 1,
					["time"] = 1641824866,
					["from"] = "塞北第一贼",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "塞北第一贼",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641824879,
					["from"] = "特变电工",
					["msg"] = "有排到吗",
					["inbound"] = false,
					["convo"] = "塞北第一贼",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641824882,
					["from"] = "塞北第一贼",
					["msg"] = "you ",
					["inbound"] = true,
					["convo"] = "塞北第一贼",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641825234,
					["from"] = "特变电工",
					["msg"] = "392名才能进R10",
					["inbound"] = false,
					["convo"] = "塞北第一贼",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641825241,
					["from"] = "特变电工",
					["msg"] = "发错",
					["inbound"] = false,
					["convo"] = "塞北第一贼",
				}, -- [5]
				["info"] = {
				},
			},
			["小馋"] = {
				{
					["type"] = 1,
					["time"] = 1641915490,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "小馋",
				}, -- [1]
				["info"] = {
				},
			},
			["命不由天定"] = {
				{
					["type"] = 1,
					["time"] = 1641232178,
					["from"] = "特变电工",
					["msg"] = "加我好友啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641232180,
					["from"] = "特变电工",
					["msg"] = "我加你了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641232182,
					["from"] = "特变电工",
					["msg"] = "以后一起起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641232187,
					["from"] = "命不由天定",
					["msg"] = "加了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641232197,
					["from"] = "特变电工",
					["msg"] = "战骑组合 可以杀7个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641232205,
					["from"] = "特变电工",
					["msg"] = "2V7",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641232210,
					["from"] = "命不由天定",
					["msg"] = "这么厉害呀",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641232212,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641232222,
					["from"] = "特变电工",
					["msg"] = "不要打群架",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641232229,
					["from"] = "特变电工",
					["msg"] = "拦截人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641232233,
					["from"] = "特变电工",
					["msg"] = "独享2人荣誉",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641232238,
					["from"] = "特变电工",
					["msg"] = "不跟大部队",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641232244,
					["from"] = "特变电工",
					["msg"] = "大部队是均摊的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641232261,
					["from"] = "命不由天定",
					["msg"] = "o 哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641232283,
					["from"] = "特变电工",
					["msg"] = "你看这个战士",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641232289,
					["from"] = "特变电工",
					["msg"] = "他是独狼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641232306,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641232350,
					["from"] = "特变电工",
					["msg"] = "我尼玛",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641232353,
					["from"] = "特变电工",
					["msg"] = "全部杀我们2个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641232358,
					["from"] = "特变电工",
					["msg"] = "我以为只会来几个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641232363,
					["from"] = "命不由天定",
					["msg"] = "哈哈恨死咱们了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641232369,
					["from"] = "特变电工",
					["msg"] = "看来引起公愤了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641232371,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641232374,
					["from"] = "特变电工",
					["msg"] = "笑死我了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641232379,
					["from"] = "特变电工",
					["msg"] = "我以为只有4个左右",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641232422,
					["from"] = "特变电工",
					["msg"] = "这把坑了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641232426,
					["from"] = "特变电工",
					["msg"] = "我们有很大责任",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641232430,
					["from"] = "特变电工",
					["msg"] = "杀了太多人回去了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641232432,
					["from"] = "命不由天定",
					["msg"] = "是呀 ",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641232444,
					["from"] = "特变电工",
					["msg"] = "我只想微微的防守",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641232452,
					["from"] = "特变电工",
					["msg"] = "结果没停住",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641232460,
					["from"] = "命不由天定",
					["msg"] = "都杀回去了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641232484,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641232501,
					["from"] = "命不由天定",
					["msg"] = "我拿口吃的",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641232723,
					["from"] = "命不由天定",
					["msg"] = "我回来了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641232769,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641232894,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641232899,
					["from"] = "特变电工",
					["msg"] = "4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641232911,
					["from"] = "特变电工",
					["msg"] = "太多了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641232912,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641232962,
					["from"] = "特变电工",
					["msg"] = "让他们开",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641232998,
					["from"] = "特变电工",
					["msg"] = "我们往前拦截",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641233008,
					["from"] = "特变电工",
					["msg"] = "又能保证荣誉和游戏体验",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641233013,
					["from"] = "特变电工",
					["msg"] = "也能让坑场快点结束",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641233031,
					["from"] = "命不由天定",
					["msg"] = "去哪",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641233036,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641233049,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641233146,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641233151,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641233154,
					["from"] = "特变电工",
					["msg"] = "。。。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641233157,
					["from"] = "特变电工",
					["msg"] = "我本来不想打的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641233163,
					["from"] = "特变电工",
					["msg"] = "我看别人被欺负了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641233312,
					["from"] = "特变电工",
					["msg"] = "等他们墓地好",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641233334,
					["from"] = "特变电工",
					["msg"] = "然后他们大部队就在雷矛了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641233339,
					["from"] = "特变电工",
					["msg"] = "然后我们",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641233390,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641233401,
					["from"] = "特变电工",
					["msg"] = "雷矛他们不一定了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641233489,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641233492,
					["from"] = "特变电工",
					["msg"] = "一堆人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641233495,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641233499,
					["from"] = "特变电工",
					["msg"] = "杀了2个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641233502,
					["from"] = "特变电工",
					["msg"] = "够本",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641233504,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641233698,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641233705,
					["from"] = "特变电工",
					["msg"] = "你ADD到了^&*!OSS",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641233713,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641233806,
					["from"] = "特变电工",
					["msg"] = "你可以给我上牺牲",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641233824,
					["from"] = "命不由天定",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641233830,
					["from"] = "特变电工",
					["msg"] = "我北洋",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641233840,
					["from"] = "特变电工",
					["msg"] = "你北洋",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641233892,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641233896,
					["from"] = "特变电工",
					["msg"] = "这么多NPC",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641233898,
					["from"] = "命不由天定",
					["msg"] = "你拉太多了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641233902,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641234239,
					["from"] = "命不由天定",
					["msg"] = "u不开越来越多",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641234241,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641234245,
					["from"] = "特变电工",
					["msg"] = "怎么回来这么多的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641234246,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641234262,
					["from"] = "特变电工",
					["msg"] = "就是在这里坑杀他们",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641234271,
					["from"] = "特变电工",
					["msg"] = "2个坑4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641234278,
					["from"] = "特变电工",
					["msg"] = "结果莫名其妙来了一群人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641234293,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641234295,
					["from"] = "特变电工",
					["msg"] = "杀了4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641234300,
					["from"] = "特变电工",
					["msg"] = "够本",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641234430,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641234432,
					["from"] = "特变电工",
					["msg"] = "我知道了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641234449,
					["from"] = "特变电工",
					["msg"] = "他们后面一直在围着这个冰雪大王",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641234455,
					["from"] = "特变电工",
					["msg"] = "但他迟迟不欠",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641234616,
					["from"] = "特变电工",
					["msg"] = "睡觉了 晚安 明天还要上班 有空一起起飞啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641234617,
					["from"] = "特变电工",
					["msg"] = "》。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641234632,
					["from"] = "命不由天定",
					["msg"] = "好的 88",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641304200,
					["from"] = "特变电工",
					["msg"] = "等你起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641304208,
					["from"] = "命不由天定",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641304220,
					["from"] = "命不由天定",
					["msg"] = "你是？",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641304238,
					["from"] = "特变电工",
					["msg"] = "凌晨一起驰骋奥山。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641316686,
					["from"] = "命不由天定",
					["msg"] = "不好意思哈   我朋友玩我号去打工 去了   他不会玩战场 我听他说了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641316693,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641316694,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641316713,
					["from"] = "特变电工",
					["msg"] = "等我起飞啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641316715,
					["from"] = "特变电工",
					["msg"] = "马上出来",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641316741,
					["from"] = "命不由天定",
					["msg"] = "哈哈 好",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641316776,
					["from"] = "特变电工",
					["msg"] = "进组",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641316791,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641316801,
					["from"] = "特变电工",
					["msg"] = "|cff1eff00|Hitem:17901::::::::60:::::::::|h[3级雷矛勋章]|h|r你又这个没",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641316809,
					["from"] = "命不由天定",
					["msg"] = "我好像没有",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641316813,
					["from"] = "特变电工",
					["msg"] = "没做任务把",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641316837,
					["from"] = "特变电工",
					["msg"] = "黑市上",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641316842,
					["from"] = "特变电工",
					["msg"] = "黑石塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641316845,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1641316858,
					["from"] = "命不由天定",
					["msg"] = "嗯 ",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1641316871,
					["from"] = "特变电工",
					["msg"] = "排队时间可以去黑石塔砍人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1641316871,
					["from"] = "命不由天定",
					["msg"] = "黑石塔有人吗",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1641316878,
					["from"] = "特变电工",
					["msg"] = "又",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1641316901,
					["from"] = "特变电工",
					["msg"] = "飞灼热",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1641316929,
					["from"] = "特变电工",
					["msg"] = "下一把吧好像来不及了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1641316946,
					["from"] = "特变电工",
					["msg"] = "我带几个有限无敌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1641316985,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1641317158,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1641317163,
					["from"] = "命不由天定",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1641317223,
					["from"] = "特变电工",
					["msg"] = "死了南塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1641317224,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1641317229,
					["from"] = "特变电工",
					["msg"] = "你没徽章",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1641317238,
					["from"] = "特变电工",
					["msg"] = "有徽章我们去中场",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1641317246,
					["from"] = "特变电工",
					["msg"] = "来了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1641317284,
					["from"] = "特变电工",
					["msg"] = "擦了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1641317302,
					["from"] = "特变电工",
					["msg"] = "那个术士喝有限无敌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1641317309,
					["from"] = "命不由天定",
					["msg"] = "哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1641317346,
					["from"] = "特变电工",
					["msg"] = "复活啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1641317372,
					["from"] = "命不由天定",
					["msg"] = "o ",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1641317412,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1641317417,
					["from"] = "特变电工",
					["msg"] = "北塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1641317636,
					["from"] = "特变电工",
					["msg"] = "全是有限无敌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1641317639,
					["from"] = "特变电工",
					["msg"] = "国家队啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1641317640,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1641317642,
					["from"] = "特变电工",
					["msg"] = "我醉了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1641317643,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1641317913,
					["from"] = "命不由天定",
					["msg"] = "在哪了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1641317920,
					["from"] = "特变电工",
					["msg"] = "你看地图",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [138]
				{
					["type"] = 1,
					["time"] = 1641317941,
					["from"] = "特变电工",
					["msg"] = "星星",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [139]
				{
					["type"] = 1,
					["time"] = 1641317958,
					["from"] = "特变电工",
					["msg"] = "出",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [140]
				{
					["type"] = 1,
					["time"] = 1641317965,
					["from"] = "特变电工",
					["msg"] = "走 黑石塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [141]
				{
					["type"] = 1,
					["time"] = 1641317971,
					["from"] = "特变电工",
					["msg"] = "对面太强了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [142]
				{
					["type"] = 1,
					["time"] = 1641317975,
					["from"] = "特变电工",
					["msg"] = "全是吃药的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [143]
				{
					["type"] = 1,
					["time"] = 1641317991,
					["from"] = "命不由天定",
					["msg"] = "哈哈 好快一场",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [144]
				{
					["type"] = 1,
					["time"] = 1641318922,
					["from"] = "命不由天定",
					["msg"] = "最后一场我下了哈 改天玩",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [145]
				{
					["type"] = 1,
					["time"] = 1641318926,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [146]
				{
					["type"] = 1,
					["time"] = 1641318929,
					["from"] = "特变电工",
					["msg"] = "我也睡了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [147]
				{
					["type"] = 1,
					["time"] = 1641319048,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [148]
				{
					["type"] = 1,
					["time"] = 1641319053,
					["from"] = "命不由天定",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [149]
				{
					["type"] = 1,
					["time"] = 1641319055,
					["from"] = "特变电工",
					["msg"] = "我就不信不能起飞了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [150]
				{
					["type"] = 1,
					["time"] = 1641319064,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [151]
				{
					["type"] = 1,
					["time"] = 1641319110,
					["from"] = "特变电工",
					["msg"] = "上来",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [152]
				{
					["type"] = 1,
					["time"] = 1641319201,
					["from"] = "特变电工",
					["msg"] = "擦 ",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [153]
				{
					["type"] = 1,
					["time"] = 1641319203,
					["from"] = "特变电工",
					["msg"] = "3个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [154]
				{
					["type"] = 1,
					["time"] = 1641319204,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [155]
				{
					["type"] = 1,
					["time"] = 1641319218,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [156]
				{
					["type"] = 1,
					["time"] = 1641319263,
					["from"] = "特变电工",
					["msg"] = "拦截人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [157]
				{
					["type"] = 1,
					["time"] = 1641319345,
					["from"] = "特变电工",
					["msg"] = "死",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [158]
				{
					["type"] = 1,
					["time"] = 1641319347,
					["from"] = "特变电工",
					["msg"] = "复活",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [159]
				{
					["type"] = 1,
					["time"] = 1641319375,
					["from"] = "命不由天定",
					["msg"] = "我没有章",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [160]
				{
					["type"] = 1,
					["time"] = 1641319378,
					["from"] = "命不由天定",
					["msg"] = "被控制",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [161]
				{
					["type"] = 1,
					["time"] = 1641319800,
					["from"] = "特变电工",
					["msg"] = "睡觉前挖一个坑",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [162]
				{
					["type"] = 1,
					["time"] = 1641319800,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [163]
				{
					["type"] = 1,
					["time"] = 1641319802,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [164]
				{
					["type"] = 1,
					["time"] = 1641319804,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [165]
				{
					["type"] = 1,
					["time"] = 1641319818,
					["from"] = "命不由天定",
					["msg"] = "每次跟你都是坑",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [166]
				{
					["type"] = 1,
					["time"] = 1641319828,
					["from"] = "特变电工",
					["msg"] = "挖坑王",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [167]
				{
					["type"] = 1,
					["time"] = 1641319837,
					["from"] = "特变电工",
					["msg"] = "这群B部落确实讨厌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [168]
				{
					["type"] = 1,
					["time"] = 1641319842,
					["from"] = "命不由天定",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [169]
				{
					["type"] = 1,
					["time"] = 1641319965,
					["from"] = "命不由天定",
					["msg"] = "复活15人没有我 哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [170]
				{
					["type"] = 1,
					["time"] = 1641320079,
					["from"] = "命不由天定",
					["msg"] = "下了 你瞬间融化了哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [171]
				{
					["type"] = 1,
					["time"] = 1641320082,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [172]
				{
					["type"] = 1,
					["time"] = 1641320083,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [173]
				{
					["type"] = 1,
					["time"] = 1641320086,
					["from"] = "特变电工",
					["msg"] = "晚安",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [174]
				{
					["type"] = 1,
					["time"] = 1641387225,
					["from"] = "特变电工",
					["msg"] = "要一起起飞吗",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [175]
				{
					["type"] = 1,
					["time"] = 1641394866,
					["from"] = "特变电工",
					["msg"] = "起飞吗",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [176]
				{
					["type"] = 1,
					["time"] = 1641394913,
					["from"] = "命不由天定",
					["msg"] = "不是本人，{龇牙}",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [177]
				{
					["type"] = 1,
					["time"] = 1641403756,
					["from"] = "命不由天定",
					["msg"] = "我来了哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [178]
				{
					["type"] = 1,
					["time"] = 1641403759,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [179]
				{
					["type"] = 1,
					["time"] = 1641403763,
					["from"] = "特变电工",
					["msg"] = "已经开始了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [180]
				{
					["type"] = 1,
					["time"] = 1641403773,
					["from"] = "特变电工",
					["msg"] = "最后一把睡觉了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [181]
				{
					["type"] = 1,
					["time"] = 1641403784,
					["from"] = "命不由天定",
					["msg"] = "嗯嗯 我到2点睡哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [182]
				{
					["type"] = 1,
					["time"] = 1641487203,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [183]
				{
					["type"] = 1,
					["time"] = 1641487208,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [184]
				{
					["type"] = 1,
					["time"] = 1641487469,
					["from"] = "命不由天定",
					["msg"] = "有BL守",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [185]
				{
					["type"] = 1,
					["time"] = 1641487526,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [186]
				{
					["type"] = 1,
					["time"] = 1641487627,
					["from"] = "特变电工",
					["msg"] = "我在南塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [187]
				{
					["type"] = 1,
					["time"] = 1641487629,
					["from"] = "特变电工",
					["msg"] = "你没看见。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [188]
				{
					["type"] = 1,
					["time"] = 1641487646,
					["from"] = "命不由天定",
					["msg"] = "死了，过不去有BL",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [189]
				{
					["type"] = 1,
					["time"] = 1642090842,
					["from"] = "命不由天定",
					["msg"] = "怎么又打战歌了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [190]
				{
					["type"] = 1,
					["time"] = 1642090847,
					["from"] = "特变电工",
					["msg"] = "好玩",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [191]
				{
					["type"] = 1,
					["time"] = 1642090851,
					["from"] = "特变电工",
					["msg"] = "奥山不好玩",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [192]
				{
					["type"] = 1,
					["time"] = 1642091132,
					["from"] = "特变电工",
					["msg"] = "我是真的强",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [193]
				{
					["type"] = 1,
					["time"] = 1642091141,
					["from"] = "特变电工",
					["msg"] = "场场COVER全场",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [194]
				{
					["type"] = 1,
					["time"] = 1642091149,
					["from"] = "命不由天定",
					["msg"] = "厉害",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [195]
				["info"] = {
				},
			},
			["牧马人"] = {
				{
					["type"] = 1,
					["time"] = 1641097810,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "牧马人",
				}, -- [1]
				["info"] = {
				},
			},
			["芜湖小司马"] = {
				{
					["type"] = 1,
					["time"] = 1641100999,
					["from"] = "特变电工",
					["msg"] = "做一个宏单独密",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641101004,
					["from"] = "芜湖小司马",
					["msg"] = "M谁啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641101008,
					["from"] = "特变电工",
					["msg"] = "只有3个骑士 我们是小拯救",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641101009,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641101013,
					["from"] = "特变电工",
					["msg"] = "|cfff48cba有内鬼啊|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641101018,
					["from"] = "特变电工",
					["msg"] = "3队骑士",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641101028,
					["from"] = "芜湖小司马",
					["msg"] = "哦了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641108908,
					["from"] = "芜湖小司马",
					["msg"] = "近战不打吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641108997,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641720936,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641720943,
					["from"] = "特变电工",
					["msg"] = "你的泰坦怎么还有2消失",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641720954,
					["from"] = "特变电工",
					["msg"] = "点错了？",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641723341,
					["from"] = "芜湖小司马",
					["msg"] = "什么？",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641723358,
					["from"] = "芜湖小司马",
					["msg"] = "刚才 MC你没吃第二瓶泰坦啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641723373,
					["from"] = "特变电工",
					["msg"] = "吃了啊",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641723380,
					["from"] = "特变电工",
					["msg"] = "我还剩1分钟",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641723381,
					["from"] = "特变电工",
					["msg"] = "现在",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641723387,
					["from"] = "芜湖小司马",
					["msg"] = "我也1分钟啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641723391,
					["from"] = "芜湖小司马",
					["msg"] = "一样  哈哈",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641723393,
					["from"] = "特变电工",
					["msg"] = "那就是插件BUG",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641723429,
					["from"] = "芜湖小司马",
					["msg"] = "下了 吃饭去 ",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641723443,
					["from"] = "特变电工",
					["msg"] = "嗯嗯 ",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [22]
				["info"] = {
				},
			},
			["森类滴话"] = {
				{
					["type"] = 1,
					["time"] = 1641015736,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "森类滴话",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641015752,
					["from"] = "特变电工",
					["msg"] = "公爵",
					["inbound"] = false,
					["convo"] = "森类滴话",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641015785,
					["from"] = "森类滴话",
					["msg"] = "<大脚团队提示>欢迎加入本团队，希望我们合作愉快，拥有一次快乐的冒险旅程。",
					["inbound"] = true,
					["convo"] = "森类滴话",
				}, -- [3]
				["info"] = {
				},
			},
			["小养由基"] = {
				{
					["type"] = 1,
					["time"] = 1640880956,
					["from"] = "特变电工",
					["msg"] = "[附魔靴子 - 强效敏捷]代工多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640880976,
					["from"] = "小养由基",
					["msg"] = "4",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640880989,
					["from"] = "特变电工",
					["msg"] = "4G么",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640880996,
					["from"] = "小养由基",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640881006,
					["from"] = "特变电工",
					["msg"] = "组我哈",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640881024,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易取消: 对方取消了交易。",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640881035,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。 (收到)4g,|cff1eff00|Hitem:16203::::::::60:::::::::|h[强效不灭精华]|h|rx8",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640881043,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。(交出)附魔靴子 - 强效敏捷",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640881047,
					["from"] = "小养由基",
					["msg"] = "好了",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640881049,
					["from"] = "特变电工",
					["msg"] = "谢谢",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640881801,
					["from"] = "特变电工",
					["msg"] = "披风3敏捷多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640881846,
					["from"] = "小养由基",
					["msg"] = "8",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640881851,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640881868,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。(交出)附魔披风 - 次级敏捷 (收到)8g",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640881889,
					["from"] = "特变电工",
					["msg"] = "手15敏多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640881974,
					["from"] = "小养由基",
					["msg"] = "手有151敏吗",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640881982,
					["from"] = "特变电工",
					["msg"] = "好像TAQ开放",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640881985,
					["from"] = "小养由基",
					["msg"] = "没有15没的",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [18]
				["info"] = {
				},
			},
			["随便的青枣"] = {
				{
					["type"] = 1,
					["time"] = 1641620146,
					["from"] = "随便的青枣",
					["msg"] = "你在几微米",
					["inbound"] = true,
					["convo"] = "随便的青枣",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641620149,
					["from"] = "随便的青枣",
					["msg"] = "你在几位面",
					["inbound"] = true,
					["convo"] = "随便的青枣",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641620181,
					["from"] = "随便的青枣",
					["msg"] = "发吧 ",
					["inbound"] = true,
					["convo"] = "随便的青枣",
				}, -- [3]
				["info"] = {
				},
			},
			["Whitegods"] = {
				{
					["type"] = 1,
					["time"] = 1641097738,
					["from"] = "特变电工",
					["msg"] = "白天开组了么",
					["inbound"] = false,
					["convo"] = "Whitegods",
				}, -- [1]
				["info"] = {
				},
			},
			["袁阿满"] = {
				{
					["type"] = 1,
					["time"] = 1641060406,
					["from"] = "特变电工",
					["msg"] = "却暴力狂暴战吗",
					["inbound"] = false,
					["convo"] = "袁阿满",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641060450,
					["from"] = "特变电工",
					["msg"] = "不要装备 只做任务",
					["inbound"] = false,
					["convo"] = "袁阿满",
				}, -- [2]
				["info"] = {
				},
			},
			["社区送温暖"] = {
				{
					["type"] = 1,
					["time"] = 1640882285,
					["from"] = "特变电工",
					["msg"] = "亏惨",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640882293,
					["from"] = "特变电工",
					["msg"] = "2周亏60万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640882295,
					["from"] = "特变电工",
					["msg"] = "毫无压力",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640882328,
					["from"] = "社区送温暖",
					["msg"] = "我今天傻了，忘记清光伏了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640882368,
					["from"] = "社区送温暖",
					["msg"] = "睡过头了，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640882390,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640882396,
					["from"] = "特变电工",
					["msg"] = "那应该快起飞了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640882403,
					["from"] = "社区送温暖",
					["msg"] = "感觉有的跌啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640882404,
					["from"] = "特变电工",
					["msg"] = "内心毫无波兰",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640882407,
					["from"] = "特变电工",
					["msg"] = "都不想看",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640882419,
					["from"] = "特变电工",
					["msg"] = "你还好没清",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640882422,
					["from"] = "特变电工",
					["msg"] = "运气是真的好",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640882428,
					["from"] = "特变电工",
					["msg"] = "你看盘后发改委",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640882440,
					["from"] = "特变电工",
					["msg"] = "重新提光伏了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640882465,
					["from"] = "特变电工",
					["msg"] = "快洗完了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640882471,
					["from"] = "社区送温暖",
					["msg"] = "今天都没起来",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640882480,
					["from"] = "特变电工",
					["msg"] = "你坚持不住了 大多数散户也跟你一样了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640882485,
					["from"] = "特变电工",
					["msg"] = "情绪到达了零界点了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640882486,
					["from"] = "社区送温暖",
					["msg"] = "我分众传媒上赚的都贴光伏了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640882490,
					["from"] = "特变电工",
					["msg"] = "随时起飞",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640882508,
					["from"] = "社区送温暖",
					["msg"] = "最近元宇宙太变态了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640882520,
					["from"] = "社区送温暖",
					["msg"] = "这段时间我便宜一倍多",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640882590,
					["from"] = "社区送温暖",
					["msg"] = "那我拿到年30前一个礼拜卖，年后看时机在买回来",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640882605,
					["from"] = "特变电工",
					["msg"] = "我从来不追热点",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640882616,
					["from"] = "特变电工",
					["msg"] = "A股的元宇宙就是垃圾",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640882622,
					["from"] = "特变电工",
					["msg"] = "我只买美股的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640882633,
					["from"] = "社区送温暖",
					["msg"] = "A股都是炒，一样的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640882640,
					["from"] = "社区送温暖",
					["msg"] = "什么基本面都没用",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640882649,
					["from"] = "特变电工",
					["msg"] = "炒注定要亏钱",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640882657,
					["from"] = "特变电工",
					["msg"] = "我要炒 要&*!@#$去美股赌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640882668,
					["from"] = "特变电工",
					["msg"] = "怎么会在A股赌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640882674,
					["from"] = "特变电工",
					["msg"] = "期权赌不香吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640882679,
					["from"] = "特变电工",
					["msg"] = "我一天赚200% 14万美元",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640882682,
					["from"] = "社区送温暖",
					["msg"] = "反正我现在仓位不重，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640882683,
					["from"] = "特变电工",
					["msg"] = "我去打板",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640882737,
					["from"] = "社区送温暖",
					["msg"] = "不过，最近基金还可以，三个月都正收益，虽然不高",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640882762,
					["from"] = "特变电工",
					["msg"] = "明天最后一天",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640882773,
					["from"] = "特变电工",
					["msg"] = "我今年从120% 回撤到70%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640882780,
					["from"] = "特变电工",
					["msg"] = "收益160万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640882783,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640882811,
					["from"] = "社区送温暖",
					["msg"] = "我也准备搞长线了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640882827,
					["from"] = "社区送温暖",
					["msg"] = "短线太考验心态了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640882850,
					["from"] = "社区送温暖",
					["msg"] = "一次错前面几次连班赚的都赔光",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640882867,
					["from"] = "特变电工",
					["msg"] = "短线胜率低于50%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640882875,
					["from"] = "特变电工",
					["msg"] = "短线唯一的做法就是仍骰子",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640882934,
					["from"] = "社区送温暖",
					["msg"] = "还是趴在低位，时间换金钱好",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640883451,
					["from"] = "特变电工",
					["msg"] = "今晚中改可以",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640883483,
					["from"] = "社区送温暖",
					["msg"] = "中概我买了100块快跌了10个点了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640883520,
					["from"] = "社区送温暖",
					["msg"] = "想买的，不知道什么时候买",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640883529,
					["from"] = "社区送温暖",
					["msg"] = "不太敢抄底",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640883570,
					["from"] = "特变电工",
					["msg"] = "你开美股了吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640883580,
					["from"] = "社区送温暖",
					["msg"] = "基金啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1640883583,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1640883670,
					["from"] = "特变电工",
					["msg"] = "开",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1640883843,
					["from"] = "社区送温暖",
					["msg"] = "不弄了，太多更加搞不好了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1640960433,
					["from"] = "社区送温暖",
					["msg"] = "昨天睡过头没卖今天还真的大涨了- -",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1640960822,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1640960826,
					["from"] = "特变电工",
					["msg"] = "韭菜盒子",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1640960830,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1640960845,
					["from"] = "特变电工",
					["msg"] = "我说过了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1640960848,
					["from"] = "特变电工",
					["msg"] = "48",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1640960849,
					["from"] = "社区送温暖",
					["msg"] = "没卖，主要光伏本身就有盈利",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1640960858,
					["from"] = "特变电工",
					["msg"] = "今年结账了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1640960863,
					["from"] = "社区送温暖",
					["msg"] = "之前高的时候有25个点盈利",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1640960864,
					["from"] = "特变电工",
					["msg"] = "收益70%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1640960870,
					["from"] = "特变电工",
					["msg"] = "170万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1640960875,
					["from"] = "特变电工",
					["msg"] = "最高260万 120%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1640960879,
					["from"] = "特变电工",
					["msg"] = "我没卖",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1640960882,
					["from"] = "特变电工",
					["msg"] = "一点也不候会",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1640960885,
					["from"] = "特变电工",
					["msg"] = "后悔",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1640960913,
					["from"] = "社区送温暖",
					["msg"] = "恩，我也准备把周期拉长",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641059581,
					["from"] = "特变电工",
					["msg"] = "你在希利苏斯做T0.5吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641059596,
					["from"] = "社区送温暖",
					["msg"] = "不是，双采。。",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641059601,
					["from"] = "社区送温暖",
					["msg"] = "瞎玩玩",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641059604,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [75]
				["info"] = {
				},
			},
			["常驻力量谷"] = {
				{
					["type"] = 1,
					["time"] = 1641304302,
					["from"] = "特变电工",
					["msg"] = "1",
					["inbound"] = false,
					["convo"] = "常驻力量谷",
				}, -- [1]
				["info"] = {
				},
			},
			["大个一米八六"] = {
				{
					["type"] = 1,
					["time"] = 1641116535,
					["from"] = "特变电工",
					["msg"] = "那个比T打的高一点的法师要分金吗",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641702731,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641703634,
					["from"] = "特变电工",
					["msg"] = "2队近战需要一个光环猎人",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641718032,
					["from"] = "特变电工",
					["msg"] = "卖我点",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [4]
				["info"] = {
				},
			},
			["一葉知秋"] = {
				{
					["type"] = 1,
					["time"] = 1640948924,
					["from"] = "特变电工",
					["msg"] = "7力量多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640948939,
					["from"] = "特变电工",
					["msg"] = "手7力量多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640948954,
					["from"] = "一葉知秋",
					["msg"] = " 7力24G ",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640948958,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640948993,
					["from"] = "一葉知秋",
					["msg"] = "与[特变电工]交易成功。(交出)附魔手套 - 强效力量 (收到)24g",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640949044,
					["from"] = "特变电工",
					["msg"] = "附魔护腕 - 超强耐力多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640949068,
					["from"] = "一葉知秋",
					["msg"] = "9耐9G",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640949084,
					["from"] = "一葉知秋",
					["msg"] = "与[特变电工]交易成功。(交出)附魔护腕 - 超强耐力 (收到)9g",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640949094,
					["from"] = "一葉知秋",
					["msg"] = "没事",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [9]
				["info"] = {
				},
			},
			["子木子也"] = {
				{
					["type"] = 1,
					["time"] = 1641718847,
					["from"] = "子木子也",
					["msg"] = "老哥 才冲击多少啊",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641718854,
					["from"] = "特变电工",
					["msg"] = "9900",
					["inbound"] = false,
					["convo"] = "子木子也",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641718869,
					["from"] = "子木子也",
					["msg"] = "叶子呢",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641718874,
					["from"] = "子木子也",
					["msg"] = "我参考下价格- - ",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641718876,
					["from"] = "特变电工",
					["msg"] = "3000",
					["inbound"] = false,
					["convo"] = "子木子也",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641718880,
					["from"] = "子木子也",
					["msg"] = "谢谢",
					["inbound"] = true,
					["convo"] = "子木子也",
				}, -- [6]
				["info"] = {
				},
			},
			["古月"] = {
				{
					["type"] = 1,
					["time"] = 1641827485,
					["from"] = "特变电工",
					["msg"] = "第二午夜团是周几几点",
					["inbound"] = false,
					["convo"] = "古月",
				}, -- [1]
				["info"] = {
				},
			},
			["卡卡汐"] = {
				{
					["type"] = 1,
					["time"] = 1640882204,
					["from"] = "特变电工",
					["msg"] = "我彻底毕业了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640882207,
					["from"] = "特变电工",
					["msg"] = "大兄弟",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640882215,
					["from"] = "特变电工",
					["msg"] = "我MC黑龙打第一",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640882218,
					["from"] = "特变电工",
					["msg"] = "你敢信",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640882226,
					["from"] = "特变电工",
					["msg"] = "很轻松",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640882231,
					["from"] = "特变电工",
					["msg"] = "不用吹灰之力",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640882250,
					["from"] = "特变电工",
					["msg"] = "你要为你认识练级期间认识我这样的朋友而感到自豪",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640882251,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640882254,
					["from"] = "特变电工",
					["msg"] = "确实日白",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640882266,
					["from"] = "卡卡汐",
					["msg"] = "DPS我经常第一 ",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640882271,
					["from"] = "特变电工",
					["msg"] = "你打不过我",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640882277,
					["from"] = "卡卡汐",
					["msg"] = "恭喜你了",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640882287,
					["from"] = "卡卡汐",
					["msg"] = "打了多少伤害",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640882299,
					["from"] = "特变电工",
					["msg"] = "忘记了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640882326,
					["from"] = "卡卡汐",
					["msg"] = "黑龙你怎么打的第一？",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640882348,
					["from"] = "特变电工",
					["msg"] = "很简单啊",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640882350,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640882356,
					["from"] = "特变电工",
					["msg"] = "黑龙比MC简单",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640882365,
					["from"] = "特变电工",
					["msg"] = "地上有精英龙啊",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640882373,
					["from"] = "特变电工",
					["msg"] = "还是2只拉一起",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640882380,
					["from"] = "特变电工",
					["msg"] = "一顿A",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641216295,
					["from"] = "特变电工",
					["msg"] = "我已经起飞了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [22]
				["info"] = {
				},
			},
			["蒙塔基钢弹"] = {
				{
					["type"] = 1,
					["time"] = 1640961079,
					["from"] = "特变电工",
					["msg"] = "坦",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640962855,
					["from"] = "特变电工",
					["msg"] = "T",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640962862,
					["from"] = "特变电工",
					["msg"] = "坦克起飞",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640962865,
					["from"] = "特变电工",
					["msg"] = "我又来了",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [4]
				["info"] = {
				},
			},
			["海鸟跟鱼相爱"] = {
				{
					["type"] = 1,
					["time"] = 1641719209,
					["from"] = "特变电工",
					["msg"] = "1个有限无敌 害我没打第一",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641719221,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "~啊。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641719226,
					["from"] = "特变电工",
					["msg"] = "老1全程地板",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641719228,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641719232,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我本来第二。。。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641719241,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "然后老10躺尸了",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641719245,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "血崩。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641719254,
					["from"] = "特变电工",
					["msg"] = "我全程基本上没用英勇",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641719268,
					["from"] = "特变电工",
					["msg"] = "全程顺劈",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641719274,
					["from"] = "特变电工",
					["msg"] = "仇恨太低了",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641719276,
					["from"] = "特变电工",
					["msg"] = "T的",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641720483,
					["from"] = "特变电工",
					["msg"] = "下次",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641720490,
					["from"] = "特变电工",
					["msg"] = "我们商量好",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641720494,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "好的= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641720499,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "= =你要啥",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641720503,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我只要艾古了",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641720504,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "~~~~~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641720505,
					["from"] = "特变电工",
					["msg"] = "提前拍",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641720520,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "艾古我都不是很想要。。。",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641720522,
					["from"] = "特变电工",
					["msg"] = "我们先提前拍 然后不要的",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641720526,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "你要风脸不= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641720534,
					["from"] = "特变电工",
					["msg"] = "给差价的70%",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641720541,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "OJBK",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641720557,
					["from"] = "特变电工",
					["msg"] = "我不要艾古",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641720563,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我也不要= =那你要啥",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641720566,
					["from"] = "特变电工",
					["msg"] = "我要橙锤和削骨",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641720576,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "  = =削骨~~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641720579,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我也想要~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641720580,
					["from"] = "特变电工",
					["msg"] = "我是PVP选手",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641720584,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我也是~~~~~~",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641720588,
					["from"] = "特变电工",
					["msg"] = "你是个锤子",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641720591,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "算了 无所谓了= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641720596,
					["from"] = "特变电工",
					["msg"] = "你买艾古",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641720602,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "我不想要 艾古= =",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641720602,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641720618,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "= =算了 不顶你",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641720623,
					["from"] = "特变电工",
					["msg"] = "顶我我就P",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641720624,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641720628,
					["from"] = "特变电工",
					["msg"] = "我去按摩",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641720631,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "= =你不要骗我",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641720633,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "走了 按摩去",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641720636,
					["from"] = "海鸟跟鱼相爱",
					["msg"] = "拜拜",
					["inbound"] = true,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641720639,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641720655,
					["from"] = "特变电工",
					["msg"] = "冲击下次这几个人顶到6000我就P",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641720682,
					["from"] = "特变电工",
					["msg"] = "然后按摩+1",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641720683,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641720692,
					["from"] = "特变电工",
					["msg"] = "削骨你要不要",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641720707,
					["from"] = "特变电工",
					["msg"] = "冲击对PVP的提升不是很大",
					["inbound"] = false,
					["convo"] = "海鸟跟鱼相爱",
				}, -- [48]
				["info"] = {
				},
			},
			["Aicc"] = {
				{
					["type"] = 1,
					["time"] = 1641703906,
					["from"] = "特变电工",
					["msg"] = "问下你这边天赋出光环了么",
					["inbound"] = false,
					["convo"] = "Aicc",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641704055,
					["from"] = "Aicc",
					["msg"] = "出了",
					["inbound"] = true,
					["convo"] = "Aicc",
				}, -- [2]
				["info"] = {
				},
			},
			["Jumbajump"] = {
				{
					["type"] = 1,
					["time"] = 1641709634,
					["from"] = "特变电工",
					["msg"] = "5队伍的爪子帮忙不一个",
					["inbound"] = false,
					["convo"] = "Jumbajump",
				}, -- [1]
				["info"] = {
				},
			},
			["我给你跪下了"] = {
				{
					["type"] = 1,
					["time"] = 1641730835,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641730836,
					["from"] = "特变电工",
					["msg"] = "我知道",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641730838,
					["from"] = "特变电工",
					["msg"] = "免疫",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641731196,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641731198,
					["from"] = "特变电工",
					["msg"] = "坑了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641731204,
					["from"] = "特变电工",
					["msg"] = "跟我没关系",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641731211,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641731229,
					["from"] = "我给你跪下了",
					["msg"] = "对面也和你一个想法",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641731425,
					["from"] = "特变电工",
					["msg"] = "他们出生地",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641731429,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641731437,
					["from"] = "特变电工",
					["msg"] = "他们的山洞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641731439,
					["from"] = "特变电工",
					["msg"] = "外面",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641731463,
					["from"] = "我给你跪下了",
					["msg"] = "2T一堆",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641731678,
					["from"] = "我给你跪下了",
					["msg"] = "搞那个君莫惜和昨夜星辰 荣誉多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641731689,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641731702,
					["from"] = "我给你跪下了",
					["msg"] = "他俩都嗑药",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641731793,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641731794,
					["from"] = "特变电工",
					["msg"] = "我知道了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641731801,
					["from"] = "特变电工",
					["msg"] = "我双手武器只有85的熟练",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641731803,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641731810,
					["from"] = "特变电工",
					["msg"] = "才发现",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641733712,
					["from"] = "我给你跪下了",
					["msg"] = "出去把我T了 我先有事",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641733719,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641744461,
					["from"] = "特变电工",
					["msg"] = "你MC都不打的吗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641744462,
					["from"] = "特变电工",
					["msg"] = "。。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641744467,
					["from"] = "我给你跪下了",
					["msg"] = "没团",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641744479,
					["from"] = "特变电工",
					["msg"] = "找个团",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641744489,
					["from"] = "我给你跪下了",
					["msg"] = "黑龙我不打 任务都没做",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641744491,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641744504,
					["from"] = "我给你跪下了",
					["msg"] = "MC看运气吧 团太少了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641744512,
					["from"] = "特变电工",
					["msg"] = "我们公会有7个全通团",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641744516,
					["from"] = "我给你跪下了",
					["msg"] = "。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641744534,
					["from"] = "我给你跪下了",
					["msg"] = "世界上喊得都不缺近战",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641744536,
					["from"] = "我给你跪下了",
					["msg"] = "一般",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641744548,
					["from"] = "特变电工",
					["msg"] = "今天我们7个盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641744567,
					["from"] = "我给你跪下了",
					["msg"] = "输出行不",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641744580,
					["from"] = "特变电工",
					["msg"] = "前10 8个近战 1个猎人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641744591,
					["from"] = "特变电工",
					["msg"] = "第一是个盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641744595,
					["from"] = "特变电工",
					["msg"] = "我今天很蛋疼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641744602,
					["from"] = "我给你跪下了",
					["msg"] = "啥装备",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641744610,
					["from"] = "特变电工",
					["msg"] = "T0.5 双刀",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641744619,
					["from"] = "特变电工",
					["msg"] = "我#$%^&*今天死惨了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641744625,
					["from"] = "我给你跪下了",
					["msg"] = "你们没匕首贼吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641744628,
					["from"] = "特变电工",
					["msg"] = "他逃命很强",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641744653,
					["from"] = "我给你跪下了",
					["msg"] = "匕首输出高一点",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641744657,
					["from"] = "我给你跪下了",
					["msg"] = "打本的话",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641744663,
					["from"] = "特变电工",
					["msg"] = "不是双刀",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641744665,
					["from"] = "特变电工",
					["msg"] = "是匕首",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641744667,
					["from"] = "特变电工",
					["msg"] = "想起来了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641744671,
					["from"] = "特变电工",
					["msg"] = "有犬牙",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641744684,
					["from"] = "我给你跪下了",
					["msg"] = "那挺猛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641744698,
					["from"] = "特变电工",
					["msg"] = "你来我们会报名",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641744715,
					["from"] = "特变电工",
					["msg"] = "现在都是在微信报名",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641744718,
					["from"] = "特变电工",
					["msg"] = "野外喊的人少",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641744746,
					["from"] = "我给你跪下了",
					["msg"] = "我这浑身就一千金去了能消费上不",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641744748,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641744752,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641744755,
					["from"] = "特变电工",
					["msg"] = "套装可以",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641744770,
					["from"] = "特变电工",
					["msg"] = "不过都没人要",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641744774,
					["from"] = "特变电工",
					["msg"] = "都是T0.5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641744779,
					["from"] = "我给你跪下了",
					["msg"] = "PVP可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641744792,
					["from"] = "我给你跪下了",
					["msg"] = "底价可以拿一套",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641744818,
					["from"] = "我给你跪下了",
					["msg"] = "你们出毁灭过吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641744824,
					["from"] = "特变电工",
					["msg"] = "今天第一打老10",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641744831,
					["from"] = "特变电工",
					["msg"] = "打了三次 最后一次过了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641744835,
					["from"] = "特变电工",
					["msg"] = "老10只能打3次",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641744842,
					["from"] = "特变电工",
					["msg"] = "3次过不了就没了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641744849,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 我也看了 时间到会消失 恶心",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641744901,
					["from"] = "我给你跪下了",
					["msg"] = "攒点钱在找团吧 不然白打工",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641744905,
					["from"] = "我给你跪下了",
					["msg"] = "起码不能白去",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641744914,
					["from"] = "特变电工",
					["msg"] = "当排骨",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641744923,
					["from"] = "我给你跪下了",
					["msg"] = "垃圾的团打一天",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641744926,
					["from"] = "我给你跪下了",
					["msg"] = "分几百",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641744926,
					["from"] = "特变电工",
					["msg"] = "你每周都打 分点前",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641744928,
					["from"] = "我给你跪下了",
					["msg"] = "没意思",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641744943,
					["from"] = "特变电工",
					["msg"] = "不就有钱消费了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641744978,
					["from"] = "我给你跪下了",
					["msg"] = "刚才我看了个主播跟我拍一场奥山了 5500血的LR 我菊花茶技能全开把他杀了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641744996,
					["from"] = "特变电工",
					["msg"] = "吐口水没",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641745000,
					["from"] = "我给你跪下了",
					["msg"] = "那没有",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641745017,
					["from"] = "特变电工",
					["msg"] = "哪个平台",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641745027,
					["from"] = "我给你跪下了",
					["msg"] = "虎牙 月灵心",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641745048,
					["from"] = "特变电工",
					["msg"] = "我以前是虎牙的股东 买了很多他家股票 还好跑了 不然死都要亏出来",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641745052,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641745060,
					["from"] = "特变电工",
					["msg"] = "买了100万 最高",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641745077,
					["from"] = "特变电工",
					["msg"] = "我以前也在虎牙直播",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641745083,
					["from"] = "我给你跪下了",
					["msg"] = "你叫啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641745084,
					["from"] = "特变电工",
					["msg"] = "所以就买了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641745091,
					["from"] = "特变电工",
					["msg"] = "我在N服的时候",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641745095,
					["from"] = "特变电工",
					["msg"] = "3年前了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641745097,
					["from"] = "我给你跪下了",
					["msg"] = "那时间太长了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641745099,
					["from"] = "特变电工",
					["msg"] = "typescripts",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641745101,
					["from"] = "我给你跪下了",
					["msg"] = "我应该不知道",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641745107,
					["from"] = "我给你跪下了",
					["msg"] = "确实不知道",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641745111,
					["from"] = "我给你跪下了",
					["msg"] = "那会看得少",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641745124,
					["from"] = "特变电工",
					["msg"] = "超强",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641745133,
					["from"] = "特变电工",
					["msg"] = "联盟第一把眼球服",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641745142,
					["from"] = "特变电工",
					["msg"] = "dkp 梭哈",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641745164,
					["from"] = "我给你跪下了",
					["msg"] = "N服流行DKP吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641745174,
					["from"] = "特变电工",
					["msg"] = "也就G团",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641745195,
					["from"] = "我给你跪下了",
					["msg"] = "没玩过N服 60级东西我很多不懂",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641745205,
					["from"] = "特变电工",
					["msg"] = "以前怀旧服第一竞速公会AOT就是我们N服的 我朋友还去他们那里消费过",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641745239,
					["from"] = "特变电工",
					["msg"] = "玩魔兽最开心就是N服了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641745245,
					["from"] = "特变电工",
					["msg"] = "还有老外可以交流",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641745267,
					["from"] = "我给你跪下了",
					["msg"] = "说的我挺想去 可惜没机会了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641745278,
					["from"] = "特变电工",
					["msg"] = "体验非常好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641745296,
					["from"] = "特变电工",
					["msg"] = "台服也不错",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641745311,
					["from"] = "特变电工",
					["msg"] = "很适合你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641745327,
					["from"] = "特变电工",
					["msg"] = "和谐 友爱 文明",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641745327,
					["from"] = "我给你跪下了",
					["msg"] = "台服要开加速器吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1641745330,
					["from"] = "特变电工",
					["msg"] = "要",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1641745340,
					["from"] = "特变电工",
					["msg"] = "不过就是人少了点",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1641745370,
					["from"] = "我给你跪下了",
					["msg"] = "这个整个国际服也不错",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1641745403,
					["from"] = "我给你跪下了",
					["msg"] = "我在被坑杀怎么说",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1641745408,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1641745413,
					["from"] = "我给你跪下了",
					["msg"] = "被堵洞口了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1641745436,
					["from"] = "特变电工",
					["msg"] = "潜行啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1641745454,
					["from"] = "我给你跪下了",
					["msg"] = "躺平了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1641745460,
					["from"] = "我给你跪下了",
					["msg"] = "任人蹂躏",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1641745486,
					["from"] = "特变电工",
					["msg"] = "害我练了一个锻造",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1641745493,
					["from"] = "特变电工",
					["msg"] = "这个武器链",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1641745525,
					["from"] = "我给你跪下了",
					["msg"] = "是干啥的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1641745532,
					["from"] = "特变电工",
					["msg"] = "免疫缴械啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1641745535,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:19323:37:::::::60:::::::::|h[无坚不摧之力]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1641745550,
					["from"] = "我给你跪下了",
					["msg"] = "战士的缴械是天赋点的吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1641745553,
					["from"] = "特变电工",
					["msg"] = "不是",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1641745554,
					["from"] = "我给你跪下了",
					["msg"] = "有的没有有的有",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1641745559,
					["from"] = "特变电工",
					["msg"] = "自带的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1641745560,
					["from"] = "我给你跪下了",
					["msg"] = "那咋有人不用",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1641745564,
					["from"] = "特变电工",
					["msg"] = "二比啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1641745569,
					["from"] = "特变电工",
					["msg"] = "很多人不会",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1641745575,
					["from"] = "特变电工",
					["msg"] = "必须缴械",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1641745578,
					["from"] = "我给你跪下了",
					["msg"] = "。。。我以为是天赋点的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1641745584,
					["from"] = "我给你跪下了",
					["msg"] = "有的人不用有的人用",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1641745591,
					["from"] = "特变电工",
					["msg"] = "抵抗很高",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1641745593,
					["from"] = "特变电工",
					["msg"] = "这个很烦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1641745597,
					["from"] = "特变电工",
					["msg"] = "牛头人就好了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1641745607,
					["from"] = "我给你跪下了",
					["msg"] = "咋 他有加成？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1641745611,
					["from"] = "特变电工",
					["msg"] = "跺脚之后昏迷缴械100%",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [138]
				{
					["type"] = 1,
					["time"] = 1641745618,
					["from"] = "特变电工",
					["msg"] = "不然容易抵抗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [139]
				{
					["type"] = 1,
					["time"] = 1641745622,
					["from"] = "特变电工",
					["msg"] = "很容易抵抗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [140]
				{
					["type"] = 1,
					["time"] = 1641745629,
					["from"] = "特变电工",
					["msg"] = "或者拦截缴械",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [141]
				{
					["type"] = 1,
					["time"] = 1641745644,
					["from"] = "特变电工",
					["msg"] = "太费拦截了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [142]
				{
					["type"] = 1,
					["time"] = 1641745648,
					["from"] = "我给你跪下了",
					["msg"] = "缴械算法术啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [143]
				{
					["type"] = 1,
					["time"] = 1641745658,
					["from"] = "特变电工",
					["msg"] = "你开闪避就不会被缴械",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [144]
				{
					["type"] = 1,
					["time"] = 1641745662,
					["from"] = "特变电工",
					["msg"] = "但是会被压制",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [145]
				{
					["type"] = 1,
					["time"] = 1641745663,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [146]
				{
					["type"] = 1,
					["time"] = 1641745677,
					["from"] = "特变电工",
					["msg"] = "我现在武器战了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [147]
				{
					["type"] = 1,
					["time"] = 1641745679,
					["from"] = "我给你跪下了",
					["msg"] = "他算法术还是物理攻击",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [148]
				{
					["type"] = 1,
					["time"] = 1641745688,
					["from"] = "特变电工",
					["msg"] = "武器",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [149]
				{
					["type"] = 1,
					["time"] = 1641745691,
					["from"] = "特变电工",
					["msg"] = "物理",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [150]
				{
					["type"] = 1,
					["time"] = 1641745700,
					["from"] = "特变电工",
					["msg"] = "咋了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [151]
				{
					["type"] = 1,
					["time"] = 1641745715,
					["from"] = "我给你跪下了",
					["msg"] = "那背面是不是没有必中",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [152]
				{
					["type"] = 1,
					["time"] = 1641745730,
					["from"] = "特变电工",
					["msg"] = "背面100%缴械",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [153]
				{
					["type"] = 1,
					["time"] = 1641745777,
					["from"] = "我给你跪下了",
					["msg"] = "那还行 断筋绕背也还可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [154]
				{
					["type"] = 1,
					["time"] = 1641745845,
					["from"] = "我给你跪下了",
					["msg"] = "你战场有要拿的装备吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [155]
				{
					["type"] = 1,
					["time"] = 1641745891,
					["from"] = "特变电工",
					["msg"] = "啥装",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [156]
				{
					["type"] = 1,
					["time"] = 1641745894,
					["from"] = "特变电工",
					["msg"] = "R10",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [157]
				{
					["type"] = 1,
					["time"] = 1641745905,
					["from"] = "我给你跪下了",
					["msg"] = "R10比副本的好吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [158]
				{
					["type"] = 1,
					["time"] = 1641745907,
					["from"] = "特变电工",
					["msg"] = "60级很恶心",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [159]
				{
					["type"] = 1,
					["time"] = 1641745921,
					["from"] = "特变电工",
					["msg"] = "有个肩膀和腿可以用 不过我就是为了打架",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [160]
				{
					["type"] = 1,
					["time"] = 1641745933,
					["from"] = "特变电工",
					["msg"] = "我副本PVE装备我不会花很多前",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [161]
				{
					["type"] = 1,
					["time"] = 1641745940,
					["from"] = "特变电工",
					["msg"] = "PVP装备 我会不惜一切代价",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [162]
				{
					["type"] = 1,
					["time"] = 1641745948,
					["from"] = "特变电工",
					["msg"] = "PVE随便打打就起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [163]
				{
					["type"] = 1,
					["time"] = 1641745958,
					["from"] = "特变电工",
					["msg"] = "比如AL 削骨 橙锤",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [164]
				{
					["type"] = 1,
					["time"] = 1641745966,
					["from"] = "特变电工",
					["msg"] = "谁来谁死",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [165]
				{
					["type"] = 1,
					["time"] = 1641745990,
					["from"] = "特变电工",
					["msg"] = "副本一周就打几个小时",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [166]
				{
					["type"] = 1,
					["time"] = 1641745994,
					["from"] = "我给你跪下了",
					["msg"] = "那我要躲着点",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [167]
				{
					["type"] = 1,
					["time"] = 1641745996,
					["from"] = "特变电工",
					["msg"] = "大部分时间都泡在战场杀人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [168]
				{
					["type"] = 1,
					["time"] = 1641746005,
					["from"] = "特变电工",
					["msg"] = "性价比高的多",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [169]
				{
					["type"] = 1,
					["time"] = 1641746054,
					["from"] = "我给你跪下了",
					["msg"] = "下次我玩个战士 感觉战士挺萌的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [170]
				{
					["type"] = 1,
					["time"] = 1641746057,
					["from"] = "我给你跪下了",
					["msg"] = "猛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [171]
				{
					["type"] = 1,
					["time"] = 1641746066,
					["from"] = "特变电工",
					["msg"] = "没治疗就是个垃圾",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [172]
				{
					["type"] = 1,
					["time"] = 1641746066,
					["from"] = "我给你跪下了",
					["msg"] = "但我不会",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [173]
				{
					["type"] = 1,
					["time"] = 1641746071,
					["from"] = "我给你跪下了",
					["msg"] = "得慢慢摸索",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [174]
				{
					["type"] = 1,
					["time"] = 1641746089,
					["from"] = "特变电工",
					["msg"] = "遇到法师只有脚爸爸",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [175]
				{
					["type"] = 1,
					["time"] = 1641746090,
					["from"] = "我给你跪下了",
					["msg"] = "战士我感觉血又多输出又高",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [176]
				{
					["type"] = 1,
					["time"] = 1641746093,
					["from"] = "我给你跪下了",
					["msg"] = "那曲市",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [177]
				{
					["type"] = 1,
					["time"] = 1641746095,
					["from"] = "我给你跪下了",
					["msg"] = "确实",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [178]
				{
					["type"] = 1,
					["time"] = 1641746107,
					["from"] = "特变电工",
					["msg"] = "跟个骑士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [179]
				{
					["type"] = 1,
					["time"] = 1641746111,
					["from"] = "特变电工",
					["msg"] = "天下无敌",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [180]
				{
					["type"] = 1,
					["time"] = 1641746141,
					["from"] = "我给你跪下了",
					["msg"] = "还有那暗牧 真肉",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [181]
				{
					["type"] = 1,
					["time"] = 1641746152,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [182]
				{
					["type"] = 1,
					["time"] = 1641746153,
					["from"] = "我给你跪下了",
					["msg"] = "就给你挂DOT我就死了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [183]
				{
					["type"] = 1,
					["time"] = 1641746164,
					["from"] = "特变电工",
					["msg"] = "必须要有治疗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [184]
				{
					["type"] = 1,
					["time"] = 1641746168,
					["from"] = "特变电工",
					["msg"] = "不然只有打猎人 盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [185]
				{
					["type"] = 1,
					["time"] = 1641746183,
					["from"] = "特变电工",
					["msg"] = "玩的好的盗贼也很蛋疼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [186]
				{
					["type"] = 1,
					["time"] = 1641746184,
					["from"] = "我给你跪下了",
					["msg"] = "LR能打吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [187]
				{
					["type"] = 1,
					["time"] = 1641746188,
					["from"] = "特变电工",
					["msg"] = "猎人100%胜算",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [188]
				{
					["type"] = 1,
					["time"] = 1641746190,
					["from"] = "我给你跪下了",
					["msg"] = "感觉猎人不太怕",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [189]
				{
					["type"] = 1,
					["time"] = 1641746191,
					["from"] = "特变电工",
					["msg"] = "我就没输过",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [190]
				{
					["type"] = 1,
					["time"] = 1641746195,
					["from"] = "我给你跪下了",
					["msg"] = "好吧‘",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [191]
				{
					["type"] = 1,
					["time"] = 1641746205,
					["from"] = "特变电工",
					["msg"] = "盗贼我单挑输过不少",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [192]
				{
					["type"] = 1,
					["time"] = 1641746214,
					["from"] = "特变电工",
					["msg"] = "85%胜算把",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [193]
				{
					["type"] = 1,
					["time"] = 1641746252,
					["from"] = "我给你跪下了",
					["msg"] = "盗贼一套不行两套 技能全先手的话还是可以的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [194]
				{
					["type"] = 1,
					["time"] = 1641746315,
					["from"] = "特变电工",
					["msg"] = "玩的好的盗贼 知道战士技能 然后卡好技能 战士很容易输",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [195]
				{
					["type"] = 1,
					["time"] = 1641746340,
					["from"] = "我给你跪下了",
					["msg"] = "嗯是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [196]
				{
					["type"] = 1,
					["time"] = 1641746361,
					["from"] = "我给你跪下了",
					["msg"] = "盗贼玩得好还是可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [197]
				{
					["type"] = 1,
					["time"] = 1641746363,
					["from"] = "特变电工",
					["msg"] = "如果你是武器姿态就凿 ",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [198]
				{
					["type"] = 1,
					["time"] = 1641746377,
					["from"] = "特变电工",
					["msg"] = "然后走元 进潜",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [199]
				{
					["type"] = 1,
					["time"] = 1641746412,
					["from"] = "特变电工",
					["msg"] = "如果凿不了血量危险就致盲 进潜 闷棍 绷带",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [200]
				{
					["type"] = 1,
					["time"] = 1641746437,
					["from"] = "特变电工",
					["msg"] = "然后在进潜 偷袭 肾",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [201]
				{
					["type"] = 1,
					["time"] = 1641746449,
					["from"] = "特变电工",
					["msg"] = "然后在凿",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [202]
				{
					["type"] = 1,
					["time"] = 1641746458,
					["from"] = "特变电工",
					["msg"] = "很难受",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [203]
				{
					["type"] = 1,
					["time"] = 1641746481,
					["from"] = "我给你跪下了",
					["msg"] = "差不多 盗贼两套技能全在控到死",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [204]
				{
					["type"] = 1,
					["time"] = 1641746499,
					["from"] = "特变电工",
					["msg"] = "但是我有章的话",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [205]
				{
					["type"] = 1,
					["time"] = 1641746509,
					["from"] = "特变电工",
					["msg"] = "他们节奏就会段",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [206]
				{
					["type"] = 1,
					["time"] = 1641746517,
					["from"] = "我给你跪下了",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [207]
				{
					["type"] = 1,
					["time"] = 1641746525,
					["from"] = "特变电工",
					["msg"] = "‘",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [208]
				{
					["type"] = 1,
					["time"] = 1641746582,
					["from"] = "特变电工",
					["msg"] = "你明天不上班？",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [209]
				{
					["type"] = 1,
					["time"] = 1641746599,
					["from"] = "我给你跪下了",
					["msg"] = "我等下休息了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [210]
				{
					["type"] = 1,
					["time"] = 1641746613,
					["from"] = "我给你跪下了",
					["msg"] = "趁双倍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [211]
				{
					["type"] = 1,
					["time"] = 1641746620,
					["from"] = "特变电工",
					["msg"] = "一样的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [212]
				{
					["type"] = 1,
					["time"] = 1641746628,
					["from"] = "特变电工",
					["msg"] = "大家都双倍",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [213]
				{
					["type"] = 1,
					["time"] = 1641746657,
					["from"] = "我给你跪下了",
					["msg"] = "但是今天他们打二十四小时 不双倍了就要四十八小时才能追",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [214]
				{
					["type"] = 1,
					["time"] = 1641746667,
					["from"] = "特变电工",
					["msg"] = "对了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [215]
				{
					["type"] = 1,
					["time"] = 1641746670,
					["from"] = "特变电工",
					["msg"] = "周一结束？",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [216]
				{
					["type"] = 1,
					["time"] = 1641746672,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [217]
				{
					["type"] = 1,
					["time"] = 1641746675,
					["from"] = "特变电工",
					["msg"] = "哦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [218]
				{
					["type"] = 1,
					["time"] = 1641746677,
					["from"] = "特变电工",
					["msg"] = "也是",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [219]
				{
					["type"] = 1,
					["time"] = 1641746711,
					["from"] = "我给你跪下了",
					["msg"] = "感觉下周R10还是不太行。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [220]
				{
					["type"] = 1,
					["time"] = 1641746713,
					["from"] = "我给你跪下了",
					["msg"] = "我的肝",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [221]
				{
					["type"] = 1,
					["time"] = 1641746714,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [222]
				{
					["type"] = 1,
					["time"] = 1641746716,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [223]
				{
					["type"] = 1,
					["time"] = 1641746738,
					["from"] = "特变电工",
					["msg"] = "那你不会觉得 都R10了 不刷可惜了 直接R13",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [224]
				{
					["type"] = 1,
					["time"] = 1641746747,
					["from"] = "特变电工",
					["msg"] = "然后R13觉得亏 然后R14",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [225]
				{
					["type"] = 1,
					["time"] = 1641746749,
					["from"] = "我给你跪下了",
					["msg"] = "我这排名够不上",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [226]
				{
					["type"] = 1,
					["time"] = 1641746761,
					["from"] = "我给你跪下了",
					["msg"] = "R13每周都要前三四十",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [227]
				{
					["type"] = 1,
					["time"] = 1641746770,
					["from"] = "我给你跪下了",
					["msg"] = "100多万啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [228]
				{
					["type"] = 1,
					["time"] = 1641746808,
					["from"] = "我给你跪下了",
					["msg"] = "那得一天十二小时还得场场单吃",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [229]
				{
					["type"] = 1,
					["time"] = 1641746822,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [230]
				{
					["type"] = 1,
					["time"] = 1641746836,
					["from"] = "特变电工",
					["msg"] = "24小时",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [231]
				{
					["type"] = 1,
					["time"] = 1641746845,
					["from"] = "特变电工",
					["msg"] = "不就是第一了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [232]
				{
					["type"] = 1,
					["time"] = 1641746860,
					["from"] = "我给你跪下了",
					["msg"] = "是啊 第一上周150w",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [233]
				{
					["type"] = 1,
					["time"] = 1641746867,
					["from"] = "我给你跪下了",
					["msg"] = "咋打出来的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [234]
				{
					["type"] = 1,
					["time"] = 1641746968,
					["from"] = "特变电工",
					["msg"] = "正常",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [235]
				{
					["type"] = 1,
					["time"] = 1641746976,
					["from"] = "特变电工",
					["msg"] = "我在N服 第一名也差不多这个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [236]
				{
					["type"] = 1,
					["time"] = 1641746983,
					["from"] = "特变电工",
					["msg"] = "不过很严格",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [237]
				{
					["type"] = 1,
					["time"] = 1641746990,
					["from"] = "特变电工",
					["msg"] = "超过16个小时就会被封号",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [238]
				{
					["type"] = 1,
					["time"] = 1641747451,
					["from"] = "特变电工",
					["msg"] = "你要自己装",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [239]
				{
					["type"] = 1,
					["time"] = 1641747550,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [240]
				{
					["type"] = 1,
					["time"] = 1641747559,
					["from"] = "特变电工",
					["msg"] = "我们要不要互助一下啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [241]
				{
					["type"] = 1,
					["time"] = 1641747572,
					["from"] = "我给你跪下了",
					["msg"] = "啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [242]
				{
					["type"] = 1,
					["time"] = 1641747574,
					["from"] = "我给你跪下了",
					["msg"] = "啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [243]
				{
					["type"] = 1,
					["time"] = 1641747577,
					["from"] = "特变电工",
					["msg"] = "你觉得呢",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [244]
				{
					["type"] = 1,
					["time"] = 1641747578,
					["from"] = "我给你跪下了",
					["msg"] = "尴尬采煤在",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [245]
				{
					["type"] = 1,
					["time"] = 1641747580,
					["from"] = "特变电工",
					["msg"] = "我不在的时候",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [246]
				{
					["type"] = 1,
					["time"] = 1641747582,
					["from"] = "我给你跪下了",
					["msg"] = "刚才没在",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [247]
				{
					["type"] = 1,
					["time"] = 1641747583,
					["from"] = "特变电工",
					["msg"] = "你帮我",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [248]
				{
					["type"] = 1,
					["time"] = 1641747588,
					["from"] = "特变电工",
					["msg"] = "你不在的时候 我帮你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [249]
				{
					["type"] = 1,
					["time"] = 1641747597,
					["from"] = "我给你跪下了",
					["msg"] = "奥山？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [250]
				{
					["type"] = 1,
					["time"] = 1641747600,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [251]
				{
					["type"] = 1,
					["time"] = 1641747615,
					["from"] = "我给你跪下了",
					["msg"] = "你啥时候不在",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [252]
				{
					["type"] = 1,
					["time"] = 1641747634,
					["from"] = "特变电工",
					["msg"] = "我是晚上10点到凌晨3点",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [253]
				{
					["type"] = 1,
					["time"] = 1641747658,
					["from"] = "我给你跪下了",
					["msg"] = "你这不是正常作息啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [254]
				{
					["type"] = 1,
					["time"] = 1641747661,
					["from"] = "我给你跪下了",
					["msg"] = "在国外？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [255]
				{
					["type"] = 1,
					["time"] = 1641747665,
					["from"] = "特变电工",
					["msg"] = "没有啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [256]
				{
					["type"] = 1,
					["time"] = 1641747672,
					["from"] = "特变电工",
					["msg"] = "我早上一般10点半到公司",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [257]
				{
					["type"] = 1,
					["time"] = 1641747676,
					["from"] = "特变电工",
					["msg"] = "9点40起床",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [258]
				{
					["type"] = 1,
					["time"] = 1641747679,
					["from"] = "特变电工",
					["msg"] = "不打卡 晚点也没事",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [259]
				{
					["type"] = 1,
					["time"] = 1641747716,
					["from"] = "我给你跪下了",
					["msg"] = "我下午六点到12点",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [260]
				{
					["type"] = 1,
					["time"] = 1641747719,
					["from"] = "我给你跪下了",
					["msg"] = "可以帮你",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [261]
				{
					["type"] = 1,
					["time"] = 1641747731,
					["from"] = "特变电工",
					["msg"] = "那就是6点到凌晨3点",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [262]
				{
					["type"] = 1,
					["time"] = 1641747741,
					["from"] = "特变电工",
					["msg"] = "7个小时",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [263]
				{
					["type"] = 1,
					["time"] = 1641747749,
					["from"] = "特变电工",
					["msg"] = "加我微信",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [264]
				{
					["type"] = 1,
					["time"] = 1641747753,
					["from"] = "特变电工",
					["msg"] = "我加你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [265]
				{
					["type"] = 1,
					["time"] = 1641747766,
					["from"] = "我给你跪下了",
					["msg"] = "13131653113",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [266]
				{
					["type"] = 1,
					["time"] = 1641747792,
					["from"] = "我给你跪下了",
					["msg"] = "我先帮你搞吧 我看看下周没到R10的话你再来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [267]
				{
					["type"] = 1,
					["time"] = 1641747837,
					["from"] = "特变电工",
					["msg"] = "我擦 你在廊坊啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [268]
				{
					["type"] = 1,
					["time"] = 1641747842,
					["from"] = "特变电工",
					["msg"] = "我在北京 很近",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [269]
				{
					["type"] = 1,
					["time"] = 1641747849,
					["from"] = "我给你跪下了",
					["msg"] = "。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [270]
				{
					["type"] = 1,
					["time"] = 1641747852,
					["from"] = "我给你跪下了",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [271]
				{
					["type"] = 1,
					["time"] = 1641747891,
					["from"] = "特变电工",
					["msg"] = "这样效率最高",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [272]
				{
					["type"] = 1,
					["time"] = 1641747908,
					["from"] = "我给你跪下了",
					["msg"] = "你现在R几",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [273]
				{
					["type"] = 1,
					["time"] = 1641747913,
					["from"] = "特变电工",
					["msg"] = "5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [274]
				{
					["type"] = 1,
					["time"] = 1641747917,
					["from"] = "特变电工",
					["msg"] = "5 91%",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [275]
				{
					["type"] = 1,
					["time"] = 1641747924,
					["from"] = "我给你跪下了",
					["msg"] = "那搞得快两周可以了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [276]
				{
					["type"] = 1,
					["time"] = 1641747968,
					["from"] = "特变电工",
					["msg"] = "你等会下了 微信我帮你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [277]
				{
					["type"] = 1,
					["time"] = 1641747974,
					["from"] = "特变电工",
					["msg"] = "明天你帮我",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [278]
				{
					["type"] = 1,
					["time"] = 1641747975,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [279]
				{
					["type"] = 1,
					["time"] = 1641747977,
					["from"] = "特变电工",
					["msg"] = "安逸的很",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [280]
				{
					["type"] = 1,
					["time"] = 1641747991,
					["from"] = "特变电工",
					["msg"] = "其实最好的策略是3个人互帮",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [281]
				{
					["type"] = 1,
					["time"] = 1641748037,
					["from"] = "我给你跪下了",
					["msg"] = "。。那得真有个在国外的了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [282]
				{
					["type"] = 1,
					["time"] = 1641748124,
					["from"] = "我给你跪下了",
					["msg"] = "下周开始搞吧 这周我自己打长一点时间下周可以多帮你搞会",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [283]
				{
					["type"] = 1,
					["time"] = 1641748142,
					["from"] = "特变电工",
					["msg"] = "我说的是shuang kai",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [284]
				{
					["type"] = 1,
					["time"] = 1641748147,
					["from"] = "我给你跪下了",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [285]
				{
					["type"] = 1,
					["time"] = 1641748148,
					["from"] = "我给你跪下了",
					["msg"] = "擦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [286]
				{
					["type"] = 1,
					["time"] = 1641748151,
					["from"] = "我给你跪下了",
					["msg"] = "理解错了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [287]
				{
					["type"] = 1,
					["time"] = 1641748153,
					["from"] = "我给你跪下了",
					["msg"] = "那可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [288]
				{
					["type"] = 1,
					["time"] = 1641748154,
					["from"] = "特变电工",
					["msg"] = "你在想啥",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [289]
				{
					["type"] = 1,
					["time"] = 1641748155,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [290]
				{
					["type"] = 1,
					["time"] = 1641748161,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [291]
				{
					["type"] = 1,
					["time"] = 1641748170,
					["from"] = "我给你跪下了",
					["msg"] = "我的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [292]
				{
					["type"] = 1,
					["time"] = 1641748174,
					["from"] = "我给你跪下了",
					["msg"] = "我没转过来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [293]
				{
					["type"] = 1,
					["time"] = 1641748176,
					["from"] = "特变电工",
					["msg"] = "不然怎么脚互助",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [294]
				{
					["type"] = 1,
					["time"] = 1641748183,
					["from"] = "我给你跪下了",
					["msg"] = "那我爽歪歪了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [295]
				{
					["type"] = 1,
					["time"] = 1641748192,
					["from"] = "我给你跪下了",
					["msg"] = "直接用你的砍人",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [296]
				{
					["type"] = 1,
					["time"] = 1641748198,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [297]
				{
					["type"] = 1,
					["time"] = 1641748203,
					["from"] = "特变电工",
					["msg"] = "你可以联系一下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [298]
				{
					["type"] = 1,
					["time"] = 1641748204,
					["from"] = "我给你跪下了",
					["msg"] = "我隐身吃荣誉",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [299]
				{
					["type"] = 1,
					["time"] = 1641748217,
					["from"] = "特变电工",
					["msg"] = "键位随便调",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [300]
				{
					["type"] = 1,
					["time"] = 1641748224,
					["from"] = "特变电工",
					["msg"] = "我有插件复原",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [301]
				{
					["type"] = 1,
					["time"] = 1641748231,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [302]
				{
					["type"] = 1,
					["time"] = 1641748241,
					["from"] = "特变电工",
					["msg"] = "不要吃合计",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [303]
				{
					["type"] = 1,
					["time"] = 1641748243,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [304]
				{
					["type"] = 1,
					["time"] = 1641748245,
					["from"] = "我给你跪下了",
					["msg"] = "不吃",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [305]
				{
					["type"] = 1,
					["time"] = 1641748250,
					["from"] = "我给你跪下了",
					["msg"] = "喔药都不用",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [306]
				{
					["type"] = 1,
					["time"] = 1641748254,
					["from"] = "我给你跪下了",
					["msg"] = "对冲",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [307]
				{
					["type"] = 1,
					["time"] = 1641748257,
					["from"] = "我给你跪下了",
					["msg"] = "不需要打人",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [308]
				{
					["type"] = 1,
					["time"] = 1641748264,
					["from"] = "特变电工",
					["msg"] = "大红随便吃",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [309]
				{
					["type"] = 1,
					["time"] = 1641748369,
					["from"] = "特变电工",
					["msg"] = "这样",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [310]
				{
					["type"] = 1,
					["time"] = 1641748373,
					["from"] = "特变电工",
					["msg"] = "我们就起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [311]
				{
					["type"] = 1,
					["time"] = 1641748381,
					["from"] = "特变电工",
					["msg"] = "你在找一个白天的朋友",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [312]
				{
					["type"] = 1,
					["time"] = 1641748384,
					["from"] = "特变电工",
					["msg"] = "3人互助",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [313]
				{
					["type"] = 1,
					["time"] = 1641748385,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [314]
				{
					["type"] = 1,
					["time"] = 1641748388,
					["from"] = "特变电工",
					["msg"] = "R14有望",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [315]
				{
					["type"] = 1,
					["time"] = 1641748391,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [316]
				{
					["type"] = 1,
					["time"] = 1641748395,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [317]
				{
					["type"] = 1,
					["time"] = 1641748410,
					["from"] = "特变电工",
					["msg"] = "我们有冲突",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [318]
				{
					["type"] = 1,
					["time"] = 1641748431,
					["from"] = "特变电工",
					["msg"] = "如果你是15-22就完美了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [319]
				{
					["type"] = 1,
					["time"] = 1641748445,
					["from"] = "特变电工",
					["msg"] = "16-22",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [320]
				{
					["type"] = 1,
					["time"] = 1641748449,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [321]
				{
					["type"] = 1,
					["time"] = 1641748455,
					["from"] = "特变电工",
					["msg"] = "完美衔接",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [322]
				{
					["type"] = 1,
					["time"] = 1641748492,
					["from"] = "我给你跪下了",
					["msg"] = "确实 这样可以R13",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [323]
				{
					["type"] = 1,
					["time"] = 1641748499,
					["from"] = "我给你跪下了",
					["msg"] = "一天二十万",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [324]
				{
					["type"] = 1,
					["time"] = 1641748513,
					["from"] = "我给你跪下了",
					["msg"] = "R14",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [325]
				{
					["type"] = 1,
					["time"] = 1641748527,
					["from"] = "特变电工",
					["msg"] = "你在找个朋友",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [326]
				{
					["type"] = 1,
					["time"] = 1641748531,
					["from"] = "特变电工",
					["msg"] = "有木有",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [327]
				{
					["type"] = 1,
					["time"] = 1641748557,
					["from"] = "我给你跪下了",
					["msg"] = "没有",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [328]
				{
					["type"] = 1,
					["time"] = 1641748560,
					["from"] = "我给你跪下了",
					["msg"] = "哪有那种",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [329]
				{
					["type"] = 1,
					["time"] = 1641749162,
					["from"] = "特变电工",
					["msg"] = "我练慢了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [330]
				{
					["type"] = 1,
					["time"] = 1641749164,
					["from"] = "特变电工",
					["msg"] = "满了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [331]
				{
					["type"] = 1,
					["time"] = 1641749166,
					["from"] = "特变电工",
					["msg"] = "305",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [332]
				{
					["type"] = 1,
					["time"] = 1641749176,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [333]
				{
					["type"] = 1,
					["time"] = 1641749180,
					["from"] = "我给你跪下了",
					["msg"] = "可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [334]
				{
					["type"] = 1,
					["time"] = 1641749187,
					["from"] = "特变电工",
					["msg"] = "我发现打人默认是305",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [335]
				{
					["type"] = 1,
					["time"] = 1641749199,
					["from"] = "特变电工",
					["msg"] = "我之前只有85点一样砍人痛",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [336]
				{
					["type"] = 1,
					["time"] = 1641749229,
					["from"] = "我给你跪下了",
					["msg"] = "好像是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [337]
				{
					["type"] = 1,
					["time"] = 1641749242,
					["from"] = "特变电工",
					["msg"] = "不过有时候ADD到NPC打不过",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [338]
				{
					["type"] = 1,
					["time"] = 1641749244,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [339]
				{
					["type"] = 1,
					["time"] = 1641749257,
					["from"] = "特变电工",
					["msg"] = "我发现武器战没有狂暴战凶",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [340]
				{
					["type"] = 1,
					["time"] = 1641749260,
					["from"] = "我给你跪下了",
					["msg"] = "确实 我练匕首的时候打弓箭手不掉血",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [341]
				{
					["type"] = 1,
					["time"] = 1641750264,
					["from"] = "特变电工",
					["msg"] = "你下一个myslot",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [342]
				{
					["type"] = 1,
					["time"] = 1641750266,
					["from"] = "特变电工",
					["msg"] = "插件",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [343]
				{
					["type"] = 1,
					["time"] = 1641750274,
					["from"] = "特变电工",
					["msg"] = "保存键位",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [344]
				{
					["type"] = 1,
					["time"] = 1641751315,
					["from"] = "特变电工",
					["msg"] = "好想不上班了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [345]
				{
					["type"] = 1,
					["time"] = 1641751319,
					["from"] = "特变电工",
					["msg"] = "然后天天刷",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [346]
				{
					["type"] = 1,
					["time"] = 1641751320,
					["from"] = "特变电工",
					["msg"] = "到14",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [347]
				{
					["type"] = 1,
					["time"] = 1641751326,
					["from"] = "特变电工",
					["msg"] = "安逸的很",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [348]
				{
					["type"] = 1,
					["time"] = 1641751368,
					["from"] = "特变电工",
					["msg"] = "我16年5月去廊坊看了草莓音乐节",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [349]
				{
					["type"] = 1,
					["time"] = 1641751396,
					["from"] = "我给你跪下了",
					["msg"] = "。。那太远了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [350]
				{
					["type"] = 1,
					["time"] = 1641751407,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [351]
				{
					["type"] = 1,
					["time"] = 1641751411,
					["from"] = "我给你跪下了",
					["msg"] = "时间太久了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [352]
				{
					["type"] = 1,
					["time"] = 1641751420,
					["from"] = "特变电工",
					["msg"] = "不知不觉6年了快",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [353]
				{
					["type"] = 1,
					["time"] = 1641751454,
					["from"] = "特变电工",
					["msg"] = "有个什么中国城",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [354]
				{
					["type"] = 1,
					["time"] = 1641751460,
					["from"] = "特变电工",
					["msg"] = "古城",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [355]
				{
					["type"] = 1,
					["time"] = 1641751468,
					["from"] = "特变电工",
					["msg"] = "在那里举办的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [356]
				{
					["type"] = 1,
					["time"] = 1641751502,
					["from"] = "我给你跪下了",
					["msg"] = "我看一个骑士一刀把法师秒了 这也太",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [357]
				{
					["type"] = 1,
					["time"] = 1641751565,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [358]
				{
					["type"] = 1,
					["time"] = 1641751600,
					["from"] = "特变电工",
					["msg"] = "我之前T2.5加R12加眼球服",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [359]
				{
					["type"] = 1,
					["time"] = 1641751603,
					["from"] = "特变电工",
					["msg"] = "一刀一个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [360]
				{
					["type"] = 1,
					["time"] = 1641751611,
					["from"] = "特变电工",
					["msg"] = "平砍法师满血",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [361]
				{
					["type"] = 1,
					["time"] = 1641751616,
					["from"] = "特变电工",
					["msg"] = "带盾",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [362]
				{
					["type"] = 1,
					["time"] = 1641751620,
					["from"] = "我给你跪下了",
					["msg"] = "他就现在 一刀就秒了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [363]
				{
					["type"] = 1,
					["time"] = 1641751623,
					["from"] = "特变电工",
					["msg"] = "我朋友在我旁边都惊呆了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [364]
				{
					["type"] = 1,
					["time"] = 1641751628,
					["from"] = "特变电工",
					["msg"] = "平砍",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [365]
				{
					["type"] = 1,
					["time"] = 1641751654,
					["from"] = "我给你跪下了",
					["msg"] = "那他还是用技能了的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [366]
				{
					["type"] = 1,
					["time"] = 1641751660,
					["from"] = "我给你跪下了",
					["msg"] = "不光平砍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [367]
				{
					["type"] = 1,
					["time"] = 1641751689,
					["from"] = "我给你跪下了",
					["msg"] = "然后把一个R12贼砍掉80血",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [368]
				{
					["type"] = 1,
					["time"] = 1641751696,
					["from"] = "我给你跪下了",
					["msg"] = "也太猛了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [369]
				{
					["type"] = 1,
					["time"] = 1641822605,
					["from"] = "特变电工",
					["msg"] = "我擦。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [370]
				{
					["type"] = 1,
					["time"] = 1641822613,
					["from"] = "我给你跪下了",
					["msg"] = "咋了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [371]
				{
					["type"] = 1,
					["time"] = 1641822629,
					["from"] = "特变电工",
					["msg"] = "你练习一下战士砍人 很有快感",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [372]
				{
					["type"] = 1,
					["time"] = 1641822635,
					["from"] = "特变电工",
					["msg"] = "我也练习一下盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [373]
				{
					["type"] = 1,
					["time"] = 1641822640,
					["from"] = "特变电工",
					["msg"] = "你下一个myslot插件",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [374]
				{
					["type"] = 1,
					["time"] = 1641822651,
					["from"] = "特变电工",
					["msg"] = "键位保存一下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [375]
				{
					["type"] = 1,
					["time"] = 1641822658,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [376]
				{
					["type"] = 1,
					["time"] = 1641822827,
					["from"] = "特变电工",
					["msg"] = "进了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [377]
				{
					["type"] = 1,
					["time"] = 1641822902,
					["from"] = "特变电工",
					["msg"] = "擦 忘记买面包",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [378]
				{
					["type"] = 1,
					["time"] = 1641822907,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [379]
				{
					["type"] = 1,
					["time"] = 1641822912,
					["from"] = "特变电工",
					["msg"] = "等会要去铁桥买",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [380]
				{
					["type"] = 1,
					["time"] = 1641822917,
					["from"] = "我给你跪下了",
					["msg"] = "没事死了复活",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [381]
				{
					["type"] = 1,
					["time"] = 1641822926,
					["from"] = "特变电工",
					["msg"] = "KD很难看",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [382]
				{
					["type"] = 1,
					["time"] = 1641822952,
					["from"] = "特变电工",
					["msg"] = "这周能到60万",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [383]
				{
					["type"] = 1,
					["time"] = 1641822968,
					["from"] = "特变电工",
					["msg"] = "石炉哨塔",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [384]
				{
					["type"] = 1,
					["time"] = 1641822972,
					["from"] = "我给你跪下了",
					["msg"] = "那可能R8",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [385]
				{
					["type"] = 1,
					["time"] = 1641822982,
					["from"] = "特变电工",
					["msg"] = "直接砍人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [386]
				{
					["type"] = 1,
					["time"] = 1641822984,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [387]
				{
					["type"] = 1,
					["time"] = 1641822996,
					["from"] = "我给你跪下了",
					["msg"] = "我害怕坑了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [388]
				{
					["type"] = 1,
					["time"] = 1641823011,
					["from"] = "我给你跪下了",
					["msg"] = "赌狗洞爸还是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [389]
				{
					["type"] = 1,
					["time"] = 1641823960,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [390]
				{
					["type"] = 1,
					["time"] = 1641823962,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [391]
				{
					["type"] = 1,
					["time"] = 1641823972,
					["from"] = "特变电工",
					["msg"] = "我微信发你视频",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [392]
				{
					["type"] = 1,
					["time"] = 1641823980,
					["from"] = "特变电工",
					["msg"] = "手机魔兽",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [393]
				{
					["type"] = 1,
					["time"] = 1641824008,
					["from"] = "我给你跪下了",
					["msg"] = "看了。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [394]
				{
					["type"] = 1,
					["time"] = 1641824270,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [395]
				{
					["type"] = 1,
					["time"] = 1641824274,
					["from"] = "特变电工",
					["msg"] = "8个单杀",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [396]
				{
					["type"] = 1,
					["time"] = 1641824281,
					["from"] = "特变电工",
					["msg"] = "爽歪歪",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [397]
				{
					["type"] = 1,
					["time"] = 1641824304,
					["from"] = "我给你跪下了",
					["msg"] = "可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [398]
				{
					["type"] = 1,
					["time"] = 1641825244,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [399]
				{
					["type"] = 1,
					["time"] = 1641825248,
					["from"] = "特变电工",
					["msg"] = "392名才能进R10",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [400]
				{
					["type"] = 1,
					["time"] = 1641825264,
					["from"] = "我给你跪下了",
					["msg"] = "你这周R10不了啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [401]
				{
					["type"] = 1,
					["time"] = 1641825273,
					["from"] = "我给你跪下了",
					["msg"] = "最多R8",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [402]
				{
					["type"] = 1,
					["time"] = 1641825274,
					["from"] = "特变电工",
					["msg"] = "才有资格冲进R10",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [403]
				{
					["type"] = 1,
					["time"] = 1641825277,
					["from"] = "特变电工",
					["msg"] = "最多R7",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [404]
				{
					["type"] = 1,
					["time"] = 1641825284,
					["from"] = "我给你跪下了",
					["msg"] = "差不多吧 比较慢",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [405]
				{
					["type"] = 1,
					["time"] = 1641826133,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈哈 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [406]
				{
					["type"] = 1,
					["time"] = 1641826138,
					["from"] = "我给你跪下了",
					["msg"] = "你看人家说你妹",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [407]
				{
					["type"] = 1,
					["time"] = 1641826139,
					["from"] = "我给你跪下了",
					["msg"] = "没",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [408]
				{
					["type"] = 1,
					["time"] = 1641826153,
					["from"] = "特变电工",
					["msg"] = "管得着",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [409]
				{
					["type"] = 1,
					["time"] = 1641826156,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [410]
				{
					["type"] = 1,
					["time"] = 1641826183,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [411]
				{
					["type"] = 1,
					["time"] = 1641826200,
					["from"] = "我给你跪下了",
					["msg"] = "你要出名了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [412]
				{
					["type"] = 1,
					["time"] = 1641826202,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [413]
				{
					["type"] = 1,
					["time"] = 1641826205,
					["from"] = "特变电工",
					["msg"] = "我一直都很出名",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [414]
				{
					["type"] = 1,
					["time"] = 1641826208,
					["from"] = "特变电工",
					["msg"] = "从N服的时候",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [415]
				{
					["type"] = 1,
					["time"] = 1641826218,
					["from"] = "特变电工",
					["msg"] = "部落红色通缉令",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [416]
				{
					["type"] = 1,
					["time"] = 1641826226,
					["from"] = "特变电工",
					["msg"] = "被20多人坑杀墓地",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [417]
				{
					["type"] = 1,
					["time"] = 1641826237,
					["from"] = "特变电工",
					["msg"] = "还塔小王子",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [418]
				{
					["type"] = 1,
					["time"] = 1641826245,
					["from"] = "特变电工",
					["msg"] = "哈哈哈",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [419]
				{
					["type"] = 1,
					["time"] = 1641826265,
					["from"] = "特变电工",
					["msg"] = "感觉R10都好难",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [420]
				{
					["type"] = 1,
					["time"] = 1641826272,
					["from"] = "特变电工",
					["msg"] = "我都想放弃了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [421]
				{
					["type"] = 1,
					["time"] = 1641826278,
					["from"] = "我给你跪下了",
					["msg"] = "现在刷的人太多了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [422]
				{
					["type"] = 1,
					["time"] = 1641826279,
					["from"] = "特变电工",
					["msg"] = "太难了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [423]
				{
					["type"] = 1,
					["time"] = 1641826282,
					["from"] = "我给你跪下了",
					["msg"] = "好多耍一天的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [424]
				{
					["type"] = 1,
					["time"] = 1641826291,
					["from"] = "我给你跪下了",
					["msg"] = "肯定刷不过",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [425]
				{
					["type"] = 1,
					["time"] = 1641826294,
					["from"] = "特变电工",
					["msg"] = "太内卷了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [426]
				{
					["type"] = 1,
					["time"] = 1641826298,
					["from"] = "特变电工",
					["msg"] = "感觉要找GZS了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [427]
				{
					["type"] = 1,
					["time"] = 1641826321,
					["from"] = "我给你跪下了",
					["msg"] = "R10有必要找吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [428]
				{
					["type"] = 1,
					["time"] = 1641826343,
					["from"] = "特变电工",
					["msg"] = "R10都到了 感觉不打R14有点血亏",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [429]
				{
					["type"] = 1,
					["time"] = 1641826366,
					["from"] = "我给你跪下了",
					["msg"] = "。。R14得找GS",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [430]
				{
					["type"] = 1,
					["time"] = 1641826369,
					["from"] = "我给你跪下了",
					["msg"] = "GZS",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [431]
				{
					["type"] = 1,
					["time"] = 1641826370,
					["from"] = "特变电工",
					["msg"] = "我去问下R14多少R",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [432]
				{
					["type"] = 1,
					["time"] = 1641826373,
					["from"] = "我给你跪下了",
					["msg"] = "一个人真不行",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [433]
				{
					["type"] = 1,
					["time"] = 1641826401,
					["from"] = "我给你跪下了",
					["msg"] = "你认识GZS？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [434]
				{
					["type"] = 1,
					["time"] = 1641826415,
					["from"] = "特变电工",
					["msg"] = "淘宝问下就知道了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [435]
				{
					["type"] = 1,
					["time"] = 1641826433,
					["from"] = "我给你跪下了",
					["msg"] = "估计要几万",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [436]
				{
					["type"] = 1,
					["time"] = 1641826508,
					["from"] = "特变电工",
					["msg"] = "蛋疼了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [437]
				{
					["type"] = 1,
					["time"] = 1641827349,
					["from"] = "我给你跪下了",
					["msg"] = "弄会别的 先撤了我",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [438]
				{
					["type"] = 1,
					["time"] = 1641827355,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [439]
				{
					["type"] = 1,
					["time"] = 1641827356,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [440]
				{
					["type"] = 1,
					["time"] = 1641829312,
					["from"] = "特变电工",
					["msg"] = "想通了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [441]
				{
					["type"] = 1,
					["time"] = 1641829330,
					["from"] = "我给你跪下了",
					["msg"] = "？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [442]
				{
					["type"] = 1,
					["time"] = 1641829574,
					["from"] = "特变电工",
					["msg"] = "不刷了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [443]
				{
					["type"] = 1,
					["time"] = 1641829579,
					["from"] = "特变电工",
					["msg"] = "我觉得R10没啥乱用",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [444]
				{
					["type"] = 1,
					["time"] = 1641829583,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [445]
				{
					["type"] = 1,
					["time"] = 1641829583,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 差不多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [446]
				{
					["type"] = 1,
					["time"] = 1641829589,
					["from"] = "特变电工",
					["msg"] = "太累了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [447]
				{
					["type"] = 1,
					["time"] = 1641829594,
					["from"] = "特变电工",
					["msg"] = "我这几天心力交瘁",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [448]
				{
					["type"] = 1,
					["time"] = 1641829595,
					["from"] = "我给你跪下了",
					["msg"] = "还一个月黑翼了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [449]
				{
					["type"] = 1,
					["time"] = 1641829599,
					["from"] = "我给你跪下了",
					["msg"] = "装备比R10hao",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [450]
				{
					["type"] = 1,
					["time"] = 1641829602,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [451]
				{
					["type"] = 1,
					["time"] = 1641829605,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [452]
				{
					["type"] = 1,
					["time"] = 1641829614,
					["from"] = "我给你跪下了",
					["msg"] = "跟R13比也差不了几个",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [453]
				{
					["type"] = 1,
					["time"] = 1641829619,
					["from"] = "我给你跪下了",
					["msg"] = "所以确实没必要",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [454]
				{
					["type"] = 1,
					["time"] = 1641829630,
					["from"] = "特变电工",
					["msg"] = "TAQ T2.5 全力以赴",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [455]
				{
					["type"] = 1,
					["time"] = 1641829635,
					["from"] = "特变电工",
					["msg"] = "拿了去奥山砍人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [456]
				{
					["type"] = 1,
					["time"] = 1641829659,
					["from"] = "我给你跪下了",
					["msg"] = "现在拿个削骨 战场碰见R13照样砍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [457]
				{
					["type"] = 1,
					["time"] = 1641829669,
					["from"] = "特变电工",
					["msg"] = "橙锤",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [458]
				{
					["type"] = 1,
					["time"] = 1641829689,
					["from"] = "我给你跪下了",
					["msg"] = "橙锤几率小啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [459]
				{
					["type"] = 1,
					["time"] = 1641829701,
					["from"] = "我给你跪下了",
					["msg"] = "开黑翼拿AL",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [460]
				{
					["type"] = 1,
					["time"] = 1641829718,
					["from"] = "我给你跪下了",
					["msg"] = "R10确实没必要",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [461]
				{
					["type"] = 1,
					["time"] = 1641831503,
					["from"] = "特变电工",
					["msg"] = "双倍结束了把",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [462]
				{
					["type"] = 1,
					["time"] = 1641831520,
					["from"] = "特变电工",
					["msg"] = "突然好无聊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [463]
				{
					["type"] = 1,
					["time"] = 1641831539,
					["from"] = "我给你跪下了",
					["msg"] = "。。早点休息 明天开始新目标",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [464]
				{
					["type"] = 1,
					["time"] = 1641833411,
					["from"] = "特变电工",
					["msg"] = "我直接打阿拉希和战歌了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [465]
				{
					["type"] = 1,
					["time"] = 1641833417,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [466]
				{
					["type"] = 1,
					["time"] = 1641833419,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:22672::::::::60:::::::::|h[哨兵的板甲护腿]|h|r|cffa335ee|Hitem:19578::::::::60:::::::::|h[狂暴者护腕]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [467]
				{
					["type"] = 1,
					["time"] = 1641833435,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:16479::::::::60:::::::::|h[统帅的板甲护腿]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [468]
				{
					["type"] = 1,
					["time"] = 1641909415,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [469]
				{
					["type"] = 1,
					["time"] = 1641909422,
					["from"] = "特变电工",
					["msg"] = "我打战歌 阿拉希好玩",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [470]
				{
					["type"] = 1,
					["time"] = 1641914487,
					["from"] = "特变电工",
					["msg"] = "阿拉希 战歌 奥山 牌子一起交",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [471]
				{
					["type"] = 1,
					["time"] = 1641914500,
					["from"] = "我给你跪下了",
					["msg"] = "有啥用",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [472]
				{
					["type"] = 1,
					["time"] = 1641914508,
					["from"] = "特变电工",
					["msg"] = "荣誉杠杠的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [473]
				{
					["type"] = 1,
					["time"] = 1641914537,
					["from"] = "我给你跪下了",
					["msg"] = "多少",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [474]
				{
					["type"] = 1,
					["time"] = 1641915828,
					["from"] = "特变电工",
					["msg"] = "2450",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [475]
				{
					["type"] = 1,
					["time"] = 1641915840,
					["from"] = "特变电工",
					["msg"] = "三线作战",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [476]
				{
					["type"] = 1,
					["time"] = 1641915842,
					["from"] = "特变电工",
					["msg"] = "荣誉起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [477]
				{
					["type"] = 1,
					["time"] = 1641915846,
					["from"] = "特变电工",
					["msg"] = "奥山不行",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [478]
				{
					["type"] = 1,
					["time"] = 1641917999,
					["from"] = "特变电工",
					["msg"] = "战歌好好玩",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [479]
				{
					["type"] = 1,
					["time"] = 1641918000,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [480]
				{
					["type"] = 1,
					["time"] = 1641918002,
					["from"] = "特变电工",
					["msg"] = "一群砍人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [481]
				{
					["type"] = 1,
					["time"] = 1641918047,
					["from"] = "我给你跪下了",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [482]
				{
					["type"] = 1,
					["time"] = 1641998979,
					["from"] = "特变电工",
					["msg"] = "111",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [483]
				{
					["type"] = 1,
					["time"] = 1641998981,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [484]
				{
					["type"] = 1,
					["time"] = 1641999147,
					["from"] = "我给你跪下了",
					["msg"] = "没双倍每把都坑",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [485]
				{
					["type"] = 1,
					["time"] = 1641999154,
					["from"] = "特变电工",
					["msg"] = "..",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [486]
				{
					["type"] = 1,
					["time"] = 1641999159,
					["from"] = "特变电工",
					["msg"] = "我在战歌起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [487]
				{
					["type"] = 1,
					["time"] = 1642000876,
					["from"] = "特变电工",
					["msg"] = "坑惨了啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [488]
				{
					["type"] = 1,
					["time"] = 1642000890,
					["from"] = "特变电工",
					["msg"] = "打战歌阿拉希一小时有8000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [489]
				{
					["type"] = 1,
					["time"] = 1642000892,
					["from"] = "特变电工",
					["msg"] = "还不错啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [490]
				{
					["type"] = 1,
					["time"] = 1642000930,
					["from"] = "我给你跪下了",
					["msg"] = "挺多的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [491]
				{
					["type"] = 1,
					["time"] = 1642086233,
					["from"] = "特变电工",
					["msg"] = "R7",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [492]
				{
					["type"] = 1,
					["time"] = 1642086246,
					["from"] = "我给你跪下了",
					["msg"] = "嗯 R8以后难",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [493]
				{
					["type"] = 1,
					["time"] = 1642086350,
					["from"] = "特变电工",
					["msg"] = "昨天一个大元帅战士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [494]
				{
					["type"] = 1,
					["time"] = 1642086355,
					["from"] = "特变电工",
					["msg"] = "完全不是我的对手",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [495]
				{
					["type"] = 1,
					["time"] = 1642086407,
					["from"] = "我给你跪下了",
					["msg"] = "是吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [496]
				{
					["type"] = 1,
					["time"] = 1642086411,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [497]
				{
					["type"] = 1,
					["time"] = 1642086422,
					["from"] = "特变电工",
					["msg"] = "直接一个缴械 他就死了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [498]
				{
					["type"] = 1,
					["time"] = 1642086429,
					["from"] = "我给你跪下了",
					["msg"] = "牛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [499]
				{
					["type"] = 1,
					["time"] = 1642086434,
					["from"] = "特变电工",
					["msg"] = "都不附魔武器链",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [500]
				["info"] = {
				},
			},
			["豚杆"] = {
				{
					["type"] = 1,
					["time"] = 1641998980,
					["from"] = "豚杆",
					["msg"] = "我想问你个问题",
					["inbound"] = true,
					["convo"] = "豚杆",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641998986,
					["from"] = "特变电工",
					["msg"] = "啥",
					["inbound"] = false,
					["convo"] = "豚杆",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641999012,
					["from"] = "豚杆",
					["msg"] = "海狗永不为奴是不是也是你呀。",
					["inbound"] = true,
					["convo"] = "豚杆",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641999023,
					["from"] = "特变电工",
					["msg"] = "？",
					["inbound"] = false,
					["convo"] = "豚杆",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641999034,
					["from"] = "特变电工",
					["msg"] = "不认识",
					["inbound"] = false,
					["convo"] = "豚杆",
				}, -- [5]
				["info"] = {
				},
			},
			["萌萌灰#51759"] = {
				{
					["type"] = 1,
					["time"] = 1641308324,
					["from"] = "特变电工",
					["msg"] = "|Hitem:18423::::::::60:::::::::|h[奥妮克希亚的头颅]|h",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641308340,
					["from"] = "特变电工",
					["msg"] = "270R",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641308348,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641308351,
					["from"] = "萌萌灰#51759",
					["msg"] = "来正式服啊",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [4]
				["info"] = {
				},
			},
			["戒之在灶"] = {
				{
					["type"] = 1,
					["time"] = 1641037647,
					["from"] = "特变电工",
					["msg"] = "组我下",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641037649,
					["from"] = "特变电工",
					["msg"] = "换个位面",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641037659,
					["from"] = "特变电工",
					["msg"] = "3Q",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641037671,
					["from"] = "戒之在灶",
					["msg"] = "我在战场 组到你了么",
					["inbound"] = true,
					["convo"] = "戒之在灶",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641037677,
					["from"] = "特变电工",
					["msg"] = "组到了",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [5]
				["info"] = {
				},
			},
			["求心"] = {
				{
					["type"] = 1,
					["time"] = 1641622145,
					["from"] = "特变电工",
					["msg"] = "好啊",
					["inbound"] = false,
					["convo"] = "求心",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641622181,
					["from"] = "特变电工",
					["msg"] = "小德T0.5如何",
					["inbound"] = false,
					["convo"] = "求心",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641622194,
					["from"] = "特变电工",
					["msg"] = "战士T0.5 跟R10差不多",
					["inbound"] = false,
					["convo"] = "求心",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641622196,
					["from"] = "求心",
					["msg"] = "不如R10，",
					["inbound"] = true,
					["convo"] = "求心",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641622207,
					["from"] = "求心",
					["msg"] = "战场有个移动加成",
					["inbound"] = true,
					["convo"] = "求心",
				}, -- [5]
				["info"] = {
				},
			},
			["小哥"] = {
				{
					["type"] = 1,
					["time"] = 1641651608,
					["from"] = "特变电工",
					["msg"] = "1",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [1]
				["info"] = {
				},
			},
			["茅台酒"] = {
				{
					["type"] = 1,
					["time"] = 1640952445,
					["from"] = "特变电工",
					["msg"] = "今年结账了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640955697,
					["from"] = "茅台酒",
					["msg"] = "嗯 赚了多少G",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640955704,
					["from"] = "茅台酒",
					["msg"] = "RMB",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640955718,
					["from"] = "特变电工",
					["msg"] = "160",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640955728,
					["from"] = "茅台酒",
					["msg"] = "可以",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640955735,
					["from"] = "特变电工",
					["msg"] = "最高280",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640955756,
					["from"] = "茅台酒",
					["msg"] = "可以在游戏里面当思聪了",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640955810,
					["from"] = "特变电工",
					["msg"] = "准备拿1%收益",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640955824,
					["from"] = "茅台酒",
					["msg"] = "不明白",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640955849,
					["from"] = "特变电工",
					["msg"] = "拿0.5%收益在魔兽消费",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640955858,
					["from"] = "茅台酒",
					["msg"] = "用不完",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640955890,
					["from"] = "特变电工",
					["msg"] = "明年的目标是1000",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640955897,
					["from"] = "特变电工",
					["msg"] = "A股600 美股400",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640955911,
					["from"] = "特变电工",
					["msg"] = "因为是复利",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640955926,
					["from"] = "特变电工",
					["msg"] = "越到后面越猛",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640955944,
					["from"] = "特变电工",
					["msg"] = "A股特工48 美股wish 30 phun 30",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640955961,
					["from"] = "特变电工",
					["msg"] = "我说的是股价",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640955970,
					["from"] = "特变电工",
					["msg"] = "茅台800",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132493,
					["from"] = "特变电工",
					["msg"] = "我已经彻底毕业了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132506,
					["from"] = "茅台酒",
					["msg"] = "厉害",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641187162,
					["from"] = "特变电工",
					["msg"] = "t0.5我都做完了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641187174,
					["from"] = "茅台酒",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641187175,
					["from"] = "特变电工",
					["msg"] = "30次DK 10次通灵 10次黑上 各种任务",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641187180,
					["from"] = "特变电工",
					["msg"] = "爽",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641187186,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641187195,
					["from"] = "特变电工",
					["msg"] = "PVP神器",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641187209,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [27]
				["info"] = {
				},
			},
			["小铃噹"] = {
				{
					["type"] = 1,
					["time"] = 1641053130,
					["from"] = "特变电工",
					["msg"] = "我才打完台服TBC 繁字体",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641053138,
					["from"] = "小铃噹",
					["msg"] = "額。。。。",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641053145,
					["from"] = "特变电工",
					["msg"] = "你为啥打繁体字",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641053158,
					["from"] = "小铃噹",
					["msg"] = "電腦如此，，，，",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641053162,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641053177,
					["from"] = "特变电工",
					["msg"] = "我有湾湾朋友想玩国服 卡实名。。",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641053197,
					["from"] = "小铃噹",
					["msg"] = "額",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [7]
				["info"] = {
				},
			},
		},
	},
}
WIM3_ChatFilters = {
}
WIM3_Alias = nil
