
WIM3_Data = {
	["escapeToHide"] = true,
	["hoverLinks"] = false,
	["pop_rules"] = {
		["whisper"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = true,
			["resting"] = {
				["keepfocus"] = true,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = true,
				["onReceive"] = true,
			},
			["alwaysOther"] = false,
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
		},
		["chat"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["bn"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = false,
			["resting"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["alwaysOther"] = true,
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
		},
	},
	["timeStampFormat"] = "%H:%M",
	["windowAlpha"] = 80,
	["sounds"] = {
		["force_game_sound"] = false,
		["whispers"] = {
			["msgout_sml"] = "IM",
			["msgout"] = false,
			["guild"] = false,
			["bnet_sml"] = "IM",
			["msgin_sml"] = "IM",
			["msgin"] = true,
			["friend_sml"] = "IM",
			["guild_sml"] = "IM",
			["bnet"] = false,
			["friend"] = false,
		},
		["chat"] = {
			["msgout_sml"] = "Chat Blip",
			["msgout"] = false,
			["world_sml"] = "Chat Blip",
			["msgin_sml"] = "Chat Blip",
			["msgin"] = true,
			["party_sml"] = "Chat Blip",
			["custom_sml"] = "Chat Blip",
			["say_sml"] = "Chat Blip",
			["raid_sml"] = "Chat Blip",
			["raidleader_sml"] = "Chat Blip",
			["officer_sml"] = "Chat Blip",
			["guild_sml"] = "Chat Blip",
			["battlegroundleader_sml"] = "Chat Blip",
			["battleground_sml"] = "Chat Blip",
		},
	},
	["formatting"] = {
		["bracketing"] = {
			["enabled"] = true,
			["type"] = 1,
		},
	},
	["keepFocusRested"] = true,
	["wordwrap_indent"] = false,
	["enabled"] = true,
	["keepFocus"] = true,
	["alertedPrivateServer"] = false,
	["autoFocus"] = false,
	["winCascade"] = {
		["enabled"] = true,
		["direction"] = 8,
	},
	["lastState"] = "other",
	["displayColors"] = {
		["wispOut"] = {
			["b"] = 0.9882352941176471,
			["g"] = 0.0784313725490196,
			["r"] = 1,
		},
		["wispIn"] = {
			["b"] = 0.7607843137254902,
			["g"] = 0.03137254901960784,
			["r"] = 0.5607843137254902,
		},
		["sysMsg"] = {
			["b"] = 0,
			["g"] = 0.6627450980392157,
			["r"] = 1,
		},
		["BNwispOut"] = {
			["b"] = 1,
			["g"] = 0.6352941176470588,
			["r"] = 0.1725490196078431,
		},
		["historyIn"] = {
			["b"] = 0.4705882352941176,
			["g"] = 0.4705882352941176,
			["r"] = 0.4705882352941176,
		},
		["errorMsg"] = {
			["b"] = 0,
			["g"] = 0,
			["r"] = 1,
		},
		["webAddress"] = {
			["b"] = 1,
			["g"] = 1,
			["r"] = 1,
		},
		["BNwispIn"] = {
			["b"] = 0.6549019607843137,
			["g"] = 0.4862745098039216,
			["r"] = 0,
		},
		["historyOut"] = {
			["b"] = 0.7058823529411764,
			["g"] = 0.7058823529411764,
			["r"] = 0.7058823529411764,
		},
		["useSkin"] = true,
	},
	["fontSize"] = 12,
	["showToolTips"] = true,
	["minimap"] = {
		["free_position"] = {
			["y"] = -119.9890033406945,
			["x"] = -161.5500472187982,
			["point"] = "TOPRIGHT",
		},
		["free"] = false,
		["rightClickNew"] = false,
		["position"] = 200,
	},
	["winAnimation"] = true,
	["expose"] = {
		["protect"] = 1,
		["borderSize"] = 20,
		["combat"] = true,
		["groupOnly"] = false,
		["border"] = false,
		["direction"] = 1,
	},
	["alias"] = {
		["title_string"] = "{n} - {a}",
	},
	["menuSortActivity"] = true,
	["whoLookups"] = true,
	["modules"] = {
		["ChatSounds"] = {
			["enabled"] = true,
		},
		["ShortcutBar"] = {
			["enabled"] = true,
		},
		["Emoticons"] = {
			["enabled"] = true,
		},
		["ChatAlerts"] = {
			["enabled"] = true,
		},
		["Sounds"] = {
			["enabled"] = true,
		},
		["Expose"] = {
			["enabled"] = true,
		},
		["WhisperEngine"] = {
			["enabled"] = true,
		},
		["MinimapIcon"] = {
			["enabled"] = true,
		},
		["TimeStamps"] = {
			["enabled"] = true,
		},
		["OffScreenTracker"] = {
			["enabled"] = true,
		},
		["History"] = {
			["enabled"] = true,
		},
		["LDB"] = {
			["enabled"] = true,
		},
		["URLHandler"] = {
			["enabled"] = true,
		},
		["Tabs"] = {
			["enabled"] = true,
		},
		["ClickControl"] = {
			["enabled"] = true,
		},
		["Menu"] = {
			["enabled"] = true,
		},
		["Filters"] = {
			["enabled"] = true,
		},
	},
	["chat"] = {
		["bn"] = {
			["showAlerts"] = true,
		},
		["guild"] = {
			["showAlerts"] = true,
		},
		["party"] = {
			["showAlerts"] = true,
		},
		["custom"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
		["say"] = {
		},
		["battleground"] = {
		},
		["raid"] = {
			["showAlerts"] = true,
		},
		["officer"] = {
			["showAlerts"] = true,
		},
		["world"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
	},
	["ClickControl"] = {
		["clickSensitivity"] = 0.2,
	},
	["tabs"] = {
		["sortBy"] = 2,
		["whispers"] = {
			["enabled"] = false,
			["guild"] = false,
			["friends"] = false,
		},
		["chat"] = {
			["enabled"] = false,
			["aswhisper"] = false,
		},
	},
	["history"] = {
		["ageLimit"] = true,
		["previewCount"] = 25,
		["maxPer"] = true,
		["whispers"] = {
			["friends"] = true,
			["all"] = false,
			["guild"] = true,
		},
		["maxAge"] = 1209600,
		["preview"] = true,
		["maxCount"] = 500,
		["chat"] = {
			["ageLimit"] = true,
			["maxAge"] = 1209600,
			["previewCount"] = 25,
			["preview"] = true,
			["maxCount"] = 500,
			["maxPer"] = true,
		},
	},
	["skin"] = {
		["font_outline"] = "",
		["selected"] = "WIM Classic",
		["font"] = "ChatFontNormal",
		["suggest"] = true,
	},
	["winFade"] = true,
	["stats"] = {
		["startDate"] = "",
		["versions"] = 1,
		["whispers"] = 0,
		["mostConvos"] = 0,
	},
	["clampToScreen"] = true,
	["winLoc"] = {
		["left"] = 217,
		["top"] = 664,
	},
	["coloredNames"] = true,
	["ignoreArrowKeys"] = true,
	["tabAdvance"] = false,
	["windowOnTop"] = true,
	["winSize"] = {
		["height"] = 220,
		["strata"] = "DIALOG",
		["scale"] = 100,
		["width"] = 333,
	},
}
WIM3_Cache = {
	["鱼人摩洛克"] = {
		["Dwac"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["|Kq22|k"] = 2,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq3|k"] = 2,
				["|Kq23|k"] = 2,
				["|Kq1|k"] = 2,
				["|Kq11|k"] = 2,
				["|Kq17|k"] = 2,
				["|Kq14|k"] = 2,
				["|Kq18|k"] = 2,
				["|Kq8|k"] = 2,
				["|Kq21|k"] = 2,
				["|Kq4|k"] = 2,
				["|Kq20|k"] = 2,
				["|Kq13|k"] = 2,
				["|Kq15|k"] = 2,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["|Kq16|k"] = 2,
				["|Kq5|k"] = 2,
			},
		},
		["特变电工"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["雪中飞"] = 1,
				["|Kq16|k"] = 2,
				["姞青"] = 1,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq5|k"] = 2,
				["|Kq23|k"] = 2,
				["审判"] = 1,
				["命不由天定"] = 1,
				["茅台酒"] = 1,
				["|Kq18|k"] = 2,
				["幽雅"] = 1,
				["面包一箩筐"] = 1,
				["阡祈"] = 1,
				["神奇灬女侠"] = 1,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["战山河"] = 1,
				["灬鳯灬"] = 1,
				["云江月"] = 1,
				["Sylvania"] = 1,
				["|Kq15|k"] = 2,
				["|Kq1|k"] = 2,
				["|Kq8|k"] = 2,
				["|Kq3|k"] = 2,
				["|Kq17|k"] = 2,
				["Alei"] = 1,
				["|Kq22|k"] = 2,
				["卡卡汐"] = 1,
				["盖伦的小宝剑"] = 1,
				["|Kq20|k"] = 2,
				["|Kq4|k"] = 2,
				["|Kq21|k"] = 2,
				["我给你跪下了"] = 1,
				["挖煤的小伙伴"] = 1,
				["|Kq13|k"] = 2,
				["戒之在灶"] = 1,
				["|Kq11|k"] = 2,
				["|Kq14|k"] = 2,
				["冯一刀"] = 1,
				["社区送温暖"] = 1,
				["阿摇"] = 1,
			},
			["guildList"] = {
				["白酒壹斤半"] = 237,
				["大夫"] = 169,
				["随机起名字"] = 841,
				["丨悟空丶"] = 19,
				["团长没了"] = 276,
				["水牛奶丶"] = 142,
				["丹莫罗的風"] = 112,
				["豆蔻梢头"] = 819,
				["道道盗盗到"] = 217,
				["霜术"] = 110,
				["管泽元"] = 777,
				["丢丢大魔王"] = 180,
				["呆呆的贼丶"] = 256,
				["垫脚亲亲你"] = 192,
				["一朵小红花"] = 349,
				["熊壮壮"] = 739,
				["沐萌"] = 166,
				["呆萌兔子"] = 216,
				["择主而事"] = 140,
				["九针"] = 520,
				["森类滴话"] = 918,
				["大鸟不会飞"] = 157,
				["不要插嘴"] = 366,
				["吾家有小哥"] = 889,
				["魔幻使者"] = 856,
				["断肠人"] = 665,
				["丧丨彪"] = 512,
				["听话"] = 561,
				["胖小德"] = 795,
				["妮妹"] = 610,
				["萌萌大鲸鱼"] = 160,
				["毛头超鱼水"] = 712,
				["Playeriuwur"] = 496,
				["杀戮梦魇"] = 688,
				["神行百变"] = 167,
				["十二宫"] = 23,
				["胖小圣骑"] = 794,
				["茶恬恬"] = 804,
				["箫声咽"] = 778,
				["克洛普"] = 203,
				["罗小牧"] = 787,
				["身法有一套"] = 950,
				["加百利"] = 550,
				["菜菜騒丶"] = 943,
				["米莱狄"] = 781,
				["夜幕祈祷"] = 584,
				["哎呦不错噢"] = 288,
				["无面者"] = 671,
				["馒头仔"] = 50,
				["怒帕拉丁"] = 58,
				["清扬骑士"] = 729,
				["知麻膏"] = 766,
				["三岁会撩妹"] = 18,
				["某某"] = 60,
				["安黛尔"] = 107,
				["北嶋流年"] = 551,
				["溟沧之御"] = 476,
				["子木子也"] = 8,
				["风涧芯"] = 959,
				["Tenveo"] = 499,
				["飞丶"] = 854,
				["小刀手"] = 95,
				["丶青衫"] = 517,
				["夜空的流星"] = 129,
				["毛毛猪"] = 920,
				["牛牛妞"] = 284,
				["司徒小秘"] = 71,
				["不空君"] = 227,
				["唔喺哎木啼"] = 25,
				["東风"] = 915,
				["麦子大叔"] = 860,
				["Diong"] = 863,
				["修玛丶"] = 528,
				["七彩雲飘飘"] = 507,
				["加摩尔丶"] = 190,
				["风涧德"] = 9,
				["塞北第一法"] = 893,
				["鯊魚哥"] = 857,
				["Meinv"] = 491,
				["海底捞"] = 385,
				["小护士"] = 624,
				["流浪喵"] = 720,
				["流浪"] = 154,
				["王权没有永恒"] = 752,
				["疯狂小法"] = 758,
				["Malahidiel"] = 218,
				["地獄之花"] = 232,
				["羽风"] = 939,
				["夏夜浅酌"] = 70,
				["珈百璃"] = 754,
				["微光角落"] = 205,
				["爆炸小拿铁"] = 456,
				["神教教主"] = 770,
				["土豆粉"] = 576,
				["农民在杀鱼"] = 90,
				["女武神之殇"] = 197,
				["蒸籽蛋"] = 945,
				["牛海王"] = 135,
				["护叔乂宝"] = 282,
				["开水"] = 639,
				["王丶兰花"] = 77,
				["圣光会脏死你"] = 138,
				["桐秋"] = 695,
				["朝思暮想"] = 686,
				["空之境界"] = 449,
				["诱歼小红帽丶"] = 347,
				["朝先"] = 910,
				["雁塔牛铁蛋"] = 79,
				["萌丶小鬼"] = 93,
				["亚巴顿"] = 879,
				["诗雨"] = 817,
				["萌萌大鲨鱼"] = 103,
				["祝大常"] = 158,
				["天地乖离"] = 594,
				["残梦"] = 705,
				["夜班保安"] = 586,
				["桑塔纳"] = 696,
				["莫待季"] = 198,
				["飞翔中的明明"] = 120,
				["跳跳乃波万"] = 179,
				["坦克泡泡"] = 892,
				["Shadanz"] = 966,
				["古月"] = 967,
				["要求相信接受"] = 417,
				["Sakura"] = 867,
				["Paa"] = 866,
				["没茅台"] = 717,
				["密斯酷"] = 898,
				["江城第一深情"] = 922,
				["安格玛污王"] = 295,
				["风涧牧"] = 11,
				["台州丶大潘"] = 287,
				["雷达网带鱼"] = 275,
				["咕噜姆"] = 132,
				["风掣"] = 48,
				["芜湖小司马"] = 797,
				["天公不作美"] = 593,
				["欧吉桑"] = 371,
				["带血的眼泪"] = 298,
				["丨残丶箭丨"] = 873,
				["Kouki"] = 380,
				["雷锋叔叔"] = 848,
				["超毛分水鱼"] = 824,
				["漫步雨落"] = 734,
				["雪山忆思缘"] = 846,
				["吉安纳丨语风"] = 168,
				["Torr"] = 16,
				["丁香枝上"] = 506,
				["阿摇"] = 955,
				["凉森婈梦"] = 91,
				["雨天的彩虹"] = 844,
				["丿叶光寒"] = 125,
				["一页书叔"] = 162,
				["张子枫"] = 182,
				["我的月亮"] = 35,
				["莼蓝色"] = 46,
				["夜风凛凛丶"] = 362,
				["紫衣云梦"] = 783,
				["劝君秃鸡"] = 549,
				["白小腰"] = 42,
				["丶大江东去"] = 419,
				["射手不太行"] = 620,
				["腥辰"] = 796,
				["郑俗人"] = 831,
				["暴躁的小笼包"] = 679,
				["呐个矮子法"] = 184,
				["冲锋在右"] = 475,
				["说的好"] = 818,
				["汉唐"] = 39,
				["重拾山河"] = 834,
				["Agile"] = 479,
				["木公子"] = 165,
				["团队支柱"] = 147,
				["手一挥"] = 657,
				["丶雅木茶丶"] = 341,
				["伊心懿意"] = 524,
				["酒意入桃枝"] = 155,
				["天然莼丶"] = 597,
				["箭無虚髪"] = 779,
				["毒药贰"] = 305,
				["与德服人"] = 220,
				["狐狸麻糖"] = 746,
				["落晨"] = 225,
				["史莱姆"] = 556,
				["无须多言"] = 263,
				["瞄秂缝"] = 328,
				["叶神大叔"] = 121,
				["软炮炮"] = 226,
				["晓德德"] = 230,
				["沈奕琳"] = 716,
				["战争与和平"] = 969,
				["Aicc"] = 480,
				["护花使者"] = 661,
				["武冰"] = 704,
				["偏偏意气用事"] = 529,
				["黎明前的优雅"] = 156,
				["一葉知秋"] = 504,
				["千山暮雪"] = 400,
				["石沟权丶铠坚"] = 307,
				["找寻记忆"] = 660,
				["黑白影子"] = 161,
				["淡忘的时光"] = 357,
				["喔嚯"] = 891,
				["猫姐在寂寞"] = 749,
				["爱保健的浴霸"] = 741,
				["霜木"] = 66,
				["红发飘飘"] = 936,
				["二爷"] = 128,
				["来抓我呀"] = 690,
				["龘龖龍龖龘"] = 314,
				["叨锣酿帝"] = 252,
				["乐心"] = 519,
				["玉树临風"] = 250,
				["Thorin"] = 144,
				["一号技师"] = 869,
				["小雨儿"] = 627,
				["鬼画符"] = 343,
				["莫尛筱"] = 173,
				["术丶爷"] = 390,
				["卓玛"] = 231,
				["花落思量错"] = 941,
				["啊船"] = 259,
				["小怪"] = 623,
				["仙喵"] = 55,
				["丶白胡子法神"] = 516,
				["大豆"] = 262,
				["咿呀咿呀"] = 566,
				["永恒明月"] = 414,
				["汤姆哒哒"] = 88,
				["维斯特利"] = 242,
				["Rpen"] = 219,
				["帮主任"] = 635,
				["無糖"] = 228,
				["悍将孤影"] = 363,
				["埋骨残魂"] = 289,
				["姥田"] = 290,
				["甜甜的"] = 755,
				["南城旧事"] = 294,
				["三禾穆"] = 174,
				["微微一笑"] = 643,
				["布莱恩灬铜须"] = 139,
				["烈風"] = 367,
				["Rxl"] = 52,
				["空城"] = 403,
				["逍遥贼"] = 118,
				["超级小霸王"] = 948,
				["尸不过三"] = 631,
				["王大志"] = 751,
				["巴托里"] = 633,
				["神术妙法"] = 195,
				["你的老婆"] = 333,
				["菜菜德丶"] = 150,
				["昔日的侠客"] = 133,
				["小灬灬树"] = 318,
				["捌零玖零"] = 302,
				["盾牌猛击"] = 933,
				["美人杀"] = 788,
				["大芃熊"] = 462,
				["樂山大佛"] = 919,
				["微笑星星"] = 300,
				["Eastwood"] = 189,
				["牛小逼"] = 176,
				["牧贵妃"] = 10,
				["猎骑士"] = 325,
				["喝一碗甜甜圈"] = 570,
				["青衣缺德"] = 115,
				["哈宁"] = 890,
				["月色"] = 257,
				["泉哥二宝哥"] = 40,
				["菠萝怪"] = 944,
				["浅柔"] = 721,
				["督军山克"] = 763,
				["骚气贼"] = 51,
				["谷大川"] = 65,
				["简简单单丶"] = 775,
				["清澜"] = 224,
				["英雄漠"] = 398,
				["湖中"] = 733,
				["罗小宁"] = 309,
				["开心心"] = 163,
				["默然灬"] = 861,
				["狮驼居士"] = 235,
				["茉莉绿茶"] = 803,
				["伊本瓦利德"] = 332,
				["西厢娇客"] = 812,
				["我是小强"] = 383,
				["超级大黑狗"] = 253,
				["清风悠悠"] = 730,
				["岁月如歌"] = 452,
				["叶落苍穹"] = 557,
				["薇薇酱"] = 313,
				["你真高丶"] = 248,
				["土土士"] = 210,
				["卓尔"] = 286,
				["老九"] = 359,
				["步子大了"] = 323,
				["逐风而去"] = 829,
				["刘秀"] = 545,
				["非一般的炮台"] = 13,
				["康桑阿米达丶"] = 299,
				["单挑幼儿园"] = 204,
				["我不会奶不上"] = 652,
				["爱如空气"] = 41,
				["喵喵灬猫猫"] = 571,
				["法夜"] = 718,
				["战神赤"] = 384,
				["三级自爆卡车"] = 80,
				["比你跑的快"] = 709,
				["小笼包"] = 56,
				["钢丝套餐"] = 835,
				["今年二十八"] = 416,
				["兰兰"] = 533,
				["梅闻花"] = 917,
				["Jumbajump"] = 14,
				["麦丁"] = 208,
				["丘比特之枪"] = 511,
				["天降正義"] = 599,
				["振刀啊"] = 663,
				["冷月葬花魂"] = 22,
				["丶丶神"] = 514,
				["东哥丶"] = 209,
				["海岸"] = 723,
				["Adele"] = 862,
				["椰蓉面包"] = 698,
				["蛇七"] = 126,
				["樱桃子"] = 970,
				["白雪公主后妈"] = 364,
				["斯奎"] = 36,
				["不会唱歌的猫"] = 81,
				["帕斯卡"] = 96,
				["无敌暗影箭"] = 668,
				["嗷力给"] = 572,
				["超凶的"] = 240,
				["来玩啊有发票"] = 914,
				["凹凸撸凸凹"] = 191,
				["一九七九"] = 503,
				["灵魂之誓言"] = 324,
				["焦糖玛奇朵"] = 453,
				["魂殇"] = 402,
				["神之太烦"] = 365,
				["暮光星灵"] = 677,
				["位面灬天使"] = 21,
				["无敌治疗术"] = 670,
				["稳阿"] = 63,
				["袁阿满"] = 946,
				["Tough"] = 17,
				["姬战"] = 86,
				["虾撸相逢"] = 810,
				["别惹我"] = 547,
				["明月灬"] = 673,
				["石原莉奈"] = 397,
				["雨老爷"] = 845,
				["鱼肠剑"] = 859,
				["River"] = 381,
				["西西子"] = 815,
				["天降丷正義"] = 598,
				["电耗子"] = 756,
				["杰克信仰"] = 37,
				["护叔寶"] = 906,
				["丶初秋丶"] = 111,
				["永恒之王者"] = 715,
				["苏拉"] = 800,
				["酱油半咕咚"] = 832,
				["王一一"] = 358,
				["初恋丶"] = 546,
				["零缺嚸"] = 83,
				["Blessu"] = 388,
				["杰尼"] = 38,
				["箖鳩"] = 935,
				["四岁就很帅"] = 463,
				["猫头鹰密涅瓦"] = 748,
				["Naq"] = 494,
				["依然丶"] = 355,
				["戦鬥熋"] = 656,
				["只影向谁去"] = 554,
				["宝石蓝绿"] = 617,
				["Minipig"] = 98,
				["傲笑红尘"] = 474,
				["楚歌"] = 699,
				["烧锅炉"] = 265,
				["梦寻千古醉"] = 401,
				["气球"] = 713,
				["杰爷"] = 692,
				["欲眠"] = 702,
				["错了错了"] = 143,
				["重生之六哥哥"] = 953,
				["关一里姬"] = 293,
				["你爱吃香菜吗"] = 175,
				["水水更健康"] = 306,
				["春色未曾看丶"] = 675,
				["在你身后射箭"] = 455,
				["寻蝶舞沧海"] = 899,
				["妖言"] = 609,
				["牧马人"] = 927,
				["画画的贝贝"] = 757,
				["非诺"] = 958,
				["快剑格蕾"] = 647,
				["小肉墩"] = 32,
				["薰大圣"] = 199,
				["冰冷之泉"] = 279,
				["天啦你真高"] = 185,
				["含泪自愿加班"] = 213,
				["糖可爱"] = 782,
				["老歌丶"] = 44,
				["神圣道标"] = 292,
				["月墨夕寒"] = 909,
				["天堂在左"] = 895,
				["你行你来"] = 467,
				["魔龙灵宿"] = 963,
				["追忆丶小雪"] = 473,
				["黑索塔"] = 67,
				["忘了出门带刀"] = 646,
				["阿阮"] = 839,
				["那不是爱情"] = 830,
				["迷璐"] = 441,
				["雏田丿"] = 956,
				["大佛丶"] = 122,
				["莉村花"] = 805,
				["匣里龙吟"] = 221,
				["鱼人牧"] = 202,
				["伽利略"] = 151,
				["姬儿加蛋"] = 316,
				["开心的小脑斧"] = 638,
				["粉条天下"] = 346,
				["埃提耶什"] = 337,
				["潮汐海灵"] = 926,
				["小僵尸绿了"] = 249,
				["我是你们的神"] = 269,
				["希尔纳"] = 634,
				["Nicolekidman"] = 495,
				["海狗永不为奴"] = 725,
				["宝宝你在哪"] = 614,
				["永泰"] = 459,
				["淡淡的忧愁"] = 728,
				["莉莉德荣"] = 387,
				["烦恼即菩提"] = 737,
				["热带鱼"] = 267,
				["無情哈拉少"] = 283,
				["叶小菡"] = 229,
				["安斋灬拉拉"] = 345,
				["洪琻寶"] = 245,
				["一条皮皮虾"] = 382,
				["圣剑阿拉贡"] = 281,
				["夏虫不可语冰"] = 581,
				["开车不踩刹车"] = 181,
				["小时候的光"] = 469,
				["浩哥"] = 722,
				["悠闲的杀戮"] = 648,
				["追忆丶雪山"] = 952,
				["欧煌史迪仔"] = 351,
				["小黃人"] = 628,
				["小浪浪"] = 626,
				["暮色晚秋"] = 260,
				["剑梦灵心"] = 241,
				["日月之行"] = 672,
				["小哥"] = 900,
				["怀旧时间双绝"] = 206,
				["药王"] = 353,
				["Xxim"] = 868,
				["Elaina"] = 374,
				["无冷却"] = 666,
				["小猫打扑克"] = 901,
				["毒药多"] = 708,
				["起舞弄清影"] = 321,
				["标准近战猎"] = 916,
				["玩你个蛋"] = 753,
				["三只小德"] = 74,
				["小冰雨"] = 171,
				["红波浪"] = 938,
				["宝宝我在这"] = 615,
				["妖狐"] = 608,
				["若如初见"] = 477,
				["云隐鹤乡"] = 433,
				["紫涵"] = 308,
				["狮心斩杀者"] = 101,
				["叶知秋霜"] = 317,
				["阿姨爱吃肉"] = 119,
				["茅臺"] = 123,
				["法诗诗"] = 149,
				["人小能量大"] = 523,
				["无敌最俊朗丶"] = 669,
				["椰壳"] = 379,
				["奎托利亚"] = 602,
				["北美大内内"] = 420,
				["霸王爱上弓"] = 104,
				["鱼人木乃伊"] = 137,
				["一只沫沫"] = 124,
				["鄙人不善奔跑"] = 78,
				["孤舟"] = 29,
				["战山河"] = 905,
				["Whitegods"] = 971,
				["美娟"] = 790,
				["赵德嵀"] = 274,
				["丶大聪明"] = 515,
				["孜然"] = 611,
				["天才小熊猫"] = 595,
				["武林萌主"] = 304,
				["小七月"] = 234,
				["海贼丶小玉"] = 726,
				["八级大狂风丶"] = 532,
				["貂蝉姐姐"] = 947,
				["明德"] = 370,
				["老李来开会"] = 793,
				["甄姬爸浪"] = 340,
				["土豆忒好吃"] = 575,
				["白衣染霜华"] = 760,
				["塞北第一贼"] = 28,
				["法狂如雷"] = 719,
				["愤怒得小鸟"] = 247,
				["丶猪突猛进"] = 116,
				["习惯孤独"] = 521,
				["未媛"] = 465,
				["特效治疗"] = 744,
				["皇室节奏"] = 761,
				["牧遥"] = 61,
				["夜雨沁人心"] = 436,
				["笨果果丶"] = 774,
				["奈何以死惧之"] = 211,
				["豆芽丝"] = 178,
				["小养由基"] = 622,
				["四月私语"] = 574,
				["蔷薇之泪"] = 809,
				["米彩"] = 780,
				["熟悉的陌生人"] = 740,
				["四季大发财"] = 573,
				["宝石骑士"] = 618,
				["一神丶"] = 870,
				["啦拉拉"] = 569,
				["骑士水大叔"] = 395,
				["骑墙头"] = 69,
				["三二一"] = 375,
				["诺克萨斯"] = 377,
				["榕哥"] = 391,
				["里予"] = 833,
				["比目鱼吻"] = 710,
				["大徐州"] = 589,
				["顶天立地"] = 851,
				["苹果十四"] = 278,
				["吾皇"] = 563,
				["清扬小小牧"] = 89,
				["猎爹大魔王"] = 747,
				["刀手"] = 336,
				["唯一"] = 568,
				["咸州帝一法"] = 565,
				["中原大呲花"] = 513,
				["杜鹃花"] = 913,
				["帝王丶"] = 297,
				["伊莉莎丶"] = 105,
				["炮泡糖"] = 736,
				["Dragoncity"] = 486,
				["猎艳轰唇"] = 434,
				["黑色蕾丝"] = 201,
				["凤舞离殇"] = 543,
				["丶桃子"] = 874,
				["回归者帝陨"] = 26,
				["阿咘"] = 837,
				["大胡子钢须"] = 592,
				["夏洛不明"] = 193,
				["发光使我快乐"] = 553,
				["流水无痕"] = 923,
				["宝子"] = 613,
				["黑暗与黎明"] = 254,
				["星尘斗士"] = 194,
				["凛风丿"] = 541,
				["奥优给"] = 605,
				["普罗米修斯丶"] = 676,
				["千灬山"] = 887,
				["一粒沙"] = 871,
				["格罗米"] = 92,
				["宝石绿蓝"] = 616,
				["沐雨聆风"] = 207,
				["澳洲野玫瑰"] = 423,
				["林丷"] = 694,
				["我是垃圾"] = 97,
				["海鸟跟鱼相爱"] = 924,
				["别开呛我先跑"] = 389,
				["微醺人生"] = 413,
				["朕赦你无罪"] = 685,
				["木子又土"] = 912,
				["别打我扛不住"] = 886,
				["农村混血妞"] = 535,
				["胡二刀"] = 102,
				["小二上菜"] = 31,
				["想脱贫找阿姨"] = 350,
				["术绍岐黄"] = 408,
				["常驻力量谷"] = 636,
				["王子不是我"] = 450,
				["夜丶凌乱"] = 583,
				["吹风渠里冷"] = 24,
				["西索的牙"] = 814,
				["土鲁鲁"] = 187,
				["克拉雷特"] = 530,
				["乱羽"] = 268,
				["风涧落"] = 960,
				["可乐小浅"] = 555,
				["朝思暮欢"] = 911,
				["看门大爷"] = 934,
				["部落卡德甲"] = 399,
				["天水伯约"] = 596,
				["太阳的暖"] = 356,
				["波萝咪"] = 438,
				["狗茶"] = 117,
				["超级水宝宝"] = 949,
				["Dtfs"] = 487,
				["鹿鸣"] = 396,
				["不学巫术"] = 509,
				["雨人码头"] = 843,
				["杨十一"] = 691,
				["五更寒"] = 404,
				["古惑仔"] = 406,
				["上海三套房丶"] = 99,
				["小肥子"] = 130,
				["铁堡城主"] = 68,
				["潇瑟"] = 925,
				["椰子球"] = 697,
				["大狗警长"] = 591,
				["龙妹"] = 410,
				["是与非爱与恨"] = 430,
				["大帅哥"] = 588,
				["就此别过"] = 412,
				["Shurrik"] = 15,
				["槑槑呆槑槑"] = 701,
				["大漠映残阳"] = 590,
				["西克"] = 368,
				["Kele"] = 490,
				["耗子违之"] = 311,
				["白鷺"] = 62,
				["奔跑吧小卤蛋"] = 604,
				["凝霜"] = 542,
				["红叶丶"] = 937,
				["奶奶灰"] = 606,
				["大个一米八六"] = 587,
				["闻香识女人丶"] = 418,
				["美兹兹"] = 789,
				["罗晋"] = 172,
				["Cococoing"] = 484,
				["蘇察哈尔灿"] = 108,
				["小矮牧"] = 327,
				["龍叔"] = 3,
				["惹不起"] = 301,
				["红色幻刺"] = 786,
				["曦风"] = 421,
				["狂爆"] = 929,
				["丷乄丷"] = 518,
				["Cpg"] = 485,
				["凉雨初夏"] = 540,
				["牛莽夫"] = 743,
				["基努里维斯"] = 152,
				["擎天柱"] = 59,
				["安澜秀"] = 612,
				["憨憨的奶锤"] = 407,
				["汤姆克鲁斯"] = 422,
				["阿飘飘阿飘"] = 427,
				["Micoo"] = 492,
				["影沉寒水"] = 641,
				["基本無解"] = 580,
				["雪雨星風"] = 957,
				["山河无恙"] = 33,
				["小思林"] = 338,
				["德憨憨"] = 164,
				["沐羽橙风"] = 270,
				["竭尽所能"] = 773,
				["Amor"] = 481,
				["花非花梦非梦"] = 64,
				["醉红唇"] = 478,
				["圣光之子"] = 342,
				["小玲噹"] = 238,
				["不良熊"] = 510,
				["落地九八壳"] = 47,
				["琉璃"] = 930,
				["瞅你个熊色儿"] = 764,
				["繁星璀璨"] = 43,
				["牛海皇"] = 136,
				["红手套"] = 114,
				["肉佳馍"] = 45,
				["荊軻"] = 470,
				["瓦夫"] = 431,
				["清扬小德"] = 1,
				["刘三"] = 544,
				["甄丑"] = 931,
				["落葉滿長安"] = 373,
				["九江月"] = 432,
				["上山凯特"] = 170,
				["负饿贷"] = 821,
				["血暗影"] = 243,
				["柒天鲜活"] = 84,
				["小柒丿"] = 625,
				["天真无鞋"] = 896,
				["青丰"] = 849,
				["角色扮演"] = 320,
				["丷胖墩丷"] = 344,
				["血麒麟"] = 200,
				["公子不语"] = 376,
				["亿米八大长腿"] = 880,
				["消毒的风"] = 727,
				["布呐呐"] = 34,
				["李老师归来"] = 689,
				["喜欢妮"] = 94,
				["枕刀歌"] = 693,
				["尼哥"] = 437,
				["月小倩"] = 682,
				["五月天"] = 522,
				["皇家玛德里"] = 762,
				["大鱼海棠"] = 439,
				["用脸拉怪"] = 85,
				["火师战"] = 352,
				["竹取彝族"] = 239,
				["一箭破云"] = 361,
				["德天独厚"] = 645,
				["嗜血的米勒"] = 442,
				["此岸的风"] = 443,
				["圣光归来"] = 577,
				["风行"] = 444,
				["风尘女子"] = 446,
				["一米八四"] = 447,
				["攻其不备"] = 319,
				["Mx"] = 493,
				["清欢与酒"] = 264,
				["小馋"] = 4,
				["澳洲棒棒糖"] = 331,
				["山炮"] = 458,
				["水叶"] = 714,
				["天火天火"] = 148,
				["吸湮的鱼"] = 562,
				["Ex"] = 488,
				["百年老腰"] = 215,
				["莫惜花前醉"] = 466,
				["天神下凡"] = 468,
				["上允尢虍"] = 508,
				["每天都做梦"] = 706,
				["丁香花丶云起"] = 354,
				["咖啡沫"] = 564,
				["名将灬法"] = 558,
				["蓓蓓般强壮"] = 12,
				["捅尼付死"] = 908,
				["鬼迷"] = 962,
				["Arcane"] = 482,
				["剑舞丶丶魅影"] = 548,
				["大鱼吃小鱼"] = 460,
				["辛多雷怒火"] = 826,
				["卜贱卜散"] = 405,
				["天鹰翔星曲"] = 600,
				["Frozenkaipio"] = 489,
				["冯一刀"] = 538,
				["温柔帅哥"] = 731,
				["尘世行"] = 630,
				["自我催眠"] = 196,
				["洋葱肥牛飯"] = 134,
				["殺氣"] = 141,
				["圣潜德"] = 233,
				["马儿闯天涯"] = 855,
				["井星邦邦骑"] = 877,
				["木鱼戮"] = 687,
				["亚尔特留斯"] = 878,
				["小小酒缸"] = 296,
				["事过人迁"] = 876,
				["风涧骑"] = 49,
				["煜老爷"] = 738,
				["賽西施"] = 109,
				["潇乄飞"] = 440,
				["Alicephil"] = 127,
				["夜歌不带刀"] = 585,
				["兽仁战"] = 534,
				["谈谈理想"] = 329,
				["圣大力"] = 27,
				["随便的青枣"] = 840,
				["萌萌小猫咪"] = 177,
				["战不旋踵"] = 214,
				["作曲大师"] = 527,
				["Attacker"] = 483,
				["千亦丶刹"] = 552,
				["小伢"] = 621,
				["冰水雪碧"] = 271,
				["可爱屁"] = 255,
				["称职奶爸"] = 435,
				["少一个请字"] = 629,
				["卡米啦"] = 888,
				["艾因斯坦"] = 372,
				["小暮雪"] = 76,
				["减肥大王"] = 280,
				["特变电工"] = 928,
				["芝芝奶芙"] = 940,
				["橘子汽水"] = 425,
				["泽丶火"] = 392,
				["银叶草丶"] = 836,
				["贼嘻嘻"] = 823,
				["无忌哥哥"] = 667,
				["大胡子丶铜须"] = 445,
				["永远的驹迷"] = 153,
				["坏笑的天使"] = 579,
				["地里热瓜"] = 578,
				["德义双馨"] = 644,
				["审判"] = 30,
				["香蕉超人"] = 961,
				["钟正秋"] = 461,
				["Playerkpmdxk"] = 497,
				["峨眉居士"] = 632,
				["西门大脚"] = 816,
				["花解语蝴蝶"] = 799,
				["瞬间快感"] = 765,
				["老乡人"] = 394,
				["白色头像"] = 965,
				["一颗小虎牙"] = 505,
				["窃梦者"] = 159,
				["小丶法"] = 291,
				["小铃噹"] = 902,
				["Usop"] = 500,
				["花开如火"] = 277,
				["醉清风"] = 386,
				["伯爵"] = 525,
				["魅惑之箭"] = 360,
				["时间不等人"] = 6,
				["Resume"] = 378,
				["天赋是混"] = 272,
				["宽老三"] = 619,
				["零陵邢道荣"] = 847,
				["混乱风暴"] = 415,
				["冬天的柚子"] = 428,
				["庄亮亮"] = 637,
				["叫朕大郎"] = 146,
				["波波糖"] = 73,
				["荒野丶"] = 5,
				["開心心"] = 212,
				["花心儿大萝卜"] = 798,
				["中医疗法"] = 53,
				["冷言"] = 885,
				["强壯壯"] = 640,
				["多情"] = 968,
				["Necromastery"] = 330,
				["秦歌"] = 771,
				["贤斌珐师"] = 822,
				["潘西无情"] = 183,
				["心灵之美"] = 429,
				["甜甜糖"] = 932,
				["蛐蛐哥"] = 811,
				["银鞍照白马"] = 954,
				["灵梦丶小贼儿"] = 735,
				["丶晴天"] = 285,
				["执念"] = 448,
				["瓦丝琪"] = 236,
				["拟态"] = 662,
				["羽西"] = 792,
				["惊骑队长"] = 649,
				["花重锦官城"] = 472,
				["风脸小旋风"] = 853,
				["手抽筋了"] = 658,
				["濑亚美莉丷"] = 393,
				["莫奈"] = 942,
				["Heratl"] = 864,
				["复仇心切"] = 894,
				["我要开车了"] = 655,
				["Kaka"] = 865,
				["沈鱼"] = 223,
				["曲晓晓"] = 680,
				["暴哥"] = 678,
				["星落"] = 674,
				["趴趴熊"] = 825,
				["清风寒月"] = 261,
				["水泥一号"] = 258,
				["有丶绿"] = 683,
				["徐州小霸王"] = 642,
				["圣光奶你"] = 471,
				["趁虚而入"] = 369,
				["白神男青年"] = 964,
				["胡子乱了"] = 409,
				["楚记"] = 700,
				["君莫笑丨"] = 559,
				["破晓残月"] = 767,
				["学友"] = 100,
				["风华血月"] = 244,
				["夫子"] = 601,
				["联盟舰队司令"] = 451,
				["对了对了"] = 82,
				["我的头发呢"] = 653,
				["鱼人王多鱼"] = 858,
				["蓝色的丶大海"] = 808,
				["毛头分水鱼"] = 711,
				["追猫猫"] = 827,
				["慈悲喜舍"] = 650,
				["疯子捷哥"] = 273,
				["星华"] = 113,
				["唐十五"] = 567,
				["王小淘"] = 315,
				["快乐的胖子"] = 334,
				["丽娅怒风"] = 251,
				["群演百事可乐"] = 791,
				["牛攵"] = 742,
				["钕施主"] = 348,
				["呐个矮子牧"] = 2,
				["软泡泡"] = 951,
				["狂奔的蜗牛"] = 745,
				["四岁就很酷"] = 464,
				["葬爱灬野子"] = 312,
				["易烊千玺"] = 222,
				["天风"] = 322,
				["苦海种青莲"] = 802,
				["猫小烦"] = 750,
				["Wish"] = 501,
				["管我叫胖娇"] = 776,
				["谁也挡不了"] = 246,
				["何处不青山"] = 457,
				["社区扛把子"] = 768,
				["有事我先走"] = 684,
				["羽瑜"] = 310,
				["小树林见"] = 339,
				["正方形的圆"] = 703,
				["祖奶奶"] = 769,
				["冬天难熬"] = 537,
				["游人"] = 732,
				["稳稳的爱"] = 772,
				["弑神白起"] = 72,
				["丶苹果"] = 875,
				["吧唧"] = 560,
				["肉桂"] = 188,
				["豌豆尖尖"] = 131,
				["紫霄依韵丶"] = 784,
				["曹婴"] = 681,
				["乍见之欢"] = 20,
				["Xit"] = 502,
				["我瞅你像猪"] = 654,
				["其实很安静"] = 884,
				["每天都要玩"] = 707,
				["萬剣人踪灭"] = 806,
				["上单卧龙"] = 335,
				["奥义千年杀"] = 897,
				["打你吐血"] = 659,
				["西池未央"] = 813,
				["八佰狼"] = 531,
				["众神老王"] = 882,
				["發丶麦发啧"] = 759,
				["貓小烦"] = 820,
				["红三爷"] = 785,
				["澜雪"] = 426,
				["跳跳瓏"] = 424,
				["放鸽子的大猴"] = 664,
				["隐子猎手"] = 842,
				["凶残的光头"] = 7,
				["光阴荏苒"] = 145,
				["慵懒症"] = 651,
				["多听相声爱国"] = 582,
				["受伤丶小豆丁"] = 106,
				["剑剑锋"] = 266,
				["Skillet"] = 498,
				["张星彩"] = 904,
				["陌狄"] = 326,
				["拉怪劣人"] = 87,
				["一锅卤肉饭"] = 872,
				["奔波儿菲兹"] = 603,
				["元芳"] = 883,
				["黑白"] = 454,
				["休闲"] = 411,
				["仍是少年"] = 881,
				["苗战"] = 801,
				["韩跑跑"] = 850,
				["搞毛啊"] = 303,
				["向前冲呀"] = 186,
				["永恒灬圣骑"] = 921,
				["蒙塔基钢弹"] = 807,
				["就叫帅比吧丶"] = 903,
				["山月不知事"] = 57,
				["风礼"] = 852,
				["挥腊肠的女孩"] = 907,
				["冰火丶两重天"] = 539,
				["冬天熙雨"] = 536,
				["好逑"] = 607,
				["阿尔塞纳"] = 838,
				["依落花"] = 75,
				["似故人来"] = 526,
				["逃出绝命镇"] = 828,
				["井星邦邦"] = 54,
				["海是海洋的洋"] = 724,
			},
		},
	},
}
WIM3_Filters = {
	{
		"^OQ[,S]", -- [1]
		["enabled"] = true,
		["type"] = 1,
		["pattern"] = "^<T>PartyQuests[^A-Z]+\n^<M_N>\n^ItemDB-Request:\n^LVBM\n^YOU ARE BEING WATCHED!\n^YOU ARE MARKED!\n^YOU ARE CURSED!\n^YOU HAVE THE PLAGUE!\n^YOU ARE BURNING!\n^YOU ARE THE BOMB!\nVOLATILE INFECTION\n^/^GA[^A-Z]+\n^<METAMAP\n^<CT",
		["sent"] = true,
		["name"] = "由插件发送的悄悄话",
		["received"] = true,
		["action"] = 2,
		["stats"] = 0,
		["protected"] = true,
		["tag"] = "addons",
	}, -- [1]
	{
		["enabled"] = false,
		["type"] = 2,
		["action"] = 1,
		["friend"] = true,
		["party"] = true,
		["name"] = "悄悄话选择区1",
		["guild"] = true,
		["raid"] = true,
		["received"] = true,
		["stats"] = 0,
	}, -- [2]
	{
		["enabled"] = false,
		["type"] = 2,
		["name"] = "悄悄话选择区2",
		["action"] = 2,
		["all"] = true,
		["received"] = true,
		["stats"] = 0,
	}, -- [3]
}
WIM3_History = {
	["鱼人摩洛克"] = {
		["特变电工"] = {
			["吹风渠里冷"] = {
				{
					["type"] = 1,
					["time"] = 1640713157,
					["from"] = "吹风渠里冷",
					["msg"] = "1111",
					["inbound"] = true,
					["convo"] = "吹风渠里冷",
				}, -- [1]
				["info"] = {
				},
			},
			["吧唧"] = {
				{
					["type"] = 1,
					["time"] = 1641101826,
					["from"] = "特变电工",
					["msg"] = "毛的一手好伤害。。。",
					["inbound"] = false,
					["convo"] = "吧唧",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641101828,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "吧唧",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641101860,
					["from"] = "吧唧",
					["msg"] = "- -无尽黑暗不毛不合适",
					["inbound"] = true,
					["convo"] = "吧唧",
				}, -- [3]
				["info"] = {
				},
			},
			["无忌哥哥"] = {
				{
					["type"] = 1,
					["time"] = 1641131782,
					["from"] = "无忌哥哥",
					["msg"] = "你们通灵多久打完",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641131795,
					["from"] = "无忌哥哥",
					["msg"] = "我想去收个cd 做点药剂",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641131805,
					["from"] = "特变电工",
					["msg"] = "马上",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641131816,
					["from"] = "特变电工",
					["msg"] = "5分钟",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641131856,
					["from"] = "无忌哥哥",
					["msg"] = "好的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641131856,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 讲师玛丽希亚交战，（当前12%，5/5存活）",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641131859,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 讲师玛丽希亚的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641132015,
					["from"] = "特变电工",
					["msg"] = "来吗",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641132028,
					["from"] = "无忌哥哥",
					["msg"] = "来的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641132034,
					["from"] = "特变电工",
					["msg"] = "块",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641132034,
					["from"] = "无忌哥哥",
					["msg"] = "组我吧",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641132036,
					["from"] = "特变电工",
					["msg"] = "我要走了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641132040,
					["from"] = "无忌哥哥",
					["msg"] = "实验室那边的怪你打 了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641132057,
					["from"] = "无忌哥哥",
					["msg"] = "做药剂台子边上的那波 ",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641132067,
					["from"] = "特变电工",
					["msg"] = "不清楚哦",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641132068,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641132085,
					["from"] = "特变电工",
					["msg"] = "正常全通",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641132086,
					["from"] = "特变电工",
					["msg"] = "路线",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132096,
					["from"] = "特变电工",
					["msg"] = "传令",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132119,
					["from"] = "无忌哥哥",
					["msg"] = "我是说霜雨房间",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641132125,
					["from"] = "特变电工",
					["msg"] = "打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641132131,
					["from"] = "特变电工",
					["msg"] = "没清完",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641132154,
					["from"] = "特变电工",
					["msg"] = "BOSS打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641132159,
					["from"] = "特变电工",
					["msg"] = "打了一波怪",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641132162,
					["from"] = "无忌哥哥",
					["msg"] = "那估计完了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641134021,
					["from"] = "无忌哥哥",
					["msg"] = "你还在刷么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641134025,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641134030,
					["from"] = "无忌哥哥",
					["msg"] = "也是全通么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641134032,
					["from"] = "特变电工",
					["msg"] = "刚才那个CD没去？",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641134040,
					["from"] = "无忌哥哥",
					["msg"] = "那个那波怪没清",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641134046,
					["from"] = "无忌哥哥",
					["msg"] = "这次你能清下么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641134048,
					["from"] = "特变电工",
					["msg"] = "要全清？",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641134061,
					["from"] = "无忌哥哥",
					["msg"] = "就霜语房间，右手边那一波 要清",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641134071,
					["from"] = "无忌哥哥",
					["msg"] = "你们只清了左手边的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641134090,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641134094,
					["from"] = "无忌哥哥",
					["msg"] = "谢谢拉",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641135477,
					["from"] = "特变电工",
					["msg"] = "清完了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641135482,
					["from"] = "特变电工",
					["msg"] = "你10分钟后飞本",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641135485,
					["from"] = "无忌哥哥",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641136294,
					["from"] = "特变电工",
					["msg"] = "飞了没",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641136298,
					["from"] = "无忌哥哥",
					["msg"] = "嗯 到了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641136489,
					["from"] = "无忌哥哥",
					["msg"] = "在副本门口了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641136495,
					["from"] = "特变电工",
					["msg"] = "等5分钟",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641136497,
					["from"] = "特变电工",
					["msg"] = "马上好",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641136505,
					["from"] = "无忌哥哥",
					["msg"] = "嗯好",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641136648,
					["from"] = "特变电工",
					["msg"] = "$%^&*!@#$。。",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641136650,
					["from"] = "特变电工",
					["msg"] = "灭了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641136652,
					["from"] = "特变电工",
					["msg"] = "稍等",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641136653,
					["from"] = "无忌哥哥",
					["msg"] = "..",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641136656,
					["from"] = "特变电工",
					["msg"] = "有个%^&*!@猎人",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641136658,
					["from"] = "无忌哥哥",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641136660,
					["from"] = "特变电工",
					["msg"] = "各种ADD",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641137211,
					["from"] = "无忌哥哥",
					["msg"] = "队长能给我么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641137231,
					["from"] = "无忌哥哥",
					["msg"] = "感谢 感谢",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641137235,
					["from"] = "特变电工",
					["msg"] = "好了嘛",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641142170,
					["from"] = "无忌哥哥",
					["msg"] = "你后来又打了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641142174,
					["from"] = "特变电工",
					["msg"] = "打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641142175,
					["from"] = "特变电工",
					["msg"] = "出了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641142177,
					["from"] = "特变电工",
					["msg"] = "毕业了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641142181,
					["from"] = "无忌哥哥",
					["msg"] = "额额",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641142182,
					["from"] = "特变电工",
					["msg"] = "所有副本都毕业",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641142184,
					["from"] = "无忌哥哥",
					["msg"] = "cz 了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [62]
				["info"] = {
				},
			},
			["阿摇"] = {
				{
					["type"] = 1,
					["time"] = 1640432817,
					["from"] = "特变电工",
					["msg"] = "跌惨",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640432832,
					["from"] = "阿摇",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640432835,
					["from"] = "特变电工",
					["msg"] = "你是哪个大学",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640432845,
					["from"] = "阿摇",
					["msg"] = "广东科技学院",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640432861,
					["from"] = "特变电工",
					["msg"] = "什么专业",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640539021,
					["from"] = "特变电工",
					["msg"] = "。。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640539026,
					["from"] = "特变电工",
					["msg"] = "1-8 去打了个",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640539067,
					["from"] = "阿摇",
					["msg"] = "啊？ 什么啊，",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640539088,
					["from"] = "特变电工",
					["msg"] = "MC",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640539094,
					["from"] = "特变电工",
					["msg"] = "轻松打第一",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640539099,
					["from"] = "阿摇",
					["msg"] = "- -跟咱公会的打呀",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640539106,
					["from"] = "特变电工",
					["msg"] = "我明天有事",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640539107,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640539110,
					["from"] = "阿摇",
					["msg"] = "哈哈 ",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640617777,
					["from"] = "特变电工",
					["msg"] = "又跌",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640617779,
					["from"] = "特变电工",
					["msg"] = "妈蛋",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640617783,
					["from"] = "特变电工",
					["msg"] = "两周亏60万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640617786,
					["from"] = "阿摇",
					["msg"] = "卧槽",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640617792,
					["from"] = "特变电工",
					["msg"] = "小场面",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640617794,
					["from"] = "特变电工",
					["msg"] = "正常波动",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640617795,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640617804,
					["from"] = "阿摇",
					["msg"] = "这么狠，，，",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640618887,
					["from"] = "特变电工",
					["msg"] = "你们新疆的公司行不行",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640618889,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640618909,
					["from"] = "阿摇",
					["msg"] = "哈哈哈哈 肯定行",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640618933,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640618993,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640619001,
					["from"] = "阿摇",
					["msg"] = "{猥琐}",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640619010,
					["from"] = "特变电工",
					["msg"] = "特变进上证180了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640619015,
					["from"] = "特变电工",
					["msg"] = "大蓝筹了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640619017,
					["from"] = "特变电工",
					["msg"] = "更稳了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640619031,
					["from"] = "阿摇",
					["msg"] = "现在还能冲不",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640619044,
					["from"] = "特变电工",
					["msg"] = "我390万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640619049,
					["from"] = "特变电工",
					["msg"] = "370万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640619061,
					["from"] = "特变电工",
					["msg"] = "什么时候到48 我什么时候出",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640619077,
					["from"] = "阿摇",
					["msg"] = "{尴尬} 卧槽 这么多",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640619085,
					["from"] = "阿摇",
					["msg"] = "股东啊",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640619092,
					["from"] = "特变电工",
					["msg"] = "现在只赚130万了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640619094,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640619100,
					["from"] = "阿摇",
					["msg"] = "{尴尬}",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640619105,
					["from"] = "特变电工",
					["msg"] = "最高250万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [41]
				["info"] = {
				},
			},
			["刘人杰#5854"] = {
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "刘人杰#5854",
					["msg"] = "噢 哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "特变电工",
					["msg"] = "总共A股",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "刘人杰#5854",
					["msg"] = "可以了 很 牛 比了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641010277,
					["from"] = "刘人杰#5854",
					["msg"] = "不能追求最高点最低点 哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641010278,
					["from"] = "特变电工",
					["msg"] = "回撤没控制好 没办法",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641010310,
					["from"] = "刘人杰#5854",
					["msg"] = "一波主升浪结束 还是要出来下  回头马后炮看",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641010341,
					["from"] = "特变电工",
					["msg"] = "是 长线满仓一支是这样的结果",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641010344,
					["from"] = "刘人杰#5854",
					["msg"] = "没主升浪就不动 主升浪了   外面那些追涨的老鼠!@# 全进来了  ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641010356,
					["from"] = "刘人杰#5854",
					["msg"] = "捣乱",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641010366,
					["from"] = "刘人杰#5854",
					["msg"] = "已经很牛 比了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641010376,
					["from"] = "特变电工",
					["msg"] = "现在特变筹码获利比例10%",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641010398,
					["from"] = "刘人杰#5854",
					["msg"] = "但是让我马后炮 旁观者 说话不腰疼  就是暴涨后  先离场",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641010413,
					["from"] = "刘人杰#5854",
					["msg"] = "因为外面那些捣乱资金追进去了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641010430,
					["from"] = "刘人杰#5854",
					["msg"] = "150W 美滋滋啊 ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641010449,
					["from"] = "特变电工",
					["msg"] = "刚好跟税后工资收入差不多",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641010459,
					["from"] = "刘人杰#5854",
					["msg"] = "你是高收入",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641010465,
					["from"] = "特变电工",
					["msg"] = "相当于副业跟主业一样",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641010467,
					["from"] = "刘人杰#5854",
					["msg"] = "一半人 就20 30W 上班族",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641010472,
					["from"] = "刘人杰#5854",
					["msg"] = "一般人",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641010518,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641010535,
					["from"] = "特变电工",
					["msg"] = "但是不知道还有几年红利期",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641010542,
					["from"] = "特变电工",
					["msg"] = "互联网今年太惨了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641010561,
					["from"] = "特变电工",
					["msg"] = "还好公司发的股票我都抛了买了特变 ",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641010566,
					["from"] = "特变电工",
					["msg"] = "不然今年要被锤惨",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641010586,
					["from"] = "特变电工",
					["msg"] = "今年我跟我们同行业同事的收入差距拉开了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641010590,
					["from"] = "特变电工",
					["msg"] = "选择比努力重要",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641010596,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641010615,
					["from"] = "特变电工",
					["msg"] = "想想还是知足了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641010648,
					["from"] = "刘人杰#5854",
					["msg"] = "一口吃不了胖子  志向高远 也要慢慢来",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641010670,
					["from"] = "刘人杰#5854",
					["msg"] = "你这条件 已经甩开   95%以上的人了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641010688,
					["from"] = "特变电工",
					["msg"] = "今年有个最失误的选择",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641010729,
					["from"] = "特变电工",
					["msg"] = "就是我朋友叫我帮他打理十几亿的资产 给我底薪100万加提成 我没去 然后走的时候套我话以10块钱买了8000万的特变",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641010736,
					["from"] = "特变电工",
					["msg"] = "我太谨慎了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641010761,
					["from"] = "刘人杰#5854",
					["msg"] = "人家赚发了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641010766,
					["from"] = "特变电工",
					["msg"] = "还好",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641010774,
					["from"] = "刘人杰#5854",
					["msg"] = "他还没卖？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641010776,
					["from"] = "特变电工",
					["msg"] = "没",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641010785,
					["from"] = "特变电工",
					["msg"] = "大游资",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641010793,
					["from"] = "刘人杰#5854",
					["msg"] = "啥席位？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641010826,
					["from"] = "特变电工",
					["msg"] = "现在持仓1.8个亿吧",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641010850,
					["from"] = "特变电工",
					["msg"] = "流通股东肯定看不到他",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641010857,
					["from"] = "刘人杰#5854",
					["msg"] = "那肯定啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641010857,
					["from"] = "特变电工",
					["msg"] = "特变市值高",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641010862,
					["from"] = "刘人杰#5854",
					["msg"] = "特变多大的盘子",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641010867,
					["from"] = "特变电工",
					["msg"] = "更不用说举牌了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641010890,
					["from"] = "特变电工",
					["msg"] = "而且他是多账号买入",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641010904,
					["from"] = "特变电工",
					["msg"] = "我第一次看他的股票资金",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641010907,
					["from"] = "特变电工",
					["msg"] = "吓死我了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641010917,
					["from"] = "特变电工",
					["msg"] = "一个子账户 1个多亿",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641010924,
					["from"] = "特变电工",
					["msg"] = "看着特别像模拟盘",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641010925,
					["from"] = "刘人杰#5854",
					["msg"] = "他全是长线？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641010928,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641010933,
					["from"] = "特变电工",
					["msg"] = "他很聪明的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641010943,
					["from"] = "特变电工",
					["msg"] = "不然怎么能赚十多个亿",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641010946,
					["from"] = "特变电工",
					["msg"] = "土老板",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641010949,
					["from"] = "特变电工",
					["msg"] = "做房地产的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641010958,
					["from"] = "特变电工",
					["msg"] = "最近2年都不做 在撤了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641010976,
					["from"] = "特变电工",
					["msg"] = "也是选择比努力重要的典范",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641010977,
					["from"] = "刘人杰#5854",
					["msg"] = "你是在北京？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641010982,
					["from"] = "刘人杰#5854",
					["msg"] = "百度是在北京吗？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641010984,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641010994,
					["from"] = "刘人杰#5854",
					["msg"] = "北京房子贵啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641011000,
					["from"] = "特变电工",
					["msg"] = "我租房",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641011009,
					["from"] = "刘人杰#5854",
					["msg"] = "好点地段10W一平有吧？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641011019,
					["from"] = "特变电工",
					["msg"] = "我今年能买一个不错的房子",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641011021,
					["from"] = "特变电工",
					["msg"] = "但是我不买",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641011044,
					["from"] = "特变电工",
					["msg"] = "作为全球顶级投资家怎么会去买房子",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641011049,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641011050,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641011059,
					["from"] = "特变电工",
					["msg"] = "我特鄙视买房行为",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641011061,
					["from"] = "特变电工",
					["msg"] = "不知道为啥",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641011070,
					["from"] = "特变电工",
					["msg"] = "觉得很不值",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641011077,
					["from"] = "刘人杰#5854",
					["msg"] = "买房躺赢时代结束了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641011082,
					["from"] = "刘人杰#5854",
					["msg"] = "这波!@#$%^房价的上涨",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641011087,
					["from"] = "刘人杰#5854",
					["msg"] = "泡沫太大了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641011099,
					["from"] = "刘人杰#5854",
					["msg"] = "已经透支玩了 ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641011132,
					["from"] = "特变电工",
					["msg"] = "我16年在重庆买的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641011139,
					["from"] = "刘人杰#5854",
					["msg"] = "老家重庆的？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641011143,
					["from"] = "特变电工",
					["msg"] = "投资收益700%",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641011150,
					["from"] = "特变电工",
					["msg"] = "完爆我的股票收益",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641011155,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641011159,
					["from"] = "特变电工",
					["msg"] = "我还瞧不上",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641011160,
					["from"] = "刘人杰#5854",
					["msg"] = "那时候躺赢 房产",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641011166,
					["from"] = "刘人杰#5854",
					["msg"] = "现在这波可以说 已经没了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641011183,
					["from"] = "刘人杰#5854",
					["msg"] = "我这三线小城  房子早就没流动性了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641011195,
					["from"] = "刘人杰#5854",
					["msg"] = "买了就是套",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641011196,
					["from"] = "特变电工",
					["msg"] = "北京生活体验太差",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641011211,
					["from"] = "刘人杰#5854",
					["msg"] = "不增值就相当于 钱糟蹋了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641011211,
					["from"] = "特变电工",
					["msg"] = "绝对的全国倒数",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641011241,
					["from"] = "刘人杰#5854",
					["msg"] = "但是好公司多啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641011241,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641011260,
					["from"] = "刘人杰#5854",
					["msg"] = "不过有钱人还是往上海跑",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641011263,
					["from"] = "刘人杰#5854",
					["msg"] = "估计还是因为环境",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641011302,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641011310,
					["from"] = "特变电工",
					["msg"] = "上海比北京生活体验好太多",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641011329,
					["from"] = "刘人杰#5854",
					["msg"] = "还是地理位置好",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641011334,
					["from"] = "刘人杰#5854",
					["msg"] = "靠海 有在长三角",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [97]
				["info"] = {
				},
			},
			["无敌治疗术"] = {
				{
					["type"] = 1,
					["time"] = 1640793490,
					["from"] = "无敌治疗术",
					["msg"] = "<大脚团队提示>欢迎加入本团队，希望我们合作愉快，拥有一次快乐的冒险旅程。",
					["inbound"] = true,
					["convo"] = "无敌治疗术",
				}, -- [1]
				["info"] = {
				},
			},
			["位面灬天使"] = {
				{
					["type"] = 1,
					["time"] = 1641141785,
					["from"] = "特变电工",
					["msg"] = "。。你要多少代工费",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641141795,
					["from"] = "位面灬天使",
					["msg"] = "看着给吧 3K买的图纸",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641141809,
					["from"] = "位面灬天使",
					["msg"] = "随便 一个会的",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641141818,
					["from"] = "位面灬天使",
					["msg"] = "成本慢慢收",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641141821,
					["from"] = "特变电工",
					["msg"] = "30？",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641141835,
					["from"] = "位面灬天使",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641141866,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641141868,
					["from"] = "特变电工",
					["msg"] = "铁炉堡？",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641141870,
					["from"] = "位面灬天使",
					["msg"] = "我去冬泉谷交任务 马上回",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641141879,
					["from"] = "位面灬天使",
					["msg"] = "黑龙门任务 交了就回了",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641141926,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641141931,
					["from"] = "特变电工",
					["msg"] = "材料准备好了 等你起飞",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641141940,
					["from"] = "位面灬天使",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641141980,
					["from"] = "位面灬天使",
					["msg"] = "回了",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641142033,
					["from"] = "位面灬天使",
					["msg"] = "ok",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641142044,
					["from"] = "位面灬天使",
					["msg"] = "8~",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [16]
				["info"] = {
				},
			},
			["审判"] = {
				{
					["type"] = 1,
					["time"] = 1640413978,
					["from"] = "审判",
					["msg"] = "你们公会怎么样？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640413982,
					["from"] = "特变电工",
					["msg"] = "不知道啊",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640413983,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640413993,
					["from"] = "特变电工",
					["msg"] = "人停多",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640414002,
					["from"] = "特变电工",
					["msg"] = "微信群很活跃",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640414017,
					["from"] = "审判",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为所有数据",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  938,871 (449.1, 5.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "2. |cfffff468Naq|r  934,089 (428.6, 5.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "3. |cfffff468别惹我|r  927,812 (425.2, 5%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "4. |cffc69b6d追风中年|r  ^&*,340 (498.9, 4.8%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "5. |cff3fc6ea宝石大哥|r  873,386 (791.3, 4.7%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "6. |cff3fc6ea银叶草丶|r  844,724 (701.4, 4.6%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "7. |cff3fc6ea吧唧|r  803,216 (712.8, 4.4%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "8. |cffc69b6d芜湖小司马|r  792,247 (409.0, 4.3%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "9. |cffaad372夏虫不可语冰|r  780,309 (485.5, 4.2%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641106546,
					["from"] = "特变电工",
					["msg"] = "10. |cff3fc6ea杰克信仰|r  755,940 (701.7, 4.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641106578,
					["from"] = "审判",
					["msg"] = "打完了？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641106582,
					["from"] = "特变电工",
					["msg"] = "没",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641106598,
					["from"] = "特变电工",
					["msg"] = "轻松打第一ia",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [20]
				["info"] = {
				},
			},
			["爱吃鱼的猫"] = {
				{
					["type"] = 1,
					["time"] = 1641016915,
					["from"] = "特变电工",
					["msg"] = "换位面？",
					["inbound"] = false,
					["convo"] = "爱吃鱼的猫",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641016919,
					["from"] = "爱吃鱼的猫",
					["msg"] = "嗯 别急我组你",
					["inbound"] = true,
					["convo"] = "爱吃鱼的猫",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641019436,
					["from"] = "爱吃鱼的猫",
					["msg"] = "与[特变电工]交易成功。 (收到)50g",
					["inbound"] = true,
					["convo"] = "爱吃鱼的猫",
				}, -- [3]
				["info"] = {
				},
			},
			["说的好"] = {
				{
					["type"] = 1,
					["time"] = 1640195231,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "说的好",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640195240,
					["from"] = "特变电工",
					["msg"] = "打到哪了",
					["inbound"] = false,
					["convo"] = "说的好",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640195247,
					["from"] = "特变电工",
					["msg"] = "9号",
					["inbound"] = false,
					["convo"] = "说的好",
				}, -- [3]
				["info"] = {
				},
			},
			["别惹我"] = {
				{
					["type"] = 1,
					["time"] = 1640954743,
					["from"] = "特变电工",
					["msg"] = "次级体质多少钱",
					["inbound"] = false,
					["convo"] = "别惹我",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640954751,
					["from"] = "别惹我",
					["msg"] = "90",
					["inbound"] = true,
					["convo"] = "别惹我",
				}, -- [2]
				["info"] = {
				},
			},
			["幽雅"] = {
				{
					["type"] = 1,
					["time"] = 1640513999,
					["from"] = "特变电工",
					["msg"] = "没加你好友 居然",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640514000,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640514000,
					["from"] = "幽雅",
					["msg"] = "{邪恶}",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640514003,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640514004,
					["from"] = "幽雅",
					["msg"] = "...",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640514027,
					["from"] = "特变电工",
					["msg"] = "2分钟后找你",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640514052,
					["from"] = "特变电工",
					["msg"] = "尾王了",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640514118,
					["from"] = "幽雅",
					["msg"] = "去下WC 人在铁",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640514118,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 瑞文戴尔男爵交战，（当前29%，5/5存活）",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640514130,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 瑞文戴尔男爵的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640514219,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640514224,
					["from"] = "特变电工",
					["msg"] = "组",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640514249,
					["from"] = "特变电工",
					["msg"] = "123",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640514323,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640514324,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640514494,
					["from"] = "幽雅",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640514566,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640514601,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640514603,
					["from"] = "特变电工",
					["msg"] = "吃饭",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640514611,
					["from"] = "幽雅",
					["msg"] = "刚才肚子巨他吗痛。。",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640515579,
					["from"] = "特变电工",
					["msg"] = "急祥如溢",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640515582,
					["from"] = "特变电工",
					["msg"] = "十倍速hi",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640515584,
					["from"] = "特变电工",
					["msg"] = "是不是",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640515588,
					["from"] = "幽雅",
					["msg"] = "....3",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640515594,
					["from"] = "幽雅",
					["msg"] = "可能天太冷了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640515598,
					["from"] = "幽雅",
					["msg"] = "冻的",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640949803,
					["from"] = "幽雅",
					["msg"] = "哪",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640949824,
					["from"] = "特变电工",
					["msg"] = "奥山",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640949835,
					["from"] = "特变电工",
					["msg"] = "你来铁炉堡",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640949837,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640949839,
					["from"] = "幽雅",
					["msg"] = "。。暴风",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640949845,
					["from"] = "幽雅",
					["msg"] = "我从铁过去 暴风鲁甸",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640949847,
					["from"] = "特变电工",
					["msg"] = "铁路等你起飞",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640949854,
					["from"] = "特变电工",
					["msg"] = "我在铁炉堡排的",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640949865,
					["from"] = "特变电工",
					["msg"] = "你来 我AFK出来",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640949874,
					["from"] = "特变电工",
					["msg"] = "坑了",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640949875,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640949965,
					["from"] = "幽雅",
					["msg"] = "我找到了个大哥开门",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640949972,
					["from"] = "幽雅",
					["msg"] = "大哥一个传送 自己去铁炉堡了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640949974,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640949975,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640950008,
					["from"] = "幽雅",
					["msg"] = "我到了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640950170,
					["from"] = "特变电工",
					["msg"] = "你们黑上不开了吗",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640950171,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [44]
				["info"] = {
				},
			},
			["面包一箩筐"] = {
				{
					["type"] = 1,
					["time"] = 1641045745,
					["from"] = "特变电工",
					["msg"] = "謝謝",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641132281,
					["from"] = "特变电工",
					["msg"] = "1G 面包",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641132302,
					["from"] = "特变电工",
					["msg"] = "谢",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641132308,
					["from"] = "面包一箩筐",
					["msg"] = "客气",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641132317,
					["from"] = "特变电工",
					["msg"] = "上线第一件时间就是找你",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641132321,
					["from"] = "特变电工",
					["msg"] = "每天",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641132326,
					["from"] = "面包一箩筐",
					["msg"] = "啊   哈哈 ",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641132329,
					["from"] = "特变电工",
					["msg"] = "1天1G 一年365G",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641132334,
					["from"] = "面包一箩筐",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641132338,
					["from"] = "特变电工",
					["msg"] = "10年3650G",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641132341,
					["from"] = "面包一箩筐",
					["msg"] = "每天都上线吗",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641132347,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641132362,
					["from"] = "特变电工",
					["msg"] = "你每天啥都不干就搓面包啊",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641132369,
					["from"] = "特变电工",
					["msg"] = "官方NPC",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641132386,
					["from"] = "面包一箩筐",
					["msg"] = "不想刷其他的  挂会机  看看电视",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641132397,
					["from"] = "面包一箩筐",
					["msg"] = "这个多舒服  哈哈",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641132398,
					["from"] = "特变电工",
					["msg"] = "很休闲嘛",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641132413,
					["from"] = "面包一箩筐",
					["msg"] = "要不太累了  ",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132426,
					["from"] = "面包一箩筐",
					["msg"] = "这样卖个十几天  大马就有了",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132429,
					["from"] = "特变电工",
					["msg"] = "你这个能赚回月卡钱么。。",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641132453,
					["from"] = "面包一箩筐",
					["msg"] = "肯定能啊   一个大妈两张月卡",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641132460,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641132464,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641132501,
					["from"] = "面包一箩筐",
					["msg"] = "这样也好  不然好多人上线都没吃喝",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [24]
				["info"] = {
				},
			},
			["宝宝我在这"] = {
				{
					["type"] = 1,
					["time"] = 1640612445,
					["from"] = "特变电工",
					["msg"] = "报名没组你吗。。",
					["inbound"] = false,
					["convo"] = "宝宝我在这",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640612452,
					["from"] = "宝宝我在这",
					["msg"] = "没",
					["inbound"] = true,
					["convo"] = "宝宝我在这",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640612467,
					["from"] = "宝宝我在这",
					["msg"] = "我在工会里喊话，打了那么多次11 喊了那么多次求组 ",
					["inbound"] = true,
					["convo"] = "宝宝我在这",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640612478,
					["from"] = "特变电工",
					["msg"] = "我看微信群报名说是上周固定优先",
					["inbound"] = false,
					["convo"] = "宝宝我在这",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640612486,
					["from"] = "宝宝我在这",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "宝宝我在这",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640612495,
					["from"] = "特变电工",
					["msg"] = "然后我留了一个心眼昨天就去跟野团打了 怕组不上",
					["inbound"] = false,
					["convo"] = "宝宝我在这",
				}, -- [6]
				["info"] = {
				},
			},
			["神奇灬女侠"] = {
				{
					["type"] = 1,
					["time"] = 1640507501,
					["from"] = "特变电工",
					["msg"] = "!@#$%^&*!@#$",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640507508,
					["from"] = "特变电工",
					["msg"] = "刷了20次斯坦索姆",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640507511,
					["from"] = "特变电工",
					["msg"] = "没出我的腿",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640507528,
					["from"] = "神奇灬女侠",
					["msg"] = "什么腿？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640507531,
					["from"] = "特变电工",
					["msg"] = "T0",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640507548,
					["from"] = "神奇灬女侠",
					["msg"] = "哈哈 T0 我都没要",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640507561,
					["from"] = "神奇灬女侠",
					["msg"] = "要不要陪老哥去刷一把？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640507605,
					["from"] = "神奇灬女侠",
					["msg"] = "我STSM 好像只打了三次吧 治疗衣服跟项链就到手了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640507622,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640507650,
					["from"] = "神奇灬女侠",
					["msg"] = "三大差不多毕业了 现在没事做刷下奥山声望  有个治疗副手蛮好的",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641188929,
					["from"] = "特变电工",
					["msg"] = "彻底起飞了",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641188937,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641188942,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21998:927:::::::60:::::::::|h[英勇护手]|h|r|cffa335ee|Hitem:21995:1887:::::::60:::::::::|h[英勇长靴]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641188943,
					["from"] = "神奇灬女侠",
					["msg"] = "哇",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641188952,
					["from"] = "特变电工",
					["msg"] = "PVP一霸",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641188969,
					["from"] = "神奇灬女侠",
					["msg"] = "你这收获不少呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641188975,
					["from"] = "特变电工",
					["msg"] = "对了 你们损失了一名大将。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641188982,
					["from"] = "特变电工",
					["msg"] = "我MC黑龙每次都是第一",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641188987,
					["from"] = "特变电工",
					["msg"] = "暴力DPS",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641188992,
					["from"] = "特变电工",
					["msg"] = "很轻松",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641188992,
					["from"] = "神奇灬女侠",
					["msg"] = "..  ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641188993,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641189003,
					["from"] = "特变电工",
					["msg"] = "不用吹灰之力",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641189005,
					["from"] = "神奇灬女侠",
					["msg"] = "我也退会了 换了个会",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641189008,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641189019,
					["from"] = "神奇灬女侠",
					["msg"] = "你们走了之后 没人聊天了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641189023,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641189030,
					["from"] = "神奇灬女侠",
					["msg"] = "团也打不起  ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641189162,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641189176,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641189177,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠正在与普通 - 指挥官沃恩交战，（当前98%，5/5存活）",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641189191,
					["from"] = "神奇灬女侠",
					["msg"] = "多少G买的",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641189207,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠已在普通 - 指挥官沃恩的战斗中取得胜利！",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641189210,
					["from"] = "特变电工",
					["msg"] = "1700",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641189359,
					["from"] = "神奇灬女侠",
					["msg"] = "大佬V5",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641189368,
					["from"] = "特变电工",
					["msg"] = "便宜啊",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641189372,
					["from"] = "特变电工",
					["msg"] = "可以用到NAXX",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641189418,
					["from"] = "神奇灬女侠",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641189437,
					["from"] = "特变电工",
					["msg"] = "2顿中午饭。。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641189500,
					["from"] = "神奇灬女侠",
					["msg"] = "对 有时候要等好久  碰到别错过",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641189837,
					["from"] = "特变电工",
					["msg"] = "主要是PVP也用",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641191441,
					["from"] = "特变电工",
					["msg"] = "除了法师 暗牧 其他职业看到我都要叫我爸爸",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641191443,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641191457,
					["from"] = "特变电工",
					["msg"] = "一个砍2个",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641191463,
					["from"] = "神奇灬女侠",
					["msg"] = ".. ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641191463,
					["from"] = "特变电工",
					["msg"] = "起飞起飞",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641191471,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641191477,
					["from"] = "特变电工",
					["msg"] = "我现在还是双持",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641191484,
					["from"] = "特变电工",
					["msg"] = "还没有单手武器",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641191486,
					["from"] = "特变电工",
					["msg"] = "双手武器",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641191500,
					["from"] = "特变电工",
					["msg"] = "那个削骨或者AL",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641191512,
					["from"] = "神奇灬女侠",
					["msg"] = "AL好",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641191514,
					["from"] = "特变电工",
					["msg"] = "直接垂直立体原地爆炸螺旋起飞",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641191516,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641191523,
					["from"] = "特变电工",
					["msg"] = "这个版本应该便宜",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641191529,
					["from"] = "神奇灬女侠",
					["msg"] = "静待BWL",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641191534,
					["from"] = "特变电工",
					["msg"] = "去BWL都是PVE玩家",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641191544,
					["from"] = "特变电工",
					["msg"] = "拿那个除了装逼没啥用",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641191562,
					["from"] = "特变电工",
					["msg"] = "AL 1WG我都要拿下来",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641191562,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠正在与普通 - 军需官兹格雷斯交战，（当前93%，5/5存活）",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641191575,
					["from"] = "神奇灬女侠",
					["msg"] = "应该要不了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641191581,
					["from"] = "特变电工",
					["msg"] = "最多2千",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641191583,
					["from"] = "特变电工",
					["msg"] = "你信不",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641191586,
					["from"] = "神奇灬女侠",
					["msg"] = "现在装备都不贵",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641191590,
					["from"] = "神奇灬女侠",
					["msg"] = "我信",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641191590,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠已在普通 - 军需官兹格雷斯的战斗中取得胜利！",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641308715,
					["from"] = "特变电工",
					["msg"] = "对了",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641308716,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641308723,
					["from"] = "特变电工",
					["msg"] = "来跟我奥山2人小分队啊",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641308737,
					["from"] = "神奇灬女侠",
					["msg"] = "大哥想打奥山？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641308747,
					["from"] = "特变电工",
					["msg"] = "昨天包养了一个骑士",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641308757,
					["from"] = "特变电工",
					["msg"] = "2个人守南塔杀了13个人",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641308767,
					["from"] = "特变电工",
					["msg"] = "然后直接变坑场",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641308768,
					["from"] = "神奇灬女侠",
					["msg"] = "强呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641308780,
					["from"] = "特变电工",
					["msg"] = "来暴风城",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641308791,
					["from"] = "特变电工",
					["msg"] = "龙头要来了",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641308796,
					["from"] = "特变电工",
					["msg"] = "[[60] 联盟的胜利 (7495)]",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641308816,
					["from"] = "神奇灬女侠",
					["msg"] = "太远了  BUFF不要了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641308832,
					["from"] = "特变电工",
					["msg"] = "1500",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641308835,
					["from"] = "特变电工",
					["msg"] = "刚买的",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641308846,
					["from"] = "神奇灬女侠",
					["msg"] = "龙头就1000吧",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641308855,
					["from"] = "特变电工",
					["msg"] = "哪有",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641308858,
					["from"] = "特变电工",
					["msg"] = "每次都到1500",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641308863,
					["from"] = "神奇灬女侠",
					["msg"] = "我打的团就是1000",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641308870,
					["from"] = "特变电工",
					["msg"] = "我每次都是1500",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641308877,
					["from"] = "神奇灬女侠",
					["msg"] = "{大笑}.",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641308880,
					["from"] = "特变电工",
					["msg"] = "我今天赔了10万",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641308886,
					["from"] = "特变电工",
					["msg"] = "可以买多少个龙头",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641308893,
					["from"] = "特变电工",
					["msg"] = "500个",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641308897,
					["from"] = "神奇灬女侠",
					["msg"] = "怎么？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641308911,
					["from"] = "特变电工",
					["msg"] = "跌了2.5%",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641308931,
					["from"] = "神奇灬女侠",
					["msg"] = "...",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641308970,
					["from"] = "神奇灬女侠",
					["msg"] = "这到年底了要分红了呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [93]
				["info"] = {
				},
			},
			["冯一刀"] = {
				{
					["type"] = 1,
					["time"] = 1640507983,
					["from"] = "冯一刀",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "冯一刀",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640514210,
					["from"] = "特变电工",
					["msg"] = "我刚送走一个",
					["inbound"] = false,
					["convo"] = "冯一刀",
				}, -- [2]
				["info"] = {
				},
			},
			["朝先"] = {
				{
					["type"] = 1,
					["time"] = 1640621696,
					["from"] = "特变电工",
					["msg"] = "多少钱",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640621766,
					["from"] = "朝先",
					["msg"] = "90要不？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640621781,
					["from"] = "特变电工",
					["msg"] = "我还不知道市场价。。",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640621787,
					["from"] = "朝先",
					["msg"] = "AH 150",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640621806,
					["from"] = "特变电工",
					["msg"] = "COD给我",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640621816,
					["from"] = "特变电工",
					["msg"] = "我拿去砍人",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640621867,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640621890,
					["from"] = "特变电工",
					["msg"] = "好不",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640621892,
					["from"] = "特变电工",
					["msg"] = "兄弟",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640621903,
					["from"] = "朝先",
					["msg"] = "啥？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640621913,
					["from"] = "特变电工",
					["msg"] = "货到付款邮寄我",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640621922,
					["from"] = "特变电工",
					["msg"] = "我在副本里",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640621971,
					["from"] = "朝先",
					["msg"] = "世界有人出120了。。让我再喊喊吧，我攒钱买个大马先",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640622029,
					["from"] = "特变电工",
					["msg"] = "我出130",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640622042,
					["from"] = "朝先",
					["msg"] = "AH才150.。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640622061,
					["from"] = "朝先",
					["msg"] = "你回铁交易？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640622078,
					["from"] = "特变电工",
					["msg"] = "你邮寄我就行 货到付款 不卡邮件 我在副本里",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640622084,
					["from"] = "特变电工",
					["msg"] = "1小时后就能收",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640622091,
					["from"] = "朝先",
					["msg"] = "那我算你125吧，行么？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640622094,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640622097,
					["from"] = "朝先",
					["msg"] = "|cffc69b6d特变电工-鱼人摩洛克|r",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640622099,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640622117,
					["from"] = "朝先",
					["msg"] = "邮寄了。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640622121,
					["from"] = "特变电工",
					["msg"] = "好的 3Q",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640622140,
					["from"] = "朝先",
					["msg"] = "嗯嗯，别卡信，谢谢。我下了，晚安，好运",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640622145,
					["from"] = "特变电工",
					["msg"] = "嗯 放心",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640622148,
					["from"] = "朝先",
					["msg"] = "嗯嗯",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640703149,
					["from"] = "朝先",
					["msg"] = "在么",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640703173,
					["from"] = "特变电工",
					["msg"] = "昨天下线忘记收了。。今天上线收了 应该到账了吧",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640703262,
					["from"] = "朝先",
					["msg"] = "到了到了",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640703266,
					["from"] = "朝先",
					["msg"] = "帮个忙",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640703279,
					["from"] = "朝先",
					["msg"] = "|cffffffff|Hitem:12820::::::::60:::::::::|h[冬泉火酒]|h|r 你买我一组这个吧 10G。。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640703294,
					["from"] = "朝先",
					["msg"] = "我差7G去买个马了。。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640703352,
					["from"] = "朝先",
					["msg"] = "你需要这东西不？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640703465,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640703495,
					["from"] = "朝先",
					["msg"] = "你也是狂暴战。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640703502,
					["from"] = "特变电工",
					["msg"] = "裝備如何",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640703504,
					["from"] = "特变电工",
					["msg"] = "我的",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640703520,
					["from"] = "朝先",
					["msg"] = "鞋子得换啊。。绿的没档次~哈哈",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640703528,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640703532,
					["from"] = "特变电工",
					["msg"] = "我在做T0.5",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640703535,
					["from"] = "特变电工",
					["msg"] = "你的武器多少錢",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640703537,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:17112:1900:::::::60:::::::::|h[苍穹击碎者]|h|r",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640703540,
					["from"] = "朝先",
					["msg"] = "我也要做，但是现在没钱了",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640703550,
					["from"] = "朝先",
					["msg"] = "4钱",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640703555,
					["from"] = "特变电工",
					["msg"] = "4千？",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640703576,
					["from"] = "朝先",
					["msg"] = "嗯4千",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640703809,
					["from"] = "朝先",
					["msg"] = "哈，身上剩2G了",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640703989,
					["from"] = "特变电工",
					["msg"] = "我MC轻松打第一啊",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640703990,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640703995,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640703998,
					["from"] = "特变电工",
					["msg"] = "黑龙也是第一",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [52]
				["info"] = {
				},
			},
			["命不由天定"] = {
				{
					["type"] = 1,
					["time"] = 1641232178,
					["from"] = "特变电工",
					["msg"] = "加我好友啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641232180,
					["from"] = "特变电工",
					["msg"] = "我加你了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641232182,
					["from"] = "特变电工",
					["msg"] = "以后一起起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641232187,
					["from"] = "命不由天定",
					["msg"] = "加了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641232197,
					["from"] = "特变电工",
					["msg"] = "战骑组合 可以杀7个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641232205,
					["from"] = "特变电工",
					["msg"] = "2V7",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641232210,
					["from"] = "命不由天定",
					["msg"] = "这么厉害呀",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641232212,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641232222,
					["from"] = "特变电工",
					["msg"] = "不要打群架",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641232229,
					["from"] = "特变电工",
					["msg"] = "拦截人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641232233,
					["from"] = "特变电工",
					["msg"] = "独享2人荣誉",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641232238,
					["from"] = "特变电工",
					["msg"] = "不跟大部队",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641232244,
					["from"] = "特变电工",
					["msg"] = "大部队是均摊的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641232261,
					["from"] = "命不由天定",
					["msg"] = "o 哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641232283,
					["from"] = "特变电工",
					["msg"] = "你看这个战士",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641232289,
					["from"] = "特变电工",
					["msg"] = "他是独狼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641232306,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641232350,
					["from"] = "特变电工",
					["msg"] = "我尼玛",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641232353,
					["from"] = "特变电工",
					["msg"] = "全部杀我们2个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641232358,
					["from"] = "特变电工",
					["msg"] = "我以为只会来几个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641232363,
					["from"] = "命不由天定",
					["msg"] = "哈哈恨死咱们了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641232369,
					["from"] = "特变电工",
					["msg"] = "看来引起公愤了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641232371,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641232374,
					["from"] = "特变电工",
					["msg"] = "笑死我了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641232379,
					["from"] = "特变电工",
					["msg"] = "我以为只有4个左右",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641232422,
					["from"] = "特变电工",
					["msg"] = "这把坑了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641232426,
					["from"] = "特变电工",
					["msg"] = "我们有很大责任",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641232430,
					["from"] = "特变电工",
					["msg"] = "杀了太多人回去了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641232432,
					["from"] = "命不由天定",
					["msg"] = "是呀 ",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641232444,
					["from"] = "特变电工",
					["msg"] = "我只想微微的防守",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641232452,
					["from"] = "特变电工",
					["msg"] = "结果没停住",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641232460,
					["from"] = "命不由天定",
					["msg"] = "都杀回去了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641232484,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641232501,
					["from"] = "命不由天定",
					["msg"] = "我拿口吃的",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641232723,
					["from"] = "命不由天定",
					["msg"] = "我回来了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641232769,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641232894,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641232899,
					["from"] = "特变电工",
					["msg"] = "4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641232911,
					["from"] = "特变电工",
					["msg"] = "太多了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641232912,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641232962,
					["from"] = "特变电工",
					["msg"] = "让他们开",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641232998,
					["from"] = "特变电工",
					["msg"] = "我们往前拦截",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641233008,
					["from"] = "特变电工",
					["msg"] = "又能保证荣誉和游戏体验",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641233013,
					["from"] = "特变电工",
					["msg"] = "也能让坑场快点结束",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641233031,
					["from"] = "命不由天定",
					["msg"] = "去哪",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641233036,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641233049,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641233146,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641233151,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641233154,
					["from"] = "特变电工",
					["msg"] = "。。。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641233157,
					["from"] = "特变电工",
					["msg"] = "我本来不想打的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641233163,
					["from"] = "特变电工",
					["msg"] = "我看别人被欺负了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641233312,
					["from"] = "特变电工",
					["msg"] = "等他们墓地好",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641233334,
					["from"] = "特变电工",
					["msg"] = "然后他们大部队就在雷矛了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641233339,
					["from"] = "特变电工",
					["msg"] = "然后我们",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641233390,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641233401,
					["from"] = "特变电工",
					["msg"] = "雷矛他们不一定了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641233489,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641233492,
					["from"] = "特变电工",
					["msg"] = "一堆人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641233495,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641233499,
					["from"] = "特变电工",
					["msg"] = "杀了2个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641233502,
					["from"] = "特变电工",
					["msg"] = "够本",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641233504,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641233698,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641233705,
					["from"] = "特变电工",
					["msg"] = "你ADD到了^&*!OSS",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641233713,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641233806,
					["from"] = "特变电工",
					["msg"] = "你可以给我上牺牲",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641233824,
					["from"] = "命不由天定",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641233830,
					["from"] = "特变电工",
					["msg"] = "我北洋",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641233840,
					["from"] = "特变电工",
					["msg"] = "你北洋",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641233892,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641233896,
					["from"] = "特变电工",
					["msg"] = "这么多NPC",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641233898,
					["from"] = "命不由天定",
					["msg"] = "你拉太多了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641233902,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641234239,
					["from"] = "命不由天定",
					["msg"] = "u不开越来越多",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641234241,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641234245,
					["from"] = "特变电工",
					["msg"] = "怎么回来这么多的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641234246,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641234262,
					["from"] = "特变电工",
					["msg"] = "就是在这里坑杀他们",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641234271,
					["from"] = "特变电工",
					["msg"] = "2个坑4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641234278,
					["from"] = "特变电工",
					["msg"] = "结果莫名其妙来了一群人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641234293,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641234295,
					["from"] = "特变电工",
					["msg"] = "杀了4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641234300,
					["from"] = "特变电工",
					["msg"] = "够本",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641234430,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641234432,
					["from"] = "特变电工",
					["msg"] = "我知道了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641234449,
					["from"] = "特变电工",
					["msg"] = "他们后面一直在围着这个冰雪大王",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641234455,
					["from"] = "特变电工",
					["msg"] = "但他迟迟不欠",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641234616,
					["from"] = "特变电工",
					["msg"] = "睡觉了 晚安 明天还要上班 有空一起起飞啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641234617,
					["from"] = "特变电工",
					["msg"] = "》。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641234632,
					["from"] = "命不由天定",
					["msg"] = "好的 88",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641304200,
					["from"] = "特变电工",
					["msg"] = "等你起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641304208,
					["from"] = "命不由天定",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641304220,
					["from"] = "命不由天定",
					["msg"] = "你是？",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641304238,
					["from"] = "特变电工",
					["msg"] = "凌晨一起驰骋奥山。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641316686,
					["from"] = "命不由天定",
					["msg"] = "不好意思哈   我朋友玩我号去打工 去了   他不会玩战场 我听他说了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641316693,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641316694,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641316713,
					["from"] = "特变电工",
					["msg"] = "等我起飞啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641316715,
					["from"] = "特变电工",
					["msg"] = "马上出来",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641316741,
					["from"] = "命不由天定",
					["msg"] = "哈哈 好",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641316776,
					["from"] = "特变电工",
					["msg"] = "进组",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641316791,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641316801,
					["from"] = "特变电工",
					["msg"] = "|cff1eff00|Hitem:17901::::::::60:::::::::|h[3级雷矛勋章]|h|r你又这个没",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641316809,
					["from"] = "命不由天定",
					["msg"] = "我好像没有",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641316813,
					["from"] = "特变电工",
					["msg"] = "没做任务把",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641316837,
					["from"] = "特变电工",
					["msg"] = "黑市上",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641316842,
					["from"] = "特变电工",
					["msg"] = "黑石塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641316845,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1641316858,
					["from"] = "命不由天定",
					["msg"] = "嗯 ",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1641316871,
					["from"] = "特变电工",
					["msg"] = "排队时间可以去黑石塔砍人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1641316871,
					["from"] = "命不由天定",
					["msg"] = "黑石塔有人吗",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1641316878,
					["from"] = "特变电工",
					["msg"] = "又",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1641316901,
					["from"] = "特变电工",
					["msg"] = "飞灼热",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1641316929,
					["from"] = "特变电工",
					["msg"] = "下一把吧好像来不及了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1641316946,
					["from"] = "特变电工",
					["msg"] = "我带几个有限无敌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1641316985,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1641317158,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1641317163,
					["from"] = "命不由天定",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1641317223,
					["from"] = "特变电工",
					["msg"] = "死了南塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1641317224,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1641317229,
					["from"] = "特变电工",
					["msg"] = "你没徽章",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1641317238,
					["from"] = "特变电工",
					["msg"] = "有徽章我们去中场",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1641317246,
					["from"] = "特变电工",
					["msg"] = "来了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1641317284,
					["from"] = "特变电工",
					["msg"] = "擦了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1641317302,
					["from"] = "特变电工",
					["msg"] = "那个术士喝有限无敌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1641317309,
					["from"] = "命不由天定",
					["msg"] = "哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1641317346,
					["from"] = "特变电工",
					["msg"] = "复活啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1641317372,
					["from"] = "命不由天定",
					["msg"] = "o ",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1641317412,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1641317417,
					["from"] = "特变电工",
					["msg"] = "北塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1641317636,
					["from"] = "特变电工",
					["msg"] = "全是有限无敌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1641317639,
					["from"] = "特变电工",
					["msg"] = "国家队啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1641317640,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1641317642,
					["from"] = "特变电工",
					["msg"] = "我醉了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1641317643,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1641317913,
					["from"] = "命不由天定",
					["msg"] = "在哪了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1641317920,
					["from"] = "特变电工",
					["msg"] = "你看地图",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [138]
				{
					["type"] = 1,
					["time"] = 1641317941,
					["from"] = "特变电工",
					["msg"] = "星星",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [139]
				{
					["type"] = 1,
					["time"] = 1641317958,
					["from"] = "特变电工",
					["msg"] = "出",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [140]
				{
					["type"] = 1,
					["time"] = 1641317965,
					["from"] = "特变电工",
					["msg"] = "走 黑石塔",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [141]
				{
					["type"] = 1,
					["time"] = 1641317971,
					["from"] = "特变电工",
					["msg"] = "对面太强了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [142]
				{
					["type"] = 1,
					["time"] = 1641317975,
					["from"] = "特变电工",
					["msg"] = "全是吃药的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [143]
				{
					["type"] = 1,
					["time"] = 1641317991,
					["from"] = "命不由天定",
					["msg"] = "哈哈 好快一场",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [144]
				{
					["type"] = 1,
					["time"] = 1641318922,
					["from"] = "命不由天定",
					["msg"] = "最后一场我下了哈 改天玩",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [145]
				{
					["type"] = 1,
					["time"] = 1641318926,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [146]
				{
					["type"] = 1,
					["time"] = 1641318929,
					["from"] = "特变电工",
					["msg"] = "我也睡了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [147]
				{
					["type"] = 1,
					["time"] = 1641319048,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [148]
				{
					["type"] = 1,
					["time"] = 1641319053,
					["from"] = "命不由天定",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [149]
				{
					["type"] = 1,
					["time"] = 1641319055,
					["from"] = "特变电工",
					["msg"] = "我就不信不能起飞了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [150]
				{
					["type"] = 1,
					["time"] = 1641319064,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [151]
				{
					["type"] = 1,
					["time"] = 1641319110,
					["from"] = "特变电工",
					["msg"] = "上来",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [152]
				{
					["type"] = 1,
					["time"] = 1641319201,
					["from"] = "特变电工",
					["msg"] = "擦 ",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [153]
				{
					["type"] = 1,
					["time"] = 1641319203,
					["from"] = "特变电工",
					["msg"] = "3个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [154]
				{
					["type"] = 1,
					["time"] = 1641319204,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [155]
				{
					["type"] = 1,
					["time"] = 1641319218,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [156]
				{
					["type"] = 1,
					["time"] = 1641319263,
					["from"] = "特变电工",
					["msg"] = "拦截人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [157]
				{
					["type"] = 1,
					["time"] = 1641319345,
					["from"] = "特变电工",
					["msg"] = "死",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [158]
				{
					["type"] = 1,
					["time"] = 1641319347,
					["from"] = "特变电工",
					["msg"] = "复活",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [159]
				{
					["type"] = 1,
					["time"] = 1641319375,
					["from"] = "命不由天定",
					["msg"] = "我没有章",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [160]
				{
					["type"] = 1,
					["time"] = 1641319378,
					["from"] = "命不由天定",
					["msg"] = "被控制",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [161]
				{
					["type"] = 1,
					["time"] = 1641319800,
					["from"] = "特变电工",
					["msg"] = "睡觉前挖一个坑",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [162]
				{
					["type"] = 1,
					["time"] = 1641319800,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [163]
				{
					["type"] = 1,
					["time"] = 1641319802,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [164]
				{
					["type"] = 1,
					["time"] = 1641319804,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [165]
				{
					["type"] = 1,
					["time"] = 1641319818,
					["from"] = "命不由天定",
					["msg"] = "每次跟你都是坑",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [166]
				{
					["type"] = 1,
					["time"] = 1641319828,
					["from"] = "特变电工",
					["msg"] = "挖坑王",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [167]
				{
					["type"] = 1,
					["time"] = 1641319837,
					["from"] = "特变电工",
					["msg"] = "这群B部落确实讨厌",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [168]
				{
					["type"] = 1,
					["time"] = 1641319842,
					["from"] = "命不由天定",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [169]
				{
					["type"] = 1,
					["time"] = 1641319965,
					["from"] = "命不由天定",
					["msg"] = "复活15人没有我 哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [170]
				{
					["type"] = 1,
					["time"] = 1641320079,
					["from"] = "命不由天定",
					["msg"] = "下了 你瞬间融化了哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [171]
				{
					["type"] = 1,
					["time"] = 1641320082,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [172]
				{
					["type"] = 1,
					["time"] = 1641320083,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [173]
				{
					["type"] = 1,
					["time"] = 1641320086,
					["from"] = "特变电工",
					["msg"] = "晚安",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [174]
				{
					["type"] = 1,
					["time"] = 1641387225,
					["from"] = "特变电工",
					["msg"] = "要一起起飞吗",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [175]
				{
					["type"] = 1,
					["time"] = 1641394866,
					["from"] = "特变电工",
					["msg"] = "起飞吗",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [176]
				{
					["type"] = 1,
					["time"] = 1641394913,
					["from"] = "命不由天定",
					["msg"] = "不是本人，{龇牙}",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [177]
				{
					["type"] = 1,
					["time"] = 1641403756,
					["from"] = "命不由天定",
					["msg"] = "我来了哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [178]
				{
					["type"] = 1,
					["time"] = 1641403759,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [179]
				{
					["type"] = 1,
					["time"] = 1641403763,
					["from"] = "特变电工",
					["msg"] = "已经开始了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [180]
				{
					["type"] = 1,
					["time"] = 1641403773,
					["from"] = "特变电工",
					["msg"] = "最后一把睡觉了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [181]
				{
					["type"] = 1,
					["time"] = 1641403784,
					["from"] = "命不由天定",
					["msg"] = "嗯嗯 我到2点睡哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [182]
				["info"] = {
				},
			},
			["牧马人"] = {
				{
					["type"] = 1,
					["time"] = 1641097810,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "牧马人",
				}, -- [1]
				["info"] = {
				},
			},
			["森类滴话"] = {
				{
					["type"] = 1,
					["time"] = 1641015736,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "森类滴话",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641015752,
					["from"] = "特变电工",
					["msg"] = "公爵",
					["inbound"] = false,
					["convo"] = "森类滴话",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641015785,
					["from"] = "森类滴话",
					["msg"] = "<大脚团队提示>欢迎加入本团队，希望我们合作愉快，拥有一次快乐的冒险旅程。",
					["inbound"] = true,
					["convo"] = "森类滴话",
				}, -- [3]
				["info"] = {
				},
			},
			["宝宝你在哪"] = {
				{
					["type"] = 1,
					["time"] = 1640707967,
					["from"] = "宝宝你在哪",
					["msg"] = "你先看看MS的装备在决定",
					["inbound"] = true,
					["convo"] = "宝宝你在哪",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640707974,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "宝宝你在哪",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640707976,
					["from"] = "特变电工",
					["msg"] = "没注意。。",
					["inbound"] = false,
					["convo"] = "宝宝你在哪",
				}, -- [3]
				["info"] = {
				},
			},
			["法夜"] = {
				{
					["type"] = 1,
					["time"] = 1640801669,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640801672,
					["from"] = "特变电工",
					["msg"] = "还缺吗",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640801676,
					["from"] = "特变电工",
					["msg"] = "坦",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640801684,
					["from"] = "法夜",
					["msg"] = "做0.5任务的 来不",
					["inbound"] = true,
					["convo"] = "法夜",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640801685,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640801687,
					["from"] = "特变电工",
					["msg"] = "来了",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640801696,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [7]
				["info"] = {
				},
			},
			["芜湖小司马"] = {
				{
					["type"] = 1,
					["time"] = 1641100999,
					["from"] = "特变电工",
					["msg"] = "做一个宏单独密",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641101004,
					["from"] = "芜湖小司马",
					["msg"] = "M谁啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641101008,
					["from"] = "特变电工",
					["msg"] = "只有3个骑士 我们是小拯救",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641101009,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641101013,
					["from"] = "特变电工",
					["msg"] = "|cfff48cba有内鬼啊|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641101018,
					["from"] = "特变电工",
					["msg"] = "3队骑士",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641101028,
					["from"] = "芜湖小司马",
					["msg"] = "哦了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641108908,
					["from"] = "芜湖小司马",
					["msg"] = "近战不打吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641108997,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [9]
				["info"] = {
				},
			},
			["天呐你真黑"] = {
				{
					["type"] = 1,
					["time"] = 1640270881,
					["from"] = "天呐你真黑",
					["msg"] = "111",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640270888,
					["from"] = "天呐你真黑",
					["msg"] = "不要黑爵士  有了 ",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640270898,
					["from"] = "特变电工",
					["msg"] = "稍等",
					["inbound"] = false,
					["convo"] = "天呐你真黑",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640270905,
					["from"] = "天呐你真黑",
					["msg"] = "只需求T0裤子",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640270928,
					["from"] = "特变电工",
					["msg"] = "在出副本",
					["inbound"] = false,
					["convo"] = "天呐你真黑",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640271127,
					["from"] = "天呐你真黑",
					["msg"] = "到了",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [6]
				["info"] = {
				},
			},
			["小养由基"] = {
				{
					["type"] = 1,
					["time"] = 1640880956,
					["from"] = "特变电工",
					["msg"] = "[附魔靴子 - 强效敏捷]代工多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640880976,
					["from"] = "小养由基",
					["msg"] = "4",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640880989,
					["from"] = "特变电工",
					["msg"] = "4G么",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640880996,
					["from"] = "小养由基",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640881006,
					["from"] = "特变电工",
					["msg"] = "组我哈",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640881024,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易取消: 对方取消了交易。",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640881035,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。 (收到)4g,|cff1eff00|Hitem:16203::::::::60:::::::::|h[强效不灭精华]|h|rx8",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640881043,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。(交出)附魔靴子 - 强效敏捷",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640881047,
					["from"] = "小养由基",
					["msg"] = "好了",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640881049,
					["from"] = "特变电工",
					["msg"] = "谢谢",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640881801,
					["from"] = "特变电工",
					["msg"] = "披风3敏捷多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640881846,
					["from"] = "小养由基",
					["msg"] = "8",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640881851,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640881868,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。(交出)附魔披风 - 次级敏捷 (收到)8g",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640881889,
					["from"] = "特变电工",
					["msg"] = "手15敏多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640881974,
					["from"] = "小养由基",
					["msg"] = "手有151敏吗",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640881982,
					["from"] = "特变电工",
					["msg"] = "好像TAQ开放",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640881985,
					["from"] = "小养由基",
					["msg"] = "没有15没的",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [18]
				["info"] = {
				},
			},
			["茅台酒"] = {
				{
					["type"] = 1,
					["time"] = 1640952445,
					["from"] = "特变电工",
					["msg"] = "今年结账了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640955697,
					["from"] = "茅台酒",
					["msg"] = "嗯 赚了多少G",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640955704,
					["from"] = "茅台酒",
					["msg"] = "RMB",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640955718,
					["from"] = "特变电工",
					["msg"] = "160",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640955728,
					["from"] = "茅台酒",
					["msg"] = "可以",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640955735,
					["from"] = "特变电工",
					["msg"] = "最高280",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640955756,
					["from"] = "茅台酒",
					["msg"] = "可以在游戏里面当思聪了",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640955810,
					["from"] = "特变电工",
					["msg"] = "准备拿1%收益",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640955824,
					["from"] = "茅台酒",
					["msg"] = "不明白",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640955849,
					["from"] = "特变电工",
					["msg"] = "拿0.5%收益在魔兽消费",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640955858,
					["from"] = "茅台酒",
					["msg"] = "用不完",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640955890,
					["from"] = "特变电工",
					["msg"] = "明年的目标是1000",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640955897,
					["from"] = "特变电工",
					["msg"] = "A股600 美股400",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640955911,
					["from"] = "特变电工",
					["msg"] = "因为是复利",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640955926,
					["from"] = "特变电工",
					["msg"] = "越到后面越猛",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640955944,
					["from"] = "特变电工",
					["msg"] = "A股特工48 美股wish 30 phun 30",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640955961,
					["from"] = "特变电工",
					["msg"] = "我说的是股价",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640955970,
					["from"] = "特变电工",
					["msg"] = "茅台800",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132493,
					["from"] = "特变电工",
					["msg"] = "我已经彻底毕业了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132506,
					["from"] = "茅台酒",
					["msg"] = "厉害",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641187162,
					["from"] = "特变电工",
					["msg"] = "t0.5我都做完了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641187174,
					["from"] = "茅台酒",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641187175,
					["from"] = "特变电工",
					["msg"] = "30次DK 10次通灵 10次黑上 各种任务",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641187180,
					["from"] = "特变电工",
					["msg"] = "爽",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641187186,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641187195,
					["from"] = "特变电工",
					["msg"] = "PVP神器",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641187209,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [27]
				["info"] = {
				},
			},
			["常驻力量谷"] = {
				{
					["type"] = 1,
					["time"] = 1641304302,
					["from"] = "特变电工",
					["msg"] = "1",
					["inbound"] = false,
					["convo"] = "常驻力量谷",
				}, -- [1]
				["info"] = {
				},
			},
			["大个一米八六"] = {
				{
					["type"] = 1,
					["time"] = 1641116535,
					["from"] = "特变电工",
					["msg"] = "那个比T打的高一点的法师要分金吗",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [1]
				["info"] = {
				},
			},
			["一葉知秋"] = {
				{
					["type"] = 1,
					["time"] = 1640948924,
					["from"] = "特变电工",
					["msg"] = "7力量多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640948939,
					["from"] = "特变电工",
					["msg"] = "手7力量多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640948954,
					["from"] = "一葉知秋",
					["msg"] = " 7力24G ",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640948958,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640948993,
					["from"] = "一葉知秋",
					["msg"] = "与[特变电工]交易成功。(交出)附魔手套 - 强效力量 (收到)24g",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640949044,
					["from"] = "特变电工",
					["msg"] = "附魔护腕 - 超强耐力多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640949068,
					["from"] = "一葉知秋",
					["msg"] = "9耐9G",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640949084,
					["from"] = "一葉知秋",
					["msg"] = "与[特变电工]交易成功。(交出)附魔护腕 - 超强耐力 (收到)9g",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640949094,
					["from"] = "一葉知秋",
					["msg"] = "没事",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [9]
				["info"] = {
				},
			},
			["美兹兹"] = {
				{
					["type"] = 1,
					["time"] = 1640541098,
					["from"] = "美兹兹",
					["msg"] = "10G 求拿爱与家庭的画 有的MM 谢谢",
					["inbound"] = true,
					["convo"] = "美兹兹",
				}, -- [1]
				["info"] = {
				},
			},
			["强壯壯"] = {
				{
					["type"] = 1,
					["time"] = 1640194230,
					["from"] = "特变电工",
					["msg"] = "大壮",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640194233,
					["from"] = "特变电工",
					["msg"] = "你帮我拿G吧",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640194236,
					["from"] = "特变电工",
					["msg"] = "我还有事",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640194245,
					["from"] = "强壯壯",
					["msg"] = "那我邮你",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640194248,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640194253,
					["from"] = "强壯壯",
					["msg"] = "你团队说一下",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640194261,
					["from"] = "强壯壯",
					["msg"] = "或者m那个团长法师",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640194290,
					["from"] = "特变电工",
					["msg"] = "感谢",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640194296,
					["from"] = "强壯壯",
					["msg"] = "没事",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [9]
				["info"] = {
				},
			},
			["Alei"] = {
				{
					["type"] = 1,
					["time"] = 1640805655,
					["from"] = "特变电工",
					["msg"] = "加我好友",
					["inbound"] = false,
					["convo"] = "Alei",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640805663,
					["from"] = "Alei",
					["msg"] = "加你了",
					["inbound"] = true,
					["convo"] = "Alei",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640805664,
					["from"] = "特变电工",
					["msg"] = "以后经常给你分享投资",
					["inbound"] = false,
					["convo"] = "Alei",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640805671,
					["from"] = "Alei",
					["msg"] = "好的 感谢",
					["inbound"] = true,
					["convo"] = "Alei",
				}, -- [4]
				["info"] = {
				},
			},
			["麦子大叔"] = {
				{
					["type"] = 1,
					["time"] = 1640195312,
					["from"] = "特变电工",
					["msg"] = "我擦 MC几点开始打的哦",
					["inbound"] = false,
					["convo"] = "麦子大叔",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640195312,
					["from"] = "麦子大叔",
					["msg"] = "<DBM> 麦子大叔正在与40人 - 管理者埃克索图斯交战，（当前96%，35/40存活）",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640195325,
					["from"] = "麦子大叔",
					["msg"] = "9.",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640195332,
					["from"] = "特变电工",
					["msg"] = "是公会团吗",
					["inbound"] = false,
					["convo"] = "麦子大叔",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640195337,
					["from"] = "麦子大叔",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640195346,
					["from"] = "特变电工",
					["msg"] = "晚上9点开始的呀",
					["inbound"] = false,
					["convo"] = "麦子大叔",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640195384,
					["from"] = "麦子大叔",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640195452,
					["from"] = "麦子大叔",
					["msg"] = "<DBM> 麦子大叔在40人 - 管理者埃克索图斯（91%）的战斗中灭团了。",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [8]
				["info"] = {
				},
			},
			["蒙塔基钢弹"] = {
				{
					["type"] = 1,
					["time"] = 1640961079,
					["from"] = "特变电工",
					["msg"] = "坦",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640962855,
					["from"] = "特变电工",
					["msg"] = "T",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640962862,
					["from"] = "特变电工",
					["msg"] = "坦克起飞",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640962865,
					["from"] = "特变电工",
					["msg"] = "我又来了",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [4]
				["info"] = {
				},
			},
			["社区送温暖"] = {
				{
					["type"] = 1,
					["time"] = 1640435153,
					["from"] = "社区送温暖",
					["msg"] = "最近新能源崩了啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640435263,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640435268,
					["from"] = "特变电工",
					["msg"] = "我還好",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640435281,
					["from"] = "特变电工",
					["msg"] = "股票漲漲跌跌很正常",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640435285,
					["from"] = "社区送温暖",
					["msg"] = "我之前减了一半还是有点伤",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640435343,
					["from"] = "社区送温暖",
					["msg"] = "看宁德时代像年前茅台一样在崩",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640435539,
					["from"] = "特变电工",
					["msg"] = "死不了人",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640435576,
					["from"] = "特变电工",
					["msg"] = "寧德市值明天超過茅臺",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640882285,
					["from"] = "特变电工",
					["msg"] = "亏惨",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640882293,
					["from"] = "特变电工",
					["msg"] = "2周亏60万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640882295,
					["from"] = "特变电工",
					["msg"] = "毫无压力",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640882328,
					["from"] = "社区送温暖",
					["msg"] = "我今天傻了，忘记清光伏了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640882368,
					["from"] = "社区送温暖",
					["msg"] = "睡过头了，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640882390,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640882396,
					["from"] = "特变电工",
					["msg"] = "那应该快起飞了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640882403,
					["from"] = "社区送温暖",
					["msg"] = "感觉有的跌啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640882404,
					["from"] = "特变电工",
					["msg"] = "内心毫无波兰",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640882407,
					["from"] = "特变电工",
					["msg"] = "都不想看",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640882419,
					["from"] = "特变电工",
					["msg"] = "你还好没清",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640882422,
					["from"] = "特变电工",
					["msg"] = "运气是真的好",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640882428,
					["from"] = "特变电工",
					["msg"] = "你看盘后发改委",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640882440,
					["from"] = "特变电工",
					["msg"] = "重新提光伏了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640882465,
					["from"] = "特变电工",
					["msg"] = "快洗完了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640882471,
					["from"] = "社区送温暖",
					["msg"] = "今天都没起来",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640882480,
					["from"] = "特变电工",
					["msg"] = "你坚持不住了 大多数散户也跟你一样了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640882485,
					["from"] = "特变电工",
					["msg"] = "情绪到达了零界点了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640882486,
					["from"] = "社区送温暖",
					["msg"] = "我分众传媒上赚的都贴光伏了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640882490,
					["from"] = "特变电工",
					["msg"] = "随时起飞",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640882508,
					["from"] = "社区送温暖",
					["msg"] = "最近元宇宙太变态了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640882520,
					["from"] = "社区送温暖",
					["msg"] = "这段时间我便宜一倍多",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640882590,
					["from"] = "社区送温暖",
					["msg"] = "那我拿到年30前一个礼拜卖，年后看时机在买回来",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640882605,
					["from"] = "特变电工",
					["msg"] = "我从来不追热点",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640882616,
					["from"] = "特变电工",
					["msg"] = "A股的元宇宙就是垃圾",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640882622,
					["from"] = "特变电工",
					["msg"] = "我只买美股的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640882633,
					["from"] = "社区送温暖",
					["msg"] = "A股都是炒，一样的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640882640,
					["from"] = "社区送温暖",
					["msg"] = "什么基本面都没用",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640882649,
					["from"] = "特变电工",
					["msg"] = "炒注定要亏钱",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640882657,
					["from"] = "特变电工",
					["msg"] = "我要炒 要&*!@#$去美股赌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640882668,
					["from"] = "特变电工",
					["msg"] = "怎么会在A股赌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640882674,
					["from"] = "特变电工",
					["msg"] = "期权赌不香吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640882679,
					["from"] = "特变电工",
					["msg"] = "我一天赚200% 14万美元",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640882682,
					["from"] = "社区送温暖",
					["msg"] = "反正我现在仓位不重，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640882683,
					["from"] = "特变电工",
					["msg"] = "我去打板",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640882737,
					["from"] = "社区送温暖",
					["msg"] = "不过，最近基金还可以，三个月都正收益，虽然不高",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640882762,
					["from"] = "特变电工",
					["msg"] = "明天最后一天",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640882773,
					["from"] = "特变电工",
					["msg"] = "我今年从120% 回撤到70%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640882780,
					["from"] = "特变电工",
					["msg"] = "收益160万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640882783,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640882811,
					["from"] = "社区送温暖",
					["msg"] = "我也准备搞长线了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640882827,
					["from"] = "社区送温暖",
					["msg"] = "短线太考验心态了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640882850,
					["from"] = "社区送温暖",
					["msg"] = "一次错前面几次连班赚的都赔光",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640882867,
					["from"] = "特变电工",
					["msg"] = "短线胜率低于50%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1640882875,
					["from"] = "特变电工",
					["msg"] = "短线唯一的做法就是仍骰子",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1640882934,
					["from"] = "社区送温暖",
					["msg"] = "还是趴在低位，时间换金钱好",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1640883451,
					["from"] = "特变电工",
					["msg"] = "今晚中改可以",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1640883483,
					["from"] = "社区送温暖",
					["msg"] = "中概我买了100块快跌了10个点了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1640883520,
					["from"] = "社区送温暖",
					["msg"] = "想买的，不知道什么时候买",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1640883529,
					["from"] = "社区送温暖",
					["msg"] = "不太敢抄底",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1640883570,
					["from"] = "特变电工",
					["msg"] = "你开美股了吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1640883580,
					["from"] = "社区送温暖",
					["msg"] = "基金啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1640883583,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1640883670,
					["from"] = "特变电工",
					["msg"] = "开",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1640883843,
					["from"] = "社区送温暖",
					["msg"] = "不弄了，太多更加搞不好了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1640960433,
					["from"] = "社区送温暖",
					["msg"] = "昨天睡过头没卖今天还真的大涨了- -",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1640960822,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1640960826,
					["from"] = "特变电工",
					["msg"] = "韭菜盒子",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1640960830,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1640960845,
					["from"] = "特变电工",
					["msg"] = "我说过了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1640960848,
					["from"] = "特变电工",
					["msg"] = "48",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1640960849,
					["from"] = "社区送温暖",
					["msg"] = "没卖，主要光伏本身就有盈利",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1640960858,
					["from"] = "特变电工",
					["msg"] = "今年结账了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1640960863,
					["from"] = "社区送温暖",
					["msg"] = "之前高的时候有25个点盈利",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1640960864,
					["from"] = "特变电工",
					["msg"] = "收益70%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1640960870,
					["from"] = "特变电工",
					["msg"] = "170万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1640960875,
					["from"] = "特变电工",
					["msg"] = "最高260万 120%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1640960879,
					["from"] = "特变电工",
					["msg"] = "我没卖",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1640960882,
					["from"] = "特变电工",
					["msg"] = "一点也不候会",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1640960885,
					["from"] = "特变电工",
					["msg"] = "后悔",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1640960913,
					["from"] = "社区送温暖",
					["msg"] = "恩，我也准备把周期拉长",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641059581,
					["from"] = "特变电工",
					["msg"] = "你在希利苏斯做T0.5吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641059596,
					["from"] = "社区送温暖",
					["msg"] = "不是，双采。。",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641059601,
					["from"] = "社区送温暖",
					["msg"] = "瞎玩玩",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641059604,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [83]
				["info"] = {
				},
			},
			["牛攵"] = {
				{
					["type"] = 1,
					["time"] = 1640802956,
					["from"] = "牛攵",
					["msg"] = "我马上来 这边通知拿装备了",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640802960,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640803164,
					["from"] = "特变电工",
					["msg"] = "不来了吗。。",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640803176,
					["from"] = "牛攵",
					["msg"] = "马上",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640803203,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640803205,
					["from"] = "特变电工",
					["msg"] = "我是深渊哦",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640803207,
					["from"] = "牛攵",
					["msg"] = "我在血色区拿个装备",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640803225,
					["from"] = "牛攵",
					["msg"] = "炮手",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640803259,
					["from"] = "牛攵",
					["msg"] = "那边打工的 已经到炮手了 通知我过来拿装备",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640803269,
					["from"] = "牛攵",
					["msg"] = "三分钟",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640803283,
					["from"] = "特变电工",
					["msg"] = "好的哈",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640803431,
					["from"] = "牛攵",
					["msg"] = "组",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640804026,
					["from"] = "特变电工",
					["msg"] = "你在哪个MC",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640804029,
					["from"] = "特变电工",
					["msg"] = "团",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640804032,
					["from"] = "特变电工",
					["msg"] = "公会里的",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640804038,
					["from"] = "牛攵",
					["msg"] = "周末团吧 我是里予",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640804061,
					["from"] = "特变电工",
					["msg"] = "中午12点半？",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640804069,
					["from"] = "牛攵",
					["msg"] = "午夜团",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640804080,
					["from"] = "特变电工",
					["msg"] = "午夜团不是周1 9点半吗",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640804081,
					["from"] = "牛攵",
					["msg"] = "上次跟的尾团",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640804094,
					["from"] = "牛攵",
					["msg"] = "昨晚",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640804102,
					["from"] = "特变电工",
					["msg"] = "全通吗",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640804107,
					["from"] = "牛攵",
					["msg"] = "老九",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [23]
				["info"] = {
				},
			},
			["江城第一深情"] = {
				{
					["type"] = 1,
					["time"] = 1640794089,
					["from"] = "江城第一深情",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "江城第一深情",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640794103,
					["from"] = "特变电工",
					["msg"] = "奶吗",
					["inbound"] = false,
					["convo"] = "江城第一深情",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640794104,
					["from"] = "江城第一深情",
					["msg"] = "奶德",
					["inbound"] = true,
					["convo"] = "江城第一深情",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640795982,
					["from"] = "特变电工",
					["msg"] = "？",
					["inbound"] = false,
					["convo"] = "江城第一深情",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640795983,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "江城第一深情",
				}, -- [5]
				["info"] = {
				},
			},
			["风涧芯"] = {
				{
					["type"] = 1,
					["time"] = 1640274237,
					["from"] = "风涧芯",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640274281,
					["from"] = "特变电工",
					["msg"] = "是治疗吧",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640274317,
					["from"] = "风涧芯",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640274386,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16732::::::::60:::::::::|h[勇气腿铠]|h|r|cff0070dd|Hitem:16728::::::::60:::::::::|h[光铸腿铠]|h|r勇气是我的 光铸是你的",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640274402,
					["from"] = "风涧芯",
					["msg"] = "哥，别担心....我只需治疗项链。。。",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640274405,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640274409,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640274412,
					["from"] = "风涧芯",
					["msg"] = "不用这么紧张",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640274427,
					["from"] = "特变电工",
					["msg"] = "。。。。。。。。。。",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640274471,
					["from"] = "风涧芯",
					["msg"] = "可以附2个吗。。。头腿都各来一个",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640274479,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640274482,
					["from"] = "风涧芯",
					["msg"] = "发错了",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640274514,
					["from"] = "风涧芯",
					["msg"] = "我去附个魔，1分钟",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640274522,
					["from"] = "特变电工",
					["msg"] = "队伍里说",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640274608,
					["from"] = "风涧芯",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640274611,
					["from"] = "风涧芯",
					["msg"] = "搞定了",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640280896,
					["from"] = "特变电工",
					["msg"] = "继续",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640280902,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [18]
				["info"] = {
				},
			},
			["我给你跪下了"] = {
				{
					["type"] = 1,
					["time"] = 1640537832,
					["from"] = "特变电工",
					["msg"] = "出碧空了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640537834,
					["from"] = "特变电工",
					["msg"] = "4000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640537839,
					["from"] = "特变电工",
					["msg"] = "一个人分了352",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640537903,
					["from"] = "特变电工",
					["msg"] = "只有一个人能灭火",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640537940,
					["from"] = "我给你跪下了",
					["msg"] = "没人愿意做那个额 麻烦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640537949,
					["from"] = "我给你跪下了",
					["msg"] = "还好了 能分点钱",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640537999,
					["from"] = "我给你跪下了",
					["msg"] = "你们灭过吗 还是一次过",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640615249,
					["from"] = "特变电工",
					["msg"] = "马上开奖",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640615251,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640615253,
					["from"] = "特变电工",
					["msg"] = "第20次",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640615275,
					["from"] = "我给你跪下了",
					["msg"] = "快摸",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640615275,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 瑞文戴尔男爵交战，（当前94%，5/5存活）",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640615318,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 瑞文戴尔男爵的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640615343,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16687::::::::60:::::::::|h[博学者护腿]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640615358,
					["from"] = "我给你跪下了",
					["msg"] = "这。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640615362,
					["from"] = "我给你跪下了",
					["msg"] = "20次不出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640617752,
					["from"] = "特变电工",
					["msg"] = "又要摸奖了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640617754,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640617864,
					["from"] = "我给你跪下了",
					["msg"] = "没事 马上了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640617872,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640617894,
					["from"] = "我给你跪下了",
					["msg"] = "再来20次 我觉得可以出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640617894,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 瑞文戴尔男爵交战，（当前87%，5/5存活）",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640617935,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 瑞文戴尔男爵的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640617942,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16728::::::::60:::::::::|h[光铸腿铠]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640617958,
					["from"] = "我给你跪下了",
					["msg"] = "不亏 这个也不好出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640617961,
					["from"] = "我给你跪下了",
					["msg"] = "我只见过一次",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640617966,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640618060,
					["from"] = "特变电工",
					["msg"] = "我想删号",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640618061,
					["from"] = "特变电工",
					["msg"] = "真的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640618072,
					["from"] = "我给你跪下了",
					["msg"] = "耐心",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640618084,
					["from"] = "我给你跪下了",
					["msg"] = "在刷他一个月又怎么样",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640619925,
					["from"] = "我给你跪下了",
					["msg"] = "你还在斯坦索姆。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640952464,
					["from"] = "特变电工",
					["msg"] = "我已经彻底毕业",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640952481,
					["from"] = "我给你跪下了",
					["msg"] = "只差团本了？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640952490,
					["from"] = "特变电工",
					["msg"] = "还有胡里奥",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640952506,
					["from"] = "我给你跪下了",
					["msg"] = "那个好弄",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640952510,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640952523,
					["from"] = "特变电工",
					["msg"] = "我一把奥山砍人荣誉都有4000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640952532,
					["from"] = "特变电工",
					["msg"] = "找人单挑",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640952536,
					["from"] = "特变电工",
					["msg"] = "一个300",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640952542,
					["from"] = "特变电工",
					["msg"] = "一场砍10几个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640952557,
					["from"] = "我给你跪下了",
					["msg"] = "去哪砍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640952574,
					["from"] = "特变电工",
					["msg"] = "看时机",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640952586,
					["from"] = "特变电工",
					["msg"] = "比如他们营地门口大树后面蹲",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640952599,
					["from"] = "特变电工",
					["msg"] = "比如他们墓地前蹲复活的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640952615,
					["from"] = "特变电工",
					["msg"] = "队列后面落单的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640952631,
					["from"] = "我给你跪下了",
					["msg"] = "可以 一天能刷好多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640952643,
					["from"] = "特变电工",
					["msg"] = "我就无聊打打",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640952684,
					["from"] = "我给你跪下了",
					["msg"] = "狂暴战有点脆感觉",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640952692,
					["from"] = "我给你跪下了",
					["msg"] = "没有武器狠",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640952884,
					["from"] = "我给你跪下了",
					["msg"] = "你0.5做到哪一步了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640953066,
					["from"] = "特变电工",
					["msg"] = "刚做到脚",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1640953079,
					["from"] = "特变电工",
					["msg"] = "我等武器有了打武器战",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1640954218,
					["from"] = "特变电工",
					["msg"] = "&*!@#$%^&",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1640954222,
					["from"] = "特变电工",
					["msg"] = "不能打阿拉希和战歌",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1640954225,
					["from"] = "特变电工",
					["msg"] = "全是国家队",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1640954229,
					["from"] = "特变电工",
					["msg"] = "对面一群元帅",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1640954254,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈 是啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1640954259,
					["from"] = "特变电工",
					["msg"] = "我才法系",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1640954261,
					["from"] = "特变电工",
					["msg"] = "发i西安",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1640954264,
					["from"] = "特变电工",
					["msg"] = "发现",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1640954280,
					["from"] = "我给你跪下了",
					["msg"] = "他们冲军衔最后一周了大概 快14了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1640954357,
					["from"] = "特变电工",
					["msg"] = "我在战歌捣乱",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1640954368,
					["from"] = "特变电工",
					["msg"] = "拿他们棋子 放3楼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1640954385,
					["from"] = "我给你跪下了",
					["msg"] = "战歌我去过一次 直接0荣誉出场了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1640954387,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641016164,
					["from"] = "特变电工",
					["msg"] = "灰烬使者",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641016169,
					["from"] = "特变电工",
					["msg"] = "灰烬公爵",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641016169,
					["from"] = "我给你跪下了",
					["msg"] = "啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641016174,
					["from"] = "特变电工",
					["msg"] = "我去做T0.5任务了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641016184,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641016194,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641016199,
					["from"] = "特变电工",
					["msg"] = "你做到哪一步了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641016204,
					["from"] = "我给你跪下了",
					["msg"] = "没做呢",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641016215,
					["from"] = "特变电工",
					["msg"] = "黑上胸也出了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641016221,
					["from"] = "我给你跪下了",
					["msg"] = "没 没去呢",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641016266,
					["from"] = "我给你跪下了",
					["msg"] = "我看战士的4件套不猛啊好像",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641016284,
					["from"] = "特变电工",
					["msg"] = "猛",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641016298,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21995::::::::60:::::::::|h[英勇长靴]|h|r|cffa335ee|Hitem:21998::::::::60:::::::::|h[英勇护手]|h|r|cffa335ee|Hitem:21999::::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997::::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641016337,
					["from"] = "我给你跪下了",
					["msg"] = "单件可以 套装效果回血是PVP的吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641016371,
					["from"] = "特变电工",
					["msg"] = "本来就i是PVP",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641016376,
					["from"] = "特变电工",
					["msg"] = "PVE就一个鞋",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641016380,
					["from"] = "特变电工",
					["msg"] = "我拿来砍人的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641016384,
					["from"] = "我给你跪下了",
					["msg"] = "比军装还猛吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641016390,
					["from"] = "特变电工",
					["msg"] = "R10好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641016397,
					["from"] = "特变电工",
					["msg"] = "没有R13好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641016412,
					["from"] = "特变电工",
					["msg"] = ">r10 <r13",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641016418,
					["from"] = "我给你跪下了",
					["msg"] = "那不刷个r13？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641016423,
					["from"] = "特变电工",
					["msg"] = "慢慢来啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641016430,
					["from"] = "特变电工",
					["msg"] = "我没啥时间",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641016438,
					["from"] = "特变电工",
					["msg"] = "到时候直接TAQ T2.5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641016442,
					["from"] = "我给你跪下了",
					["msg"] = "那也是 r13太肝了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641016448,
					["from"] = "特变电工",
					["msg"] = "比R13好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641016486,
					["from"] = "我给你跪下了",
					["msg"] = "我算了算好像要很久我才能到r11",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641016494,
					["from"] = "特变电工",
					["msg"] = "我军衔就打着玩",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641016496,
					["from"] = "特变电工",
					["msg"] = "随缘",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641016504,
					["from"] = "我给你跪下了",
					["msg"] = "擦 又不能放弃 不然之前白打",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641016520,
					["from"] = "特变电工",
					["msg"] = "赌徒效应",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641016523,
					["from"] = "特变电工",
					["msg"] = "你现在陷入了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641016536,
					["from"] = "我给你跪下了",
					["msg"] = "哎",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为所有数据",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  959,521 (!@#.7, 5.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "2. |cfffff468Naq|r  945,715 (424.6, 5.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "3. |cfffff468别惹我|r  939,829 (423.3, 5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "4. |cffc69b6d追风中年|r  896,813 (496.3, 4.8%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "5. |cff3fc6ea宝石大哥|r  892,979 (788.7, 4.8%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "6. |cff3fc6ea银叶草丶|r  862,069 (701.9, 4.6%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "7. |cff3fc6ea吧唧|r  817,193 ($%^.6, 4.4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "8. |cffc69b6d芜湖小司马|r  805,527 (407.0, 4.3%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "9. |cffaad372夏虫不可语冰|r  796,424 (486.1, 4.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1641106637,
					["from"] = "特变电工",
					["msg"] = "10. |cff3fc6ea杰克信仰|r  773,080 (701.6, 4.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1641106686,
					["from"] = "特变电工",
					["msg"] = "轻松第一啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1641106688,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1641106795,
					["from"] = "我给你跪下了",
					["msg"] = "老几了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1641106810,
					["from"] = "特变电工",
					["msg"] = "出稳固 迅疾了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1641106812,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1641106814,
					["from"] = "特变电工",
					["msg"] = "5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1641106838,
					["from"] = "我给你跪下了",
					["msg"] = "可以 直接拿下了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1641106847,
					["from"] = "特变电工",
					["msg"] = "我身上只有3600",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1641106887,
					["from"] = "我给你跪下了",
					["msg"] = "应该可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1641106900,
					["from"] = "特变电工",
					["msg"] = "我T0.5最后一步了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1641106924,
					["from"] = "我给你跪下了",
					["msg"] = "黑上？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1641106929,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1641106941,
					["from"] = "我给你跪下了",
					["msg"] = "牛 很快啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1641106953,
					["from"] = "特变电工",
					["msg"] = "可以去砍人了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1641106995,
					["from"] = "我给你跪下了",
					["msg"] = "起飞了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1641106995,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与40人 - 迦顿男爵交战，（当前95%，40/40存活）",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1641107175,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工在40人 - 迦顿男爵（49%）的战斗中灭团了。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1641109274,
					["from"] = "特变电工",
					["msg"] = "1700",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1641109288,
					["from"] = "我给你跪下了",
					["msg"] = "迅击？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1641109291,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1641109292,
					["from"] = "特变电工",
					["msg"] = "我买了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1641109293,
					["from"] = "特变电工",
					["msg"] = "还可以",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1641109299,
					["from"] = "我给你跪下了",
					["msg"] = "还好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1641109306,
					["from"] = "特变电工",
					["msg"] = "PVP也可以",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1641109311,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为所有数据",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  1,745,729 (432.2, 5.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [138]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "2. |cffc69b6d追风中年|r  1,672,742 (492.5, 5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [139]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "3. |cfffff468Naq|r  1,576,020 (393.5, 4.7%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [140]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "4. |cff3fc6ea宝石大哥|r  1,533,764 (676.3, 4.5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [141]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "5. |cff3fc6ea吧唧|r  1,531,380 (636.8, 4.5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [142]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "6. |cffaad372夏虫不可语冰|r  1,478,549 (451.9, 4.4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [143]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "7. |cffc69b6d芜湖小司马|r  1,413,878 (377.6, 4.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [144]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "8. |cff3fc6ea杰克信仰|r  1,386,921 (618.2, 4.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [145]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "9. |cfffff468别惹我|r  1,385,105 (421.7, 4.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [146]
				{
					["type"] = 1,
					["time"] = 1641115379,
					["from"] = "特变电工",
					["msg"] = "10. |cfffff468骚气贼|r  1,362,430 (369.1, 4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [147]
				{
					["type"] = 1,
					["time"] = 1641115379,
					["from"] = "特变电工",
					["msg"] = "1-9总伤害",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [148]
				{
					["type"] = 1,
					["time"] = 1641115407,
					["from"] = "我给你跪下了",
					["msg"] = "牛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [149]
				{
					["type"] = 1,
					["time"] = 1641115413,
					["from"] = "我给你跪下了",
					["msg"] = "有点狠",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [150]
				{
					["type"] = 1,
					["time"] = 1641115424,
					["from"] = "特变电工",
					["msg"] = "后面都没吃药了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [151]
				{
					["type"] = 1,
					["time"] = 1641115501,
					["from"] = "我给你跪下了",
					["msg"] = "这伤害有点厉害",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [152]
				{
					["type"] = 1,
					["time"] = 1641115511,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [153]
				{
					["type"] = 1,
					["time"] = 1641115514,
					["from"] = "特变电工",
					["msg"] = "基本$%^作",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [154]
				{
					["type"] = 1,
					["time"] = 1641115521,
					["from"] = "特变电工",
					["msg"] = "都坐下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [155]
				{
					["type"] = 1,
					["time"] = 1641115521,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [156]
				{
					["type"] = 1,
					["time"] = 1641115522,
					["from"] = "我给你跪下了",
					["msg"] = "主要现在第一阶段",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [157]
				{
					["type"] = 1,
					["time"] = 1641115531,
					["from"] = "我给你跪下了",
					["msg"] = "狂暴战第一可以的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [158]
				{
					["type"] = 1,
					["time"] = 1641140308,
					["from"] = "特变电工",
					["msg"] = "我!@#$%^要吐了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [159]
				{
					["type"] = 1,
					["time"] = 1641140311,
					["from"] = "特变电工",
					["msg"] = "通灵",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [160]
				{
					["type"] = 1,
					["time"] = 1641229779,
					["from"] = "我给你跪下了",
					["msg"] = "还没睡",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [161]
				{
					["type"] = 1,
					["time"] = 1641229786,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [162]
				{
					["type"] = 1,
					["time"] = 1641229804,
					["from"] = "我给你跪下了",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [163]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为上次战斗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [164]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  227,241 (459.8, 5.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [165]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "2. |cffaad372花都丶多猎|r  208,297 (443.5, 4.8%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [166]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "3. |cff3fc6ea淡淡忧伤|r  192,061 (510.0, 4.4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [167]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "4. |cffaad372小汉子|r  191,183 (386.3, 4.4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [168]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "5. |cfffff468光头加发蜡|r  185,274 (351.4, 4.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [169]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "6. |cfffff468没事人|r  181,575 (482.2, 4.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [170]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "7. |cff3fc6ea邪恶努努|r  173,220 (443.2, 3.9%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [171]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "8. |cff3fc6ea电音之王|r  172,930 (575.6, 3.9%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [172]
				{
					["type"] = 1,
					["time"] = 1641307352,
					["from"] = "特变电工",
					["msg"] = "9. |cfffff468贼心不死|r  172,721 (397.8, 3.9%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [173]
				{
					["type"] = 1,
					["time"] = 1641307362,
					["from"] = "特变电工",
					["msg"] = "10. |cff3fc6ea低手坟墓|r  170,296 (539.0, 3.9%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [174]
				{
					["type"] = 1,
					["time"] = 1641307362,
					["from"] = "特变电工",
					["msg"] = "黑龙又第一。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [175]
				{
					["type"] = 1,
					["time"] = 1641307377,
					["from"] = "我给你跪下了",
					["msg"] = "KEYI",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [176]
				{
					["type"] = 1,
					["time"] = 1641307444,
					["from"] = "特变电工",
					["msg"] = "昨天我包养了一个骑士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [177]
				{
					["type"] = 1,
					["time"] = 1641307450,
					["from"] = "特变电工",
					["msg"] = "2个人杀了13个人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [178]
				{
					["type"] = 1,
					["time"] = 1641307465,
					["from"] = "特变电工",
					["msg"] = "直接把部落全杀回家变成坑场了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [179]
				{
					["type"] = 1,
					["time"] = 1641307466,
					["from"] = "特变电工",
					["msg"] = "。。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [180]
				{
					["type"] = 1,
					["time"] = 1641307471,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [181]
				{
					["type"] = 1,
					["time"] = 1641307473,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [182]
				{
					["type"] = 1,
					["time"] = 1641307474,
					["from"] = "特变电工",
					["msg"] = "笑死我了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [183]
				{
					["type"] = 1,
					["time"] = 1641307491,
					["from"] = "我给你跪下了",
					["msg"] = "强",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [184]
				{
					["type"] = 1,
					["time"] = 1641307523,
					["from"] = "特变电工",
					["msg"] = "他们3个3个的上 在南塔",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [185]
				{
					["type"] = 1,
					["time"] = 1641307535,
					["from"] = "特变电工",
					["msg"] = "葫芦娃救爷爷",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [186]
				{
					["type"] = 1,
					["time"] = 1641307563,
					["from"] = "我给你跪下了",
					["msg"] = "战士一个斩杀打我2000多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [187]
				{
					["type"] = 1,
					["time"] = 1641307570,
					["from"] = "特变电工",
					["msg"] = "正常",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [188]
				{
					["type"] = 1,
					["time"] = 1641307571,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [189]
				{
					["type"] = 1,
					["time"] = 1641307609,
					["from"] = "我给你跪下了",
					["msg"] = "致死斩杀我没了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [190]
				{
					["type"] = 1,
					["time"] = 1641307631,
					["from"] = "特变电工",
					["msg"] = "你上毒放风筝",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [191]
				{
					["type"] = 1,
					["time"] = 1641307640,
					["from"] = "特变电工",
					["msg"] = "卡8码",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [192]
				{
					["type"] = 1,
					["time"] = 1641307683,
					["from"] = "我给你跪下了",
					["msg"] = "没那技术",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [193]
				{
					["type"] = 1,
					["time"] = 1641308001,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18423::::::::60:::::::::|h[奥妮克希亚的头颅]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [194]
				{
					["type"] = 1,
					["time"] = 1641308004,
					["from"] = "特变电工",
					["msg"] = "1500",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [195]
				{
					["type"] = 1,
					["time"] = 1641308009,
					["from"] = "特变电工",
					["msg"] = "懒得等了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [196]
				{
					["type"] = 1,
					["time"] = 1641308011,
					["from"] = "特变电工",
					["msg"] = "直接起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [197]
				{
					["type"] = 1,
					["time"] = 1641308049,
					["from"] = "我给你跪下了",
					["msg"] = "低价多少",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [198]
				{
					["type"] = 1,
					["time"] = 1641308159,
					["from"] = "特变电工",
					["msg"] = "500",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [199]
				{
					["type"] = 1,
					["time"] = 1641308163,
					["from"] = "特变电工",
					["msg"] = "起拍",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [200]
				{
					["type"] = 1,
					["time"] = 1641308214,
					["from"] = "我给你跪下了",
					["msg"] = "狂暴战能用到P几",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [201]
				{
					["type"] = 1,
					["time"] = 1641308218,
					["from"] = "我给你跪下了",
					["msg"] = "这个",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [202]
				{
					["type"] = 1,
					["time"] = 1641308220,
					["from"] = "特变电工",
					["msg"] = "NAXX",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [203]
				{
					["type"] = 1,
					["time"] = 1641308224,
					["from"] = "我给你跪下了",
					["msg"] = "那可以 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [204]
				{
					["type"] = 1,
					["time"] = 1641308232,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r也是",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [205]
				{
					["type"] = 1,
					["time"] = 1641308234,
					["from"] = "我给你跪下了",
					["msg"] = "盗贼不怎么需要这个",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [206]
				{
					["type"] = 1,
					["time"] = 1641313984,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [207]
				{
					["type"] = 1,
					["time"] = 1641313989,
					["from"] = "特变电工",
					["msg"] = "我们能不能一起起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [208]
				{
					["type"] = 1,
					["time"] = 1641313995,
					["from"] = "我给你跪下了",
					["msg"] = "哪里",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [209]
				{
					["type"] = 1,
					["time"] = 1641313997,
					["from"] = "特变电工",
					["msg"] = "每次都遇不见你",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [210]
				{
					["type"] = 1,
					["time"] = 1641313999,
					["from"] = "特变电工",
					["msg"] = "奥山",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [211]
				{
					["type"] = 1,
					["time"] = 1641314011,
					["from"] = "我给你跪下了",
					["msg"] = "来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [212]
				{
					["type"] = 1,
					["time"] = 1641314021,
					["from"] = "特变电工",
					["msg"] = "你排了没",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [213]
				{
					["type"] = 1,
					["time"] = 1641314024,
					["from"] = "我给你跪下了",
					["msg"] = "没",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [214]
				{
					["type"] = 1,
					["time"] = 1641314029,
					["from"] = "特变电工",
					["msg"] = "我已经拍了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [215]
				{
					["type"] = 1,
					["time"] = 1641314030,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [216]
				{
					["type"] = 1,
					["time"] = 1641314032,
					["from"] = "我给你跪下了",
					["msg"] = "组我啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [217]
				{
					["type"] = 1,
					["time"] = 1641314038,
					["from"] = "特变电工",
					["msg"] = "别人的队长",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [218]
				{
					["type"] = 1,
					["time"] = 1641314039,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [219]
				{
					["type"] = 1,
					["time"] = 1641314044,
					["from"] = "我给你跪下了",
					["msg"] = "那明天",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [220]
				{
					["type"] = 1,
					["time"] = 1641314047,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [221]
				{
					["type"] = 1,
					["time"] = 1641314050,
					["from"] = "我给你跪下了",
					["msg"] = "我今天先休息",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [222]
				{
					["type"] = 1,
					["time"] = 1641314053,
					["from"] = "特变电工",
					["msg"] = "好的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [223]
				{
					["type"] = 1,
					["time"] = 1641314064,
					["from"] = "我给你跪下了",
					["msg"] = "找的黑上团衣服都包出去了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [224]
				{
					["type"] = 1,
					["time"] = 1641314066,
					["from"] = "我给你跪下了",
					["msg"] = "晕",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [225]
				{
					["type"] = 1,
					["time"] = 1641314072,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [226]
				{
					["type"] = 1,
					["time"] = 1641314072,
					["from"] = "我给你跪下了",
					["msg"] = "问了十多个",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [227]
				{
					["type"] = 1,
					["time"] = 1641314081,
					["from"] = "特变电工",
					["msg"] = "你做到最后一步了？",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [228]
				{
					["type"] = 1,
					["time"] = 1641314096,
					["from"] = "我给你跪下了",
					["msg"] = "没做呢 先把衣服买了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [229]
				{
					["type"] = 1,
					["time"] = 1641314107,
					["from"] = "我给你跪下了",
					["msg"] = "挺难找位置还",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [230]
				{
					["type"] = 1,
					["time"] = 1641314114,
					["from"] = "我给你跪下了",
					["msg"] = "问了一天都是包出去了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [231]
				{
					["type"] = 1,
					["time"] = 1641314148,
					["from"] = "我给你跪下了",
					["msg"] = "先下了 明天搞奥山看看你的表演",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [232]
				{
					["type"] = 1,
					["time"] = 1641314150,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [233]
				{
					["type"] = 1,
					["time"] = 1641390068,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [234]
				{
					["type"] = 1,
					["time"] = 1641390077,
					["from"] = "特变电工",
					["msg"] = "把把都起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [235]
				{
					["type"] = 1,
					["time"] = 1641390096,
					["from"] = "特变电工",
					["msg"] = "T0.5是真的好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [236]
				{
					["type"] = 1,
					["time"] = 1641390113,
					["from"] = "特变电工",
					["msg"] = "我想喝泰坦打奥山了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [237]
				{
					["type"] = 1,
					["time"] = 1641390143,
					["from"] = "我给你跪下了",
					["msg"] = "你多少血",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [238]
				{
					["type"] = 1,
					["time"] = 1641390153,
					["from"] = "特变电工",
					["msg"] = "5千 无BUFF",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [239]
				{
					["type"] = 1,
					["time"] = 1641390184,
					["from"] = "特变电工",
					["msg"] = "可还行",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [240]
				{
					["type"] = 1,
					["time"] = 1641390190,
					["from"] = "特变电工",
					["msg"] = "盗贼的噩梦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [241]
				{
					["type"] = 1,
					["time"] = 1641390193,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [242]
				{
					["type"] = 1,
					["time"] = 1641390201,
					["from"] = "特变电工",
					["msg"] = "我专砍盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [243]
				{
					["type"] = 1,
					["time"] = 1641390206,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [244]
				{
					["type"] = 1,
					["time"] = 1641390207,
					["from"] = "特变电工",
					["msg"] = "猎人 术士 ",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [245]
				{
					["type"] = 1,
					["time"] = 1641390213,
					["from"] = "特变电工",
					["msg"] = "从来没输过",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [246]
				{
					["type"] = 1,
					["time"] = 1641390217,
					["from"] = "特变电工",
					["msg"] = "2个一起上都不是我对手",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [247]
				{
					["type"] = 1,
					["time"] = 1641390236,
					["from"] = "特变电工",
					["msg"] = "晕完起来就秒一个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [248]
				{
					["type"] = 1,
					["time"] = 1641390255,
					["from"] = "我给你跪下了",
					["msg"] = "一起啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [249]
				{
					["type"] = 1,
					["time"] = 1641390261,
					["from"] = "特变电工",
					["msg"] = "出来等",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [250]
				{
					["type"] = 1,
					["time"] = 1641390265,
					["from"] = "特变电工",
					["msg"] = "我刚进去",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [251]
				{
					["type"] = 1,
					["time"] = 1641390265,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [252]
				{
					["type"] = 1,
					["time"] = 1641390267,
					["from"] = "特变电工",
					["msg"] = "我带你起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [253]
				{
					["type"] = 1,
					["time"] = 1641390274,
					["from"] = "特变电工",
					["msg"] = "2人荣誉小分队",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [254]
				{
					["type"] = 1,
					["time"] = 1641390290,
					["from"] = "特变电工",
					["msg"] = "上一把在冰翼 一个人杀了5个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [255]
				{
					["type"] = 1,
					["time"] = 1641390300,
					["from"] = "特变电工",
					["msg"] = "他们开场15分钟之后都没开",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [256]
				{
					["type"] = 1,
					["time"] = 1641390309,
					["from"] = "特变电工",
					["msg"] = "一夫当关 万夫莫开",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [257]
				{
					["type"] = 1,
					["time"] = 1641390324,
					["from"] = "特变电工",
					["msg"] = "我杀人一场都有2000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [258]
				{
					["type"] = 1,
					["time"] = 1641390328,
					["from"] = "特变电工",
					["msg"] = "荣誉",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [259]
				{
					["type"] = 1,
					["time"] = 1641390335,
					["from"] = "特变电工",
					["msg"] = "荣誉狗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [260]
				{
					["type"] = 1,
					["time"] = 1641390336,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [261]
				{
					["type"] = 1,
					["time"] = 1641390353,
					["from"] = "我给你跪下了",
					["msg"] = "。。没人骂你啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [262]
				{
					["type"] = 1,
					["time"] = 1641390359,
					["from"] = "特变电工",
					["msg"] = "骂我干嘛",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [263]
				{
					["type"] = 1,
					["time"] = 1641390375,
					["from"] = "我给你跪下了",
					["msg"] = "单吃的没把都被骂",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [264]
				{
					["type"] = 1,
					["time"] = 1641390411,
					["from"] = "我给你跪下了",
					["msg"] = "有时候两边人就喷起来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [265]
				{
					["type"] = 1,
					["time"] = 1641390994,
					["from"] = "我给你跪下了",
					["msg"] = "*!@9 这么整齐",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [266]
				{
					["type"] = 1,
					["time"] = 1641391137,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [267]
				{
					["type"] = 1,
					["time"] = 1641391269,
					["from"] = "特变电工",
					["msg"] = "我要的BUFF",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [268]
				{
					["type"] = 1,
					["time"] = 1641391277,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [269]
				{
					["type"] = 1,
					["time"] = 1641391280,
					["from"] = "特变电工",
					["msg"] = "单耐",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [270]
				{
					["type"] = 1,
					["time"] = 1641391285,
					["from"] = "特变电工",
					["msg"] = "先中场拦截吧",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [271]
				{
					["type"] = 1,
					["time"] = 1641391285,
					["from"] = "我给你跪下了",
					["msg"] = "6000 跟R13的差不多了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [272]
				{
					["type"] = 1,
					["time"] = 1641391296,
					["from"] = "我给你跪下了",
					["msg"] = "我先去开救济",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [273]
				{
					["type"] = 1,
					["time"] = 1641391301,
					["from"] = "特变电工",
					["msg"] = "杀人啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [274]
				{
					["type"] = 1,
					["time"] = 1641391305,
					["from"] = "我给你跪下了",
					["msg"] = "我开完来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [275]
				{
					["type"] = 1,
					["time"] = 1641391306,
					["from"] = "特变电工",
					["msg"] = "让他们开",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [276]
				{
					["type"] = 1,
					["time"] = 1641391308,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [277]
				{
					["type"] = 1,
					["time"] = 1641391319,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [278]
				{
					["type"] = 1,
					["time"] = 1641391324,
					["from"] = "特变电工",
					["msg"] = "你&*!这个心干嘛",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [279]
				{
					["type"] = 1,
					["time"] = 1641391336,
					["from"] = "特变电工",
					["msg"] = "我们砍人刷荣誉 玩的开心",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [280]
				{
					["type"] = 1,
					["time"] = 1641391341,
					["from"] = "特变电工",
					["msg"] = "输赢不重要",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [281]
				{
					["type"] = 1,
					["time"] = 1641391344,
					["from"] = "特变电工",
					["msg"] = "防守也很重要",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [282]
				{
					["type"] = 1,
					["time"] = 1641391345,
					["from"] = "我给你跪下了",
					["msg"] = "确实",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [283]
				{
					["type"] = 1,
					["time"] = 1641391350,
					["from"] = "特变电工",
					["msg"] = "个人荣誉",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [284]
				{
					["type"] = 1,
					["time"] = 1641391356,
					["from"] = "特变电工",
					["msg"] = "有你没你都一样",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [285]
				{
					["type"] = 1,
					["time"] = 1641391360,
					["from"] = "特变电工",
					["msg"] = "防守好了一样的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [286]
				{
					["type"] = 1,
					["time"] = 1641391382,
					["from"] = "我给你跪下了",
					["msg"] = "准备看你表演了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [287]
				{
					["type"] = 1,
					["time"] = 1641391416,
					["from"] = "特变电工",
					["msg"] = "我死了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [288]
				{
					["type"] = 1,
					["time"] = 1641391417,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [289]
				{
					["type"] = 1,
					["time"] = 1641391420,
					["from"] = "特变电工",
					["msg"] = "一群人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [290]
				{
					["type"] = 1,
					["time"] = 1641391422,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [291]
				{
					["type"] = 1,
					["time"] = 1641391436,
					["from"] = "我给你跪下了",
					["msg"] = "那肯定",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [292]
				{
					["type"] = 1,
					["time"] = 1641391477,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [293]
				{
					["type"] = 1,
					["time"] = 1641391481,
					["from"] = "特变电工",
					["msg"] = "每次后面都有增援",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [294]
				{
					["type"] = 1,
					["time"] = 1641391485,
					["from"] = "特变电工",
					["msg"] = "眼看要杀死",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [295]
				{
					["type"] = 1,
					["time"] = 1641391488,
					["from"] = "特变电工",
					["msg"] = "运气不好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [296]
				{
					["type"] = 1,
					["time"] = 1641391511,
					["from"] = "我给你跪下了",
					["msg"] = "我来看你表演了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [297]
				{
					["type"] = 1,
					["time"] = 1641391704,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [298]
				{
					["type"] = 1,
					["time"] = 1641391712,
					["from"] = "我给你跪下了",
					["msg"] = "然后去哪",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [299]
				{
					["type"] = 1,
					["time"] = 1641391717,
					["from"] = "特变电工",
					["msg"] = "雷矛",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [300]
				{
					["type"] = 1,
					["time"] = 1641391719,
					["from"] = "特变电工",
					["msg"] = "墓地",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [301]
				{
					["type"] = 1,
					["time"] = 1641391720,
					["from"] = "特变电工",
					["msg"] = "杀人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [302]
				{
					["type"] = 1,
					["time"] = 1641392017,
					["from"] = "我给你跪下了",
					["msg"] = "可以 猛啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [303]
				{
					["type"] = 1,
					["time"] = 1641392022,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [304]
				{
					["type"] = 1,
					["time"] = 1641392024,
					["from"] = "特变电工",
					["msg"] = "失误了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [305]
				{
					["type"] = 1,
					["time"] = 1641392030,
					["from"] = "特变电工",
					["msg"] = "每次都有增援",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [306]
				{
					["type"] = 1,
					["time"] = 1641392061,
					["from"] = "我给你跪下了",
					["msg"] = "我觉得挺猛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [307]
				{
					["type"] = 1,
					["time"] = 1641392075,
					["from"] = "特变电工",
					["msg"] = "上把没发挥出来",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [308]
				{
					["type"] = 1,
					["time"] = 1641392076,
					["from"] = "特变电工",
					["msg"] = "不算。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [309]
				{
					["type"] = 1,
					["time"] = 1641392081,
					["from"] = "我给你跪下了",
					["msg"] = "宏",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [310]
				{
					["type"] = 1,
					["time"] = 1641392081,
					["from"] = "特变电工",
					["msg"] = "丢人了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [311]
				{
					["type"] = 1,
					["time"] = 1641392082,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [312]
				{
					["type"] = 1,
					["time"] = 1641392086,
					["from"] = "我给你跪下了",
					["msg"] = "再来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [313]
				{
					["type"] = 1,
					["time"] = 1641392093,
					["from"] = "特变电工",
					["msg"] = "你别去前面了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [314]
				{
					["type"] = 1,
					["time"] = 1641392101,
					["from"] = "特变电工",
					["msg"] = "直接中场开干",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [315]
				{
					["type"] = 1,
					["time"] = 1641392111,
					["from"] = "特变电工",
					["msg"] = "干一半回家",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [316]
				{
					["type"] = 1,
					["time"] = 1641392116,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [317]
				{
					["type"] = 1,
					["time"] = 1641392120,
					["from"] = "我给你跪下了",
					["msg"] = "可以 我直接中场开送",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [318]
				{
					["type"] = 1,
					["time"] = 1641392124,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [319]
				{
					["type"] = 1,
					["time"] = 1641392271,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [320]
				{
					["type"] = 1,
					["time"] = 1641392273,
					["from"] = "特变电工",
					["msg"] = "黑石塔",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [321]
				{
					["type"] = 1,
					["time"] = 1641392275,
					["from"] = "特变电工",
					["msg"] = "排队的时间",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [322]
				{
					["type"] = 1,
					["time"] = 1641392280,
					["from"] = "特变电工",
					["msg"] = "利用起来",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [323]
				{
					["type"] = 1,
					["time"] = 1641392285,
					["from"] = "我给你跪下了",
					["msg"] = "黑石塔干啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [324]
				{
					["type"] = 1,
					["time"] = 1641392287,
					["from"] = "特变电工",
					["msg"] = "杀人啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [325]
				{
					["type"] = 1,
					["time"] = 1641392289,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [326]
				{
					["type"] = 1,
					["time"] = 1641392294,
					["from"] = "特变电工",
					["msg"] = "来不及了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [327]
				{
					["type"] = 1,
					["time"] = 1641392297,
					["from"] = "我给你跪下了",
					["msg"] = "飞过去都进了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [328]
				{
					["type"] = 1,
					["time"] = 1641392316,
					["from"] = "特变电工",
					["msg"] = "能毛几百荣誉是几百",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [329]
				{
					["type"] = 1,
					["time"] = 1641392319,
					["from"] = "特变电工",
					["msg"] = "很近的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [330]
				{
					["type"] = 1,
					["time"] = 1641392601,
					["from"] = "特变电工",
					["msg"] = "回",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [331]
				{
					["type"] = 1,
					["time"] = 1641392602,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [332]
				{
					["type"] = 1,
					["time"] = 1641392606,
					["from"] = "特变电工",
					["msg"] = "我强杀了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [333]
				{
					["type"] = 1,
					["time"] = 1641392648,
					["from"] = "我给你跪下了",
					["msg"] = "来了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [334]
				{
					["type"] = 1,
					["time"] = 1641392680,
					["from"] = "我给你跪下了",
					["msg"] = "有Z在",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [335]
				{
					["type"] = 1,
					["time"] = 1641392836,
					["from"] = "我给你跪下了",
					["msg"] = "好像人有点多了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [336]
				{
					["type"] = 1,
					["time"] = 1641392840,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [337]
				{
					["type"] = 1,
					["time"] = 1641392844,
					["from"] = "特变电工",
					["msg"] = "走了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [338]
				{
					["type"] = 1,
					["time"] = 1641392893,
					["from"] = "特变电工",
					["msg"] = "要坑了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [339]
				{
					["type"] = 1,
					["time"] = 1641392985,
					["from"] = "特变电工",
					["msg"] = "他们老家门口",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [340]
				{
					["type"] = 1,
					["time"] = 1641393053,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [341]
				{
					["type"] = 1,
					["time"] = 1641393057,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [342]
				{
					["type"] = 1,
					["time"] = 1641393134,
					["from"] = "特变电工",
					["msg"] = "太多了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [343]
				{
					["type"] = 1,
					["time"] = 1641393135,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [344]
				{
					["type"] = 1,
					["time"] = 1641393141,
					["from"] = "我给你跪下了",
					["msg"] = "逐个击破",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [345]
				{
					["type"] = 1,
					["time"] = 1641393219,
					["from"] = "特变电工",
					["msg"] = "他们家里",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [346]
				{
					["type"] = 1,
					["time"] = 1641393222,
					["from"] = "特变电工",
					["msg"] = "门口大叔",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [347]
				{
					["type"] = 1,
					["time"] = 1641393263,
					["from"] = "特变电工",
					["msg"] = "砍这个盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [348]
				{
					["type"] = 1,
					["time"] = 1641393265,
					["from"] = "特变电工",
					["msg"] = "也是荣誉狗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [349]
				{
					["type"] = 1,
					["time"] = 1641393367,
					["from"] = "特变电工",
					["msg"] = "我直接自由行动",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [350]
				{
					["type"] = 1,
					["time"] = 1641393376,
					["from"] = "我给你跪下了",
					["msg"] = "看到了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [351]
				{
					["type"] = 1,
					["time"] = 1641393391,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [352]
				{
					["type"] = 1,
					["time"] = 1641393461,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [353]
				{
					["type"] = 1,
					["time"] = 1641393487,
					["from"] = "我给你跪下了",
					["msg"] = "我去里面看看",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [354]
				{
					["type"] = 1,
					["time"] = 1641393492,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [355]
				{
					["type"] = 1,
					["time"] = 1641393515,
					["from"] = "我给你跪下了",
					["msg"] = "里面一堆",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [356]
				{
					["type"] = 1,
					["time"] = 1641393565,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [357]
				{
					["type"] = 1,
					["time"] = 1641393567,
					["from"] = "特变电工",
					["msg"] = "算了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [358]
				{
					["type"] = 1,
					["time"] = 1641393570,
					["from"] = "特变电工",
					["msg"] = "我们没优势",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [359]
				{
					["type"] = 1,
					["time"] = 1641393632,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [360]
				{
					["type"] = 1,
					["time"] = 1641393634,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [361]
				{
					["type"] = 1,
					["time"] = 1641393637,
					["from"] = "特变电工",
					["msg"] = "2个法师",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [362]
				{
					["type"] = 1,
					["time"] = 1641393698,
					["from"] = "特变电工",
					["msg"] = "你引走 我杀术士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [363]
				{
					["type"] = 1,
					["time"] = 1641393760,
					["from"] = "特变电工",
					["msg"] = "10%",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [364]
				{
					["type"] = 1,
					["time"] = 1641393762,
					["from"] = "特变电工",
					["msg"] = "%^&*!@#$% ",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [365]
				{
					["type"] = 1,
					["time"] = 1641393837,
					["from"] = "特变电工",
					["msg"] = "这个法师菜",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [366]
				{
					["type"] = 1,
					["time"] = 1641393842,
					["from"] = "特变电工",
					["msg"] = "可以吃他几次",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [367]
				{
					["type"] = 1,
					["time"] = 1641393848,
					["from"] = "特变电工",
					["msg"] = "不用吃药",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [368]
				{
					["type"] = 1,
					["time"] = 1641393852,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [369]
				{
					["type"] = 1,
					["time"] = 1641393887,
					["from"] = "特变电工",
					["msg"] = "我先上",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [370]
				{
					["type"] = 1,
					["time"] = 1641393890,
					["from"] = "特变电工",
					["msg"] = "冰环之后你在上",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [371]
				{
					["type"] = 1,
					["time"] = 1641393967,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [372]
				{
					["type"] = 1,
					["time"] = 1641394047,
					["from"] = "特变电工",
					["msg"] = "没人了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [373]
				{
					["type"] = 1,
					["time"] = 1641394050,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [374]
				{
					["type"] = 1,
					["time"] = 1641394053,
					["from"] = "特变电工",
					["msg"] = "进去干把",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [375]
				{
					["type"] = 1,
					["time"] = 1641394056,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [376]
				{
					["type"] = 1,
					["time"] = 1641394058,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [377]
				{
					["type"] = 1,
					["time"] = 1641394307,
					["from"] = "特变电工",
					["msg"] = "坑了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [378]
				{
					["type"] = 1,
					["time"] = 1641394309,
					["from"] = "特变电工",
					["msg"] = "afk出",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [379]
				{
					["type"] = 1,
					["time"] = 1641394339,
					["from"] = "特变电工",
					["msg"] = "太坑了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [380]
				{
					["type"] = 1,
					["time"] = 1641394340,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [381]
				{
					["type"] = 1,
					["time"] = 1641394350,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [382]
				{
					["type"] = 1,
					["time"] = 1641394421,
					["from"] = "特变电工",
					["msg"] = "你T0,5还没做啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [383]
				{
					["type"] = 1,
					["time"] = 1641394423,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [384]
				{
					["type"] = 1,
					["time"] = 1641394439,
					["from"] = "我给你跪下了",
					["msg"] = "没空 净搁着刷奥删了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [385]
				{
					["type"] = 1,
					["time"] = 1641394821,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [386]
				{
					["type"] = 1,
					["time"] = 1641394825,
					["from"] = "特变电工",
					["msg"] = "你准备刷到多少",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [387]
				{
					["type"] = 1,
					["time"] = 1641394830,
					["from"] = "我给你跪下了",
					["msg"] = "10",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [388]
				{
					["type"] = 1,
					["time"] = 1641394833,
					["from"] = "我给你跪下了",
					["msg"] = "太难了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [389]
				{
					["type"] = 1,
					["time"] = 1641394848,
					["from"] = "特变电工",
					["msg"] = "不是说全民大元帅吗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [390]
				{
					["type"] = 1,
					["time"] = 1641394849,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [391]
				{
					["type"] = 1,
					["time"] = 1641394880,
					["from"] = "我给你跪下了",
					["msg"] = "他们一天10几万的刷",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [392]
				{
					["type"] = 1,
					["time"] = 1641394888,
					["from"] = "我给你跪下了",
					["msg"] = "升不上去",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [393]
				{
					["type"] = 1,
					["time"] = 1641394921,
					["from"] = "我给你跪下了",
					["msg"] = "R10以上的一天最少8 9万",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [394]
				{
					["type"] = 1,
					["time"] = 1641394928,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [395]
				{
					["type"] = 1,
					["time"] = 1641394945,
					["from"] = "特变电工",
					["msg"] = "T0.5 比 R10好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [396]
				{
					["type"] = 1,
					["time"] = 1641394948,
					["from"] = "特变电工",
					["msg"] = "你还不如做T0.5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [397]
				{
					["type"] = 1,
					["time"] = 1641394990,
					["from"] = "我给你跪下了",
					["msg"] = "我看人家配装要两件R10 现在后悔来不及了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [398]
				{
					["type"] = 1,
					["time"] = 1641394993,
					["from"] = "我给你跪下了",
					["msg"] = "哎",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [399]
				{
					["type"] = 1,
					["time"] = 1641395007,
					["from"] = "特变电工",
					["msg"] = "我R10随缘",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [400]
				{
					["type"] = 1,
					["time"] = 1641395008,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [401]
				{
					["type"] = 1,
					["time"] = 1641395012,
					["from"] = "特变电工",
					["msg"] = "等TAQ拿2.5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [402]
				{
					["type"] = 1,
					["time"] = 1641395049,
					["from"] = "我给你跪下了",
					["msg"] = "排名前400R9升R10要4周",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [403]
				{
					["type"] = 1,
					["time"] = 1641395735,
					["from"] = "特变电工",
					["msg"] = "中场",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [404]
				{
					["type"] = 1,
					["time"] = 1641395742,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [405]
				{
					["type"] = 1,
					["time"] = 1641395838,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [406]
				{
					["type"] = 1,
					["time"] = 1641395841,
					["from"] = "特变电工",
					["msg"] = "3个法师",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [407]
				{
					["type"] = 1,
					["time"] = 1641395842,
					["from"] = "我给你跪下了",
					["msg"] = "怎么样",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [408]
				{
					["type"] = 1,
					["time"] = 1641395845,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [409]
				{
					["type"] = 1,
					["time"] = 1641396256,
					["from"] = "特变电工",
					["msg"] = "死了没",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [410]
				{
					["type"] = 1,
					["time"] = 1641396262,
					["from"] = "我给你跪下了",
					["msg"] = "帮你报仇了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [411]
				{
					["type"] = 1,
					["time"] = 1641396274,
					["from"] = "特变电工",
					["msg"] = "我都打残了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [412]
				{
					["type"] = 1,
					["time"] = 1641396278,
					["from"] = "特变电工",
					["msg"] = "1法2战",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [413]
				{
					["type"] = 1,
					["time"] = 1641396288,
					["from"] = "特变电工",
					["msg"] = "法师我被杀了 2个战士被我打残了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [414]
				{
					["type"] = 1,
					["time"] = 1641396289,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [415]
				{
					["type"] = 1,
					["time"] = 1641396294,
					["from"] = "特变电工",
					["msg"] = "1v3",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [416]
				{
					["type"] = 1,
					["time"] = 1641396298,
					["from"] = "我给你跪下了",
					["msg"] = "我就看见俩战士 法师没看见",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [417]
				{
					["type"] = 1,
					["time"] = 1641396301,
					["from"] = "特变电工",
					["msg"] = "他死了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [418]
				{
					["type"] = 1,
					["time"] = 1641396306,
					["from"] = "我给你跪下了",
					["msg"] = "哦哦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [419]
				{
					["type"] = 1,
					["time"] = 1641396309,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [420]
				{
					["type"] = 1,
					["time"] = 1641396312,
					["from"] = "特变电工",
					["msg"] = "那个法师做梦都想不到",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [421]
				{
					["type"] = 1,
					["time"] = 1641396315,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [422]
				{
					["type"] = 1,
					["time"] = 1641396322,
					["from"] = "特变电工",
					["msg"] = "强杀",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [423]
				{
					["type"] = 1,
					["time"] = 1641396327,
					["from"] = "特变电工",
					["msg"] = "自由行动",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [424]
				{
					["type"] = 1,
					["time"] = 1641396366,
					["from"] = "我给你跪下了",
					["msg"] = "有个法师一直灼烧我把我弄残血了觉得稳了跟我贴脸 我一个凿击 俩背刺秒了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [425]
				{
					["type"] = 1,
					["time"] = 1641396368,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [426]
				{
					["type"] = 1,
					["time"] = 1641396378,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [427]
				{
					["type"] = 1,
					["time"] = 1641396384,
					["from"] = "特变电工",
					["msg"] = "火法啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [428]
				{
					["type"] = 1,
					["time"] = 1641396393,
					["from"] = "我给你跪下了",
					["msg"] = "冰火",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [429]
				{
					["type"] = 1,
					["time"] = 1641396396,
					["from"] = "特变电工",
					["msg"] = "火法最好杀",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [430]
				{
					["type"] = 1,
					["time"] = 1641396413,
					["from"] = "特变电工",
					["msg"] = "我还是最喜欢打盗贼 猎人 萨满 牧师 术士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [431]
				{
					["type"] = 1,
					["time"] = 1641396420,
					["from"] = "特变电工",
					["msg"] = "看见法师只有自由行动",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [432]
				{
					["type"] = 1,
					["time"] = 1641396427,
					["from"] = "我给你跪下了",
					["msg"] = "术士太肉了 我打不死",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [433]
				{
					["type"] = 1,
					["time"] = 1641396440,
					["from"] = "特变电工",
					["msg"] = "带魅魔我不好打",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [434]
				{
					["type"] = 1,
					["time"] = 1641396441,
					["from"] = "我给你跪下了",
					["msg"] = "看自己这边的术士都4 5000血",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [435]
				{
					["type"] = 1,
					["time"] = 1641396446,
					["from"] = "特变电工",
					["msg"] = "其他都要被我弄死",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [436]
				{
					["type"] = 1,
					["time"] = 1641396480,
					["from"] = "特变电工",
					["msg"] = "打盗贼 猎人 带魅魔的术士 我都要引怪",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [437]
				{
					["type"] = 1,
					["time"] = 1641396484,
					["from"] = "特变电工",
					["msg"] = "如果旁边有怪的话",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [438]
				{
					["type"] = 1,
					["time"] = 1641396493,
					["from"] = "我给你跪下了",
					["msg"] = "可以 细节",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [439]
				{
					["type"] = 1,
					["time"] = 1641396496,
					["from"] = "特变电工",
					["msg"] = "侧跑一下引一下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [440]
				{
					["type"] = 1,
					["time"] = 1641396529,
					["from"] = "特变电工",
					["msg"] = "我在TBC专门打竞技场的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [441]
				{
					["type"] = 1,
					["time"] = 1641396563,
					["from"] = "我给你跪下了",
					["msg"] = "你玩啥职业",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [442]
				{
					["type"] = 1,
					["time"] = 1641396566,
					["from"] = "特变电工",
					["msg"] = "战士",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [443]
				{
					["type"] = 1,
					["time"] = 1641396577,
					["from"] = "特变电工",
					["msg"] = "战德组合 天下无敌",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [444]
				{
					["type"] = 1,
					["time"] = 1641396583,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [445]
				{
					["type"] = 1,
					["time"] = 1641396609,
					["from"] = "我给你跪下了",
					["msg"] = "那确实是有点厉害",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [446]
				{
					["type"] = 1,
					["time"] = 1641396931,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [447]
				{
					["type"] = 1,
					["time"] = 1641396983,
					["from"] = "特变电工",
					["msg"] = "等他们引怪 你偷袭",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [448]
				{
					["type"] = 1,
					["time"] = 1641396994,
					["from"] = "特变电工",
					["msg"] = "boss能打死他们",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [449]
				{
					["type"] = 1,
					["time"] = 1641397012,
					["from"] = "特变电工",
					["msg"] = "不要让法师羊了BOSS就起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [450]
				{
					["type"] = 1,
					["time"] = 1641397017,
					["from"] = "我给你跪下了",
					["msg"] = "人很多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [451]
				{
					["type"] = 1,
					["time"] = 1641397067,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [452]
				{
					["type"] = 1,
					["time"] = 1641397080,
					["from"] = "我给你跪下了",
					["msg"] = "人确实很多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [453]
				{
					["type"] = 1,
					["time"] = 1641397083,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [454]
				{
					["type"] = 1,
					["time"] = 1641397085,
					["from"] = "特变电工",
					["msg"] = "3个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [455]
				{
					["type"] = 1,
					["time"] = 1641397099,
					["from"] = "特变电工",
					["msg"] = "收好墓地",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [456]
				{
					["type"] = 1,
					["time"] = 1641397105,
					["from"] = "特变电工",
					["msg"] = "我马上传送",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [457]
				{
					["type"] = 1,
					["time"] = 1641397202,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [458]
				{
					["type"] = 1,
					["time"] = 1641397206,
					["from"] = "特变电工",
					["msg"] = "他们盗贼都死了吗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [459]
				{
					["type"] = 1,
					["time"] = 1641397207,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [460]
				{
					["type"] = 1,
					["time"] = 1641397214,
					["from"] = "我给你跪下了",
					["msg"] = "。。不会回了吧",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [461]
				{
					["type"] = 1,
					["time"] = 1641397241,
					["from"] = "特变电工",
					["msg"] = "没生意啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [462]
				{
					["type"] = 1,
					["time"] = 1641397243,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [463]
				{
					["type"] = 1,
					["time"] = 1641397245,
					["from"] = "特变电工",
					["msg"] = "很难受",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [464]
				{
					["type"] = 1,
					["time"] = 1641397248,
					["from"] = "特变电工",
					["msg"] = "这把稳赢",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [465]
				{
					["type"] = 1,
					["time"] = 1641397258,
					["from"] = "我给你跪下了",
					["msg"] = "前线压力好像挺大",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [466]
				{
					["type"] = 1,
					["time"] = 1641397283,
					["from"] = "特变电工",
					["msg"] = "急救开了的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [467]
				{
					["type"] = 1,
					["time"] = 1641397284,
					["from"] = "特变电工",
					["msg"] = "还好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [468]
				{
					["type"] = 1,
					["time"] = 1641397326,
					["from"] = "特变电工",
					["msg"] = "走前面",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [469]
				{
					["type"] = 1,
					["time"] = 1641397331,
					["from"] = "特变电工",
					["msg"] = "没生意了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [470]
				{
					["type"] = 1,
					["time"] = 1641397338,
					["from"] = "我给你跪下了",
					["msg"] = "冰翼 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [471]
				{
					["type"] = 1,
					["time"] = 1641397340,
					["from"] = "我给你跪下了",
					["msg"] = "多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [472]
				{
					["type"] = 1,
					["time"] = 1641397344,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [473]
				{
					["type"] = 1,
					["time"] = 1641397346,
					["from"] = "我给你跪下了",
					["msg"] = "我刚死回来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [474]
				{
					["type"] = 1,
					["time"] = 1641397474,
					["from"] = "我给你跪下了",
					["msg"] = "我死到雪落了。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [475]
				{
					["type"] = 1,
					["time"] = 1641397497,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [476]
				{
					["type"] = 1,
					["time"] = 1641397631,
					["from"] = "我给你跪下了",
					["msg"] = "前面人也不少 我在这也起飞了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [477]
				{
					["type"] = 1,
					["time"] = 1641399303,
					["from"] = "特变电工",
					["msg"] = "冰翼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [478]
				{
					["type"] = 1,
					["time"] = 1641399311,
					["from"] = "我给你跪下了",
					["msg"] = "冰翼全是人",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [479]
				{
					["type"] = 1,
					["time"] = 1641399427,
					["from"] = "我给你跪下了",
					["msg"] = "你没死啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [480]
				{
					["type"] = 1,
					["time"] = 1641399465,
					["from"] = "特变电工",
					["msg"] = "1V4",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [481]
				{
					["type"] = 1,
					["time"] = 1641399470,
					["from"] = "特变电工",
					["msg"] = "换塔",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [482]
				{
					["type"] = 1,
					["time"] = 1641399494,
					["from"] = "特变电工",
					["msg"] = "太强了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [483]
				{
					["type"] = 1,
					["time"] = 1641399495,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [484]
				{
					["type"] = 1,
					["time"] = 1641399505,
					["from"] = "我给你跪下了",
					["msg"] = "我直接就死了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [485]
				{
					["type"] = 1,
					["time"] = 1641399629,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [486]
				{
					["type"] = 1,
					["time"] = 1641399632,
					["from"] = "特变电工",
					["msg"] = "我杀了太多了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [487]
				{
					["type"] = 1,
					["time"] = 1641399638,
					["from"] = "特变电工",
					["msg"] = "这把你没有见证",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [488]
				{
					["type"] = 1,
					["time"] = 1641399645,
					["from"] = "我给你跪下了",
					["msg"] = "。。我早就死回来了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [489]
				{
					["type"] = 1,
					["time"] = 1641399663,
					["from"] = "特变电工",
					["msg"] = "台服湾湾朋友叫我打TBC 55了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [490]
				{
					["type"] = 1,
					["time"] = 1641399689,
					["from"] = "我给你跪下了",
					["msg"] = "好 我也快下了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [491]
				{
					["type"] = 1,
					["time"] = 1641401062,
					["from"] = "特变电工",
					["msg"] = "打完了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [492]
				{
					["type"] = 1,
					["time"] = 1641401062,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [493]
				{
					["type"] = 1,
					["time"] = 1641401080,
					["from"] = "我给你跪下了",
					["msg"] = "你双线&*!作啊？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [494]
				{
					["type"] = 1,
					["time"] = 1641401089,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [495]
				{
					["type"] = 1,
					["time"] = 1641401092,
					["from"] = "特变电工",
					["msg"] = "一样起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [496]
				{
					["type"] = 1,
					["time"] = 1641401109,
					["from"] = "我给你跪下了",
					["msg"] = "你是真狠",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [497]
				{
					["type"] = 1,
					["time"] = 1641401117,
					["from"] = "特变电工",
					["msg"] = "2张月卡",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [498]
				{
					["type"] = 1,
					["time"] = 1641401119,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [499]
				{
					["type"] = 1,
					["time"] = 1641401146,
					["from"] = "我给你跪下了",
					["msg"] = "打完这把我撤退了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [500]
				["info"] = {
				},
			},
			["卡卡汐"] = {
				{
					["type"] = 1,
					["time"] = 1640882204,
					["from"] = "特变电工",
					["msg"] = "我彻底毕业了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640882207,
					["from"] = "特变电工",
					["msg"] = "大兄弟",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640882215,
					["from"] = "特变电工",
					["msg"] = "我MC黑龙打第一",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640882218,
					["from"] = "特变电工",
					["msg"] = "你敢信",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640882226,
					["from"] = "特变电工",
					["msg"] = "很轻松",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640882231,
					["from"] = "特变电工",
					["msg"] = "不用吹灰之力",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640882250,
					["from"] = "特变电工",
					["msg"] = "你要为你认识练级期间认识我这样的朋友而感到自豪",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640882251,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640882254,
					["from"] = "特变电工",
					["msg"] = "确实日白",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640882266,
					["from"] = "卡卡汐",
					["msg"] = "DPS我经常第一 ",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640882271,
					["from"] = "特变电工",
					["msg"] = "你打不过我",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640882277,
					["from"] = "卡卡汐",
					["msg"] = "恭喜你了",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640882287,
					["from"] = "卡卡汐",
					["msg"] = "打了多少伤害",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640882299,
					["from"] = "特变电工",
					["msg"] = "忘记了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640882326,
					["from"] = "卡卡汐",
					["msg"] = "黑龙你怎么打的第一？",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640882348,
					["from"] = "特变电工",
					["msg"] = "很简单啊",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640882350,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640882356,
					["from"] = "特变电工",
					["msg"] = "黑龙比MC简单",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640882365,
					["from"] = "特变电工",
					["msg"] = "地上有精英龙啊",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640882373,
					["from"] = "特变电工",
					["msg"] = "还是2只拉一起",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640882380,
					["from"] = "特变电工",
					["msg"] = "一顿A",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641216295,
					["from"] = "特变电工",
					["msg"] = "我已经起飞了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [22]
				["info"] = {
				},
			},
			["萌萌灰#51759"] = {
				{
					["type"] = 1,
					["time"] = 1641308324,
					["from"] = "特变电工",
					["msg"] = "|Hitem:18423::::::::60:::::::::|h[奥妮克希亚的头颅]|h",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641308340,
					["from"] = "特变电工",
					["msg"] = "270R",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641308348,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641308351,
					["from"] = "萌萌灰#51759",
					["msg"] = "来正式服啊",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [4]
				["info"] = {
				},
			},
			["戒之在灶"] = {
				{
					["type"] = 1,
					["time"] = 1640612392,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640612396,
					["from"] = "特变电工",
					["msg"] = "又跌了",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640612408,
					["from"] = "特变电工",
					["msg"] = "2周亏我60万",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641037647,
					["from"] = "特变电工",
					["msg"] = "组我下",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641037649,
					["from"] = "特变电工",
					["msg"] = "换个位面",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641037659,
					["from"] = "特变电工",
					["msg"] = "3Q",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641037671,
					["from"] = "戒之在灶",
					["msg"] = "我在战场 组到你了么",
					["inbound"] = true,
					["convo"] = "戒之在灶",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641037677,
					["from"] = "特变电工",
					["msg"] = "组到了",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [8]
				["info"] = {
				},
			},
			["袁阿满"] = {
				{
					["type"] = 1,
					["time"] = 1641060406,
					["from"] = "特变电工",
					["msg"] = "却暴力狂暴战吗",
					["inbound"] = false,
					["convo"] = "袁阿满",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641060450,
					["from"] = "特变电工",
					["msg"] = "不要装备 只做任务",
					["inbound"] = false,
					["convo"] = "袁阿满",
				}, -- [2]
				["info"] = {
				},
			},
			["小哥"] = {
				{
					["type"] = 1,
					["time"] = 1640448679,
					["from"] = "小哥",
					["msg"] = "DZ",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640448700,
					["from"] = "特变电工",
					["msg"] = "DPS满了哈",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [2]
				["info"] = {
				},
			},
			["Whitegods"] = {
				{
					["type"] = 1,
					["time"] = 1641097738,
					["from"] = "特变电工",
					["msg"] = "白天开组了么",
					["inbound"] = false,
					["convo"] = "Whitegods",
				}, -- [1]
				["info"] = {
				},
			},
			["小铃噹"] = {
				{
					["type"] = 1,
					["time"] = 1641053130,
					["from"] = "特变电工",
					["msg"] = "我才打完台服TBC 繁字体",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641053138,
					["from"] = "小铃噹",
					["msg"] = "額。。。。",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641053145,
					["from"] = "特变电工",
					["msg"] = "你为啥打繁体字",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641053158,
					["from"] = "小铃噹",
					["msg"] = "電腦如此，，，，",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641053162,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641053177,
					["from"] = "特变电工",
					["msg"] = "我有湾湾朋友想玩国服 卡实名。。",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641053197,
					["from"] = "小铃噹",
					["msg"] = "額",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [7]
				["info"] = {
				},
			},
			["无敌暗影箭"] = {
				{
					["type"] = 1,
					["time"] = 1640793163,
					["from"] = "特变电工",
					["msg"] = "3G求拉厄运",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640793342,
					["from"] = "无敌暗影箭",
					["msg"] = "进组啊",
					["inbound"] = true,
					["convo"] = "无敌暗影箭",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640793478,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640793482,
					["from"] = "特变电工",
					["msg"] = "在组一下",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640793485,
					["from"] = "特变电工",
					["msg"] = "刚才WC",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640794570,
					["from"] = "特变电工",
					["msg"] = "飞机还有吗",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [6]
				["info"] = {
				},
			},
		},
	},
}
WIM3_ChatFilters = {
}
WIM3_Alias = nil
