
WIM3_Data = {
	["escapeToHide"] = true,
	["hoverLinks"] = false,
	["pop_rules"] = {
		["whisper"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = true,
			["resting"] = {
				["keepfocus"] = true,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = true,
				["onReceive"] = true,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["alwaysOther"] = false,
		},
		["chat"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["bn"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = false,
			["resting"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["alwaysOther"] = true,
		},
	},
	["timeStampFormat"] = "%H:%M",
	["windowAlpha"] = 80,
	["sounds"] = {
		["force_game_sound"] = false,
		["whispers"] = {
			["msgout_sml"] = "IM",
			["msgout"] = false,
			["guild"] = false,
			["bnet_sml"] = "IM",
			["msgin_sml"] = "IM",
			["msgin"] = true,
			["friend_sml"] = "IM",
			["guild_sml"] = "IM",
			["bnet"] = false,
			["friend"] = false,
		},
		["chat"] = {
			["msgout_sml"] = "Chat Blip",
			["msgout"] = false,
			["world_sml"] = "Chat Blip",
			["msgin_sml"] = "Chat Blip",
			["msgin"] = true,
			["party_sml"] = "Chat Blip",
			["custom_sml"] = "Chat Blip",
			["say_sml"] = "Chat Blip",
			["raid_sml"] = "Chat Blip",
			["raidleader_sml"] = "Chat Blip",
			["officer_sml"] = "Chat Blip",
			["guild_sml"] = "Chat Blip",
			["battlegroundleader_sml"] = "Chat Blip",
			["battleground_sml"] = "Chat Blip",
		},
	},
	["formatting"] = {
		["bracketing"] = {
			["enabled"] = true,
			["type"] = 1,
		},
	},
	["keepFocusRested"] = true,
	["wordwrap_indent"] = false,
	["enabled"] = true,
	["keepFocus"] = true,
	["alertedPrivateServer"] = false,
	["autoFocus"] = false,
	["winCascade"] = {
		["enabled"] = true,
		["direction"] = 8,
	},
	["lastState"] = "other",
	["displayColors"] = {
		["wispOut"] = {
			["r"] = 1,
			["g"] = 0.0784313725490196,
			["b"] = 0.9882352941176471,
		},
		["wispIn"] = {
			["r"] = 0.5607843137254902,
			["g"] = 0.03137254901960784,
			["b"] = 0.7607843137254902,
		},
		["sysMsg"] = {
			["r"] = 1,
			["g"] = 0.6627450980392157,
			["b"] = 0,
		},
		["BNwispOut"] = {
			["r"] = 0.1725490196078431,
			["g"] = 0.6352941176470588,
			["b"] = 1,
		},
		["historyIn"] = {
			["r"] = 0.4705882352941176,
			["g"] = 0.4705882352941176,
			["b"] = 0.4705882352941176,
		},
		["errorMsg"] = {
			["r"] = 1,
			["g"] = 0,
			["b"] = 0,
		},
		["useSkin"] = true,
		["BNwispIn"] = {
			["r"] = 0,
			["g"] = 0.4862745098039216,
			["b"] = 0.6549019607843137,
		},
		["historyOut"] = {
			["r"] = 0.7058823529411764,
			["g"] = 0.7058823529411764,
			["b"] = 0.7058823529411764,
		},
		["webAddress"] = {
			["r"] = 1,
			["g"] = 1,
			["b"] = 1,
		},
	},
	["fontSize"] = 12,
	["showToolTips"] = true,
	["minimap"] = {
		["free_position"] = {
			["y"] = -119.9890033406945,
			["x"] = -161.5500472187982,
			["point"] = "TOPRIGHT",
		},
		["position"] = 200,
		["rightClickNew"] = false,
		["free"] = false,
	},
	["winAnimation"] = true,
	["expose"] = {
		["protect"] = 1,
		["borderSize"] = 20,
		["combat"] = true,
		["direction"] = 1,
		["border"] = false,
		["groupOnly"] = false,
	},
	["alias"] = {
		["title_string"] = "{n} - {a}",
	},
	["winSize"] = {
		["height"] = 220,
		["strata"] = "DIALOG",
		["scale"] = 100,
		["width"] = 333,
	},
	["windowOnTop"] = true,
	["modules"] = {
		["ChatSounds"] = {
			["enabled"] = true,
		},
		["ShortcutBar"] = {
			["enabled"] = true,
		},
		["Emoticons"] = {
			["enabled"] = true,
		},
		["ChatAlerts"] = {
			["enabled"] = true,
		},
		["Sounds"] = {
			["enabled"] = true,
		},
		["Expose"] = {
			["enabled"] = true,
		},
		["WhisperEngine"] = {
			["enabled"] = true,
		},
		["MinimapIcon"] = {
			["enabled"] = true,
		},
		["TimeStamps"] = {
			["enabled"] = true,
		},
		["OffScreenTracker"] = {
			["enabled"] = true,
		},
		["History"] = {
			["enabled"] = true,
		},
		["LDB"] = {
			["enabled"] = true,
		},
		["URLHandler"] = {
			["enabled"] = true,
		},
		["Filters"] = {
			["enabled"] = true,
		},
		["Menu"] = {
			["enabled"] = true,
		},
		["ClickControl"] = {
			["enabled"] = true,
		},
		["Tabs"] = {
			["enabled"] = true,
		},
	},
	["ignoreArrowKeys"] = true,
	["coloredNames"] = true,
	["winLoc"] = {
		["left"] = 217,
		["top"] = 664,
	},
	["clampToScreen"] = true,
	["stats"] = {
		["startDate"] = "",
		["versions"] = 1,
		["whispers"] = 0,
		["mostConvos"] = 0,
	},
	["winFade"] = true,
	["skin"] = {
		["font_outline"] = "",
		["selected"] = "WIM Classic",
		["font"] = "ChatFontNormal",
		["suggest"] = true,
	},
	["ClickControl"] = {
		["clickSensitivity"] = 0.2,
	},
	["tabs"] = {
		["sortBy"] = 2,
		["whispers"] = {
			["enabled"] = false,
			["guild"] = false,
			["friends"] = false,
		},
		["chat"] = {
			["enabled"] = false,
			["aswhisper"] = false,
		},
	},
	["history"] = {
		["ageLimit"] = true,
		["maxPer"] = true,
		["previewCount"] = 25,
		["whispers"] = {
			["friends"] = true,
			["all"] = false,
			["guild"] = true,
		},
		["maxAge"] = 1209600,
		["preview"] = true,
		["maxCount"] = 500,
		["chat"] = {
			["ageLimit"] = true,
			["maxAge"] = 1209600,
			["maxPer"] = true,
			["preview"] = true,
			["maxCount"] = 500,
			["previewCount"] = 25,
		},
	},
	["chat"] = {
		["bn"] = {
			["showAlerts"] = true,
		},
		["guild"] = {
			["showAlerts"] = true,
		},
		["party"] = {
			["showAlerts"] = true,
		},
		["custom"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
		["say"] = {
		},
		["world"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
		["raid"] = {
			["showAlerts"] = true,
		},
		["officer"] = {
			["showAlerts"] = true,
		},
		["battleground"] = {
		},
	},
	["tabAdvance"] = false,
	["whoLookups"] = true,
	["menuSortActivity"] = true,
}
WIM3_Cache = {
	["鱼人摩洛克"] = {
		["特变电工"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["|Kq16|k"] = 2,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq3|k"] = 2,
				["阡祈"] = 1,
				["|Kq1|k"] = 2,
				["|Kq11|k"] = 2,
				["社区送温暖"] = 1,
				["|Kq17|k"] = 2,
				["茅台酒"] = 1,
				["|Kq18|k"] = 2,
				["|Kq8|k"] = 2,
				["|Kq14|k"] = 2,
				["|Kq4|k"] = 2,
				["|Kq21|k"] = 2,
				["|Kq20|k"] = 2,
				["|Kq13|k"] = 2,
				["|Kq15|k"] = 2,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["|Kq22|k"] = 2,
				["|Kq5|k"] = 2,
			},
			["guildList"] = {
				["一剑走江湖"] = 114,
				["法外张三丰"] = 534,
				["沉沉暮霭"] = 371,
				["偷鈊"] = 70,
				["陆哔哔"] = 189,
				["叫我欧巴"] = 730,
				["晒太阳的猪"] = 490,
				["食人魔老大"] = 482,
				["野火"] = 702,
				["龙门汤晶哥"] = 704,
				["醉笑不诉离殇"] = 686,
				["究极美人"] = 231,
				["三体来的"] = 627,
				["青盲点点"] = 159,
				["美丽天使"] = 623,
				["恶魔卡卡"] = 582,
				["月下离殇"] = 649,
				["你看不见我叭"] = 225,
				["Loiter"] = 10,
				["时光无言"] = 659,
				["勇敢牛牛灬"] = 133,
				["靡靡之音"] = 445,
				["再见叶子"] = 801,
				["哪個聯盟法師"] = 657,
				["晨拾夜梦"] = 240,
				["侠盗者"] = 115,
				["只会怂"] = 463,
				["弥赛亚"] = 171,
				["紫发乄无面纹"] = 620,
				["酷酷"] = 220,
				["吉米迪克"] = 647,
				["如鲸向海"] = 236,
				["发财丨"] = 431,
				["月亮井里的鱼"] = 346,
				["梦之蓝"] = 453,
				["胡子爹"] = 306,
				["撒谎的匹诺曹"] = 759,
				["稻香二五酒馆"] = 168,
				["独孤风轻扬"] = 350,
				["豺华"] = 684,
				["茅台酒"] = 352,
				["末日行者"] = 586,
				["小小蚁来了"] = 399,
				["烟雨红尘"] = 207,
				["乐桃德"] = 60,
				["执念曾经"] = 667,
				["粉红色马尾"] = 302,
				["洋洋哥哥"] = 726,
				["战神李某"] = 101,
				["宝咬它"] = 467,
				["杀戮兲罖"] = 607,
				["马维娜之箭"] = 157,
				["老王隔壁"] = 376,
				["没事溜狗"] = 401,
				["以无旁骛之吻"] = 397,
				["矮子法"] = 513,
				["高山流水水"] = 687,
				["小丁女神"] = 344,
				["醉落魄"] = 516,
				["天使的号角"] = 365,
				["荷鲁斯"] = 81,
				["甜热热"] = 699,
				["动我躺给你看"] = 721,
				["一剪没"] = 165,
				["美好的一天"] = 303,
				["你也想起舞么"] = 94,
				["是对还是错"] = 489,
				["玩丶火"] = 244,
				["Smir"] = 266,
				["小害羞"] = 294,
				["溜达哒哒"] = 418,
				["我累个擦"] = 389,
				["逍乄遥"] = 307,
				["二寸"] = 542,
				["阴影之中"] = 456,
				["啊呜喵"] = 613,
				["大掌士"] = 504,
				["时间是个贼"] = 25,
				["二郎眞君"] = 484,
				["新世界路飞"] = 743,
				["山一程"] = 415,
				["孤影阑珊"] = 292,
				["壹拾弎"] = 526,
				["别天神灬"] = 192,
				["彬临天下"] = 319,
				["光头洛克"] = 146,
				["布丁下楼玩"] = 552,
				["迪菲亚强袭者"] = 592,
				["秋巴比母捏牛"] = 91,
				["爆头总裁"] = 402,
				["小红帽恰恰"] = 528,
				["呆呆萌"] = 253,
				["世界公"] = 628,
				["零杠零八"] = 356,
				["此人很帅"] = 561,
				["只儿豁阿歹"] = 612,
				["老司机不翻车"] = 442,
				["絕戀"] = 278,
				["灬安静灬"] = 566,
				["冰可口可乐"] = 191,
				["燃情美女"] = 103,
				["朵儿不哭"] = 1,
				["Tuesday"] = 181,
				["Floyd"] = 763,
				["赵默笙"] = 95,
				["战烬天下"] = 368,
				["凌乱遗忘"] = 430,
				["吴灬彦祖"] = 525,
				["Playerpgrbev"] = 520,
				["布灵梦"] = 387,
				["摘你苦胆"] = 658,
				["Yell"] = 13,
				["老公"] = 51,
				["烟云雾雨"] = 275,
				["自渡"] = 56,
				["龙滴滴"] = 250,
				["浑身是劲丶"] = 347,
				["转角的你"] = 105,
				["凯爷"] = 461,
				["射之深处"] = 50,
				["小刀割肉"] = 688,
				["尚西"] = 140,
				["你灬瞅啥"] = 459,
				["瞅一瞅"] = 276,
				["华丽舞者"] = 194,
				["丶低姿态"] = 223,
				["失控的胖子"] = 575,
				["白发牧羊人"] = 374,
				["妹熹"] = 466,
				["陈师傅啊"] = 695,
				["平胸平天下"] = 750,
				["丨半道丨"] = 313,
				["辫子李三"] = 591,
				["尖瑞亖尢"] = 779,
				["茨威格"] = 735,
				["那年我不懂"] = 515,
				["似锦繁花"] = 251,
				["Onlyonrtwo"] = 311,
				["柠檬小猎"] = 271,
				["德了吧"] = 270,
				["沙蒂丝"] = 4,
				["边三条"] = 736,
				["一丨花丨一"] = 222,
				["鸟德"] = 164,
				["浴血封神"] = 326,
				["阿兜中中"] = 539,
				["牛杰小紫"] = 243,
				["龙腾盛世"] = 211,
				["乔泽格达奈奈"] = 500,
				["红衣女郎"] = 645,
				["弹丸"] = 100,
				["我要上岸"] = 322,
				["晓月圆舞曲"] = 744,
				["光头龍哥"] = 287,
				["瀑布里的鱼"] = 348,
				["雷霆万钧丶"] = 86,
				["狂傲"] = 142,
				["休闲小白"] = 747,
				["爱翠翠"] = 218,
				["旺旺煎饼"] = 473,
				["与君重逢"] = 447,
				["谷雨彭于晏"] = 144,
				["小心刺杀"] = 169,
				["李李"] = 176,
				["芝麻芝士"] = 609,
				["伤湿止疼膏"] = 382,
				["放开那公子"] = 34,
				["团体斯瑞"] = 785,
				["鱼人劫"] = 495,
				["惗訫"] = 216,
				["没电话费了"] = 633,
				["酒鬼爱喝酒"] = 199,
				["Starfall"] = 212,
				["Shuaitao"] = 312,
				["背丨刺"] = 734,
				["午夜枪手"] = 655,
				["無人渡"] = 660,
				["菠萝怪"] = 38,
				["初来砸到"] = 33,
				["小猫迷了路"] = 768,
				["抓到耗子的猫"] = 256,
				["大表哥"] = 815,
				["风骚法湿"] = 59,
				["鸿蒙"] = 335,
				["夜雨星辰"] = 632,
				["战丨吊"] = 367,
				["没有锁骨"] = 564,
				["既定之天命"] = 559,
				["蛮好小可爱"] = 353,
				["亚历山大"] = 523,
				["乐桃战"] = 427,
				["我是专业嘀"] = 296,
				["鐦鈊戰士"] = 188,
				["华丽的闪现"] = 268,
				["走中间"] = 455,
				["寒冰箭塞菊花"] = 412,
				["依然东莞仔"] = 756,
				["心所向皆可往"] = 696,
				["德哥战车"] = 554,
				["折磨王"] = 488,
				["王壹"] = 301,
				["马儿不爱跳"] = 21,
				["我要升级"] = 238,
				["老支书"] = 443,
				["倔犟小野菊"] = 598,
				["肆意阳光"] = 80,
				["灵魂切割者"] = 567,
				["亦凡丶云迪"] = 61,
				["Playeroewur"] = 718,
				["Smirz"] = 285,
				["晚天"] = 73,
				["丶熊猫人丶"] = 541,
				["修丿"] = 597,
				["波油踢夫"] = 787,
				["你说什么"] = 428,
				["李寒衣"] = 689,
				["冰糖排骨"] = 339,
				["阿尔黛丝"] = 48,
				["梵诗笛"] = 206,
				["諾丶小兔"] = 92,
				["肾蛋老人"] = 279,
				["站住打劫"] = 186,
				["你矮子妈"] = 359,
				["纸川内酷"] = 514,
				["啵啵囋囋果"] = 15,
				["桃桃独醉"] = 183,
				["陌上嫣然"] = 156,
				["刹那丶"] = 88,
				["天啦你真矮"] = 604,
				["我瞅你像猪"] = 724,
				["丶弗丁"] = 174,
				["Gambler"] = 497,
				["紫小白"] = 2,
				["被后羿射的日"] = 247,
				["麦市大哥"] = 282,
				["氧彦"] = 84,
				["棉毛裤配汗衫"] = 257,
				["炽羽"] = 392,
				["排山再蹈海"] = 556,
				["噼里啪啦砰"] = 227,
				["梨叔"] = 55,
				["漫游世界尽头"] = 373,
				["风气云涌"] = 739,
				["劈逼害菜"] = 193,
				["大人时代变了"] = 386,
				["锤娜丽莎"] = 816,
				["风儿"] = 357,
				["点点晓任性"] = 814,
				["Holypreacher"] = 128,
				["墨児"] = 546,
				["弓虽石更"] = 812,
				["我的好兄弟"] = 65,
				["縫人就问"] = 683,
				["青锋"] = 594,
				["义本无言"] = 49,
				["老污龟"] = 209,
				["Hideonbush"] = 82,
				["秋乻乐"] = 143,
				["有绒奶大"] = 438,
				["看你老婆玩蛇"] = 608,
				["黄灬毛"] = 518,
				["紫琪"] = 441,
				["叶烨"] = 252,
				["里昂"] = 794,
				["萌萌丶苮"] = 404,
				["摸一摸口袋"] = 774,
				["告白铅球"] = 340,
				["一箭灬封喉"] = 22,
				["假面优等生"] = 201,
				["布川内酷"] = 805,
				["容在下先撤"] = 293,
				["七四劣"] = 626,
				["猪儿虫虫"] = 454,
				["完美七月"] = 804,
				["尾煞瓦里安"] = 579,
				["烟雨倾城丶"] = 121,
				["伊丽莎白塞拉"] = 200,
				["姜小云"] = 291,
				["小阿离"] = 414,
				["善逸"] = 803,
				["少白头"] = 434,
				["大德哥哥"] = 450,
				["叶田雨佳"] = 802,
				["九天法王"] = 800,
				["絮猫"] = 590,
				["几度秋风凉"] = 314,
				["如水"] = 505,
				["丿猎"] = 799,
				["Blackheyt"] = 113,
				["必须有宝宝"] = 388,
				["爱在西元前"] = 798,
				["灬今晚打老虎"] = 797,
				["暗碟弄啥"] = 26,
				["洗脚叔"] = 36,
				["疯狂小上官"] = 158,
				["Miria"] = 284,
				["小小贼"] = 138,
				["好色倮裙舞姐"] = 527,
				["陆杰"] = 332,
				["逐日丶"] = 793,
				["鲜衣怒马"] = 517,
				["董事长"] = 772,
				["永恒背刺"] = 324,
				["迷恋"] = 664,
				["你在吗"] = 14,
				["宝剑"] = 255,
				["神棍熊"] = 618,
				["艾达王"] = 792,
				["科哥"] = 277,
				["红外线绿色"] = 791,
				["毕加索的秋裤"] = 476,
				["杰爷"] = 510,
				["优秀包租公"] = 596,
				["黑桃楷"] = 788,
				["果灬汁"] = 67,
				["爱德华法法"] = 491,
				["迪斯"] = 210,
				["Insec"] = 755,
				["阿呆不哭"] = 264,
				["密斯特王"] = 469,
				["那年我十八"] = 685,
				["丶清欢"] = 783,
				["第一小"] = 782,
				["柔左"] = 781,
				["枫言夏语"] = 587,
				["天选希维尔"] = 789,
				["守望燎原"] = 778,
				["冰凌小雪"] = 175,
				["月亮我射弯的"] = 417,
				["坤鸡儿"] = 776,
				["抚顺牧"] = 775,
				["残忍的黑胡子"] = 773,
				["东北二舅姥"] = 770,
				["我就这样"] = 758,
				["泳镜侠"] = 725,
				["凯文天天"] = 573,
				["倔强的小法"] = 360,
				["一念向北"] = 766,
				["仓鼠贩子"] = 777,
				["小要饭"] = 764,
				["福瑞斯戴尔"] = 208,
				["Playerkppvgm"] = 717,
				["消失的猎手"] = 760,
				["扎西"] = 769,
				["风雨唯亭"] = 333,
				["流丶去"] = 32,
				["酒鬼咆哮"] = 187,
				["Xiaochuan"] = 93,
				["小红手"] = 757,
				["浴皇一大帝"] = 679,
				["原味奶茶"] = 784,
				["恋空"] = 90,
				["秋起叶落"] = 668,
				["胭脂妆"] = 761,
				["捉头牛当宝宝"] = 753,
				["胖子法"] = 261,
				["亖三二一"] = 629,
				["果冻不顶"] = 533,
				["大可乐瓶"] = 137,
				["迈瑞"] = 752,
				["钢铁十六"] = 263,
				["憨憨的小霸王"] = 676,
				["青花瓷丶"] = 494,
				["月墨夕雪"] = 813,
				["小样儿"] = 749,
				["知绪"] = 746,
				["灰胡子叔叔"] = 745,
				["寒禅"] = 548,
				["媳父"] = 214,
				["可乐百事"] = 409,
				["壹页孤舟"] = 76,
				["刀俎"] = 740,
				["白红啤丶事"] = 651,
				["非墨"] = 738,
				["带你去民政局"] = 644,
				["迪迪"] = 737,
				["雪雪宝宝"] = 716,
				["甜甜德"] = 733,
				["大杯蜜雪冰城"] = 547,
				["追风猎"] = 155,
				["偷圣"] = 362,
				["阳光小伙"] = 405,
				["游人"] = 732,
				["躲起来输出"] = 47,
				["吃了梅"] = 731,
				["巨牙海民"] = 648,
				["光头必暴击"] = 286,
				["红尘雪"] = 729,
				["泗水合鸣"] = 728,
				["天呐你好高"] = 767,
				["常在你身后"] = 723,
				["十三妹"] = 134,
				["深海三文鱼"] = 372,
				["陈如初"] = 422,
				["漫海"] = 102,
				["雪米"] = 232,
				["Milanda"] = 425,
				["游子"] = 391,
				["哇塞哦"] = 722,
				["上苍之手"] = 654,
				["人美胸遭罪"] = 630,
				["东坎二胖"] = 720,
				["一箭定江山"] = 719,
				["搭白算兽"] = 345,
				["Jumpshot"] = 519,
				["矮子快递员"] = 715,
				["梁文静"] = 8,
				["真冬大表哥"] = 714,
				["麻了"] = 179,
				["糖小逗"] = 122,
				["小节"] = 550,
				["扫地工"] = 54,
				["白嗜可乐"] = 712,
				["疾光掠影"] = 711,
				["宝石绿蓝"] = 468,
				["久哥哥"] = 224,
				["战師"] = 390,
				["爱上奶酪的猫"] = 709,
				["墨芋"] = 41,
				["油腻的奶骑"] = 439,
				["月下狩猎"] = 560,
				["李三岁"] = 197,
				["五六柒"] = 485,
				["快乐老子"] = 708,
				["红箭小猎"] = 621,
				["徐州小霸王"] = 707,
				["头发别掉了"] = 706,
				["丶易水寒"] = 39,
				["山兔"] = 507,
				["雪落画骨寒"] = 703,
				["光头威武"] = 501,
				["小桥流水丨"] = 549,
				["赐死剑气"] = 701,
				["回归"] = 741,
				["紫儿"] = 18,
				["阿芙伦蒂娜"] = 694,
				["浪得一身剑气"] = 63,
				["绿丶茶"] = 692,
				["冬吾雪"] = 674,
				["寂小安"] = 130,
				["咔咔抗"] = 384,
				["石三"] = 691,
				["枫月"] = 690,
				["仇敌克星"] = 524,
				["虎狼之撕"] = 44,
				["笑红莎"] = 681,
				["罗兰法神"] = 700,
				["朦胧岁月"] = 678,
				["无敌最俊朗丶"] = 677,
				["给你的额外"] = 28,
				["别惊了她的梦"] = 675,
				["井点"] = 673,
				["晚上吃火锅"] = 35,
				["张大包"] = 487,
				["Kikienoeh"] = 234,
				["黑白格"] = 221,
				["夜之光"] = 786,
				["传说姐姐"] = 53,
				["Gdsflk"] = 29,
				["战舞渣"] = 239,
				["排骨三十一斤"] = 20,
				["丶桃子抹茶"] = 672,
				["猫毛"] = 393,
				["魔鬼坏蛋"] = 670,
				["一颗小多肉"] = 337,
				["吾乃大叔"] = 600,
				["衬衫男"] = 693,
				["那时丶冭嚣张"] = 669,
				["辰羲"] = 480,
				["跑路我先来"] = 444,
				["东北妞"] = 458,
				["冰飘飘"] = 98,
				["全村的希望啊"] = 666,
				["酸梅子"] = 665,
				["耗子违之"] = 662,
				["糖盟"] = 661,
				["呦呦切个闹"] = 656,
				["心跳丶"] = 120,
				["抓个宝宝过年"] = 508,
				["Okok"] = 180,
				["大强哥"] = 62,
				["宁蓉蓉"] = 343,
				["胡消失"] = 652,
				["云起雪飞扬"] = 407,
				["暗沉弥散"] = 229,
				["呆呆柱"] = 315,
				["永远的嘀嗒"] = 370,
				["励和日"] = 503,
				["枫溪"] = 650,
				["新茶上市"] = 205,
				["微月半"] = 553,
				["凛霜"] = 147,
				["怪咖小法"] = 471,
				["叶小倩"] = 642,
				["努力的相遇"] = 462,
				["虎牙小猫咪"] = 245,
				["不想游泳"] = 641,
				["那个拐角"] = 354,
				["Patrick"] = 640,
				["黑口鱼"] = 639,
				["贰爺"] = 72,
				["青空光"] = 638,
				["瀛洲一摄郎"] = 634,
				["凤舞离殇"] = 631,
				["魑魅魍魉魋"] = 249,
				["波摇撞骗"] = 298,
				["走走疯了"] = 624,
				["小不点哈"] = 577,
				["凌瑟瑟"] = 727,
				["天天爱无聊"] = 149,
				["白发丿无面纹"] = 754,
				["烟火中的烟花"] = 617,
				["温柔假象"] = 616,
				["沉默是真"] = 46,
				["狂踩垃圾"] = 185,
				["左手喝水"] = 237,
				["暗夜恋手"] = 615,
				["回楼"] = 748,
				["唯美品格"] = 601,
				["志慧慧"] = 320,
				["藏不住"] = 610,
				["小小的蓝天"] = 605,
				["笨笨龙"] = 682,
				["雨翰"] = 395,
				["小劣劣"] = 215,
				["刷个爪子"] = 129,
				["塔莉娅"] = 603,
				["堕落孩子"] = 602,
				["可儿"] = 166,
				["玉菲"] = 125,
				["加藤英"] = 116,
				["刺丶客"] = 599,
				["梓宣"] = 241,
				["扶摇"] = 780,
				["Csak"] = 595,
				["紫怡妹妹"] = 637,
				["溜达儿灬"] = 697,
				["莫依傲"] = 811,
				["铁头娃娃灬"] = 593,
				["摸一摸裤兜"] = 161,
				["梁辰"] = 57,
				["看你们缺德不"] = 589,
				["奶嘴吸吥停"] = 77,
				["殺人狂魔"] = 588,
				["胸平平天下"] = 536,
				["伤心小贱"] = 381,
				["小家伙"] = 506,
				["鱼术壹"] = 190,
				["微微安娜"] = 196,
				["老琪"] = 198,
				["秋水了无痕"] = 619,
				["飘飘仙子舞"] = 334,
				["施瓦辛格"] = 585,
				["懒惰的月歌"] = 584,
				["惬玉偸香"] = 583,
				["一剑丶开天"] = 406,
				["阳光丨"] = 74,
				["卜卜"] = 24,
				["达西西"] = 421,
				["醉仙鸭"] = 762,
				["小年糕宝宝"] = 106,
				["幽碧落"] = 581,
				["小小无尽"] = 578,
				["安然银湖"] = 17,
				["伊利香十回"] = 97,
				["颖随风"] = 233,
				["Huntress"] = 6,
				["万剑一"] = 521,
				["三鹿丶妞奶"] = 426,
				["对尖"] = 576,
				["帝韵"] = 436,
				["皮皮球"] = 230,
				["佰歌"] = 572,
				["Eifing"] = 571,
				["尖沙咀靓坤"] = 295,
				["木头的小刀"] = 163,
				["一煮一"] = 358,
				["带刺灬西瓜"] = 31,
				["连花清瘟胶囊"] = 570,
				["爱恋支狼"] = 568,
				["Jiain"] = 795,
				["葡丶萄"] = 492,
				["车车不扯"] = 537,
				["没输出"] = 565,
				["漂亮三姐"] = 259,
				["醉藕"] = 653,
				["石皮石卒"] = 58,
				["小贼爷"] = 413,
				["Christine"] = 12,
				["沙贝贝啊"] = 563,
				["永年紧固件"] = 562,
				["新手求照顾"] = 558,
				["救驾"] = 557,
				["雪凉"] = 109,
				["致青春丶念旧"] = 154,
				["扯哥水球得很"] = 323,
				["炮烝鳝鱼"] = 66,
				["小萝卜娘"] = 551,
				["摩拉迪姆"] = 751,
				["虹霜禧"] = 493,
				["啊西巴"] = 545,
				["吃手手"] = 544,
				["白起"] = 327,
				["削丶骨"] = 543,
				["Emotionmomo"] = 540,
				["站事盾强"] = 535,
				["李天霸"] = 532,
				["德姐战车"] = 531,
				["循墨"] = 530,
				["三月花开丶"] = 522,
				["栩栩"] = 474,
				["第一页"] = 809,
				["宋画吴冶"] = 790,
				["圣光燃天"] = 385,
				["平凡一生"] = 127,
				["杨倩"] = 509,
				["语言的苍白"] = 16,
				["刘皇叔嗳蹦迪"] = 502,
				["风语者温妮丝"] = 281,
				["三刀"] = 498,
				["龙江大呲花"] = 496,
				["梦凡晨"] = 272,
				["小小的青天"] = 486,
				["Arshfalanor"] = 5,
				["托菲斯"] = 369,
				["特变电工"] = 680,
				["爲勒女王"] = 635,
				["点点威力"] = 479,
				["盗花香"] = 351,
				["枫的呓语"] = 111,
				["阿花"] = 481,
				["铁锅炖大疒"] = 45,
				["灬仙儿灬"] = 478,
				["沙雕巴德蛮"] = 477,
				["猎丨吊"] = 710,
				["死兆星"] = 475,
				["我叫蔡文姬"] = 472,
				["小嘴叭叭"] = 470,
				["胶东小白菜"] = 810,
				["坐看云起"] = 465,
				["阿叶"] = 280,
				["波波兔"] = 27,
				["哈哈笑"] = 464,
				["兮嘻熙"] = 460,
				["小黄啊"] = 452,
				["不想做奶"] = 235,
				["小喵爱发呆"] = 451,
				["小暖男"] = 170,
				["丶抹茶果冻"] = 118,
				["玻璃汾"] = 440,
				["大胡子壮士"] = 30,
				["乘风归来"] = 119,
				["不归"] = 483,
				["老玩童"] = 304,
				["炊烟"] = 349,
				["辰止嘭"] = 262,
				["狂暴的暴风雪"] = 172,
				["壹点点"] = 449,
				["彭灬于晏"] = 529,
				["给你一嘴巴子"] = 622,
				["大梦幻"] = 148,
				["加不满"] = 40,
				["丶恋戦"] = 448,
				["Xikaxinxin"] = 446,
				["巴罗尔"] = 435,
				["小优秀"] = 614,
				["我星星个嘴"] = 742,
				["急眼自己都干"] = 555,
				["天蚕小法"] = 433,
				["团长没了"] = 432,
				["魔法小妹妹"] = 424,
				["不惹尘埃"] = 671,
				["一枪入魂"] = 625,
				["憨搓搓"] = 64,
				["刺儿菊"] = 213,
				["双持风剑"] = 160,
				["黑暗行者"] = 378,
				["对暗号"] = 78,
				["牙膏"] = 419,
				["乌图布拉格"] = 499,
				["小佛爷"] = 79,
				["野味浪女"] = 394,
				["喵小柒"] = 75,
				["迎风点烟"] = 538,
				["黑胡子丶蒂奇"] = 283,
				["丨上邪"] = 69,
				["斯拉克"] = 151,
				["豪杰春香"] = 104,
				["背吉他"] = 765,
				["安非他命"] = 411,
				["奶不住快跑啊"] = 254,
				["夜寻欢"] = 317,
				["夜丶未央"] = 410,
				["可可乐乐"] = 383,
				["低调的蜗牛"] = 408,
				["小小皓伦"] = 195,
				["加拉曼迪斯"] = 289,
				["Limious"] = 87,
				["猪血"] = 808,
				["洋洋世界"] = 152,
				["缓慢升级"] = 403,
				["我有点紧张"] = 400,
				["进击的肥牛卷"] = 43,
				["稻香一五酒馆"] = 173,
				["倪好"] = 429,
				["正在连接中"] = 511,
				["小刺客丶"] = 398,
				["长沙刘德华"] = 123,
				["狮子灬"] = 698,
				["两米五"] = 132,
				["零丷战"] = 396,
				["Wolf"] = 380,
				["雪果"] = 423,
				["紅鲤"] = 569,
				["烈酒封侯"] = 274,
				["好名"] = 643,
				["星痕"] = 796,
				["Cm"] = 379,
				["痛到你哭泣"] = 177,
				["还想笑"] = 96,
				["瑶老头"] = 68,
				["致命爱丽丝"] = 377,
				["可根据返回"] = 135,
				["相遇乱世以外"] = 713,
				["猥琐小老头"] = 37,
				["秋夜无痕"] = 375,
				["希璐达"] = 771,
				["划水壹号"] = 23,
				["入夏了吗"] = 226,
				["听说叫战神"] = 364,
				["剧毒"] = 363,
				["随变"] = 355,
				["蕾丝肚兜"] = 663,
				["妙脆角旋律"] = 342,
				["天吶我真高"] = 341,
				["知天意逆天男"] = 131,
				["肤浅又快乐"] = 305,
				["仰星横"] = 338,
				["咚咚隆咚呛"] = 99,
				["半仙"] = 11,
				["黯牧"] = 336,
				["进退又两难"] = 330,
				["苏霸仙"] = 329,
				["迷你进行曲"] = 331,
				["紫心梅"] = 328,
				["壹队狂暴战"] = 646,
				["法无命"] = 325,
				["懿玖筎夢"] = 321,
				["哈撒剋"] = 316,
				["Damonz"] = 310,
				["Chinaland"] = 309,
				["永远的星月"] = 512,
				["骑猪行天下"] = 308,
				["清风无痕"] = 85,
				["身高不明显"] = 117,
				["布洛芬丶丫"] = 806,
				["特斯拉小妞"] = 300,
				["假死鸟"] = 361,
				["火爆"] = 299,
				["晓贼"] = 297,
				["Monstar"] = 145,
				["光头党"] = 71,
				["你是吊哥的儿"] = 182,
				["搞七撵三"] = 83,
				["凹凸快"] = 288,
				["陪猪看日落"] = 457,
				["扎实素"] = 204,
				["狼牙怀特"] = 112,
				["影後"] = 269,
				["丶末完待续"] = 267,
				["Nivea"] = 265,
				["小腼腆"] = 318,
				["小星穗水蜈蚣"] = 42,
				["火锅王子"] = 260,
				["汉东集团"] = 258,
				["Awin"] = 52,
				["皮燕"] = 636,
				["浪得一逼"] = 273,
				["小鬼都比我高"] = 366,
				["天使之梦"] = 574,
				["逐风者毒刺"] = 248,
				["幻影流光"] = 606,
				["蛋卷"] = 246,
				["妹妹你轻点"] = 3,
				["小胖小"] = 228,
				["皓月狼影"] = 219,
				["我小我够狠"] = 203,
				["点点滴"] = 9,
				["多蛮小丸子"] = 202,
				["温迪妮"] = 807,
				["幻世英雄"] = 580,
				["洗米华"] = 184,
				["当我入夢丶"] = 416,
				["秋风伴月"] = 153,
				["背影是真的"] = 178,
				["有个小德"] = 167,
				["暗影血焉"] = 162,
				["博艺"] = 7,
				["奥优给"] = 150,
				["小心背后丨"] = 110,
				["戰弑"] = 217,
				["拔剑教你做人"] = 141,
				["北京国安"] = 290,
				["张三变"] = 437,
				["刚铎"] = 139,
				["繁华丶如今"] = 420,
				["新世界雇佣军"] = 136,
				["卡姿岚大眼袋"] = 126,
				["晓盐"] = 108,
				["克哈炮王"] = 611,
				["小红牛"] = 107,
				["思忆往昔"] = 89,
				["混道上的"] = 242,
				["发酥"] = 124,
				["嘎嘎爷们"] = 705,
				["保命狗头"] = 19,
			},
		},
	},
}
WIM3_Filters = {
	{
		"^OQ[,S]", -- [1]
		["enabled"] = true,
		["type"] = 1,
		["pattern"] = "^<T>PartyQuests[^A-Z]+\n^<M_N>\n^ItemDB-Request:\n^LVBM\n^YOU ARE BEING WATCHED!\n^YOU ARE MARKED!\n^YOU ARE CURSED!\n^YOU HAVE THE PLAGUE!\n^YOU ARE BURNING!\n^YOU ARE THE BOMB!\nVOLATILE INFECTION\n^/^GA[^A-Z]+\n^<METAMAP\n^<CT",
		["sent"] = true,
		["name"] = "由插件发送的悄悄话",
		["received"] = true,
		["protected"] = true,
		["stats"] = 0,
		["action"] = 2,
		["tag"] = "addons",
	}, -- [1]
	{
		["enabled"] = false,
		["type"] = 2,
		["action"] = 1,
		["friend"] = true,
		["party"] = true,
		["name"] = "悄悄话选择区1",
		["stats"] = 0,
		["raid"] = true,
		["received"] = true,
		["guild"] = true,
	}, -- [2]
	{
		["enabled"] = false,
		["type"] = 2,
		["name"] = "悄悄话选择区2",
		["stats"] = 0,
		["all"] = true,
		["received"] = true,
		["action"] = 2,
	}, -- [3]
}
WIM3_History = {
	["鱼人摩洛克"] = {
		["特变电工"] = {
			["茅台酒"] = {
				{
					["type"] = 1,
					["time"] = 1638082970,
					["from"] = "特变电工",
					["msg"] = "我3月份埋伏了200玩",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1638082989,
					["from"] = "特变电工",
					["msg"] = "发达",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1638082994,
					["from"] = "茅台酒",
					["msg"] = "我关注没买  买了许继电气",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1638082999,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1638083002,
					["from"] = "特变电工",
					["msg"] = "11月很强",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1638083012,
					["from"] = "特变电工",
					["msg"] = "我仓位重",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1638083025,
					["from"] = "茅台酒",
					["msg"] = "13块进去的 进出几次了",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1638083044,
					["from"] = "特变电工",
					["msg"] = "我就满仓一支",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1638083062,
					["from"] = "特变电工",
					["msg"] = "13满仓 27出 24进 准备48出",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1638083092,
					["from"] = "特变电工",
					["msg"] = "他们都叫我拳打张坤交替木头姐的全球顶级投资加",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1638083107,
					["from"] = "特变电工",
					["msg"] = "美股我满仓moderna",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1638083113,
					["from"] = "特变电工",
					["msg"] = "也已经发达",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1638083115,
					["from"] = "茅台酒",
					["msg"] = "。。。。。",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1638083128,
					["from"] = "特变电工",
					["msg"] = "中国顶级程序员兼全球顶级投资家",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1638083131,
					["from"] = "茅台酒",
					["msg"] = "茅台来点不",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1638083136,
					["from"] = "特变电工",
					["msg"] = "不",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1638083139,
					["from"] = "特变电工",
					["msg"] = "我是成长派投资家",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1638083139,
					["from"] = "茅台酒",
					["msg"] = "哈哈 ",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1638083152,
					["from"] = "特变电工",
					["msg"] = "茅台我给800",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1638083154,
					["from"] = "特变电工",
					["msg"] = "目标价",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1638083165,
					["from"] = "茅台酒",
					["msg"] = "我觉得特变和许继都还有空间",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1638083199,
					["from"] = "特变电工",
					["msg"] = "风险也高",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1638083207,
					["from"] = "茅台酒",
					["msg"] = "许继准备先出来看看 回调再进",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1638083215,
					["from"] = "特变电工",
					["msg"] = "我是利润 随便跌",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1638083225,
					["from"] = "特变电工",
					["msg"] = "我是长线目标价选手",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1638083238,
					["from"] = "茅台酒",
					["msg"] = "许继也吃了 大肉",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1638083247,
					["from"] = "特变电工",
					["msg"] = "而且不会卖强补弱 ",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1638083280,
					["from"] = "茅台酒",
					["msg"] = "你都看到48  我要进场了{邪恶}",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1638083330,
					["from"] = "特变电工",
					["msg"] = "许继可以",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1638083347,
					["from"] = "特变电工",
					["msg"] = "特工散户太多了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1638083353,
					["from"] = "特变电工",
					["msg"] = "这个是很大的风险",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1638083358,
					["from"] = "特变电工",
					["msg"] = "我怕他走17年京东方的露",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1638083378,
					["from"] = "特变电工",
					["msg"] = "不过特变的交投很活跃",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1638083383,
					["from"] = "茅台酒",
					["msg"] = "嗯 ",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1638083385,
					["from"] = "特变电工",
					["msg"] = "这个我很喜欢",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1638083396,
					["from"] = "特变电工",
					["msg"] = "稳定在30亿成交就很稳",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1638083414,
					["from"] = "特变电工",
					["msg"] = "主力都在尽流出 股价没怎么跌",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1638083415,
					["from"] = "茅台酒",
					["msg"] = "国家才出的顶层制度 政策红利还要释放",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1638083418,
					["from"] = "特变电工",
					["msg"] = "技术指标很难看",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1638083424,
					["from"] = "特变电工",
					["msg"] = "不过无所谓了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1638083427,
					["from"] = "特变电工",
					["msg"] = "都是利润",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1638083432,
					["from"] = "特变电工",
					["msg"] = "我拿起",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1638083482,
					["from"] = "特变电工",
					["msg"] = "美股不搞起？",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1638083486,
					["from"] = "特变电工",
					["msg"] = "我是A 港 美",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1638083498,
					["from"] = "特变电工",
					["msg"] = "三翼起飞",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1638083510,
					["from"] = "特变电工",
					["msg"] = "全球顶级投资家",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1638083521,
					["from"] = "特变电工",
					["msg"] = "部落第一战",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1638083526,
					["from"] = "茅台酒",
					["msg"] = "我还是只搞国内",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1638083543,
					["from"] = "特变电工",
					["msg"] = "A股优秀的公司太少了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1638083548,
					["from"] = "特变电工",
					["msg"] = "不过很简单",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1638083550,
					["from"] = "特变电工",
					["msg"] = "美股难",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1638083551,
					["from"] = "茅台酒",
					["msg"] = "现在外国不确定太多 支持国家",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1638083563,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1638083573,
					["from"] = "茅台酒",
					["msg"] = "这两天非洲!@#$%^ 估计周一要一篇大绿",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1638083573,
					["from"] = "特变电工",
					["msg"] = "你看纳斯达克指数",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1638083583,
					["from"] = "特变电工",
					["msg"] = "我就等他这个利空",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1638083584,
					["from"] = "茅台酒",
					["msg"] = "这两天非洲疫 情 估计周一要一篇大绿",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1638083586,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1638083614,
					["from"] = "特变电工",
					["msg"] = "经济越差 股市越好",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1638083620,
					["from"] = "茅台酒",
					["msg"] = "研究得少 安心跟着党走 吃点肉",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1638083648,
					["from"] = "特变电工",
					["msg"] = "美股我现在满仓川普数字媒体",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1638083649,
					["from"] = "茅台酒",
					["msg"] = "中国特色的股市 哈哈",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1638083688,
					["from"] = "特变电工",
					["msg"] = "你看一带一路板块",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1638083693,
					["from"] = "特变电工",
					["msg"] = "超垃圾",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1638083706,
					["from"] = "茅台酒",
					["msg"] = "嗯 ",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1638083742,
					["from"] = "特变电工",
					["msg"] = "许继很七块",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1638083747,
					["from"] = "特变电工",
					["msg"] = "很奇怪",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1638083751,
					["from"] = "特变电工",
					["msg"] = "财报很差",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1638083766,
					["from"] = "特变电工",
					["msg"] = "起飞了 说明明年财报是超预期的",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1638083769,
					["from"] = "茅台酒",
					["msg"] = "中国企业不能看财报",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1638083776,
					["from"] = "特变电工",
					["msg"] = "等他发财报就可以跑了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1638083785,
					["from"] = "特变电工",
					["msg"] = "股价是反应未来的财报",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1638083790,
					["from"] = "特变电工",
					["msg"] = "这个是更古不变的",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1638083799,
					["from"] = "特变电工",
					["msg"] = "只有预判机构的预判才能发达",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1638083806,
					["from"] = "茅台酒",
					["msg"] = "主要中国企业财报是可调整的",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1638083812,
					["from"] = "茅台酒",
					["msg"] = "比如茅台",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1638083824,
					["from"] = "茅台酒",
					["msg"] = "知道茅台多有钱吗？ ",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1638083852,
					["from"] = "特变电工",
					["msg"] = "太贵",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1638083859,
					["from"] = "特变电工",
					["msg"] = "超过阿里的",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1638083869,
					["from"] = "特变电工",
					["msg"] = "我只能给他1800亿美元",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1638083872,
					["from"] = "特变电工",
					["msg"] = "不能再多了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1638083872,
					["from"] = "茅台酒",
					["msg"] = "无偿给贵州省&*!@#$让2个点 贵州债务直接缓解过来",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1638083919,
					["from"] = "茅台酒",
					["msg"] = "加好友了 以后一起玩 下了88",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1638083925,
					["from"] = "特变电工",
					["msg"] = "88",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1638190202,
					["from"] = "特变电工",
					["msg"] = "特工今天还可以",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1638190216,
					["from"] = "茅台酒",
					["msg"] = "嗯 估计要起来了",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1638190218,
					["from"] = "特变电工",
					["msg"] = "我%^&*!@一个人做旋风武器",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1638190225,
					["from"] = "特变电工",
					["msg"] = "太惨了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1638190240,
					["from"] = "茅台酒",
					["msg"] = "组队做噻",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1638190246,
					["from"] = "特变电工",
					["msg"] = "没人",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1638190258,
					["from"] = "茅台酒",
					["msg"] = "ZS是版本歧视的职业",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1638190337,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1638190345,
					["from"] = "茅台酒",
					["msg"] = "昨天18级 去T 死亡矿井 悲壮啊",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1638190372,
					["from"] = "茅台酒",
					["msg"] = "最后还是打通了",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1638190430,
					["from"] = "茅台酒",
					["msg"] = "今天把许继清了 估计这几天要调整下 最近涨得太高",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1638190541,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1638190645,
					["from"] = "茅台酒",
					["msg"] = "和平均成本偏离太大",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1638191290,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:6977::::::::37:::::::::|h[旋风之剑]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1638191312,
					["from"] = "茅台酒",
					["msg"] = "属性不错",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1638191417,
					["from"] = "特变电工",
					["msg"] = "明天涨停",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1638191423,
					["from"] = "特变电工",
					["msg"] = "比先",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1638191425,
					["from"] = "特变电工",
					["msg"] = "必须",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1638191432,
					["from"] = "特变电工",
					["msg"] = "48 一定到",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1638191434,
					["from"] = "特变电工",
					["msg"] = "%^&*!@#$%",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1638191441,
					["from"] = "特变电工",
					["msg"] = "到了我就有1000万现金了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1638191458,
					["from"] = "特变电工",
					["msg"] = "川普dwac美股到300 我就有1500万了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1638191463,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1638191507,
					["from"] = "特变电工",
					["msg"] = "不影响我每天挤地铁 ",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1638191870,
					["from"] = "茅台酒",
					["msg"] = "都身价百万了 还坐地铁呀",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1638192020,
					["from"] = "特变电工",
					["msg"] = "数字游戏而已",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1638192032,
					["from"] = "特变电工",
					["msg"] = "不影响我刚才求法爷要面包 ",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1638192036,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [112]
				["info"] = {
				},
			},
			["青空光"] = {
				{
					["type"] = 1,
					["time"] = 1638087138,
					["from"] = "特变电工",
					["msg"] = "荆棘谷刺激吗 兄弟",
					["inbound"] = false,
					["convo"] = "青空光",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1638087149,
					["from"] = "特变电工",
					["msg"] = "被杀了几次了 ",
					["inbound"] = false,
					["convo"] = "青空光",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1638087151,
					["from"] = "特变电工",
					["msg"] = "人多吗",
					["inbound"] = false,
					["convo"] = "青空光",
				}, -- [3]
				["info"] = {
				},
			},
			["社区送温暖"] = {
				{
					["type"] = 1,
					["time"] = 1637854362,
					["from"] = "特变电工",
					["msg"] = "我美股今年赚130% 然后现在亏-30%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1637854368,
					["from"] = "特变电工",
					["msg"] = "太难了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1637854516,
					["from"] = "社区送温暖",
					["msg"] = "美股不是一直涨吗",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1637854537,
					["from"] = "特变电工",
					["msg"] = "除非你买Fanng",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1637854543,
					["from"] = "特变电工",
					["msg"] = "不然都是死",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1637854549,
					["from"] = "特变电工",
					["msg"] = "就权重涨",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1637854601,
					["from"] = "特变电工",
					["msg"] = "我又是拳打张坤脚踢木头姐的全球顶级颠覆性成长派投资家 才不会去买苹果 亚马逊这种权重股 没有想象力",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1638199590,
					["from"] = "特变电工",
					["msg"] = "起飞了没",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1638199592,
					["from"] = "特变电工",
					["msg"] = "禁停啊",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1638199595,
					["from"] = "特变电工",
					["msg"] = "今天",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1638199642,
					["from"] = "社区送温暖",
					["msg"] = "不多，我没买太多，在定投基金，感觉股票搞不好",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1638199660,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1638199663,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1638199685,
					["from"] = "社区送温暖",
					["msg"] = "恩，买了股票整天盯着累",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1638199691,
					["from"] = "特变电工",
					["msg"] = "等我1千万了我也买点基金",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1638199700,
					["from"] = "特变电工",
					["msg"] = "我也没盯",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1638199709,
					["from"] = "特变电工",
					["msg"] = "满仓一支 不^&*作 每天波动贼大",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1638199711,
					["from"] = "社区送温暖",
					["msg"] = "你厉害的，我就只有几十玩",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1638199737,
					["from"] = "社区送温暖",
					["msg"] = "是的，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1638199751,
					["from"] = "特变电工",
					["msg"] = "几十万在散户中算很多的了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1638199794,
					["from"] = "特变电工",
					["msg"] = "我19年买的景顺长城",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1638199801,
					["from"] = "特变电工",
					["msg"] = "去年出的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1638199806,
					["from"] = "特变电工",
					["msg"] = "120%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1638199818,
					["from"] = "社区送温暖",
					["msg"] = "我今年3月多才开始玩玩",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1638199848,
					["from"] = "特变电工",
					["msg"] = "基金特别2",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1638199858,
					["from"] = "特变电工",
					["msg"] = "你还不如买场内ETF",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1638199864,
					["from"] = "特变电工",
					["msg"] = "没有管理费",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1638199868,
					["from"] = "特变电工",
					["msg"] = "没有手续费",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1638199872,
					["from"] = "特变电工",
					["msg"] = "随时跑",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1638199888,
					["from"] = "特变电工",
					["msg"] = "很多基金经理都跑不过ETF 或者跟踪的就是ETF",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1638199949,
					["from"] = "社区送温暖",
					["msg"] = "算了，自己把握不住，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1638199962,
					["from"] = "特变电工",
					["msg"] = "你买基金就不要频繁&*!作",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1638199975,
					["from"] = "社区送温暖",
					["msg"] = "恩，就是定投",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1638199977,
					["from"] = "特变电工",
					["msg"] = "我基金都拿2年以上才考虑动",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1638199986,
					["from"] = "特变电工",
					["msg"] = "少买点消费",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1638199993,
					["from"] = "特变电工",
					["msg"] = "多买点光伏",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1638200009,
					["from"] = "社区送温暖",
					["msg"] = "我基本都是光伏 新能源 还有汽车整车",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1638200016,
					["from"] = "特变电工",
					["msg"] = "那还可以",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1638200020,
					["from"] = "社区送温暖",
					["msg"] = "加上诺安",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1638200026,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1638200058,
					["from"] = "社区送温暖",
					["msg"] = "诺安和光伏有30%了，就是才几万",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1638200090,
					["from"] = "特变电工",
					["msg"] = "不错了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1638200103,
					["from"] = "特变电工",
					["msg"] = "今年有30%就很强",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1638200116,
					["from"] = "社区送温暖",
					["msg"] = "恩，其实亏的，今天上半年把煤炭和有色卖了买的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1638200122,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1638200123,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1638200126,
					["from"] = "特变电工",
					["msg"] = "亏？",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1638200135,
					["from"] = "特变电工",
					["msg"] = "你这个赛道不可能亏啊",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1638200158,
					["from"] = "社区送温暖",
					["msg"] = "我看煤炭和有色卖了之后就暴涨",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1638200265,
					["from"] = "社区送温暖",
					["msg"] = "你说今年到年底前跌不跌",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1638200282,
					["from"] = "社区送温暖",
					["msg"] = "就是过年那会",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1638200283,
					["from"] = "特变电工",
					["msg"] = "指数震荡 个股表现",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1638200292,
					["from"] = "特变电工",
					["msg"] = "我不关心指数 大盘",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1638200310,
					["from"] = "特变电工",
					["msg"] = "只要没有系统性崩盘就行",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1638200325,
					["from"] = "特变电工",
					["msg"] = "我不喜欢全面大牛",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1638200330,
					["from"] = "特变电工",
					["msg"] = "指数大牛",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1638200334,
					["from"] = "社区送温暖",
					["msg"] = "也是我刚刚3月份进去那一会还可以",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1638200335,
					["from"] = "特变电工",
					["msg"] = "我喜欢这样",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1638200346,
					["from"] = "特变电工",
					["msg"] = "指数不变 个股表现",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1638200371,
					["from"] = "社区送温暖",
					["msg"] = "那时候随便买的医美涨的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1638200379,
					["from"] = "特变电工",
					["msg"] = "太贵",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1638200400,
					["from"] = "特变电工",
					["msg"] = "估值太高",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1638200422,
					["from"] = "社区送温暖",
					["msg"] = "刚买碰巧的，苏宁环球涨好多",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1638200458,
					["from"] = "特变电工",
					["msg"] = "现在最稳妥的是 你有50万资金 南下买企鹅",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1638200469,
					["from"] = "特变电工",
					["msg"] = "比较稳",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1638200508,
					["from"] = "特变电工",
					["msg"] = "我后悔在19年8月开怀旧服的时候没买$%^&*!和暴 血",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1638200515,
					["from"] = "特变电工",
					["msg"] = "网 易",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1638200524,
					["from"] = "特变电工",
					["msg"] = "我这么喜欢魔兽",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1638200525,
					["from"] = "社区送温暖",
					["msg"] = "我都不懂买国外的。",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1638200529,
					["from"] = "特变电工",
					["msg"] = "都没买他们",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1638200559,
					["from"] = "特变电工",
					["msg"] = "可以弄一点",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1638200562,
					["from"] = "特变电工",
					["msg"] = "作为对冲",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1638200568,
					["from"] = "社区送温暖",
					["msg"] = "感觉很烦，17年比特币我朋友叫我买，我还记得是1,3上下",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1638200570,
					["from"] = "特变电工",
					["msg"] = "人民币和美元资产都配置",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1638200575,
					["from"] = "特变电工",
					["msg"] = "如果你资产到了一定的水平",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1638200584,
					["from"] = "特变电工",
					["msg"] = "人民币资产A股 美元资产美股",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1638200589,
					["from"] = "社区送温暖",
					["msg"] = "后来想买个2个，感觉交易麻烦的不得了就没买",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1638200601,
					["from"] = "特变电工",
					["msg"] = "出入金有点麻烦",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1638200709,
					["from"] = "社区送温暖",
					["msg"] = "你觉得爱康科技怎么样",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1638200721,
					["from"] = "特变电工",
					["msg"] = "没怎么研究",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1638200725,
					["from"] = "特变电工",
					["msg"] = "好像是风电",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1638200732,
					["from"] = "社区送温暖",
					["msg"] = "光伏电池的，之前很想多买点的，就是后来不想玩股票",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1638200764,
					["from"] = "社区送温暖",
					["msg"] = "之前业绩不怎么样，但是一直是有资金进去",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1638200779,
					["from"] = "特变电工",
					["msg"] = "稳妥的就买隆基",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1638200790,
					["from"] = "特变电工",
					["msg"] = "成长就买特变",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1638200796,
					["from"] = "特变电工",
					["msg"] = "其他就算了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1638200818,
					["from"] = "社区送温暖",
					["msg"] = "恩，我这人多动想想就算了，几个翻倍的都拿不住",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1638200868,
					["from"] = "特变电工",
					["msg"] = "因为你没有目标价",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1638200872,
					["from"] = "特变电工",
					["msg"] = "没有估值体系",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1638200875,
					["from"] = "特变电工",
					["msg"] = "很章程",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1638200877,
					["from"] = "特变电工",
					["msg"] = "很正常",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1638200908,
					["from"] = "社区送温暖",
					["msg"] = "今年科士达 苏宁环球 新天然气，卫士通好几个都是赚一些走了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1638200927,
					["from"] = "社区送温暖",
					["msg"] = "东方银星一套就亏一半",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1638200960,
					["from"] = "特变电工",
					["msg"] = "哈",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1638200968,
					["from"] = "特变电工",
					["msg"] = "散户的特征",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1638200982,
					["from"] = "特变电工",
					["msg"] = "拿不住盈利 喜欢被深套装死",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1638200999,
					["from"] = "特变电工",
					["msg"] = "股票的精髓的以小博大",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1638201015,
					["from"] = "特变电工",
					["msg"] = "以最小的回撤赚最大的涨幅",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1638201027,
					["from"] = "特变电工",
					["msg"] = "我赚钱的股票绝对不会轻易卖",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1638201035,
					["from"] = "特变电工",
					["msg"] = "亏的票割肉比谁都快",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1638201048,
					["from"] = "特变电工",
					["msg"] = "我的交割胜率只有40%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1638201059,
					["from"] = "特变电工",
					["msg"] = "但是收益率是180%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1638201063,
					["from"] = "特变电工",
					["msg"] = "近一年",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1638201071,
					["from"] = "特变电工",
					["msg"] = "我经常割肉",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1638201104,
					["from"] = "社区送温暖",
					["msg"] = "其实上半年那时候指数没涨，反而好做，我那是就是去打板",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1638201114,
					["from"] = "特变电工",
					["msg"] = "你想 你买股票可能亏50% 肯定要涨100%以上你才划算",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1638201123,
					["from"] = "社区送温暖",
					["msg"] = "好几次吃到3连板跑",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1638201132,
					["from"] = "特变电工",
					["msg"] = "你冒着腰斩的风险 赚一点收益 性价比期望值太低",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1638201147,
					["from"] = "社区送温暖",
					["msg"] = "恩，后来今天板明天就闷杀",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1638201156,
					["from"] = "特变电工",
					["msg"] = "涨的票一直拿",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1638201159,
					["from"] = "特变电工",
					["msg"] = "不要慌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1638201167,
					["from"] = "社区送温暖",
					["msg"] = "恩，还是基金跟着大趋势",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1638201175,
					["from"] = "特变电工",
					["msg"] = "不要卖强补弱",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1638201194,
					["from"] = "特变电工",
					["msg"] = "这个是人性 但是也是最容易掉入深渊的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1638201203,
					["from"] = "特变电工",
					["msg"] = "你看优秀的票都是一直涨",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1638201207,
					["from"] = "社区送温暖",
					["msg"] = "恩，我不看消息买的时候赚，后来一直关注什么基本面消息就亏了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1638201211,
					["from"] = "特变电工",
					["msg"] = "只有垃圾票才会一直跌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1638201253,
					["from"] = "社区送温暖",
					["msg"] = "恩， 我做也喜欢做主升浪的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1638202496,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1638202509,
					["from"] = "特变电工",
					["msg"] = "跑凄凉之地跑惨了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1638279242,
					["from"] = "特变电工",
					["msg"] = "你觉得茅台值钱还是阿里巴巴值钱",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1638279278,
					["from"] = "社区送温暖",
					["msg"] = "不懂啊，阿里巴巴都不在大A’",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1638287348,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1638287352,
					["from"] = "特变电工",
					["msg"] = "阿里又崩了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1638287359,
					["from"] = "社区送温暖",
					["msg"] = "- -",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1638287360,
					["from"] = "特变电工",
					["msg"] = "127了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1638287387,
					["from"] = "社区送温暖",
					["msg"] = "还是茅台牛逼，那是跌破1600我想买一手的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1638287432,
					["from"] = "社区送温暖",
					["msg"] = "今天基金还亏了100块",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1638287456,
					["from"] = "特变电工",
					["msg"] = "茅台太贵了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1638287460,
					["from"] = "特变电工",
					["msg"] = "赶紧跑把",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1638287472,
					["from"] = "特变电工",
					["msg"] = "茅台能比阿里市值高？",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1638287475,
					["from"] = "社区送温暖",
					["msg"] = "又没买",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1638287484,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1638287486,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1638287490,
					["from"] = "特变电工",
					["msg"] = "鉴定看空茅台",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1638287502,
					["from"] = "社区送温暖",
					["msg"] = "这段时间大消费还可以的，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1638287513,
					["from"] = "社区送温暖",
					["msg"] = "短期感觉问题不大",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1638287514,
					["from"] = "特变电工",
					["msg"] = "只是一个微反弹",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [138]
				{
					["type"] = 1,
					["time"] = 1638287566,
					["from"] = "社区送温暖",
					["msg"] = "真要跌下来了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [139]
				{
					["type"] = 1,
					["time"] = 1638287571,
					["from"] = "社区送温暖",
					["msg"] = "还是很不错的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [140]
				{
					["type"] = 1,
					["time"] = 1638287573,
					["from"] = "特变电工",
					["msg"] = "800",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [141]
				{
					["type"] = 1,
					["time"] = 1638287580,
					["from"] = "社区送温暖",
					["msg"] = "那不可能",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [142]
				{
					["type"] = 1,
					["time"] = 1638287588,
					["from"] = "特变电工",
					["msg"] = "必然",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [143]
				{
					["type"] = 1,
					["time"] = 1638287600,
					["from"] = "社区送温暖",
					["msg"] = "要么除权",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [144]
				{
					["type"] = 1,
					["time"] = 1638287650,
					["from"] = "特变电工",
					["msg"] = "茅台没有想象力",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [145]
				{
					["type"] = 1,
					["time"] = 1638287664,
					["from"] = "特变电工",
					["msg"] = "一个公司没有想象力之后就是阿里这种跌法",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [146]
				{
					["type"] = 1,
					["time"] = 1638287680,
					["from"] = "特变电工",
					["msg"] = "跌到10倍PE都正常",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [147]
				{
					["type"] = 1,
					["time"] = 1638287688,
					["from"] = "特变电工",
					["msg"] = "你看茅台13年怎么跌的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [148]
				{
					["type"] = 1,
					["time"] = 1638287704,
					["from"] = "社区送温暖",
					["msg"] = "那就买点石英股份",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [149]
				{
					["type"] = 1,
					["time"] = 1638287714,
					["from"] = "社区送温暖",
					["msg"] = "爱康科技这种",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [150]
				{
					["type"] = 1,
					["time"] = 1638287715,
					["from"] = "特变电工",
					["msg"] = "没有想象力的公司一律不碰",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [151]
				{
					["type"] = 1,
					["time"] = 1638287728,
					["from"] = "社区送温暖",
					["msg"] = "光伏电池这一块的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [152]
				{
					["type"] = 1,
					["time"] = 1638287780,
					["from"] = "社区送温暖",
					["msg"] = "现在总体还是震荡下行啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [153]
				{
					["type"] = 1,
					["time"] = 1638287921,
					["from"] = "特变电工",
					["msg"] = "美股崩了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [154]
				{
					["type"] = 1,
					["time"] = 1638287924,
					["from"] = "特变电工",
					["msg"] = "大跳水",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [155]
				{
					["type"] = 1,
					["time"] = 1638287936,
					["from"] = "特变电工",
					["msg"] = "我的DWAC是红的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [156]
				{
					["type"] = 1,
					["time"] = 1638287972,
					["from"] = "特变电工",
					["msg"] = "指数瞬间跌到1.3%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [157]
				{
					["type"] = 1,
					["time"] = 1638287984,
					["from"] = "特变电工",
					["msg"] = "1.5了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [158]
				{
					["type"] = 1,
					["time"] = 1638287986,
					["from"] = "社区送温暖",
					["msg"] = "我现在买基金心里没大的波澜-",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [159]
				{
					["type"] = 1,
					["time"] = 1638451797,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [160]
				{
					["type"] = 1,
					["time"] = 1638451804,
					["from"] = "特变电工",
					["msg"] = "我美股回家了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [161]
				{
					["type"] = 1,
					["time"] = 1638451812,
					["from"] = "社区送温暖",
					["msg"] = "什么",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [162]
				{
					["type"] = 1,
					["time"] = 1638451813,
					["from"] = "特变电工",
					["msg"] = "一天赚了100万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [163]
				{
					["type"] = 1,
					["time"] = 1638451834,
					["from"] = "特变电工",
					["msg"] = "我86倍杠杆4万美元做空拼过",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [164]
				{
					["type"] = 1,
					["time"] = 1638451836,
					["from"] = "特变电工",
					["msg"] = "平果",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [165]
				{
					["type"] = 1,
					["time"] = 1638451845,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [166]
				{
					["type"] = 1,
					["time"] = 1638451859,
					["from"] = "特变电工",
					["msg"] = "太刺激了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [167]
				{
					["type"] = 1,
					["time"] = 1638451860,
					["from"] = "社区送温暖",
					["msg"] = "这么多啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [168]
				{
					["type"] = 1,
					["time"] = 1638451863,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [169]
				{
					["type"] = 1,
					["time"] = 1638451886,
					["from"] = "特变电工",
					["msg"] = "我今天凌晨5点收盘前平了一半",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [170]
				{
					["type"] = 1,
					["time"] = 1638451892,
					["from"] = "特变电工",
					["msg"] = "不然一天是240万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [171]
				{
					["type"] = 1,
					["time"] = 1638451897,
					["from"] = "特变电工",
					["msg"] = "气死我了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [172]
				{
					["type"] = 1,
					["time"] = 1638451911,
					["from"] = "社区送温暖",
					["msg"] = "可以了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [173]
				{
					["type"] = 1,
					["time"] = 1638451934,
					["from"] = "特变电工",
					["msg"] = "再也不赌了 直接掀赌桌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [174]
				{
					["type"] = 1,
					["time"] = 1638451944,
					["from"] = "特变电工",
					["msg"] = "我发现昨天&*!@#$的我太可怕了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [175]
				{
					["type"] = 1,
					["time"] = 1638451969,
					["from"] = "特变电工",
					["msg"] = "主要是美股就苹果涨 其他票全暴跌 指数涨",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [176]
				{
					["type"] = 1,
					["time"] = 1638451973,
					["from"] = "特变电工",
					["msg"] = "我的票跌惨了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [177]
				{
					["type"] = 1,
					["time"] = 1638451975,
					["from"] = "特变电工",
					["msg"] = "气死我了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [178]
				{
					["type"] = 1,
					["time"] = 1638451992,
					["from"] = "特变电工",
					["msg"] = "我一气之下想回本 想苹果跌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [179]
				{
					["type"] = 1,
					["time"] = 1638452035,
					["from"] = "特变电工",
					["msg"] = "这几个月的美股天天都是2月份的茅台行情 个股普跌 权重爆拉",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [180]
				{
					["type"] = 1,
					["time"] = 1638452040,
					["from"] = "特变电工",
					["msg"] = "标准的一将功成万骨枯",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [181]
				{
					["type"] = 1,
					["time"] = 1638452073,
					["from"] = "特变电工",
					["msg"] = "以后见到盗贼我见一个杀一个",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [182]
				{
					["type"] = 1,
					["time"] = 1638452078,
					["from"] = "特变电工",
					["msg"] = "直接先手",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [183]
				{
					["type"] = 1,
					["time"] = 1638452092,
					["from"] = "特变电工",
					["msg"] = "最近盗贼在你眼皮底下搞突然袭击",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [184]
				{
					["type"] = 1,
					["time"] = 1638452105,
					["from"] = "特变电工",
					["msg"] = "昨天一个34级盗贼主动打完怪然后偷袭我41级的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [185]
				{
					["type"] = 1,
					["time"] = 1638452113,
					["from"] = "特变电工",
					["msg"] = "直接被我杀",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [186]
				{
					["type"] = 1,
					["time"] = 1638452129,
					["from"] = "社区送温暖",
					["msg"] = "看见就杀",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [187]
				{
					["type"] = 1,
					["time"] = 1638452130,
					["from"] = "特变电工",
					["msg"] = "然后一个38级偷袭我技能全开把我砍了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [188]
				{
					["type"] = 1,
					["time"] = 1638452136,
					["from"] = "特变电工",
					["msg"] = "玩盗贼的都喜欢野外",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [189]
				{
					["type"] = 1,
					["time"] = 1638452141,
					["from"] = "特变电工",
					["msg"] = "老子算是看明白了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [190]
				{
					["type"] = 1,
					["time"] = 1638452155,
					["from"] = "特变电工",
					["msg"] = "我在战场可是每场杀人帮第一的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [191]
				{
					["type"] = 1,
					["time"] = 1638452240,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [192]
				{
					["type"] = 1,
					["time"] = 1638452257,
					["from"] = "特变电工",
					["msg"] = "你喜欢野外偷袭人吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [193]
				{
					["type"] = 1,
					["time"] = 1638452355,
					["from"] = "社区送温暖",
					["msg"] = "以前见到就杀，有时候还通宵守尸体",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [194]
				["info"] = {
				},
			},
			["阡祈"] = {
				{
					["type"] = 1,
					["time"] = 1638190632,
					["from"] = "阡祈",
					["msg"] = "人呢",
					["inbound"] = true,
					["convo"] = "阡祈",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1638190642,
					["from"] = "特变电工",
					["msg"] = "在任务这里",
					["inbound"] = false,
					["convo"] = "阡祈",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1638190656,
					["from"] = "特变电工",
					["msg"] = "旋风斧",
					["inbound"] = false,
					["convo"] = "阡祈",
				}, -- [3]
				["info"] = {
				},
			},
			["大叔尚"] = {
				{
					["type"] = 1,
					["time"] = 1638195774,
					["from"] = "大叔尚",
					["msg"] = "LM 战士怎么去任务地方啊",
					["inbound"] = true,
					["convo"] = "大叔尚",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1638195784,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "大叔尚",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1638195793,
					["from"] = "特变电工",
					["msg"] = "南海镇",
					["inbound"] = false,
					["convo"] = "大叔尚",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1638195800,
					["from"] = "特变电工",
					["msg"] = "沿着河上去",
					["inbound"] = false,
					["convo"] = "大叔尚",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1638195827,
					["from"] = "大叔尚",
					["msg"] = "哦哦 ，第一次LM 不大动哈哈",
					["inbound"] = true,
					["convo"] = "大叔尚",
				}, -- [5]
				["info"] = {
				},
			},
			["午夜枪手"] = {
				{
					["type"] = 1,
					["time"] = 1638070203,
					["from"] = "特变电工",
					["msg"] = "法爺 幫我做點吃的吧",
					["inbound"] = false,
					["convo"] = "午夜枪手",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1638070258,
					["from"] = "特变电工",
					["msg"] = "謝謝",
					["inbound"] = false,
					["convo"] = "午夜枪手",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1638070264,
					["from"] = "特变电工",
					["msg"] = "愿聖光保佑著你",
					["inbound"] = false,
					["convo"] = "午夜枪手",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1638070286,
					["from"] = "午夜枪手",
					["msg"] = "{大笑}",
					["inbound"] = true,
					["convo"] = "午夜枪手",
				}, -- [4]
				["info"] = {
				},
			},
			["萌萌灰#51759"] = {
				{
					["type"] = 1,
					["time"] = 1637479185,
					["from"] = "萌萌灰#51759",
					["msg"] = "咦。。。",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1637479191,
					["from"] = "特变电工",
					["msg"] = "？",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1637479194,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1637479204,
					["from"] = "萌萌灰#51759",
					["msg"] = "你怎么去垃圾怀旧服了。。",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1637479206,
					["from"] = "特变电工",
					["msg"] = "姚志刚",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1637479219,
					["from"] = "萌萌灰#51759",
					["msg"] = "靠 是你的。。",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1637479220,
					["from"] = "特变电工",
					["msg"] = "我一直在台服TBC",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1637479235,
					["from"] = "萌萌灰#51759",
					["msg"] = "竟然是你 。。",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1637479238,
					["from"] = "特变电工",
					["msg"] = "赛季服没人 台服",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1637479254,
					["from"] = "萌萌灰#51759",
					["msg"] = "正式服不玩 玩怀旧。。",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1637479259,
					["from"] = "特变电工",
					["msg"] = "不好玩",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1638099114,
					["from"] = "特变电工",
					["msg"] = "姚志刚",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1638099129,
					["from"] = "特变电工",
					["msg"] = "你玩正式服玩了10年了",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1638099131,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1638099140,
					["from"] = "特变电工",
					["msg"] = "不腻啊",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1638099142,
					["from"] = "萌萌灰#51759",
					["msg"] = "60级开始玩的啊",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1638099150,
					["from"] = "萌萌灰#51759",
					["msg"] = "那否则呢？、",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1638099151,
					["from"] = "特变电工",
					["msg"] = "怀旧服好玩",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1638099154,
					["from"] = "萌萌灰#51759",
					["msg"] = "玩你么~~",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1638099158,
					["from"] = "特变电工",
					["msg"] = "我永远60-80",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1638099161,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1638099164,
					["from"] = "萌萌灰#51759",
					["msg"] = "玩10年前的东西 你不腻么？",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1638099167,
					["from"] = "特变电工",
					["msg"] = "你都不怀旧的啊",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1638099177,
					["from"] = "特变电工",
					["msg"] = "不念旧",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1638099181,
					["from"] = "特变电工",
					["msg"] = "你的青春啊",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1638099188,
					["from"] = "特变电工",
					["msg"] = "你不去寻找",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1638099216,
					["from"] = "萌萌灰#51759",
					["msg"] = "老子还年轻呢",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1638099220,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [28]
				["info"] = {
				},
			},
			["靖哥哥#52386"] = {
				{
					["type"] = 1,
					["time"] = 1637684220,
					["from"] = "特变电工",
					["msg"] = "35级了啊",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1637684269,
					["from"] = "靖哥哥#52386",
					["msg"] = "是啊",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1637684297,
					["from"] = "特变电工",
					["msg"] = "你那个服务器排队吗",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1637684305,
					["from"] = "靖哥哥#52386",
					["msg"] = "不排",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1637684309,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1637684356,
					["from"] = "特变电工",
					["msg"] = "为啥我们是战网好友",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1637684359,
					["from"] = "特变电工",
					["msg"] = "什么时候加的",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1637684417,
					["from"] = "靖哥哥#52386",
					["msg"] = "你之前是沙尔图拉的服务器的么",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1637684423,
					["from"] = "特变电工",
					["msg"] = "对",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1637684430,
					["from"] = "特变电工",
					["msg"] = "19年10月就弃坑了",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1637684438,
					["from"] = "特变电工",
					["msg"] = "然后去台服了",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1637684448,
					["from"] = "特变电工",
					["msg"] = "现在在台服TBC",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1637684460,
					["from"] = "特变电工",
					["msg"] = "赛季服人太少 就回来玩赛季服 ",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1637684461,
					["from"] = "靖哥哥#52386",
					["msg"] = "为啥去台服",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1637684466,
					["from"] = "特变电工",
					["msg"] = "环境好啊",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1637684479,
					["from"] = "特变电工",
					["msg"] = "和善 友爱 包容",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1637684496,
					["from"] = "靖哥哥#52386",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1637684504,
					["from"] = "特变电工",
					["msg"] = "现在很不!@#惯 回来",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1637684627,
					["from"] = "靖哥哥#52386",
					["msg"] = "睡觉了 88",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1637684632,
					["from"] = "特变电工",
					["msg"] = "88",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1637684635,
					["from"] = "特变电工",
					["msg"] = "我的朋友",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1637848141,
					["from"] = "特变电工",
					["msg"] = "36了哦",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1637848145,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1637848148,
					["from"] = "特变电工",
					["msg"] = "你Tbc没玩吗",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1637848172,
					["from"] = "靖哥哥#52386",
					["msg"] = "不玩了，中间afk了一年",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1637848174,
					["from"] = "靖哥哥#52386",
					["msg"] = "回来没人要",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1637848221,
					["from"] = "特变电工",
					["msg"] = "。。。",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1637848232,
					["from"] = "特变电工",
					["msg"] = "我在台服TBC",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1637848239,
					["from"] = "特变电工",
					["msg"] = "2边玩",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1637848268,
					["from"] = "靖哥哥#52386",
					["msg"] = "我就爱玩战士 tbc对近战不友好",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1637848279,
					["from"] = "特变电工",
					["msg"] = "TBC我也是战士",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1637848283,
					["from"] = "特变电工",
					["msg"] = "防战",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1637848303,
					["from"] = "特变电工",
					["msg"] = "下周可以打狂暴战了",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1637848308,
					["from"] = "特变电工",
					["msg"] = "安逸的很",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1637848349,
					["from"] = "靖哥哥#52386",
					["msg"] = "我打算就先玩玩这个，等wlk了再回去 ",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1637857340,
					["from"] = "特变电工",
					["msg"] = "血色跑好远",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1637857342,
					["from"] = "特变电工",
					["msg"] = "佩服",
					["inbound"] = false,
					["convo"] = "靖哥哥#52386",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1637857932,
					["from"] = "靖哥哥#52386",
					["msg"] = "有人拉",
					["inbound"] = true,
					["convo"] = "靖哥哥#52386",
				}, -- [38]
				["info"] = {
				},
			},
			["陪猪看日落"] = {
				{
					["type"] = 1,
					["time"] = 1638087185,
					["from"] = "特变电工",
					["msg"] = "我从来不用大脚",
					["inbound"] = false,
					["convo"] = "陪猪看日落",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1638087200,
					["from"] = "特变电工",
					["msg"] = "自己diy",
					["inbound"] = false,
					["convo"] = "陪猪看日落",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1638087227,
					["from"] = "陪猪看日落",
					["msg"] = "怎么弄哦",
					["inbound"] = true,
					["convo"] = "陪猪看日落",
				}, -- [3]
				["info"] = {
				},
			},
			["Iadci"] = {
				{
					["type"] = 1,
					["time"] = 1637476783,
					["from"] = "Iadci",
					["msg"] = "3",
					["inbound"] = true,
					["convo"] = "Iadci",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1637476792,
					["from"] = "特变电工",
					["msg"] = "啥",
					["inbound"] = false,
					["convo"] = "Iadci",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1637477917,
					["from"] = "Iadci",
					["msg"] = "r",
					["inbound"] = true,
					["convo"] = "Iadci",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1637477923,
					["from"] = "特变电工",
					["msg"] = "..",
					["inbound"] = false,
					["convo"] = "Iadci",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1637477925,
					["from"] = "特变电工",
					["msg"] = "撒子事",
					["inbound"] = false,
					["convo"] = "Iadci",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1637477934,
					["from"] = "特变电工",
					["msg"] = "大兄弟",
					["inbound"] = false,
					["convo"] = "Iadci",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1637477948,
					["from"] = "Iadci",
					["msg"] = "按错了哈哈",
					["inbound"] = true,
					["convo"] = "Iadci",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1637477962,
					["from"] = "特变电工",
					["msg"] = "%^&*!@起火",
					["inbound"] = false,
					["convo"] = "Iadci",
				}, -- [8]
				["info"] = {
				},
			},
			["余音袅袅"] = {
				{
					["type"] = 1,
					["time"] = 1637473157,
					["from"] = "余音袅袅",
					["msg"] = "群多少号呀，",
					["inbound"] = true,
					["convo"] = "余音袅袅",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1637473171,
					["from"] = "特变电工",
					["msg"] = "杀",
					["inbound"] = false,
					["convo"] = "余音袅袅",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1637473172,
					["from"] = "特变电工",
					["msg"] = "啥群",
					["inbound"] = false,
					["convo"] = "余音袅袅",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1637473179,
					["from"] = "特变电工",
					["msg"] = "你是码农吗",
					["inbound"] = false,
					["convo"] = "余音袅袅",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1637473202,
					["from"] = "余音袅袅",
					["msg"] = "加我VX",
					["inbound"] = true,
					["convo"] = "余音袅袅",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1637473342,
					["from"] = "特变电工",
					["msg"] = "你要搞一个码农公会吗。。",
					["inbound"] = false,
					["convo"] = "余音袅袅",
				}, -- [6]
				["info"] = {
				},
			},
		},
	},
}
WIM3_ChatFilters = {
}
WIM3_Alias = nil
