
WIM3_Data = {
	["escapeToHide"] = true,
	["hoverLinks"] = false,
	["pop_rules"] = {
		["whisper"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = true,
			["resting"] = {
				["keepfocus"] = true,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = true,
				["onReceive"] = true,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = true,
				["onSend"] = true,
				["autofocus"] = false,
				["onReceive"] = true,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["alwaysOther"] = false,
		},
		["chat"] = {
			["other"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["bn"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["combat"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["obeyAutoFocusRules"] = false,
			["intercept"] = false,
			["resting"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["pvp"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["party"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["raid"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["arena"] = {
				["keepfocus"] = false,
				["supress"] = false,
				["onSend"] = false,
				["autofocus"] = false,
				["onReceive"] = false,
			},
			["alwaysOther"] = true,
		},
	},
	["timeStampFormat"] = "%H:%M",
	["windowAlpha"] = 80,
	["sounds"] = {
		["force_game_sound"] = false,
		["whispers"] = {
			["msgout_sml"] = "IM",
			["msgout"] = false,
			["guild"] = false,
			["bnet_sml"] = "IM",
			["msgin_sml"] = "IM",
			["msgin"] = true,
			["friend_sml"] = "IM",
			["guild_sml"] = "IM",
			["bnet"] = false,
			["friend"] = false,
		},
		["chat"] = {
			["msgout_sml"] = "Chat Blip",
			["msgout"] = false,
			["world_sml"] = "Chat Blip",
			["msgin_sml"] = "Chat Blip",
			["msgin"] = true,
			["party_sml"] = "Chat Blip",
			["custom_sml"] = "Chat Blip",
			["say_sml"] = "Chat Blip",
			["raid_sml"] = "Chat Blip",
			["raidleader_sml"] = "Chat Blip",
			["officer_sml"] = "Chat Blip",
			["guild_sml"] = "Chat Blip",
			["battlegroundleader_sml"] = "Chat Blip",
			["battleground_sml"] = "Chat Blip",
		},
	},
	["formatting"] = {
		["bracketing"] = {
			["enabled"] = true,
			["type"] = 1,
		},
	},
	["keepFocusRested"] = true,
	["wordwrap_indent"] = false,
	["enabled"] = true,
	["keepFocus"] = true,
	["alertedPrivateServer"] = false,
	["autoFocus"] = false,
	["winCascade"] = {
		["enabled"] = true,
		["direction"] = 8,
	},
	["lastState"] = "other",
	["displayColors"] = {
		["wispOut"] = {
			["r"] = 1,
			["g"] = 0.0784313725490196,
			["b"] = 0.9882352941176471,
		},
		["wispIn"] = {
			["r"] = 0.5607843137254902,
			["g"] = 0.03137254901960784,
			["b"] = 0.7607843137254902,
		},
		["sysMsg"] = {
			["r"] = 1,
			["g"] = 0.6627450980392157,
			["b"] = 0,
		},
		["BNwispOut"] = {
			["r"] = 0.1725490196078431,
			["g"] = 0.6352941176470588,
			["b"] = 1,
		},
		["historyIn"] = {
			["r"] = 0.4705882352941176,
			["g"] = 0.4705882352941176,
			["b"] = 0.4705882352941176,
		},
		["errorMsg"] = {
			["r"] = 1,
			["g"] = 0,
			["b"] = 0,
		},
		["useSkin"] = true,
		["BNwispIn"] = {
			["r"] = 0,
			["g"] = 0.4862745098039216,
			["b"] = 0.6549019607843137,
		},
		["historyOut"] = {
			["r"] = 0.7058823529411764,
			["g"] = 0.7058823529411764,
			["b"] = 0.7058823529411764,
		},
		["webAddress"] = {
			["r"] = 1,
			["g"] = 1,
			["b"] = 1,
		},
	},
	["fontSize"] = 12,
	["showToolTips"] = true,
	["minimap"] = {
		["free_position"] = {
			["y"] = -119.9890033406945,
			["x"] = -161.5500472187982,
			["point"] = "TOPRIGHT",
		},
		["position"] = 200,
		["rightClickNew"] = false,
		["free"] = false,
	},
	["winAnimation"] = true,
	["expose"] = {
		["protect"] = 1,
		["borderSize"] = 20,
		["combat"] = true,
		["direction"] = 1,
		["border"] = false,
		["groupOnly"] = false,
	},
	["alias"] = {
		["title_string"] = "{n} - {a}",
	},
	["winSize"] = {
		["height"] = 220,
		["strata"] = "DIALOG",
		["scale"] = 100,
		["width"] = 333,
	},
	["windowOnTop"] = true,
	["modules"] = {
		["ChatSounds"] = {
			["enabled"] = true,
		},
		["ShortcutBar"] = {
			["enabled"] = true,
		},
		["Emoticons"] = {
			["enabled"] = true,
		},
		["ChatAlerts"] = {
			["enabled"] = true,
		},
		["Sounds"] = {
			["enabled"] = true,
		},
		["Expose"] = {
			["enabled"] = true,
		},
		["WhisperEngine"] = {
			["enabled"] = true,
		},
		["MinimapIcon"] = {
			["enabled"] = true,
		},
		["TimeStamps"] = {
			["enabled"] = true,
		},
		["OffScreenTracker"] = {
			["enabled"] = true,
		},
		["History"] = {
			["enabled"] = true,
		},
		["LDB"] = {
			["enabled"] = true,
		},
		["URLHandler"] = {
			["enabled"] = true,
		},
		["Filters"] = {
			["enabled"] = true,
		},
		["Menu"] = {
			["enabled"] = true,
		},
		["ClickControl"] = {
			["enabled"] = true,
		},
		["Tabs"] = {
			["enabled"] = true,
		},
	},
	["ignoreArrowKeys"] = true,
	["coloredNames"] = true,
	["winLoc"] = {
		["left"] = 217,
		["top"] = 664,
	},
	["clampToScreen"] = true,
	["stats"] = {
		["startDate"] = "",
		["versions"] = 1,
		["whispers"] = 0,
		["mostConvos"] = 0,
	},
	["winFade"] = true,
	["skin"] = {
		["font_outline"] = "",
		["selected"] = "WIM Classic",
		["font"] = "ChatFontNormal",
		["suggest"] = true,
	},
	["ClickControl"] = {
		["clickSensitivity"] = 0.2,
	},
	["tabs"] = {
		["sortBy"] = 2,
		["whispers"] = {
			["enabled"] = false,
			["guild"] = false,
			["friends"] = false,
		},
		["chat"] = {
			["enabled"] = false,
			["aswhisper"] = false,
		},
	},
	["history"] = {
		["ageLimit"] = true,
		["maxPer"] = true,
		["previewCount"] = 25,
		["whispers"] = {
			["friends"] = true,
			["all"] = false,
			["guild"] = true,
		},
		["maxAge"] = 1209600,
		["preview"] = true,
		["maxCount"] = 500,
		["chat"] = {
			["ageLimit"] = true,
			["maxAge"] = 1209600,
			["maxPer"] = true,
			["preview"] = true,
			["maxCount"] = 500,
			["previewCount"] = 25,
		},
	},
	["chat"] = {
		["bn"] = {
			["showAlerts"] = true,
		},
		["guild"] = {
			["showAlerts"] = true,
		},
		["party"] = {
			["showAlerts"] = true,
		},
		["custom"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
		["say"] = {
		},
		["world"] = {
			["enabled"] = false,
			["channelSettings"] = {
			},
		},
		["raid"] = {
			["showAlerts"] = true,
		},
		["officer"] = {
			["showAlerts"] = true,
		},
		["battleground"] = {
		},
	},
	["tabAdvance"] = false,
	["whoLookups"] = true,
	["menuSortActivity"] = true,
}
WIM3_Cache = {
	["鱼人摩洛克"] = {
		["特变电工"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["雪中飞"] = 1,
				["|Kq16|k"] = 2,
				["姞青"] = 1,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq5|k"] = 2,
				["|Kq23|k"] = 2,
				["审判"] = 1,
				["命不由天定"] = 1,
				["茅台酒"] = 1,
				["|Kq18|k"] = 2,
				["幽雅"] = 1,
				["面包一箩筐"] = 1,
				["阡祈"] = 1,
				["神奇灬女侠"] = 1,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["战山河"] = 1,
				["灬鳯灬"] = 1,
				["云江月"] = 1,
				["Sylvania"] = 1,
				["|Kq8|k"] = 2,
				["|Kq1|k"] = 2,
				["|Kq14|k"] = 2,
				["|Kq11|k"] = 2,
				["|Kq17|k"] = 2,
				["Alei"] = 1,
				["|Kq3|k"] = 2,
				["卡卡汐"] = 1,
				["盖伦的小宝剑"] = 1,
				["|Kq22|k"] = 2,
				["|Kq4|k"] = 2,
				["|Kq21|k"] = 2,
				["我给你跪下了"] = 1,
				["挖煤的小伙伴"] = 1,
				["|Kq13|k"] = 2,
				["戒之在灶"] = 1,
				["|Kq20|k"] = 2,
				["|Kq15|k"] = 2,
				["冯一刀"] = 1,
				["社区送温暖"] = 1,
				["阿摇"] = 1,
			},
			["guildList"] = {
				["白酒壹斤半"] = 232,
				["大夫"] = 162,
				["随机起名字"] = 48,
				["丨悟空丶"] = 22,
				["团长没了"] = 268,
				["水牛奶丶"] = 135,
				["丹莫罗的風"] = 107,
				["豆蔻梢头"] = 809,
				["道道盗盗到"] = 212,
				["霜术"] = 105,
				["管泽元"] = 768,
				["丢丢大魔王"] = 173,
				["呆呆的贼丶"] = 250,
				["法诗诗"] = 142,
				["一朵小红花"] = 355,
				["熊壮壮"] = 736,
				["沐萌"] = 160,
				["呆萌兔子"] = 210,
				["择主而事"] = 133,
				["克拉雷特"] = 531,
				["森类滴话"] = 899,
				["大鸟不会飞"] = 150,
				["不要插嘴"] = 372,
				["吾家有小哥"] = 873,
				["魔幻使者"] = 842,
				["断肠人"] = 669,
				["丧丨彪"] = 516,
				["听话"] = 561,
				["胖小德"] = 785,
				["妮妹"] = 609,
				["萌萌大鲸鱼"] = 153,
				["毛头超鱼水"] = 710,
				["Playeriuwur"] = 20,
				["杀戮梦魇"] = 689,
				["神行百变"] = 161,
				["十二宫"] = 283,
				["胖小圣骑"] = 784,
				["美丽好欣情"] = 779,
				["茶恬恬"] = 44,
				["风掣"] = 835,
				["克洛普"] = 197,
				["罗小牧"] = 778,
				["身法有一套"] = 931,
				["加百利"] = 24,
				["菜菜騒丶"] = 924,
				["米莱狄"] = 772,
				["夜幕祈祷"] = 585,
				["圣光之子"] = 348,
				["无面者"] = 674,
				["萌萌大鲨鱼"] = 99,
				["怒帕拉丁"] = 54,
				["清扬骑士"] = 726,
				["知麻膏"] = 760,
				["三岁会撩妹"] = 14,
				["某某"] = 56,
				["安黛尔"] = 102,
				["北嶋流年"] = 553,
				["子木子也"] = 9,
				["丶晴天"] = 276,
				["丶青衫"] = 519,
				["夜空的流星"] = 124,
				["牛牛妞"] = 273,
				["司徒小秘"] = 68,
				["Kouki"] = 386,
				["Diong"] = 848,
				["修玛丶"] = 529,
				["加摩尔丶"] = 182,
				["你真高丶"] = 238,
				["鯊魚哥"] = 843,
				["小护士"] = 625,
				["流浪喵"] = 36,
				["流浪"] = 147,
				["王权没有永恒"] = 747,
				["疯狂小法"] = 752,
				["Malahidiel"] = 213,
				["开心的小脑斧"] = 642,
				["微光角落"] = 199,
				["爆炸小拿铁"] = 462,
				["神教教主"] = 763,
				["土豆粉"] = 575,
				["女武神之殇"] = 190,
				["鱼人木乃伊"] = 131,
				["牛海王"] = 130,
				["开水"] = 643,
				["天神下凡"] = 475,
				["四月私语"] = 573,
				["朝先"] = 893,
				["雁塔牛铁蛋"] = 75,
				["溟沧之御"] = 481,
				["天地乖离"] = 27,
				["诗雨"] = 807,
				["逃出绝命镇"] = 319,
				["祝大常"] = 151,
				["快乐的胖子"] = 340,
				["残梦"] = 703,
				["夜班保安"] = 587,
				["拟态"] = 665,
				["莫待季"] = 191,
				["嘤鹿"] = 571,
				["跳跳乃波万"] = 163,
				["坦克泡泡"] = 876,
				["不空君"] = 222,
				["古月"] = 948,
				["要求相信接受"] = 423,
				["Sakura"] = 852,
				["江城第一深情"] = 903,
				["没茅台"] = 715,
				["冬天熙雨"] = 537,
				["麦丁"] = 6,
				["Qubit"] = 500,
				["群演百事可乐"] = 782,
				["台州丶大潘"] = 12,
				["雷达网带鱼"] = 267,
				["樂山大佛"] = 900,
				["阿阮"] = 47,
				["芜湖小司马"] = 787,
				["天公不作美"] = 593,
				["欧吉桑"] = 377,
				["破晓残月"] = 40,
				["安斋灬拉拉"] = 351,
				["海底捞"] = 391,
				["呐个矮子法"] = 3,
				["紫霄依韵丶"] = 775,
				["漫步雨落"] = 731,
				["张星彩"] = 53,
				["吉安纳丨语风"] = 156,
				["埋骨残魂"] = 281,
				["丁香枝上"] = 510,
				["阿摇"] = 935,
				["农民在杀鱼"] = 86,
				["羽风"] = 920,
				["Shurrik"] = 21,
				["圣光会脏死你"] = 132,
				["韩跑跑"] = 833,
				["我的月亮"] = 30,
				["空之境界"] = 455,
				["夜风凛凛丶"] = 368,
				["紫衣云梦"] = 774,
				["劝君秃鸡"] = 552,
				["袁阿满"] = 927,
				["丶大江东去"] = 425,
				["射手不太行"] = 620,
				["腥辰"] = 786,
				["史莱姆"] = 557,
				["暴躁的小笼包"] = 681,
				["弑神白起"] = 69,
				["桑塔纳"] = 695,
				["用脸拉怪"] = 81,
				["汉唐"] = 713,
				["上海三套房丶"] = 96,
				["Paa"] = 851,
				["木公子"] = 159,
				["团队支柱"] = 140,
				["手一挥"] = 660,
				["丶雅木茶丶"] = 347,
				["伊心懿意"] = 524,
				["箭無虚髪"] = 770,
				["天然莼丶"] = 596,
				["丶初秋丶"] = 106,
				["马儿闯天涯"] = 840,
				["与德服人"] = 215,
				["狐狸麻糖"] = 741,
				["馒头仔"] = 839,
				["维斯特利"] = 225,
				["无须多言"] = 258,
				["尼哥"] = 443,
				["叶神大叔"] = 116,
				["杜鹃花"] = 895,
				["雷锋叔叔"] = 831,
				["忘了出门带刀"] = 650,
				["战争与和平"] = 950,
				["Aicc"] = 483,
				["凉森婈梦"] = 87,
				["唯一"] = 567,
				["昔日的侠客"] = 128,
				["黎明前的优雅"] = 149,
				["放鸽子的大猴"] = 667,
				["千山暮雪"] = 406,
				["蒸籽蛋"] = 926,
				["斗神丶叶秋"] = 668,
				["叨锣酿帝"] = 246,
				["淡忘的时光"] = 363,
				["喔嚯"] = 875,
				["猫姐在寂寞"] = 744,
				["爱保健的浴霸"] = 307,
				["霜木"] = 938,
				["红发飘飘"] = 917,
				["重拾山河"] = 821,
				["来抓我呀"] = 302,
				["一页书叔"] = 155,
				["神术妙法"] = 187,
				["乐心"] = 292,
				["郑俗人"] = 46,
				["Thorin"] = 137,
				["一号技师"] = 507,
				["快剑格蕾"] = 651,
				["追猫猫"] = 816,
				["莫尛筱"] = 167,
				["术丶爷"] = 396,
				["说的好"] = 808,
				["花落思量错"] = 921,
				["啊船"] = 253,
				["怀旧时间双绝"] = 200,
				["仙喵"] = 865,
				["莼蓝色"] = 45,
				["落晨"] = 220,
				["咿呀咿呀"] = 565,
				["永恒明月"] = 420,
				["汤姆哒哒"] = 84,
				["振刀啊"] = 666,
				["Rpen"] = 214,
				["软炮炮"] = 221,
				["瞄秂缝"] = 334,
				["悍将孤影"] = 369,
				["晓德德"] = 224,
				["地獄之花"] = 227,
				["习惯孤独"] = 520,
				["挥腊肠的女孩"] = 889,
				["三禾穆"] = 168,
				["微微一笑"] = 647,
				["猫头鹰密涅瓦"] = 743,
				["烈風"] = 373,
				["Rxl"] = 50,
				["空城"] = 409,
				["逍遥贼"] = 113,
				["偏偏意气用事"] = 530,
				["萌丶小鬼"] = 89,
				["就叫帅比吧丶"] = 29,
				["巴托里"] = 637,
				["超级大黑狗"] = 248,
				["你的老婆"] = 339,
				["石原莉奈"] = 403,
				["黑白影子"] = 154,
				["二爷"] = 123,
				["斯奎"] = 31,
				["盾牌猛击"] = 914,
				["暮色晚秋"] = 254,
				["大芃熊"] = 468,
				["祖奶奶"] = 762,
				["楚记"] = 698,
				["Eastwood"] = 181,
				["牛小逼"] = 170,
				["小怪"] = 624,
				["猎骑士"] = 331,
				["喝一碗甜甜圈"] = 569,
				["青衣缺德"] = 110,
				["哈宁"] = 874,
				["月色"] = 251,
				["泉哥二宝哥"] = 716,
				["复仇心切"] = 878,
				["浅柔"] = 717,
				["督军山克"] = 757,
				["骚气贼"] = 841,
				["谷大川"] = 61,
				["丶白胡子法神"] = 518,
				["清澜"] = 219,
				["英雄漠"] = 404,
				["冰水雪碧"] = 265,
				["姥田"] = 272,
				["开心心"] = 157,
				["帮主任"] = 639,
				["狮驼居士"] = 230,
				["呐个矮子牧"] = 4,
				["伊本瓦利德"] = 338,
				["西厢娇客"] = 803,
				["亚尔特留斯"] = 863,
				["匣里龙吟"] = 216,
				["三米大恶魔"] = 291,
				["德憨憨"] = 158,
				["叶落苍穹"] = 558,
				["电耗子"] = 750,
				["李老师归来"] = 301,
				["甜甜的"] = 749,
				["猫小烦"] = 745,
				["老九"] = 365,
				["步子大了"] = 329,
				["逐风而去"] = 817,
				["刘秀"] = 547,
				["鹿鸣"] = 402,
				["Arcane"] = 485,
				["牧贵妃"] = 308,
				["菜菜德丶"] = 143,
				["小浪浪"] = 627,
				["小灬灬树"] = 324,
				["法夜"] = 35,
				["美兹兹"] = 312,
				["湖中"] = 730,
				["狂奔的蜗牛"] = 740,
				["小笼包"] = 885,
				["烦恼即菩提"] = 734,
				["不会唱歌的猫"] = 77,
				["酒意入桃枝"] = 148,
				["梅闻花"] = 898,
				["Jumbajump"] = 19,
				["海狗永不为奴"] = 722,
				["丘比特之枪"] = 515,
				["天降正義"] = 598,
				["流水无痕"] = 904,
				["钢丝套餐"] = 320,
				["浪子无家"] = 719,
				["石沟权丶铠坚"] = 309,
				["茉莉绿茶"] = 794,
				["Adele"] = 847,
				["椰蓉面包"] = 696,
				["埃提耶什"] = 343,
				["我是小强"] = 389,
				["气球"] = 711,
				["薇薇酱"] = 315,
				["雪山忆思缘"] = 829,
				["帕斯卡"] = 93,
				["无敌暗影箭"] = 671,
				["小雨儿"] = 630,
				["卓尔"] = 280,
				["来玩啊有发票"] = 896,
				["凹凸撸凸凹"] = 183,
				["Elaina"] = 380,
				["虾撸相逢"] = 801,
				["杰克信仰"] = 303,
				["魂殇"] = 408,
				["是与非爱与恨"] = 436,
				["暮光星灵"] = 679,
				["我的头发呢"] = 299,
				["无敌治疗术"] = 673,
				["稳阿"] = 60,
				["冬天难熬"] = 538,
				["Tough"] = 290,
				["虎躯巨震"] = 800,
				["对了对了"] = 78,
				["别惹我"] = 549,
				["塞北第一法"] = 877,
				["比你跑的快"] = 707,
				["雨老爷"] = 828,
				["鱼肠剑"] = 845,
				["River"] = 387,
				["西西子"] = 316,
				["天降丷正義"] = 597,
				["羽瑜"] = 313,
				["三级自爆卡车"] = 76,
				["护叔寶"] = 888,
				["無糖"] = 208,
				["枕刀歌"] = 692,
				["苏拉"] = 791,
				["酱油半咕咚"] = 819,
				["王一一"] = 364,
				["初恋丶"] = 548,
				["零缺嚸"] = 79,
				["Blessu"] = 394,
				["蓓蓓般强壮"] = 16,
				["箖鳩"] = 916,
				["四岁就很帅"] = 469,
				["小刀手"] = 92,
				["Naq"] = 497,
				["南城旧事"] = 293,
				["戦鬥熋"] = 659,
				["只影向谁去"] = 556,
				["宝石蓝绿"] = 616,
				["Minipig"] = 95,
				["一粒沙"] = 855,
				["楚歌"] = 697,
				["烧锅炉"] = 252,
				["梦寻千古醉"] = 407,
				["东哥丶"] = 202,
				["杰爷"] = 691,
				["欲眠"] = 700,
				["错了错了"] = 136,
				["重生之六哥哥"] = 62,
				["关一里姬"] = 277,
				["你爱吃香菜吗"] = 169,
				["暴哥"] = 680,
				["春色未曾看丶"] = 678,
				["趁虚而入"] = 375,
				["寻蝶舞沧海"] = 883,
				["妖言"] = 608,
				["飞丶"] = 49,
				["美人杀"] = 780,
				["非诺"] = 939,
				["吾皇"] = 295,
				["小肉墩"] = 628,
				["薰大圣"] = 192,
				["冰冷之泉"] = 278,
				["天啦你真高"] = 177,
				["依然丶"] = 361,
				["糖可爱"] = 773,
				["王丶兰花"] = 73,
				["神圣道标"] = 269,
				["发光使我快乐"] = 555,
				["天堂在左"] = 879,
				["你行你来"] = 473,
				["魔龙灵宿"] = 944,
				["找寻记忆"] = 663,
				["黑索塔"] = 945,
				["小丶法"] = 284,
				["战丨士"] = 658,
				["那不是爱情"] = 818,
				["迷璐"] = 447,
				["哎呦不错噢"] = 271,
				["位面灬天使"] = 527,
				["莉村花"] = 795,
				["小树林见"] = 345,
				["鱼人牧"] = 196,
				["伽利略"] = 144,
				["姬儿加蛋"] = 322,
				["伊莉莎丶"] = 90,
				["粉条天下"] = 352,
				["貓小烦"] = 810,
				["密斯酷"] = 882,
				["小僵尸绿了"] = 243,
				["永恒之王者"] = 34,
				["鬼画符"] = 349,
				["Nicolekidman"] = 498,
				["希尔纳"] = 638,
				["宝宝你在哪"] = 614,
				["永泰"] = 465,
				["单挑幼儿园"] = 198,
				["惊骑队长"] = 653,
				["药王"] = 359,
				["热带鱼"] = 260,
				["無情哈拉少"] = 262,
				["叶小菡"] = 223,
				["傲笑红尘"] = 479,
				["诺克萨斯"] = 383,
				["水水更健康"] = 306,
				["在你身后射箭"] = 461,
				["夏虫不可语冰"] = 582,
				["开车不踩刹车"] = 174,
				["小时候的光"] = 476,
				["诱歼小红帽丶"] = 353,
				["风采依旧"] = 838,
				["追忆丶雪山"] = 933,
				["尸不过三"] = 634,
				["罗小宁"] = 311,
				["莉莉德荣"] = 393,
				["雏田丿"] = 936,
				["王小淘"] = 321,
				["苹果十四"] = 274,
				["小哥"] = 623,
				["德天独厚"] = 649,
				["大佛丶"] = 117,
				["Xxim"] = 853,
				["祈丶福"] = 761,
				["欧煌史迪仔"] = 357,
				["潮汐海灵"] = 907,
				["千灬山"] = 871,
				["起舞弄清影"] = 327,
				["笨果果丶"] = 287,
				["玩你个蛋"] = 748,
				["一条皮皮虾"] = 388,
				["宽老三"] = 619,
				["红波浪"] = 919,
				["宝宝我在这"] = 615,
				["伯爵"] = 525,
				["若如初见"] = 482,
				["云隐鹤乡"] = 439,
				["小冰雨"] = 165,
				["狮心斩杀者"] = 97,
				["叶知秋霜"] = 323,
				["阿姨爱吃肉"] = 114,
				["茅臺"] = 118,
				["奔波儿菲兹"] = 602,
				["人小能量大"] = 522,
				["奎托利亚"] = 601,
				["椰壳"] = 385,
				["圣剑阿拉贡"] = 11,
				["Frozenkaipio"] = 492,
				["霸王爱上弓"] = 100,
				["悠闲的杀戮"] = 652,
				["我是你们的神"] = 10,
				["鄙人不善奔跑"] = 74,
				["孤舟"] = 611,
				["战山河"] = 887,
				["Whitegods"] = 64,
				["美娟"] = 781,
				["赵德嵀"] = 266,
				["曦风"] = 427,
				["孜然"] = 610,
				["天才小熊猫"] = 594,
				["武林萌主"] = 305,
				["小七月"] = 229,
				["海贼丶小玉"] = 723,
				["剑舞丶丶魅影"] = 551,
				["貂蝉姐姐"] = 928,
				["明德"] = 376,
				["老李来开会"] = 783,
				["嗷力给"] = 296,
				["剑梦灵心"] = 233,
				["日月之行"] = 675,
				["白雪公主后妈"] = 370,
				["无冷却"] = 670,
				["追忆丶小雪"] = 275,
				["Playerkpmdxk"] = 499,
				["丶猪突猛进"] = 111,
				["坏笑的天使"] = 579,
				["特效治疗"] = 739,
				["奈何以死惧之"] = 204,
				["紫涵"] = 310,
				["蛐蛐哥"] = 802,
				["垫脚亲亲你"] = 184,
				["风尘女子"] = 452,
				["土豆忒好吃"] = 574,
				["小养由基"] = 622,
				["骑墙头"] = 66,
				["蔷薇之泪"] = 799,
				["米彩"] = 771,
				["熟悉的陌生人"] = 737,
				["芝芝奶芙"] = 788,
				["宝石骑士"] = 617,
				["一神丶"] = 854,
				["一只沫沫"] = 119,
				["開心心"] = 189,
				["小暮雪"] = 72,
				["四季大发财"] = 572,
				["甄姬爸浪"] = 346,
				["超毛分水鱼"] = 813,
				["今年二十八"] = 422,
				["比目鱼吻"] = 708,
				["大徐州"] = 590,
				["白衣染霜华"] = 754,
				["仍是少年"] = 864,
				["Meinv"] = 494,
				["清扬小小牧"] = 85,
				["猎爹大魔王"] = 742,
				["啦拉拉"] = 568,
				["血麒麟"] = 193,
				["唐十五"] = 566,
				["兰兰"] = 534,
				["未媛"] = 471,
				["皇室节奏"] = 755,
				["澳洲棒棒糖"] = 337,
				["炮泡糖"] = 733,
				["Dragoncity"] = 489,
				["猎艳轰唇"] = 440,
				["黑色蕾丝"] = 194,
				["无敌最俊朗丶"] = 672,
				["丶桃子"] = 858,
				["牧遥"] = 58,
				["阿咘"] = 823,
				["大胡子钢须"] = 592,
				["夏洛不明"] = 185,
				["毒药多"] = 706,
				["箫声咽"] = 769,
				["宝子"] = 613,
				["西门大脚"] = 806,
				["星尘斗士"] = 186,
				["千亦丶刹"] = 554,
				["奥优给"] = 604,
				["乱羽"] = 264,
				["冷月葬花魂"] = 541,
				["小猫打扑克"] = 884,
				["格罗米"] = 88,
				["宝石绿蓝"] = 282,
				["沐雨聆风"] = 201,
				["澳洲野玫瑰"] = 429,
				["林丷"] = 693,
				["随便的青枣"] = 825,
				["海鸟跟鱼相爱"] = 905,
				["萌萌小猫咪"] = 171,
				["微醺人生"] = 419,
				["朕赦你无罪"] = 687,
				["木子又土"] = 894,
				["别打我扛不住"] = 870,
				["战神赤"] = 390,
				["兽仁战"] = 535,
				["小二上菜"] = 28,
				["想脱贫找阿姨"] = 356,
				["顶天立地"] = 834,
				["中医疗法"] = 51,
				["王子不是我"] = 458,
				["夜丶凌乱"] = 584,
				["吹风渠里冷"] = 562,
				["刀手"] = 342,
				["土鲁鲁"] = 179,
				["大豆"] = 256,
				["五月天"] = 521,
				["风涧落"] = 941,
				["可乐小浅"] = 25,
				["朝思暮欢"] = 55,
				["看门大爷"] = 915,
				["榕哥"] = 397,
				["天水伯约"] = 595,
				["别开呛我先跑"] = 395,
				["波萝咪"] = 444,
				["狗茶"] = 112,
				["超级水宝宝"] = 930,
				["Dtfs"] = 490,
				["小小酒缸"] = 297,
				["山月不知事"] = 52,
				["雨人码头"] = 827,
				["杨十一"] = 690,
				["铁堡城主"] = 65,
				["Necromastery"] = 336,
				["黑暗与黎明"] = 249,
				["小肥子"] = 125,
				["小思林"] = 344,
				["潇瑟"] = 906,
				["圣潜德"] = 228,
				["大狗警长"] = 26,
				["Wish"] = 505,
				["骑士水大叔"] = 401,
				["醉清风"] = 392,
				["Tenveo"] = 502,
				["胡二刀"] = 98,
				["槑槑呆槑槑"] = 699,
				["大漠映残阳"] = 591,
				["部落卡德甲"] = 405,
				["常驻力量谷"] = 640,
				["Kele"] = 493,
				["白鷺"] = 59,
				["奔跑吧小卤蛋"] = 603,
				["凝霜"] = 544,
				["红叶丶"] = 918,
				["奶奶灰"] = 605,
				["大个一米八六"] = 588,
				["卜贱卜散"] = 411,
				["飞翔中的明明"] = 115,
				["罗晋"] = 166,
				["辛多雷怒火"] = 815,
				["蘇察哈尔灿"] = 103,
				["小矮牧"] = 333,
				["龍叔"] = 195,
				["惹不起"] = 298,
				["红色幻刺"] = 777,
				["Cococoing"] = 487,
				["狂爆"] = 910,
				["丷乄丷"] = 15,
				["Cpg"] = 488,
				["凉雨初夏"] = 542,
				["牛莽夫"] = 38,
				["基努里维斯"] = 145,
				["擎天柱"] = 891,
				["安澜秀"] = 612,
				["憨憨的奶锤"] = 413,
				["古惑仔"] = 412,
				["阿飘飘阿飘"] = 433,
				["Amor"] = 484,
				["影沉寒水"] = 645,
				["基本無解"] = 580,
				["雪雨星風"] = 937,
				["山河无恙"] = 635,
				["荊軻"] = 477,
				["醉红唇"] = 17,
				["豌豆尖尖"] = 126,
				["竭尽所能"] = 766,
				["Shadanz"] = 947,
				["花非花梦非梦"] = 922,
				["牛海皇"] = 2,
				["龙妹"] = 416,
				["小玲噹"] = 5,
				["不良熊"] = 514,
				["沈奕琳"] = 714,
				["琉璃"] = 911,
				["瞅你个熊色儿"] = 758,
				["就此别过"] = 418,
				["混乱风暴"] = 421,
				["牛攵"] = 738,
				["肉佳馍"] = 289,
				["标准近战猎"] = 57,
				["橘子汽水"] = 431,
				["清扬小德"] = 1,
				["刘三"] = 546,
				["甄丑"] = 912,
				["落葉滿長安"] = 379,
				["耗子违之"] = 314,
				["上山凯特"] = 164,
				["负饿贷"] = 811,
				["血暗影"] = 237,
				["柒天鲜活"] = 80,
				["小柒丿"] = 626,
				["天真无鞋"] = 880,
				["北美大内内"] = 426,
				["黑白"] = 460,
				["丷胖墩丷"] = 350,
				["汤姆克鲁斯"] = 428,
				["公子不语"] = 382,
				["亿米八大长腿"] = 523,
				["洋葱肥牛飯"] = 129,
				["布呐呐"] = 285,
				["一葉知秋"] = 508,
				["喜欢妮"] = 91,
				["大鱼吃小鱼"] = 466,
				["土土士"] = 203,
				["月小倩"] = 684,
				["冬天的柚子"] = 434,
				["皇家玛德里"] = 756,
				["大鱼海棠"] = 445,
				["里予"] = 820,
				["一米八四"] = 453,
				["瓦夫"] = 437,
				["五更寒"] = 410,
				["大胡子丶铜须"] = 451,
				["风行"] = 450,
				["竹取彝族"] = 236,
				["圣光归来"] = 576,
				["红手套"] = 109,
				["清欢与酒"] = 259,
				["称职奶爸"] = 441,
				["攻其不备"] = 325,
				["Mx"] = 496,
				["火师战"] = 358,
				["小馋"] = 234,
				["夜雨沁人心"] = 442,
				["角色扮演"] = 326,
				["水叶"] = 712,
				["天火天火"] = 141,
				["吸湮的鱼"] = 294,
				["Ex"] = 491,
				["百年老腰"] = 209,
				["嗜血的米勒"] = 448,
				["此岸的风"] = 449,
				["上允尢虍"] = 512,
				["每天都做梦"] = 704,
				["丁香花丶云起"] = 360,
				["咖啡沫"] = 563,
				["名将灬法"] = 559,
				["白小腰"] = 753,
				["捅尼付死"] = 890,
				["鬼迷"] = 943,
				["菠萝怪"] = 925,
				["一箭破云"] = 367,
				["Micoo"] = 495,
				["岁月如歌"] = 457,
				["焦糖玛奇朵"] = 459,
				["天鹰翔星曲"] = 599,
				["何处不青山"] = 463,
				["冯一刀"] = 539,
				["温柔帅哥"] = 728,
				["尘世行"] = 633,
				["自我催眠"] = 188,
				["青丰"] = 832,
				["豆芽丝"] = 172,
				["莫惜花前醉"] = 472,
				["明月灬"] = 676,
				["井星邦邦骑"] = 862,
				["木鱼戮"] = 688,
				["冲锋在右"] = 480,
				["夏绿蒂"] = 581,
				["事过人迁"] = 860,
				["殺氣"] = 134,
				["煜老爷"] = 735,
				["賽西施"] = 104,
				["潇乄飞"] = 446,
				["Alicephil"] = 122,
				["夜歌不带刀"] = 586,
				["丿叶光寒"] = 120,
				["谈谈理想"] = 335,
				["圣大力"] = 577,
				["西克"] = 374,
				["我是垃圾"] = 94,
				["战不旋踵"] = 207,
				["作曲大师"] = 528,
				["Attacker"] = 486,
				["中原大呲花"] = 517,
				["小伢"] = 621,
				["麦子大叔"] = 846,
				["可爱屁"] = 8,
				["玉树临風"] = 245,
				["少一个请字"] = 632,
				["卡米啦"] = 872,
				["艾因斯坦"] = 378,
				["八级大狂风丶"] = 533,
				["减肥大王"] = 279,
				["特变电工"] = 909,
				["农村混血妞"] = 536,
				["凛风丿"] = 543,
				["泽丶火"] = 398,
				["银叶草丶"] = 822,
				["贼嘻嘻"] = 812,
				["无忌哥哥"] = 32,
				["九江月"] = 438,
				["永远的驹迷"] = 146,
				["咸州帝一法"] = 564,
				["地里热瓜"] = 578,
				["德义双馨"] = 648,
				["审判"] = 618,
				["香蕉超人"] = 942,
				["钟正秋"] = 467,
				["简简单单丶"] = 42,
				["峨眉居士"] = 636,
				["咕噜姆"] = 127,
				["花解语蝴蝶"] = 790,
				["瞬间快感"] = 759,
				["老乡人"] = 400,
				["白色头像"] = 63,
				["一颗小虎牙"] = 509,
				["窃梦者"] = 152,
				["刹娜"] = 550,
				["小铃噹"] = 886,
				["Usop"] = 504,
				["花开如火"] = 270,
				["不学巫术"] = 513,
				["术绍岐黄"] = 414,
				["魅惑之箭"] = 366,
				["时间不等人"] = 247,
				["Resume"] = 384,
				["天赋是混"] = 257,
				["似故人来"] = 526,
				["零陵邢道荣"] = 830,
				["大帅哥"] = 589,
				["闻香识女人丶"] = 424,
				["庄亮亮"] = 641,
				["叫朕大郎"] = 139,
				["波波糖"] = 70,
				["荒野丶"] = 242,
				["愤怒得小鸟"] = 235,
				["花心儿大萝卜"] = 789,
				["浩哥"] = 718,
				["冷言"] = 869,
				["强壯壯"] = 644,
				["多情"] = 949,
				["凤舞离殇"] = 545,
				["秦歌"] = 764,
				["贤斌珐师"] = 318,
				["潘西无情"] = 176,
				["心灵之美"] = 435,
				["甜甜糖"] = 913,
				["Agile"] = 18,
				["银鞍照白马"] = 934,
				["灵梦丶小贼儿"] = 732,
				["风涧芯"] = 940,
				["执念"] = 454,
				["瓦丝琪"] = 231,
				["小黃人"] = 631,
				["羽西"] = 288,
				["洪琻寶"] = 211,
				["花重锦官城"] = 478,
				["风脸小旋风"] = 837,
				["手抽筋了"] = 661,
				["濑亚美莉丷"] = 399,
				["莫奈"] = 923,
				["Heratl"] = 849,
				["太阳的暖"] = 362,
				["我要开车了"] = 657,
				["Kaka"] = 850,
				["沈鱼"] = 205,
				["天风"] = 328,
				["我瞅你像猪"] = 656,
				["星落"] = 677,
				["趴趴熊"] = 814,
				["王大志"] = 746,
				["水泥一号"] = 218,
				["护花使者"] = 664,
				["徐州小霸王"] = 646,
				["圣光奶你"] = 474,
				["樱桃子"] = 951,
				["白神男青年"] = 946,
				["胡子乱了"] = 415,
				["山炮"] = 464,
				["有丶绿"] = 685,
				["超凶的"] = 7,
				["朝思暮想"] = 33,
				["风华血月"] = 239,
				["夫子"] = 600,
				["联盟舰队司令"] = 456,
				["喵喵灬猫猫"] = 570,
				["爱如空气"] = 37,
				["鱼人王多鱼"] = 844,
				["蓝色的丶大海"] = 798,
				["毛头分水鱼"] = 709,
				["牧马人"] = 908,
				["慈悲喜舍"] = 654,
				["疯子捷哥"] = 263,
				["星华"] = 108,
				["萬剣人踪灭"] = 796,
				["夏夜浅酌"] = 67,
				["海岸"] = 720,
				["丽娅怒风"] = 240,
				["淡淡的忧愁"] = 725,
				["清风悠悠"] = 727,
				["钕施主"] = 354,
				["清风寒月"] = 255,
				["软泡泡"] = 932,
				["妖狐"] = 607,
				["四岁就很酷"] = 470,
				["试验品小牧神"] = 317,
				["易烊千玺"] = 217,
				["三二一"] = 381,
				["苦海种青莲"] = 793,
				["超级小霸王"] = 929,
				["繁星璀璨"] = 43,
				["管我叫胖娇"] = 767,
				["含泪自愿加班"] = 206,
				["画画的贝贝"] = 751,
				["社区扛把子"] = 41,
				["有事我先走"] = 686,
				["消毒的风"] = 724,
				["沐羽橙风"] = 244,
				["正方形的圆"] = 701,
				["曲晓晓"] = 682,
				["珈百璃"] = 286,
				["游人"] = 729,
				["稳稳的爱"] = 765,
				["骨爷"] = 13,
				["丶苹果"] = 859,
				["吧唧"] = 560,
				["肉桂"] = 180,
				["神之太烦"] = 371,
				["向前冲呀"] = 178,
				["曹婴"] = 683,
				["乍见之欢"] = 23,
				["Xit"] = 506,
				["蛇七"] = 121,
				["武冰"] = 702,
				["每天都要玩"] = 705,
				["西池未央"] = 804,
				["上单卧龙"] = 341,
				["西索的牙"] = 805,
				["打你吐血"] = 662,
				["奥义千年杀"] = 881,
				["八佰狼"] = 532,
				["众神老王"] = 866,
				["發丶麦发啧"] = 39,
				["椰子球"] = 304,
				["红三爷"] = 776,
				["澜雪"] = 432,
				["跳跳瓏"] = 430,
				["张子枫"] = 175,
				["隐子猎手"] = 826,
				["凶残的光头"] = 241,
				["光阴荏苒"] = 138,
				["慵懒症"] = 655,
				["多听相声爱国"] = 583,
				["受伤丶小豆丁"] = 101,
				["剑剑锋"] = 261,
				["Skillet"] = 501,
				["灵魂之誓言"] = 330,
				["陌狄"] = 332,
				["拉怪劣人"] = 83,
				["一锅卤肉饭"] = 856,
				["Torr"] = 503,
				["元芳"] = 867,
				["丨残丶箭丨"] = 857,
				["休闲"] = 417,
				["其实很安静"] = 868,
				["苗战"] = 792,
				["桐秋"] = 694,
				["搞毛啊"] = 300,
				["卓玛"] = 226,
				["永恒灬圣骑"] = 902,
				["蒙塔基钢弹"] = 797,
				["月墨夕寒"] = 892,
				["姬战"] = 82,
				["风礼"] = 836,
				["東风"] = 897,
				["冰火丶两重天"] = 540,
				["毛毛猪"] = 901,
				["好逑"] = 606,
				["阿尔塞纳"] = 824,
				["依落花"] = 71,
				["七彩雲飘飘"] = 511,
				["小阿逸"] = 629,
				["井星邦邦"] = 861,
				["海是海洋的洋"] = 721,
			},
		},
		["Dwac"] = {
			["friendList"] = {
				["|Kq19|k"] = 2,
				["|Kq22|k"] = 2,
				["|Kq2|k"] = 2,
				["|Kq12|k"] = 2,
				["|Kq9|k"] = 2,
				["|Kq3|k"] = 2,
				["|Kq23|k"] = 2,
				["|Kq1|k"] = 2,
				["|Kq11|k"] = 2,
				["|Kq17|k"] = 2,
				["|Kq14|k"] = 2,
				["|Kq18|k"] = 2,
				["|Kq8|k"] = 2,
				["|Kq21|k"] = 2,
				["|Kq5|k"] = 2,
				["|Kq20|k"] = 2,
				["|Kq13|k"] = 2,
				["|Kq15|k"] = 2,
				["|Kq10|k"] = 2,
				["|Kq7|k"] = 2,
				["|Kq6|k"] = 2,
				["|Kq16|k"] = 2,
				["|Kq4|k"] = 2,
			},
		},
	},
}
WIM3_Filters = {
	{
		"^OQ[,S]", -- [1]
		["enabled"] = true,
		["type"] = 1,
		["pattern"] = "^<T>PartyQuests[^A-Z]+\n^<M_N>\n^ItemDB-Request:\n^LVBM\n^YOU ARE BEING WATCHED!\n^YOU ARE MARKED!\n^YOU ARE CURSED!\n^YOU HAVE THE PLAGUE!\n^YOU ARE BURNING!\n^YOU ARE THE BOMB!\nVOLATILE INFECTION\n^/^GA[^A-Z]+\n^<METAMAP\n^<CT",
		["sent"] = true,
		["name"] = "由插件发送的悄悄话",
		["received"] = true,
		["protected"] = true,
		["stats"] = 0,
		["action"] = 2,
		["tag"] = "addons",
	}, -- [1]
	{
		["enabled"] = false,
		["type"] = 2,
		["action"] = 1,
		["friend"] = true,
		["party"] = true,
		["name"] = "悄悄话选择区1",
		["stats"] = 0,
		["raid"] = true,
		["received"] = true,
		["guild"] = true,
	}, -- [2]
	{
		["enabled"] = false,
		["type"] = 2,
		["name"] = "悄悄话选择区2",
		["stats"] = 0,
		["all"] = true,
		["received"] = true,
		["action"] = 2,
	}, -- [3]
}
WIM3_History = {
	["鱼人摩洛克"] = {
		["特变电工"] = {
			["吹风渠里冷"] = {
				{
					["type"] = 1,
					["time"] = 1640713157,
					["from"] = "吹风渠里冷",
					["msg"] = "1111",
					["inbound"] = true,
					["convo"] = "吹风渠里冷",
				}, -- [1]
				["info"] = {
				},
			},
			["吧唧"] = {
				{
					["type"] = 1,
					["time"] = 1641101826,
					["from"] = "特变电工",
					["msg"] = "毛的一手好伤害。。。",
					["inbound"] = false,
					["convo"] = "吧唧",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641101828,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "吧唧",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641101860,
					["from"] = "吧唧",
					["msg"] = "- -无尽黑暗不毛不合适",
					["inbound"] = true,
					["convo"] = "吧唧",
				}, -- [3]
				["info"] = {
				},
			},
			["无忌哥哥"] = {
				{
					["type"] = 1,
					["time"] = 1641131782,
					["from"] = "无忌哥哥",
					["msg"] = "你们通灵多久打完",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641131795,
					["from"] = "无忌哥哥",
					["msg"] = "我想去收个cd 做点药剂",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641131805,
					["from"] = "特变电工",
					["msg"] = "马上",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641131816,
					["from"] = "特变电工",
					["msg"] = "5分钟",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641131856,
					["from"] = "无忌哥哥",
					["msg"] = "好的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641131856,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 讲师玛丽希亚交战，（当前12%，5/5存活）",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641131859,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 讲师玛丽希亚的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641132015,
					["from"] = "特变电工",
					["msg"] = "来吗",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641132028,
					["from"] = "无忌哥哥",
					["msg"] = "来的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641132034,
					["from"] = "特变电工",
					["msg"] = "块",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641132034,
					["from"] = "无忌哥哥",
					["msg"] = "组我吧",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641132036,
					["from"] = "特变电工",
					["msg"] = "我要走了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641132040,
					["from"] = "无忌哥哥",
					["msg"] = "实验室那边的怪你打 了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641132057,
					["from"] = "无忌哥哥",
					["msg"] = "做药剂台子边上的那波 ",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641132067,
					["from"] = "特变电工",
					["msg"] = "不清楚哦",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641132068,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641132085,
					["from"] = "特变电工",
					["msg"] = "正常全通",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641132086,
					["from"] = "特变电工",
					["msg"] = "路线",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132096,
					["from"] = "特变电工",
					["msg"] = "传令",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132119,
					["from"] = "无忌哥哥",
					["msg"] = "我是说霜雨房间",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641132125,
					["from"] = "特变电工",
					["msg"] = "打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641132131,
					["from"] = "特变电工",
					["msg"] = "没清完",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641132154,
					["from"] = "特变电工",
					["msg"] = "BOSS打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641132159,
					["from"] = "特变电工",
					["msg"] = "打了一波怪",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641132162,
					["from"] = "无忌哥哥",
					["msg"] = "那估计完了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641134021,
					["from"] = "无忌哥哥",
					["msg"] = "你还在刷么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641134025,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641134030,
					["from"] = "无忌哥哥",
					["msg"] = "也是全通么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641134032,
					["from"] = "特变电工",
					["msg"] = "刚才那个CD没去？",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641134040,
					["from"] = "无忌哥哥",
					["msg"] = "那个那波怪没清",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641134046,
					["from"] = "无忌哥哥",
					["msg"] = "这次你能清下么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641134048,
					["from"] = "特变电工",
					["msg"] = "要全清？",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641134061,
					["from"] = "无忌哥哥",
					["msg"] = "就霜语房间，右手边那一波 要清",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641134071,
					["from"] = "无忌哥哥",
					["msg"] = "你们只清了左手边的",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641134090,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641134094,
					["from"] = "无忌哥哥",
					["msg"] = "谢谢拉",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641135477,
					["from"] = "特变电工",
					["msg"] = "清完了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641135482,
					["from"] = "特变电工",
					["msg"] = "你10分钟后飞本",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641135485,
					["from"] = "无忌哥哥",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641136294,
					["from"] = "特变电工",
					["msg"] = "飞了没",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641136298,
					["from"] = "无忌哥哥",
					["msg"] = "嗯 到了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641136489,
					["from"] = "无忌哥哥",
					["msg"] = "在副本门口了",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641136495,
					["from"] = "特变电工",
					["msg"] = "等5分钟",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641136497,
					["from"] = "特变电工",
					["msg"] = "马上好",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641136505,
					["from"] = "无忌哥哥",
					["msg"] = "嗯好",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641136648,
					["from"] = "特变电工",
					["msg"] = "$%^&*!@#$。。",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641136650,
					["from"] = "特变电工",
					["msg"] = "灭了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641136652,
					["from"] = "特变电工",
					["msg"] = "稍等",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641136653,
					["from"] = "无忌哥哥",
					["msg"] = "..",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641136656,
					["from"] = "特变电工",
					["msg"] = "有个%^&*!@猎人",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641136658,
					["from"] = "无忌哥哥",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641136660,
					["from"] = "特变电工",
					["msg"] = "各种ADD",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641137211,
					["from"] = "无忌哥哥",
					["msg"] = "队长能给我么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641137231,
					["from"] = "无忌哥哥",
					["msg"] = "感谢 感谢",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641137235,
					["from"] = "特变电工",
					["msg"] = "好了嘛",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641142170,
					["from"] = "无忌哥哥",
					["msg"] = "你后来又打了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641142174,
					["from"] = "特变电工",
					["msg"] = "打了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641142175,
					["from"] = "特变电工",
					["msg"] = "出了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641142177,
					["from"] = "特变电工",
					["msg"] = "毕业了",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641142181,
					["from"] = "无忌哥哥",
					["msg"] = "额额",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641142182,
					["from"] = "特变电工",
					["msg"] = "所有副本都毕业",
					["inbound"] = false,
					["convo"] = "无忌哥哥",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641142184,
					["from"] = "无忌哥哥",
					["msg"] = "cz 了么",
					["inbound"] = true,
					["convo"] = "无忌哥哥",
				}, -- [62]
				["info"] = {
				},
			},
			["阿摇"] = {
				{
					["type"] = 1,
					["time"] = 1640188802,
					["from"] = "特变电工",
					["msg"] = "我均价12的本 买了200万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640188808,
					["from"] = "阿摇",
					["msg"] = "我 日",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640188821,
					["from"] = "特变电工",
					["msg"] = "我一个朋友10块买了8000万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640188836,
					["from"] = "特变电工",
					["msg"] = "我姐姐均价11买了150万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640188853,
					["from"] = "阿摇",
					["msg"] = "{悲剧} 穷学生",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640188890,
					["from"] = "阿摇",
					["msg"] = "17买了 4W北方稀土  56出的",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640188895,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640188902,
					["from"] = "特变电工",
					["msg"] = "你学生玩怀旧服？",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640188908,
					["from"] = "阿摇",
					["msg"] = "哈哈 是啊",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640188913,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640188920,
					["from"] = "特变电工",
					["msg"] = "宋宇飞吗",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640188929,
					["from"] = "阿摇",
					["msg"] = "不是 哈哈",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640188931,
					["from"] = "特变电工",
					["msg"] = "你认识宋宇飞吗",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640188937,
					["from"] = "阿摇",
					["msg"] = "我刷到过",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640188954,
					["from"] = "特变电工",
					["msg"] = "还有小老徐",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640188958,
					["from"] = "特变电工",
					["msg"] = "都是你们学生党",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640188964,
					["from"] = "阿摇",
					["msg"] = "{猥琐}都刷到过",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640188968,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640188979,
					["from"] = "特变电工",
					["msg"] = "特变29我没卖",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640188984,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640188989,
					["from"] = "特变电工",
					["msg"] = "我看到48",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640188997,
					["from"] = "阿摇",
					["msg"] = "卧槽 我追了",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640189009,
					["from"] = "特变电工",
					["msg"] = "我最近抄底了他的子公司",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640189016,
					["from"] = "特变电工",
					["msg"] = "80万港币 新特能源 15块钱",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640189026,
					["from"] = "阿摇",
					["msg"] = "特变电工是我们那的公司 还行 老牌了",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640189033,
					["from"] = "特变电工",
					["msg"] = "你是新疆的吗",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640189037,
					["from"] = "阿摇",
					["msg"] = "对呀",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640189041,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640189047,
					["from"] = "阿摇",
					["msg"] = "{猥琐}",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640189050,
					["from"] = "特变电工",
					["msg"] = "我就是看重他是新疆",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640189064,
					["from"] = "阿摇",
					["msg"] = "哈哈哈",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640189072,
					["from"] = "特变电工",
					["msg"] = "他60%硅料 25%变压器 15%的煤炭",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640189080,
					["from"] = "特变电工",
					["msg"] = "硅料最近太惨",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640189093,
					["from"] = "阿摇",
					["msg"] = "感觉还是挺不错的 还是有空间",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640189101,
					["from"] = "特变电工",
					["msg"] = "散户太多了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640189109,
					["from"] = "阿摇",
					["msg"] = "得洗洗",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640189132,
					["from"] = "特变电工",
					["msg"] = "我玩魔兽 一群人问我",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640189139,
					["from"] = "阿摇",
					["msg"] = "哈哈 大股东",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640189498,
					["from"] = "特变电工",
					["msg"] = "最近几天亏我40万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640189508,
					["from"] = "特变电工",
					["msg"] = "美股今年也是过山车",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640189544,
					["from"] = "阿摇",
					["msg"] = "我赚的钱 玩比特币又亏回去了",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640189578,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640191156,
					["from"] = "特变电工",
					["msg"] = "我今年",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640191163,
					["from"] = "特变电工",
					["msg"] = "150%收益美股 然后变成-50%",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640191169,
					["from"] = "特变电工",
					["msg"] = "然后160%",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640191178,
					["from"] = "特变电工",
					["msg"] = "然后现在10%",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640191189,
					["from"] = "特变电工",
					["msg"] = "A股80%",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640191454,
					["from"] = "阿摇",
					["msg"] = "这么厉害- -",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640191518,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640191521,
					["from"] = "特变电工",
					["msg"] = "我shib",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640191542,
					["from"] = "特变电工",
					["msg"] = "13跌到5 然后23卖飞",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640191558,
					["from"] = "阿摇",
					["msg"] = "都吃上了啊",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1640191795,
					["from"] = "特变电工",
					["msg"] = "大学宿舍不断电？",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1640191795,
					["from"] = "阿摇",
					["msg"] = "<Deadly Boss Mods> 阿摇正在与奈鲁布恩坎交战，（当前86%，5/5存活）",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1640191825,
					["from"] = "阿摇",
					["msg"] = "<DBM> 阿摇已在奈鲁布恩坎的战斗中取得胜利！",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1640432817,
					["from"] = "特变电工",
					["msg"] = "跌惨",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1640432832,
					["from"] = "阿摇",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1640432835,
					["from"] = "特变电工",
					["msg"] = "你是哪个大学",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1640432845,
					["from"] = "阿摇",
					["msg"] = "广东科技学院",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1640432861,
					["from"] = "特变电工",
					["msg"] = "什么专业",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1640539021,
					["from"] = "特变电工",
					["msg"] = "。。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1640539026,
					["from"] = "特变电工",
					["msg"] = "1-8 去打了个",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1640539067,
					["from"] = "阿摇",
					["msg"] = "啊？ 什么啊，",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1640539088,
					["from"] = "特变电工",
					["msg"] = "MC",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1640539094,
					["from"] = "特变电工",
					["msg"] = "轻松打第一",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1640539099,
					["from"] = "阿摇",
					["msg"] = "- -跟咱公会的打呀",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1640539106,
					["from"] = "特变电工",
					["msg"] = "我明天有事",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1640539107,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1640539110,
					["from"] = "阿摇",
					["msg"] = "哈哈 ",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1640617777,
					["from"] = "特变电工",
					["msg"] = "又跌",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1640617779,
					["from"] = "特变电工",
					["msg"] = "妈蛋",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1640617783,
					["from"] = "特变电工",
					["msg"] = "两周亏60万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1640617786,
					["from"] = "阿摇",
					["msg"] = "卧槽",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1640617792,
					["from"] = "特变电工",
					["msg"] = "小场面",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1640617794,
					["from"] = "特变电工",
					["msg"] = "正常波动",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1640617795,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1640617804,
					["from"] = "阿摇",
					["msg"] = "这么狠，，，",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1640618887,
					["from"] = "特变电工",
					["msg"] = "你们新疆的公司行不行",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1640618889,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1640618909,
					["from"] = "阿摇",
					["msg"] = "哈哈哈哈 肯定行",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1640618933,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1640618993,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1640619001,
					["from"] = "阿摇",
					["msg"] = "{猥琐}",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1640619010,
					["from"] = "特变电工",
					["msg"] = "特变进上证180了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1640619015,
					["from"] = "特变电工",
					["msg"] = "大蓝筹了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1640619017,
					["from"] = "特变电工",
					["msg"] = "更稳了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1640619031,
					["from"] = "阿摇",
					["msg"] = "现在还能冲不",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1640619044,
					["from"] = "特变电工",
					["msg"] = "我390万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1640619049,
					["from"] = "特变电工",
					["msg"] = "370万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1640619061,
					["from"] = "特变电工",
					["msg"] = "什么时候到48 我什么时候出",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1640619077,
					["from"] = "阿摇",
					["msg"] = "{尴尬} 卧槽 这么多",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1640619085,
					["from"] = "阿摇",
					["msg"] = "股东啊",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1640619092,
					["from"] = "特变电工",
					["msg"] = "现在只赚130万了",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1640619094,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1640619100,
					["from"] = "阿摇",
					["msg"] = "{尴尬}",
					["inbound"] = true,
					["convo"] = "阿摇",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1640619105,
					["from"] = "特变电工",
					["msg"] = "最高250万",
					["inbound"] = false,
					["convo"] = "阿摇",
				}, -- [96]
				["info"] = {
				},
			},
			["刘人杰#5854"] = {
				{
					["type"] = 1,
					["time"] = 1640018495,
					["from"] = "刘人杰#5854",
					["msg"] = "AFK",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640018505,
					["from"] = "刘人杰#5854",
					["msg"] = "发错了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640018508,
					["from"] = "刘人杰#5854",
					["msg"] = "!@#$%^  战场全是坑",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640018515,
					["from"] = "刘人杰#5854",
					["msg"] = "睡觉了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640093352,
					["from"] = "特变电工",
					["msg"] = "今天大V 起飞",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640093385,
					["from"] = "刘人杰#5854",
					["msg"] = "牛 比了  又起飞了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640093387,
					["from"] = "刘人杰#5854",
					["msg"] = "骚",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640093532,
					["from"] = "刘人杰#5854",
					["msg"] = "倒霉 战场 现在没法打了 全是坑 进去就是残局",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640093538,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640093607,
					["from"] = "刘人杰#5854",
					["msg"] = "感觉这个轮回服  寿命到了呀  上线不知道干什么了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640093612,
					["from"] = "特变电工",
					["msg"] = "..",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640093615,
					["from"] = "特变电工",
					["msg"] = "我快毕业了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640093624,
					["from"] = "特变电工",
					["msg"] = "准备搞点军装砍人区",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640093642,
					["from"] = "刘人杰#5854",
					["msg"] = "军装难刷啊  战场太难刷了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640093658,
					["from"] = "特变电工",
					["msg"] = "非军装PVP装",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640093666,
					["from"] = "刘人杰#5854",
					["msg"] = "奥山现在基本全是坑  想搞个新场 贼难",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640093675,
					["from"] = "刘人杰#5854",
					["msg"] = "小战场 开双倍 全是 国家队  组排",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640093860,
					["from"] = "刘人杰#5854",
					["msg"] = "鱼人LM人真多",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640093878,
					["from"] = "刘人杰#5854",
					["msg"] = "每次战场  基本都是一半以上 都是你们服的",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640094223,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640094228,
					["from"] = "特变电工",
					["msg"] = "安逸的很",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "刘人杰#5854",
					["msg"] = "噢 哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "特变电工",
					["msg"] = "总共A股",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641010270,
					["from"] = "刘人杰#5854",
					["msg"] = "可以了 很 牛 比了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641010277,
					["from"] = "刘人杰#5854",
					["msg"] = "不能追求最高点最低点 哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641010278,
					["from"] = "特变电工",
					["msg"] = "回撤没控制好 没办法",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641010310,
					["from"] = "刘人杰#5854",
					["msg"] = "一波主升浪结束 还是要出来下  回头马后炮看",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641010341,
					["from"] = "特变电工",
					["msg"] = "是 长线满仓一支是这样的结果",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641010344,
					["from"] = "刘人杰#5854",
					["msg"] = "没主升浪就不动 主升浪了   外面那些追涨的老鼠!@# 全进来了  ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641010356,
					["from"] = "刘人杰#5854",
					["msg"] = "捣乱",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641010366,
					["from"] = "刘人杰#5854",
					["msg"] = "已经很牛 比了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641010376,
					["from"] = "特变电工",
					["msg"] = "现在特变筹码获利比例10%",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641010398,
					["from"] = "刘人杰#5854",
					["msg"] = "但是让我马后炮 旁观者 说话不腰疼  就是暴涨后  先离场",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641010413,
					["from"] = "刘人杰#5854",
					["msg"] = "因为外面那些捣乱资金追进去了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641010430,
					["from"] = "刘人杰#5854",
					["msg"] = "150W 美滋滋啊 ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641010449,
					["from"] = "特变电工",
					["msg"] = "刚好跟税后工资收入差不多",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641010459,
					["from"] = "刘人杰#5854",
					["msg"] = "你是高收入",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641010465,
					["from"] = "特变电工",
					["msg"] = "相当于副业跟主业一样",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641010467,
					["from"] = "刘人杰#5854",
					["msg"] = "一半人 就20 30W 上班族",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641010472,
					["from"] = "刘人杰#5854",
					["msg"] = "一般人",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641010518,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641010535,
					["from"] = "特变电工",
					["msg"] = "但是不知道还有几年红利期",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641010542,
					["from"] = "特变电工",
					["msg"] = "互联网今年太惨了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641010561,
					["from"] = "特变电工",
					["msg"] = "还好公司发的股票我都抛了买了特变 ",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641010566,
					["from"] = "特变电工",
					["msg"] = "不然今年要被锤惨",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641010586,
					["from"] = "特变电工",
					["msg"] = "今年我跟我们同行业同事的收入差距拉开了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641010590,
					["from"] = "特变电工",
					["msg"] = "选择比努力重要",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641010596,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641010615,
					["from"] = "特变电工",
					["msg"] = "想想还是知足了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641010648,
					["from"] = "刘人杰#5854",
					["msg"] = "一口吃不了胖子  志向高远 也要慢慢来",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641010670,
					["from"] = "刘人杰#5854",
					["msg"] = "你这条件 已经甩开   95%以上的人了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641010688,
					["from"] = "特变电工",
					["msg"] = "今年有个最失误的选择",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641010729,
					["from"] = "特变电工",
					["msg"] = "就是我朋友叫我帮他打理十几亿的资产 给我底薪100万加提成 我没去 然后走的时候套我话以10块钱买了8000万的特变",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641010736,
					["from"] = "特变电工",
					["msg"] = "我太谨慎了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641010761,
					["from"] = "刘人杰#5854",
					["msg"] = "人家赚发了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641010766,
					["from"] = "特变电工",
					["msg"] = "还好",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641010774,
					["from"] = "刘人杰#5854",
					["msg"] = "他还没卖？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641010776,
					["from"] = "特变电工",
					["msg"] = "没",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641010785,
					["from"] = "特变电工",
					["msg"] = "大游资",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641010793,
					["from"] = "刘人杰#5854",
					["msg"] = "啥席位？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641010826,
					["from"] = "特变电工",
					["msg"] = "现在持仓1.8个亿吧",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641010850,
					["from"] = "特变电工",
					["msg"] = "流通股东肯定看不到他",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641010857,
					["from"] = "刘人杰#5854",
					["msg"] = "那肯定啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641010857,
					["from"] = "特变电工",
					["msg"] = "特变市值高",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641010862,
					["from"] = "刘人杰#5854",
					["msg"] = "特变多大的盘子",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641010867,
					["from"] = "特变电工",
					["msg"] = "更不用说举牌了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641010890,
					["from"] = "特变电工",
					["msg"] = "而且他是多账号买入",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641010904,
					["from"] = "特变电工",
					["msg"] = "我第一次看他的股票资金",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641010907,
					["from"] = "特变电工",
					["msg"] = "吓死我了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641010917,
					["from"] = "特变电工",
					["msg"] = "一个子账户 1个多亿",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641010924,
					["from"] = "特变电工",
					["msg"] = "看着特别像模拟盘",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641010925,
					["from"] = "刘人杰#5854",
					["msg"] = "他全是长线？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641010928,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641010933,
					["from"] = "特变电工",
					["msg"] = "他很聪明的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641010943,
					["from"] = "特变电工",
					["msg"] = "不然怎么能赚十多个亿",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641010946,
					["from"] = "特变电工",
					["msg"] = "土老板",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641010949,
					["from"] = "特变电工",
					["msg"] = "做房地产的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641010958,
					["from"] = "特变电工",
					["msg"] = "最近2年都不做 在撤了",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641010976,
					["from"] = "特变电工",
					["msg"] = "也是选择比努力重要的典范",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641010977,
					["from"] = "刘人杰#5854",
					["msg"] = "你是在北京？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641010982,
					["from"] = "刘人杰#5854",
					["msg"] = "百度是在北京吗？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641010984,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641010994,
					["from"] = "刘人杰#5854",
					["msg"] = "北京房子贵啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641011000,
					["from"] = "特变电工",
					["msg"] = "我租房",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641011009,
					["from"] = "刘人杰#5854",
					["msg"] = "好点地段10W一平有吧？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641011019,
					["from"] = "特变电工",
					["msg"] = "我今年能买一个不错的房子",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641011021,
					["from"] = "特变电工",
					["msg"] = "但是我不买",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641011044,
					["from"] = "特变电工",
					["msg"] = "作为全球顶级投资家怎么会去买房子",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641011049,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641011050,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641011059,
					["from"] = "特变电工",
					["msg"] = "我特鄙视买房行为",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1641011061,
					["from"] = "特变电工",
					["msg"] = "不知道为啥",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1641011070,
					["from"] = "特变电工",
					["msg"] = "觉得很不值",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1641011077,
					["from"] = "刘人杰#5854",
					["msg"] = "买房躺赢时代结束了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1641011082,
					["from"] = "刘人杰#5854",
					["msg"] = "这波!@#$%^房价的上涨",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1641011087,
					["from"] = "刘人杰#5854",
					["msg"] = "泡沫太大了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1641011099,
					["from"] = "刘人杰#5854",
					["msg"] = "已经透支玩了 ",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1641011132,
					["from"] = "特变电工",
					["msg"] = "我16年在重庆买的",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1641011139,
					["from"] = "刘人杰#5854",
					["msg"] = "老家重庆的？",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1641011143,
					["from"] = "特变电工",
					["msg"] = "投资收益700%",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1641011150,
					["from"] = "特变电工",
					["msg"] = "完爆我的股票收益",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1641011155,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1641011159,
					["from"] = "特变电工",
					["msg"] = "我还瞧不上",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1641011160,
					["from"] = "刘人杰#5854",
					["msg"] = "那时候躺赢 房产",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1641011166,
					["from"] = "刘人杰#5854",
					["msg"] = "现在这波可以说 已经没了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1641011183,
					["from"] = "刘人杰#5854",
					["msg"] = "我这三线小城  房子早就没流动性了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1641011195,
					["from"] = "刘人杰#5854",
					["msg"] = "买了就是套",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1641011196,
					["from"] = "特变电工",
					["msg"] = "北京生活体验太差",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1641011211,
					["from"] = "刘人杰#5854",
					["msg"] = "不增值就相当于 钱糟蹋了",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1641011211,
					["from"] = "特变电工",
					["msg"] = "绝对的全国倒数",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1641011241,
					["from"] = "刘人杰#5854",
					["msg"] = "但是好公司多啊",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1641011241,
					["from"] = "刘人杰#5854",
					["msg"] = "哈哈哈",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1641011260,
					["from"] = "刘人杰#5854",
					["msg"] = "不过有钱人还是往上海跑",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1641011263,
					["from"] = "刘人杰#5854",
					["msg"] = "估计还是因为环境",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1641011302,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1641011310,
					["from"] = "特变电工",
					["msg"] = "上海比北京生活体验好太多",
					["inbound"] = false,
					["convo"] = "刘人杰#5854",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1641011329,
					["from"] = "刘人杰#5854",
					["msg"] = "还是地理位置好",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1641011334,
					["from"] = "刘人杰#5854",
					["msg"] = "靠海 有在长三角",
					["inbound"] = true,
					["convo"] = "刘人杰#5854",
				}, -- [118]
				["info"] = {
				},
			},
			["无敌治疗术"] = {
				{
					["type"] = 1,
					["time"] = 1640793490,
					["from"] = "无敌治疗术",
					["msg"] = "<大脚团队提示>欢迎加入本团队，希望我们合作愉快，拥有一次快乐的冒险旅程。",
					["inbound"] = true,
					["convo"] = "无敌治疗术",
				}, -- [1]
				["info"] = {
				},
			},
			["位面灬天使"] = {
				{
					["type"] = 1,
					["time"] = 1641141785,
					["from"] = "特变电工",
					["msg"] = "。。你要多少代工费",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641141795,
					["from"] = "位面灬天使",
					["msg"] = "看着给吧 3K买的图纸",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641141809,
					["from"] = "位面灬天使",
					["msg"] = "随便 一个会的",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641141818,
					["from"] = "位面灬天使",
					["msg"] = "成本慢慢收",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641141821,
					["from"] = "特变电工",
					["msg"] = "30？",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641141835,
					["from"] = "位面灬天使",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641141866,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641141868,
					["from"] = "特变电工",
					["msg"] = "铁炉堡？",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641141870,
					["from"] = "位面灬天使",
					["msg"] = "我去冬泉谷交任务 马上回",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641141879,
					["from"] = "位面灬天使",
					["msg"] = "黑龙门任务 交了就回了",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641141926,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641141931,
					["from"] = "特变电工",
					["msg"] = "材料准备好了 等你起飞",
					["inbound"] = false,
					["convo"] = "位面灬天使",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641141940,
					["from"] = "位面灬天使",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641141980,
					["from"] = "位面灬天使",
					["msg"] = "回了",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641142033,
					["from"] = "位面灬天使",
					["msg"] = "ok",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641142044,
					["from"] = "位面灬天使",
					["msg"] = "8~",
					["inbound"] = true,
					["convo"] = "位面灬天使",
				}, -- [16]
				["info"] = {
				},
			},
			["审判"] = {
				{
					["type"] = 1,
					["time"] = 1640024565,
					["from"] = "审判",
					["msg"] = "你去刷啥？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640024573,
					["from"] = "特变电工",
					["msg"] = "弓",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640024576,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:11726:1891:::::::60:::::::::|h[野蛮角斗士链甲]|h|r",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640024582,
					["from"] = "特变电工",
					["msg"] = "今天的收获",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640024590,
					["from"] = "审判",
					["msg"] = "不错。",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640413978,
					["from"] = "审判",
					["msg"] = "你们公会怎么样？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640413982,
					["from"] = "特变电工",
					["msg"] = "不知道啊",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640413983,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640413993,
					["from"] = "特变电工",
					["msg"] = "人停多",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640414002,
					["from"] = "特变电工",
					["msg"] = "微信群很活跃",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640414017,
					["from"] = "审判",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为所有数据",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  938,871 (449.1, 5.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "2. |cfffff468Naq|r  934,089 (428.6, 5.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "3. |cfffff468别惹我|r  927,812 (425.2, 5%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "4. |cffc69b6d追风中年|r  ^&*,340 (498.9, 4.8%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "5. |cff3fc6ea宝石大哥|r  873,386 (791.3, 4.7%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "6. |cff3fc6ea银叶草丶|r  844,724 (701.4, 4.6%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "7. |cff3fc6ea吧唧|r  803,216 (712.8, 4.4%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "8. |cffc69b6d芜湖小司马|r  792,247 (409.0, 4.3%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641106536,
					["from"] = "特变电工",
					["msg"] = "9. |cffaad372夏虫不可语冰|r  780,309 (485.5, 4.2%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641106546,
					["from"] = "特变电工",
					["msg"] = "10. |cff3fc6ea杰克信仰|r  755,940 (701.7, 4.1%)",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641106578,
					["from"] = "审判",
					["msg"] = "打完了？",
					["inbound"] = true,
					["convo"] = "审判",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641106582,
					["from"] = "特变电工",
					["msg"] = "没",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641106598,
					["from"] = "特变电工",
					["msg"] = "轻松打第一ia",
					["inbound"] = false,
					["convo"] = "审判",
				}, -- [25]
				["info"] = {
				},
			},
			["爱吃鱼的猫"] = {
				{
					["type"] = 1,
					["time"] = 1641016915,
					["from"] = "特变电工",
					["msg"] = "换位面？",
					["inbound"] = false,
					["convo"] = "爱吃鱼的猫",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641016919,
					["from"] = "爱吃鱼的猫",
					["msg"] = "嗯 别急我组你",
					["inbound"] = true,
					["convo"] = "爱吃鱼的猫",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641019436,
					["from"] = "爱吃鱼的猫",
					["msg"] = "与[特变电工]交易成功。 (收到)50g",
					["inbound"] = true,
					["convo"] = "爱吃鱼的猫",
				}, -- [3]
				["info"] = {
				},
			},
			["说的好"] = {
				{
					["type"] = 1,
					["time"] = 1640195231,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "说的好",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640195240,
					["from"] = "特变电工",
					["msg"] = "打到哪了",
					["inbound"] = false,
					["convo"] = "说的好",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640195247,
					["from"] = "特变电工",
					["msg"] = "9号",
					["inbound"] = false,
					["convo"] = "说的好",
				}, -- [3]
				["info"] = {
				},
			},
			["别惹我"] = {
				{
					["type"] = 1,
					["time"] = 1640954743,
					["from"] = "特变电工",
					["msg"] = "次级体质多少钱",
					["inbound"] = false,
					["convo"] = "别惹我",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640954751,
					["from"] = "别惹我",
					["msg"] = "90",
					["inbound"] = true,
					["convo"] = "别惹我",
				}, -- [2]
				["info"] = {
				},
			},
			["幽雅"] = {
				{
					["type"] = 1,
					["time"] = 1640513999,
					["from"] = "特变电工",
					["msg"] = "没加你好友 居然",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640514000,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640514000,
					["from"] = "幽雅",
					["msg"] = "{邪恶}",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640514003,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640514004,
					["from"] = "幽雅",
					["msg"] = "...",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640514027,
					["from"] = "特变电工",
					["msg"] = "2分钟后找你",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640514052,
					["from"] = "特变电工",
					["msg"] = "尾王了",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640514118,
					["from"] = "幽雅",
					["msg"] = "去下WC 人在铁",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640514118,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 瑞文戴尔男爵交战，（当前29%，5/5存活）",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640514130,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 瑞文戴尔男爵的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640514219,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640514224,
					["from"] = "特变电工",
					["msg"] = "组",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640514249,
					["from"] = "特变电工",
					["msg"] = "123",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640514323,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640514324,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640514494,
					["from"] = "幽雅",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640514566,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640514601,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640514603,
					["from"] = "特变电工",
					["msg"] = "吃饭",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640514611,
					["from"] = "幽雅",
					["msg"] = "刚才肚子巨他吗痛。。",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640515579,
					["from"] = "特变电工",
					["msg"] = "急祥如溢",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640515582,
					["from"] = "特变电工",
					["msg"] = "十倍速hi",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640515584,
					["from"] = "特变电工",
					["msg"] = "是不是",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640515588,
					["from"] = "幽雅",
					["msg"] = "....3",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640515594,
					["from"] = "幽雅",
					["msg"] = "可能天太冷了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640515598,
					["from"] = "幽雅",
					["msg"] = "冻的",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640949803,
					["from"] = "幽雅",
					["msg"] = "哪",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640949824,
					["from"] = "特变电工",
					["msg"] = "奥山",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640949835,
					["from"] = "特变电工",
					["msg"] = "你来铁炉堡",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640949837,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640949839,
					["from"] = "幽雅",
					["msg"] = "。。暴风",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640949845,
					["from"] = "幽雅",
					["msg"] = "我从铁过去 暴风鲁甸",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640949847,
					["from"] = "特变电工",
					["msg"] = "铁路等你起飞",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640949854,
					["from"] = "特变电工",
					["msg"] = "我在铁炉堡排的",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640949865,
					["from"] = "特变电工",
					["msg"] = "你来 我AFK出来",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640949874,
					["from"] = "特变电工",
					["msg"] = "坑了",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640949875,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640949965,
					["from"] = "幽雅",
					["msg"] = "我找到了个大哥开门",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640949972,
					["from"] = "幽雅",
					["msg"] = "大哥一个传送 自己去铁炉堡了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640949974,
					["from"] = "特变电工",
					["msg"] = "流弊",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640949975,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640950008,
					["from"] = "幽雅",
					["msg"] = "我到了",
					["inbound"] = true,
					["convo"] = "幽雅",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640950170,
					["from"] = "特变电工",
					["msg"] = "你们黑上不开了吗",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640950171,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "幽雅",
				}, -- [44]
				["info"] = {
				},
			},
			["面包一箩筐"] = {
				{
					["type"] = 1,
					["time"] = 1641045745,
					["from"] = "特变电工",
					["msg"] = "謝謝",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641132281,
					["from"] = "特变电工",
					["msg"] = "1G 面包",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641132302,
					["from"] = "特变电工",
					["msg"] = "谢",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641132308,
					["from"] = "面包一箩筐",
					["msg"] = "客气",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641132317,
					["from"] = "特变电工",
					["msg"] = "上线第一件时间就是找你",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641132321,
					["from"] = "特变电工",
					["msg"] = "每天",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641132326,
					["from"] = "面包一箩筐",
					["msg"] = "啊   哈哈 ",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641132329,
					["from"] = "特变电工",
					["msg"] = "1天1G 一年365G",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641132334,
					["from"] = "面包一箩筐",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641132338,
					["from"] = "特变电工",
					["msg"] = "10年3650G",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641132341,
					["from"] = "面包一箩筐",
					["msg"] = "每天都上线吗",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641132347,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641132362,
					["from"] = "特变电工",
					["msg"] = "你每天啥都不干就搓面包啊",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641132369,
					["from"] = "特变电工",
					["msg"] = "官方NPC",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641132386,
					["from"] = "面包一箩筐",
					["msg"] = "不想刷其他的  挂会机  看看电视",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641132397,
					["from"] = "面包一箩筐",
					["msg"] = "这个多舒服  哈哈",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641132398,
					["from"] = "特变电工",
					["msg"] = "很休闲嘛",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641132413,
					["from"] = "面包一箩筐",
					["msg"] = "要不太累了  ",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641132426,
					["from"] = "面包一箩筐",
					["msg"] = "这样卖个十几天  大马就有了",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641132429,
					["from"] = "特变电工",
					["msg"] = "你这个能赚回月卡钱么。。",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641132453,
					["from"] = "面包一箩筐",
					["msg"] = "肯定能啊   一个大妈两张月卡",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641132460,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641132464,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "面包一箩筐",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641132501,
					["from"] = "面包一箩筐",
					["msg"] = "这样也好  不然好多人上线都没吃喝",
					["inbound"] = true,
					["convo"] = "面包一箩筐",
				}, -- [24]
				["info"] = {
				},
			},
			["宝宝我在这"] = {
				{
					["type"] = 1,
					["time"] = 1640612445,
					["from"] = "特变电工",
					["msg"] = "报名没组你吗。。",
					["inbound"] = false,
					["convo"] = "宝宝我在这",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640612452,
					["from"] = "宝宝我在这",
					["msg"] = "没",
					["inbound"] = true,
					["convo"] = "宝宝我在这",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640612467,
					["from"] = "宝宝我在这",
					["msg"] = "我在工会里喊话，打了那么多次11 喊了那么多次求组 ",
					["inbound"] = true,
					["convo"] = "宝宝我在这",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640612478,
					["from"] = "特变电工",
					["msg"] = "我看微信群报名说是上周固定优先",
					["inbound"] = false,
					["convo"] = "宝宝我在这",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640612486,
					["from"] = "宝宝我在这",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "宝宝我在这",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640612495,
					["from"] = "特变电工",
					["msg"] = "然后我留了一个心眼昨天就去跟野团打了 怕组不上",
					["inbound"] = false,
					["convo"] = "宝宝我在这",
				}, -- [6]
				["info"] = {
				},
			},
			["神奇灬女侠"] = {
				{
					["type"] = 1,
					["time"] = 1640188588,
					["from"] = "神奇灬女侠",
					["msg"] = "老大哥  怎么退会了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640188596,
					["from"] = "特变电工",
					["msg"] = "找到一个晚上团",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640188600,
					["from"] = "特变电工",
					["msg"] = "9点半后",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640188611,
					["from"] = "神奇灬女侠",
					["msg"] = "哪个会",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640188618,
					["from"] = "特变电工",
					["msg"] = "山河归一",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640188627,
					["from"] = "神奇灬女侠",
					["msg"] = "没听过呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640188882,
					["from"] = "特变电工",
					["msg"] = "我只有晚上能打",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640188887,
					["from"] = "特变电工",
					["msg"] = "9点下班",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640188898,
					["from"] = "神奇灬女侠",
					["msg"] = "哦 ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640507501,
					["from"] = "特变电工",
					["msg"] = "!@#$%^&*!@#$",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640507508,
					["from"] = "特变电工",
					["msg"] = "刷了20次斯坦索姆",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640507511,
					["from"] = "特变电工",
					["msg"] = "没出我的腿",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640507528,
					["from"] = "神奇灬女侠",
					["msg"] = "什么腿？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640507531,
					["from"] = "特变电工",
					["msg"] = "T0",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640507548,
					["from"] = "神奇灬女侠",
					["msg"] = "哈哈 T0 我都没要",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640507561,
					["from"] = "神奇灬女侠",
					["msg"] = "要不要陪老哥去刷一把？",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640507605,
					["from"] = "神奇灬女侠",
					["msg"] = "我STSM 好像只打了三次吧 治疗衣服跟项链就到手了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640507622,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640507650,
					["from"] = "神奇灬女侠",
					["msg"] = "三大差不多毕业了 现在没事做刷下奥山声望  有个治疗副手蛮好的",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641188929,
					["from"] = "特变电工",
					["msg"] = "彻底起飞了",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641188937,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641188942,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21998:927:::::::60:::::::::|h[英勇护手]|h|r|cffa335ee|Hitem:21995:1887:::::::60:::::::::|h[英勇长靴]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641188943,
					["from"] = "神奇灬女侠",
					["msg"] = "哇",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641188952,
					["from"] = "特变电工",
					["msg"] = "PVP一霸",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641188969,
					["from"] = "神奇灬女侠",
					["msg"] = "你这收获不少呀",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641188975,
					["from"] = "特变电工",
					["msg"] = "对了 你们损失了一名大将。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641188982,
					["from"] = "特变电工",
					["msg"] = "我MC黑龙每次都是第一",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641188987,
					["from"] = "特变电工",
					["msg"] = "暴力DPS",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641188992,
					["from"] = "特变电工",
					["msg"] = "很轻松",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641188992,
					["from"] = "神奇灬女侠",
					["msg"] = "..  ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641188993,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641189003,
					["from"] = "特变电工",
					["msg"] = "不用吹灰之力",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641189005,
					["from"] = "神奇灬女侠",
					["msg"] = "我也退会了 换了个会",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641189008,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641189019,
					["from"] = "神奇灬女侠",
					["msg"] = "你们走了之后 没人聊天了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641189023,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641189030,
					["from"] = "神奇灬女侠",
					["msg"] = "团也打不起  ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641189162,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641189176,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:18821::::::::60:::::::::|h[迅击戒指]|h|r",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641189177,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠正在与普通 - 指挥官沃恩交战，（当前98%，5/5存活）",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641189191,
					["from"] = "神奇灬女侠",
					["msg"] = "多少G买的",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641189207,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠已在普通 - 指挥官沃恩的战斗中取得胜利！",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641189210,
					["from"] = "特变电工",
					["msg"] = "1700",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641189359,
					["from"] = "神奇灬女侠",
					["msg"] = "大佬V5",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641189368,
					["from"] = "特变电工",
					["msg"] = "便宜啊",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641189372,
					["from"] = "特变电工",
					["msg"] = "可以用到NAXX",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641189418,
					["from"] = "神奇灬女侠",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641189437,
					["from"] = "特变电工",
					["msg"] = "2顿中午饭。。",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641189500,
					["from"] = "神奇灬女侠",
					["msg"] = "对 有时候要等好久  碰到别错过",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641189837,
					["from"] = "特变电工",
					["msg"] = "主要是PVP也用",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641191441,
					["from"] = "特变电工",
					["msg"] = "除了法师 暗牧 其他职业看到我都要叫我爸爸",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641191443,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641191457,
					["from"] = "特变电工",
					["msg"] = "一个砍2个",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641191463,
					["from"] = "神奇灬女侠",
					["msg"] = ".. ",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641191463,
					["from"] = "特变电工",
					["msg"] = "起飞起飞",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641191471,
					["from"] = "特变电工",
					["msg"] = "太强",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641191477,
					["from"] = "特变电工",
					["msg"] = "我现在还是双持",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641191484,
					["from"] = "特变电工",
					["msg"] = "还没有单手武器",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641191486,
					["from"] = "特变电工",
					["msg"] = "双手武器",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641191500,
					["from"] = "特变电工",
					["msg"] = "那个削骨或者AL",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641191512,
					["from"] = "神奇灬女侠",
					["msg"] = "AL好",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641191514,
					["from"] = "特变电工",
					["msg"] = "直接垂直立体原地爆炸螺旋起飞",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641191516,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641191523,
					["from"] = "特变电工",
					["msg"] = "这个版本应该便宜",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641191529,
					["from"] = "神奇灬女侠",
					["msg"] = "静待BWL",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641191534,
					["from"] = "特变电工",
					["msg"] = "去BWL都是PVE玩家",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641191544,
					["from"] = "特变电工",
					["msg"] = "拿那个除了装逼没啥用",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641191562,
					["from"] = "特变电工",
					["msg"] = "AL 1WG我都要拿下来",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641191562,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠正在与普通 - 军需官兹格雷斯交战，（当前93%，5/5存活）",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641191575,
					["from"] = "神奇灬女侠",
					["msg"] = "应该要不了",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641191581,
					["from"] = "特变电工",
					["msg"] = "最多2千",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641191583,
					["from"] = "特变电工",
					["msg"] = "你信不",
					["inbound"] = false,
					["convo"] = "神奇灬女侠",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641191586,
					["from"] = "神奇灬女侠",
					["msg"] = "现在装备都不贵",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641191590,
					["from"] = "神奇灬女侠",
					["msg"] = "我信",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641191590,
					["from"] = "神奇灬女侠",
					["msg"] = "<DBM> 神奇灬女侠已在普通 - 军需官兹格雷斯的战斗中取得胜利！",
					["inbound"] = true,
					["convo"] = "神奇灬女侠",
				}, -- [75]
				["info"] = {
				},
			},
			["冯一刀"] = {
				{
					["type"] = 1,
					["time"] = 1640507983,
					["from"] = "冯一刀",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "冯一刀",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640514210,
					["from"] = "特变电工",
					["msg"] = "我刚送走一个",
					["inbound"] = false,
					["convo"] = "冯一刀",
				}, -- [2]
				["info"] = {
				},
			},
			["战山河"] = {
				{
					["type"] = 1,
					["time"] = 1640189141,
					["from"] = "特变电工",
					["msg"] = "COD",
					["inbound"] = false,
					["convo"] = "战山河",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640189145,
					["from"] = "特变电工",
					["msg"] = "一个给我",
					["inbound"] = false,
					["convo"] = "战山河",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640189147,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "战山河",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640189158,
					["from"] = "战山河",
					["msg"] = "额",
					["inbound"] = true,
					["convo"] = "战山河",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640189233,
					["from"] = "特变电工",
					["msg"] = "3Q",
					["inbound"] = false,
					["convo"] = "战山河",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640189235,
					["from"] = "战山河",
					["msg"] = "铁炉堡",
					["inbound"] = true,
					["convo"] = "战山河",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640189260,
					["from"] = "特变电工",
					["msg"] = "或者等会我回城也行 不会卡你邮件。。",
					["inbound"] = false,
					["convo"] = "战山河",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640189340,
					["from"] = "战山河",
					["msg"] = "邮寄了",
					["inbound"] = true,
					["convo"] = "战山河",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640189377,
					["from"] = "战山河",
					["msg"] = "邮寄了",
					["inbound"] = true,
					["convo"] = "战山河",
				}, -- [9]
				["info"] = {
				},
			},
			["朝先"] = {
				{
					["type"] = 1,
					["time"] = 1640621696,
					["from"] = "特变电工",
					["msg"] = "多少钱",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640621766,
					["from"] = "朝先",
					["msg"] = "90要不？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640621781,
					["from"] = "特变电工",
					["msg"] = "我还不知道市场价。。",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640621787,
					["from"] = "朝先",
					["msg"] = "AH 150",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640621806,
					["from"] = "特变电工",
					["msg"] = "COD给我",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640621816,
					["from"] = "特变电工",
					["msg"] = "我拿去砍人",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640621867,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640621890,
					["from"] = "特变电工",
					["msg"] = "好不",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640621892,
					["from"] = "特变电工",
					["msg"] = "兄弟",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640621903,
					["from"] = "朝先",
					["msg"] = "啥？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640621913,
					["from"] = "特变电工",
					["msg"] = "货到付款邮寄我",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640621922,
					["from"] = "特变电工",
					["msg"] = "我在副本里",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640621971,
					["from"] = "朝先",
					["msg"] = "世界有人出120了。。让我再喊喊吧，我攒钱买个大马先",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640622029,
					["from"] = "特变电工",
					["msg"] = "我出130",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640622042,
					["from"] = "朝先",
					["msg"] = "AH才150.。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640622061,
					["from"] = "朝先",
					["msg"] = "你回铁交易？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640622078,
					["from"] = "特变电工",
					["msg"] = "你邮寄我就行 货到付款 不卡邮件 我在副本里",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640622084,
					["from"] = "特变电工",
					["msg"] = "1小时后就能收",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640622091,
					["from"] = "朝先",
					["msg"] = "那我算你125吧，行么？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640622094,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640622097,
					["from"] = "朝先",
					["msg"] = "|cffc69b6d特变电工-鱼人摩洛克|r",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640622099,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640622117,
					["from"] = "朝先",
					["msg"] = "邮寄了。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640622121,
					["from"] = "特变电工",
					["msg"] = "好的 3Q",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640622140,
					["from"] = "朝先",
					["msg"] = "嗯嗯，别卡信，谢谢。我下了，晚安，好运",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640622145,
					["from"] = "特变电工",
					["msg"] = "嗯 放心",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640622148,
					["from"] = "朝先",
					["msg"] = "嗯嗯",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640703149,
					["from"] = "朝先",
					["msg"] = "在么",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640703173,
					["from"] = "特变电工",
					["msg"] = "昨天下线忘记收了。。今天上线收了 应该到账了吧",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640703262,
					["from"] = "朝先",
					["msg"] = "到了到了",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640703266,
					["from"] = "朝先",
					["msg"] = "帮个忙",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640703279,
					["from"] = "朝先",
					["msg"] = "|cffffffff|Hitem:12820::::::::60:::::::::|h[冬泉火酒]|h|r 你买我一组这个吧 10G。。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640703294,
					["from"] = "朝先",
					["msg"] = "我差7G去买个马了。。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640703352,
					["from"] = "朝先",
					["msg"] = "你需要这东西不？",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640703465,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640703495,
					["from"] = "朝先",
					["msg"] = "你也是狂暴战。",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640703502,
					["from"] = "特变电工",
					["msg"] = "裝備如何",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640703504,
					["from"] = "特变电工",
					["msg"] = "我的",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640703520,
					["from"] = "朝先",
					["msg"] = "鞋子得换啊。。绿的没档次~哈哈",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640703528,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640703532,
					["from"] = "特变电工",
					["msg"] = "我在做T0.5",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640703535,
					["from"] = "特变电工",
					["msg"] = "你的武器多少錢",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640703537,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:17112:1900:::::::60:::::::::|h[苍穹击碎者]|h|r",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640703540,
					["from"] = "朝先",
					["msg"] = "我也要做，但是现在没钱了",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640703550,
					["from"] = "朝先",
					["msg"] = "4钱",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640703555,
					["from"] = "特变电工",
					["msg"] = "4千？",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640703576,
					["from"] = "朝先",
					["msg"] = "嗯4千",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640703809,
					["from"] = "朝先",
					["msg"] = "哈，身上剩2G了",
					["inbound"] = true,
					["convo"] = "朝先",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640703989,
					["from"] = "特变电工",
					["msg"] = "我MC轻松打第一啊",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640703990,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640703995,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640703998,
					["from"] = "特变电工",
					["msg"] = "黑龙也是第一",
					["inbound"] = false,
					["convo"] = "朝先",
				}, -- [52]
				["info"] = {
				},
			},
			["命不由天定"] = {
				{
					["type"] = 1,
					["time"] = 1641232178,
					["from"] = "特变电工",
					["msg"] = "加我好友啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641232180,
					["from"] = "特变电工",
					["msg"] = "我加你了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641232182,
					["from"] = "特变电工",
					["msg"] = "以后一起起飞",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641232187,
					["from"] = "命不由天定",
					["msg"] = "加了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641232197,
					["from"] = "特变电工",
					["msg"] = "战骑组合 可以杀7个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641232205,
					["from"] = "特变电工",
					["msg"] = "2V7",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641232210,
					["from"] = "命不由天定",
					["msg"] = "这么厉害呀",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641232212,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641232222,
					["from"] = "特变电工",
					["msg"] = "不要打群架",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1641232229,
					["from"] = "特变电工",
					["msg"] = "拦截人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1641232233,
					["from"] = "特变电工",
					["msg"] = "独享2人荣誉",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1641232238,
					["from"] = "特变电工",
					["msg"] = "不跟大部队",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1641232244,
					["from"] = "特变电工",
					["msg"] = "大部队是均摊的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1641232261,
					["from"] = "命不由天定",
					["msg"] = "o 哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1641232283,
					["from"] = "特变电工",
					["msg"] = "你看这个战士",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1641232289,
					["from"] = "特变电工",
					["msg"] = "他是独狼",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1641232306,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1641232350,
					["from"] = "特变电工",
					["msg"] = "我尼玛",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1641232353,
					["from"] = "特变电工",
					["msg"] = "全部杀我们2个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1641232358,
					["from"] = "特变电工",
					["msg"] = "我以为只会来几个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1641232363,
					["from"] = "命不由天定",
					["msg"] = "哈哈恨死咱们了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641232369,
					["from"] = "特变电工",
					["msg"] = "看来引起公愤了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1641232371,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1641232374,
					["from"] = "特变电工",
					["msg"] = "笑死我了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1641232379,
					["from"] = "特变电工",
					["msg"] = "我以为只有4个左右",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1641232422,
					["from"] = "特变电工",
					["msg"] = "这把坑了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1641232426,
					["from"] = "特变电工",
					["msg"] = "我们有很大责任",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1641232430,
					["from"] = "特变电工",
					["msg"] = "杀了太多人回去了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1641232432,
					["from"] = "命不由天定",
					["msg"] = "是呀 ",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1641232444,
					["from"] = "特变电工",
					["msg"] = "我只想微微的防守",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1641232452,
					["from"] = "特变电工",
					["msg"] = "结果没停住",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1641232460,
					["from"] = "命不由天定",
					["msg"] = "都杀回去了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1641232484,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1641232501,
					["from"] = "命不由天定",
					["msg"] = "我拿口吃的",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1641232723,
					["from"] = "命不由天定",
					["msg"] = "我回来了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1641232769,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1641232894,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1641232899,
					["from"] = "特变电工",
					["msg"] = "4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1641232911,
					["from"] = "特变电工",
					["msg"] = "太多了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641232912,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641232962,
					["from"] = "特变电工",
					["msg"] = "让他们开",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641232998,
					["from"] = "特变电工",
					["msg"] = "我们往前拦截",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641233008,
					["from"] = "特变电工",
					["msg"] = "又能保证荣誉和游戏体验",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641233013,
					["from"] = "特变电工",
					["msg"] = "也能让坑场快点结束",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641233031,
					["from"] = "命不由天定",
					["msg"] = "去哪",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641233036,
					["from"] = "特变电工",
					["msg"] = "走",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641233049,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641233146,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1641233151,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1641233154,
					["from"] = "特变电工",
					["msg"] = "。。。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1641233157,
					["from"] = "特变电工",
					["msg"] = "我本来不想打的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1641233163,
					["from"] = "特变电工",
					["msg"] = "我看别人被欺负了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1641233312,
					["from"] = "特变电工",
					["msg"] = "等他们墓地好",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1641233334,
					["from"] = "特变电工",
					["msg"] = "然后他们大部队就在雷矛了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1641233339,
					["from"] = "特变电工",
					["msg"] = "然后我们",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1641233390,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1641233401,
					["from"] = "特变电工",
					["msg"] = "雷矛他们不一定了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1641233489,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1641233492,
					["from"] = "特变电工",
					["msg"] = "一堆人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1641233495,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1641233499,
					["from"] = "特变电工",
					["msg"] = "杀了2个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1641233502,
					["from"] = "特变电工",
					["msg"] = "够本",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1641233504,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1641233698,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1641233705,
					["from"] = "特变电工",
					["msg"] = "你ADD到了^&*!OSS",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1641233713,
					["from"] = "命不由天定",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1641233806,
					["from"] = "特变电工",
					["msg"] = "你可以给我上牺牲",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1641233824,
					["from"] = "命不由天定",
					["msg"] = "哦",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1641233830,
					["from"] = "特变电工",
					["msg"] = "我北洋",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1641233840,
					["from"] = "特变电工",
					["msg"] = "你北洋",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1641233892,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1641233896,
					["from"] = "特变电工",
					["msg"] = "这么多NPC",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1641233898,
					["from"] = "命不由天定",
					["msg"] = "你拉太多了",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1641233902,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1641234239,
					["from"] = "命不由天定",
					["msg"] = "u不开越来越多",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1641234241,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1641234245,
					["from"] = "特变电工",
					["msg"] = "怎么回来这么多的",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1641234246,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1641234262,
					["from"] = "特变电工",
					["msg"] = "就是在这里坑杀他们",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641234271,
					["from"] = "特变电工",
					["msg"] = "2个坑4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641234278,
					["from"] = "特变电工",
					["msg"] = "结果莫名其妙来了一群人",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641234293,
					["from"] = "特变电工",
					["msg"] = "不亏",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641234295,
					["from"] = "特变电工",
					["msg"] = "杀了4个",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1641234300,
					["from"] = "特变电工",
					["msg"] = "够本",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1641234430,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1641234432,
					["from"] = "特变电工",
					["msg"] = "我知道了",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1641234449,
					["from"] = "特变电工",
					["msg"] = "他们后面一直在围着这个冰雪大王",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1641234455,
					["from"] = "特变电工",
					["msg"] = "但他迟迟不欠",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1641234616,
					["from"] = "特变电工",
					["msg"] = "睡觉了 晚安 明天还要上班 有空一起起飞啊",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1641234617,
					["from"] = "特变电工",
					["msg"] = "》。",
					["inbound"] = false,
					["convo"] = "命不由天定",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1641234632,
					["from"] = "命不由天定",
					["msg"] = "好的 88",
					["inbound"] = true,
					["convo"] = "命不由天定",
				}, -- [91]
				["info"] = {
				},
			},
			["黑暗偿还者"] = {
				{
					["type"] = 1,
					["time"] = 1640098566,
					["from"] = "黑暗偿还者",
					["msg"] = "啦我一下 换个位面",
					["inbound"] = true,
					["convo"] = "黑暗偿还者",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640098581,
					["from"] = "黑暗偿还者",
					["msg"] = "求组",
					["inbound"] = true,
					["convo"] = "黑暗偿还者",
				}, -- [2]
				["info"] = {
				},
			},
			["牧马人"] = {
				{
					["type"] = 1,
					["time"] = 1641097810,
					["from"] = "特变电工",
					["msg"] = "321",
					["inbound"] = false,
					["convo"] = "牧马人",
				}, -- [1]
				["info"] = {
				},
			},
			["小铃噹"] = {
				{
					["type"] = 1,
					["time"] = 1641053130,
					["from"] = "特变电工",
					["msg"] = "我才打完台服TBC 繁字体",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641053138,
					["from"] = "小铃噹",
					["msg"] = "額。。。。",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641053145,
					["from"] = "特变电工",
					["msg"] = "你为啥打繁体字",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641053158,
					["from"] = "小铃噹",
					["msg"] = "電腦如此，，，，",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641053162,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641053177,
					["from"] = "特变电工",
					["msg"] = "我有湾湾朋友想玩国服 卡实名。。",
					["inbound"] = false,
					["convo"] = "小铃噹",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641053197,
					["from"] = "小铃噹",
					["msg"] = "額",
					["inbound"] = true,
					["convo"] = "小铃噹",
				}, -- [7]
				["info"] = {
				},
			},
			["森类滴话"] = {
				{
					["type"] = 1,
					["time"] = 1641015736,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "森类滴话",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641015752,
					["from"] = "特变电工",
					["msg"] = "公爵",
					["inbound"] = false,
					["convo"] = "森类滴话",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641015785,
					["from"] = "森类滴话",
					["msg"] = "<大脚团队提示>欢迎加入本团队，希望我们合作愉快，拥有一次快乐的冒险旅程。",
					["inbound"] = true,
					["convo"] = "森类滴话",
				}, -- [3]
				["info"] = {
				},
			},
			["法夜"] = {
				{
					["type"] = 1,
					["time"] = 1640801669,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640801672,
					["from"] = "特变电工",
					["msg"] = "还缺吗",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640801676,
					["from"] = "特变电工",
					["msg"] = "坦",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640801684,
					["from"] = "法夜",
					["msg"] = "做0.5任务的 来不",
					["inbound"] = true,
					["convo"] = "法夜",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640801685,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640801687,
					["from"] = "特变电工",
					["msg"] = "来了",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640801696,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "法夜",
				}, -- [7]
				["info"] = {
				},
			},
			["Whitegods"] = {
				{
					["type"] = 1,
					["time"] = 1641097738,
					["from"] = "特变电工",
					["msg"] = "白天开组了么",
					["inbound"] = false,
					["convo"] = "Whitegods",
				}, -- [1]
				["info"] = {
				},
			},
			["Tenveo"] = {
				{
					["type"] = 1,
					["time"] = 1640191318,
					["from"] = "Tenveo",
					["msg"] = "其实我也想要  哈哈",
					["inbound"] = true,
					["convo"] = "Tenveo",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640191325,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "Tenveo",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640191332,
					["from"] = "Tenveo",
					["msg"] = "给你把",
					["inbound"] = true,
					["convo"] = "Tenveo",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640191339,
					["from"] = "特变电工",
					["msg"] = "你刷双刀",
					["inbound"] = false,
					["convo"] = "Tenveo",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640191343,
					["from"] = "特变电工",
					["msg"] = "以后还有很多机会",
					["inbound"] = false,
					["convo"] = "Tenveo",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640191346,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "Tenveo",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640191361,
					["from"] = "特变电工",
					["msg"] = "十八",
					["inbound"] = false,
					["convo"] = "Tenveo",
				}, -- [7]
				["info"] = {
				},
			},
			["天呐你真黑"] = {
				{
					["type"] = 1,
					["time"] = 1640270881,
					["from"] = "天呐你真黑",
					["msg"] = "111",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640270888,
					["from"] = "天呐你真黑",
					["msg"] = "不要黑爵士  有了 ",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640270898,
					["from"] = "特变电工",
					["msg"] = "稍等",
					["inbound"] = false,
					["convo"] = "天呐你真黑",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640270905,
					["from"] = "天呐你真黑",
					["msg"] = "只需求T0裤子",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640270928,
					["from"] = "特变电工",
					["msg"] = "在出副本",
					["inbound"] = false,
					["convo"] = "天呐你真黑",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640271127,
					["from"] = "天呐你真黑",
					["msg"] = "到了",
					["inbound"] = true,
					["convo"] = "天呐你真黑",
				}, -- [6]
				["info"] = {
				},
			},
			["袁阿满"] = {
				{
					["type"] = 1,
					["time"] = 1641060406,
					["from"] = "特变电工",
					["msg"] = "却暴力狂暴战吗",
					["inbound"] = false,
					["convo"] = "袁阿满",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641060450,
					["from"] = "特变电工",
					["msg"] = "不要装备 只做任务",
					["inbound"] = false,
					["convo"] = "袁阿满",
				}, -- [2]
				["info"] = {
				},
			},
			["小哥"] = {
				{
					["type"] = 1,
					["time"] = 1640448679,
					["from"] = "小哥",
					["msg"] = "DZ",
					["inbound"] = true,
					["convo"] = "小哥",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640448700,
					["from"] = "特变电工",
					["msg"] = "DPS满了哈",
					["inbound"] = false,
					["convo"] = "小哥",
				}, -- [2]
				["info"] = {
				},
			},
			["茅台酒"] = {
				{
					["type"] = 1,
					["time"] = 1640093366,
					["from"] = "特变电工",
					["msg"] = "我都毕业了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640093378,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:12940:1900:::::::60:::::::::|h[雷德的神圣控诉者]|h|r|cff0070dd|Hitem:12939:1900:::::::60:::::::::|h[雷德的部族护卫者]|h|r|cffa335ee|Hitem:11726:1891:::::::60:::::::::|h[野蛮角斗士链甲]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640093380,
					["from"] = "茅台酒",
					["msg"] = "嗯 快呀",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640093387,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:12927::::::::60:::::::::|h[强击护肩]|h|r|cff0070dd|Hitem:15411::::::::60:::::::::|h[弗丁印记]|h|r|cff0070dd|Hitem:15063:927:::::::60:::::::::|h[魔暴龙皮手套]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640093394,
					["from"] = "茅台酒",
					["msg"] = "额。。。。 多少G",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640093395,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:15062:1506:::::::60:::::::::|h[魔暴龙皮护腿]|h|r|cff0070dd|Hitem:13142::::::::60:::::::::|h[黑龙束带]|h|r|cff0070dd|Hitem:13098::::::::60:::::::::|h[痛苦指环]|h|r|cff0070dd|Hitem:13965::::::::60:::::::::|h[黑手饰物]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640093399,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:18323::::::::60:::::::::|h[萨特强弓]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640093403,
					["from"] = "特变电工",
					["msg"] = "1天毕业",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640093419,
					["from"] = "特变电工",
					["msg"] = "我收益的万分之5",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640093421,
					["from"] = "茅台酒",
					["msg"] = "多少G 花的",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640093436,
					["from"] = "特变电工",
					["msg"] = "双刀700",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640093439,
					["from"] = "特变电工",
					["msg"] = "衣服350",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640093445,
					["from"] = "特变电工",
					["msg"] = "戒指150",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640093451,
					["from"] = "特变电工",
					["msg"] = "肩膀100",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640093455,
					["from"] = "特变电工",
					["msg"] = "弓30",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640093462,
					["from"] = "特变电工",
					["msg"] = "护腕100",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640093470,
					["from"] = "特变电工",
					["msg"] = "魔暴龙套150",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640093479,
					["from"] = "特变电工",
					["msg"] = "附魔250",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640093486,
					["from"] = "茅台酒",
					["msg"] = "有G 就是好",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640101292,
					["from"] = "特变电工",
					["msg"] = "2天亏40万",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640101301,
					["from"] = "特变电工",
					["msg"] = "美滋滋",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640952445,
					["from"] = "特变电工",
					["msg"] = "今年结账了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640955697,
					["from"] = "茅台酒",
					["msg"] = "嗯 赚了多少G",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640955704,
					["from"] = "茅台酒",
					["msg"] = "RMB",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640955718,
					["from"] = "特变电工",
					["msg"] = "160",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640955728,
					["from"] = "茅台酒",
					["msg"] = "可以",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640955735,
					["from"] = "特变电工",
					["msg"] = "最高280",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640955756,
					["from"] = "茅台酒",
					["msg"] = "可以在游戏里面当思聪了",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640955810,
					["from"] = "特变电工",
					["msg"] = "准备拿1%收益",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640955824,
					["from"] = "茅台酒",
					["msg"] = "不明白",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640955849,
					["from"] = "特变电工",
					["msg"] = "拿0.5%收益在魔兽消费",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640955858,
					["from"] = "茅台酒",
					["msg"] = "用不完",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640955890,
					["from"] = "特变电工",
					["msg"] = "明年的目标是1000",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640955897,
					["from"] = "特变电工",
					["msg"] = "A股600 美股400",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640955911,
					["from"] = "特变电工",
					["msg"] = "因为是复利",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640955926,
					["from"] = "特变电工",
					["msg"] = "越到后面越猛",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640955944,
					["from"] = "特变电工",
					["msg"] = "A股特工48 美股wish 30 phun 30",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640955961,
					["from"] = "特变电工",
					["msg"] = "我说的是股价",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640955970,
					["from"] = "特变电工",
					["msg"] = "茅台800",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1641132493,
					["from"] = "特变电工",
					["msg"] = "我已经彻底毕业了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1641132506,
					["from"] = "茅台酒",
					["msg"] = "厉害",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1641187162,
					["from"] = "特变电工",
					["msg"] = "t0.5我都做完了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1641187174,
					["from"] = "茅台酒",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "茅台酒",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1641187175,
					["from"] = "特变电工",
					["msg"] = "30次DK 10次通灵 10次黑上 各种任务",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1641187180,
					["from"] = "特变电工",
					["msg"] = "爽",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1641187186,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21999:1503:::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997:1891:::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1641187195,
					["from"] = "特变电工",
					["msg"] = "PVP神器",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1641187209,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "茅台酒",
				}, -- [48]
				["info"] = {
				},
			},
			["大个一米八六"] = {
				{
					["type"] = 1,
					["time"] = 1641116535,
					["from"] = "特变电工",
					["msg"] = "那个比T打的高一点的法师要分金吗",
					["inbound"] = false,
					["convo"] = "大个一米八六",
				}, -- [1]
				["info"] = {
				},
			},
			["一葉知秋"] = {
				{
					["type"] = 1,
					["time"] = 1640948924,
					["from"] = "特变电工",
					["msg"] = "7力量多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640948939,
					["from"] = "特变电工",
					["msg"] = "手7力量多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640948954,
					["from"] = "一葉知秋",
					["msg"] = " 7力24G ",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640948958,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640948993,
					["from"] = "一葉知秋",
					["msg"] = "与[特变电工]交易成功。(交出)附魔手套 - 强效力量 (收到)24g",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640949044,
					["from"] = "特变电工",
					["msg"] = "附魔护腕 - 超强耐力多少钱",
					["inbound"] = false,
					["convo"] = "一葉知秋",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640949068,
					["from"] = "一葉知秋",
					["msg"] = "9耐9G",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640949084,
					["from"] = "一葉知秋",
					["msg"] = "与[特变电工]交易成功。(交出)附魔护腕 - 超强耐力 (收到)9g",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640949094,
					["from"] = "一葉知秋",
					["msg"] = "没事",
					["inbound"] = true,
					["convo"] = "一葉知秋",
				}, -- [9]
				["info"] = {
				},
			},
			["美兹兹"] = {
				{
					["type"] = 1,
					["time"] = 1640541098,
					["from"] = "美兹兹",
					["msg"] = "10G 求拿爱与家庭的画 有的MM 谢谢",
					["inbound"] = true,
					["convo"] = "美兹兹",
				}, -- [1]
				["info"] = {
				},
			},
			["强壯壯"] = {
				{
					["type"] = 1,
					["time"] = 1640194230,
					["from"] = "特变电工",
					["msg"] = "大壮",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640194233,
					["from"] = "特变电工",
					["msg"] = "你帮我拿G吧",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640194236,
					["from"] = "特变电工",
					["msg"] = "我还有事",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640194245,
					["from"] = "强壯壯",
					["msg"] = "那我邮你",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640194248,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640194253,
					["from"] = "强壯壯",
					["msg"] = "你团队说一下",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640194261,
					["from"] = "强壯壯",
					["msg"] = "或者m那个团长法师",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640194290,
					["from"] = "特变电工",
					["msg"] = "感谢",
					["inbound"] = false,
					["convo"] = "强壯壯",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640194296,
					["from"] = "强壯壯",
					["msg"] = "没事",
					["inbound"] = true,
					["convo"] = "强壯壯",
				}, -- [9]
				["info"] = {
				},
			},
			["Alei"] = {
				{
					["type"] = 1,
					["time"] = 1640805655,
					["from"] = "特变电工",
					["msg"] = "加我好友",
					["inbound"] = false,
					["convo"] = "Alei",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640805663,
					["from"] = "Alei",
					["msg"] = "加你了",
					["inbound"] = true,
					["convo"] = "Alei",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640805664,
					["from"] = "特变电工",
					["msg"] = "以后经常给你分享投资",
					["inbound"] = false,
					["convo"] = "Alei",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640805671,
					["from"] = "Alei",
					["msg"] = "好的 感谢",
					["inbound"] = true,
					["convo"] = "Alei",
				}, -- [4]
				["info"] = {
				},
			},
			["蒙塔基钢弹"] = {
				{
					["type"] = 1,
					["time"] = 1640961079,
					["from"] = "特变电工",
					["msg"] = "坦",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640962855,
					["from"] = "特变电工",
					["msg"] = "T",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640962862,
					["from"] = "特变电工",
					["msg"] = "坦克起飞",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640962865,
					["from"] = "特变电工",
					["msg"] = "我又来了",
					["inbound"] = false,
					["convo"] = "蒙塔基钢弹",
				}, -- [4]
				["info"] = {
				},
			},
			["卡卡汐"] = {
				{
					["type"] = 1,
					["time"] = 1640882204,
					["from"] = "特变电工",
					["msg"] = "我彻底毕业了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640882207,
					["from"] = "特变电工",
					["msg"] = "大兄弟",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640882215,
					["from"] = "特变电工",
					["msg"] = "我MC黑龙打第一",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640882218,
					["from"] = "特变电工",
					["msg"] = "你敢信",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640882226,
					["from"] = "特变电工",
					["msg"] = "很轻松",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640882231,
					["from"] = "特变电工",
					["msg"] = "不用吹灰之力",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640882250,
					["from"] = "特变电工",
					["msg"] = "你要为你认识练级期间认识我这样的朋友而感到自豪",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640882251,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640882254,
					["from"] = "特变电工",
					["msg"] = "确实日白",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640882266,
					["from"] = "卡卡汐",
					["msg"] = "DPS我经常第一 ",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640882271,
					["from"] = "特变电工",
					["msg"] = "你打不过我",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640882277,
					["from"] = "卡卡汐",
					["msg"] = "恭喜你了",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640882287,
					["from"] = "卡卡汐",
					["msg"] = "打了多少伤害",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640882299,
					["from"] = "特变电工",
					["msg"] = "忘记了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640882326,
					["from"] = "卡卡汐",
					["msg"] = "黑龙你怎么打的第一？",
					["inbound"] = true,
					["convo"] = "卡卡汐",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640882348,
					["from"] = "特变电工",
					["msg"] = "很简单啊",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640882350,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640882356,
					["from"] = "特变电工",
					["msg"] = "黑龙比MC简单",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640882365,
					["from"] = "特变电工",
					["msg"] = "地上有精英龙啊",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640882373,
					["from"] = "特变电工",
					["msg"] = "还是2只拉一起",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640882380,
					["from"] = "特变电工",
					["msg"] = "一顿A",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1641216295,
					["from"] = "特变电工",
					["msg"] = "我已经起飞了",
					["inbound"] = false,
					["convo"] = "卡卡汐",
				}, -- [22]
				["info"] = {
				},
			},
			["萌萌灰#51759"] = {
				{
					["type"] = 1,
					["time"] = 1640184341,
					["from"] = "特变电工",
					["msg"] = "阿刚",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640184350,
					["from"] = "萌萌灰#51759",
					["msg"] = "？",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640184355,
					["from"] = "特变电工",
					["msg"] = "我在赛季服",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640184367,
					["from"] = "萌萌灰#51759",
					["msg"] = "比赛服？",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640184378,
					["from"] = "特变电工",
					["msg"] = "60级轮回服",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640184384,
					["from"] = "萌萌灰#51759",
					["msg"] = "!@#$%^啊",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640184418,
					["from"] = "特变电工",
					["msg"] = "不知不觉离开你一年多了",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640184425,
					["from"] = "特变电工",
					["msg"] = "正式服",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640184428,
					["from"] = "萌萌灰#51759",
					["msg"] = "\\",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640184430,
					["from"] = "特变电工",
					["msg"] = "太难耍了",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640184431,
					["from"] = "萌萌灰#51759",
					["msg"] = "无爱了",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640184563,
					["from"] = "特变电工",
					["msg"] = "比亚迪股东",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640184567,
					["from"] = "特变电工",
					["msg"] = "已经离开群了",
					["inbound"] = false,
					["convo"] = "萌萌灰#51759",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640184594,
					["from"] = "萌萌灰#51759",
					["msg"] = "???",
					["inbound"] = true,
					["convo"] = "萌萌灰#51759",
				}, -- [14]
				["info"] = {
				},
			},
			["牛攵"] = {
				{
					["type"] = 1,
					["time"] = 1640802956,
					["from"] = "牛攵",
					["msg"] = "我马上来 这边通知拿装备了",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640802960,
					["from"] = "特变电工",
					["msg"] = "嗯嗯",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640803164,
					["from"] = "特变电工",
					["msg"] = "不来了吗。。",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640803176,
					["from"] = "牛攵",
					["msg"] = "马上",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640803203,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640803205,
					["from"] = "特变电工",
					["msg"] = "我是深渊哦",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640803207,
					["from"] = "牛攵",
					["msg"] = "我在血色区拿个装备",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640803225,
					["from"] = "牛攵",
					["msg"] = "炮手",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640803259,
					["from"] = "牛攵",
					["msg"] = "那边打工的 已经到炮手了 通知我过来拿装备",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640803269,
					["from"] = "牛攵",
					["msg"] = "三分钟",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640803283,
					["from"] = "特变电工",
					["msg"] = "好的哈",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640803431,
					["from"] = "牛攵",
					["msg"] = "组",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640804026,
					["from"] = "特变电工",
					["msg"] = "你在哪个MC",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640804029,
					["from"] = "特变电工",
					["msg"] = "团",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640804032,
					["from"] = "特变电工",
					["msg"] = "公会里的",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640804038,
					["from"] = "牛攵",
					["msg"] = "周末团吧 我是里予",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640804061,
					["from"] = "特变电工",
					["msg"] = "中午12点半？",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640804069,
					["from"] = "牛攵",
					["msg"] = "午夜团",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640804080,
					["from"] = "特变电工",
					["msg"] = "午夜团不是周1 9点半吗",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640804081,
					["from"] = "牛攵",
					["msg"] = "上次跟的尾团",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640804094,
					["from"] = "牛攵",
					["msg"] = "昨晚",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640804102,
					["from"] = "特变电工",
					["msg"] = "全通吗",
					["inbound"] = false,
					["convo"] = "牛攵",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640804107,
					["from"] = "牛攵",
					["msg"] = "老九",
					["inbound"] = true,
					["convo"] = "牛攵",
				}, -- [23]
				["info"] = {
				},
			},
			["江城第一深情"] = {
				{
					["type"] = 1,
					["time"] = 1640794089,
					["from"] = "江城第一深情",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "江城第一深情",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640794103,
					["from"] = "特变电工",
					["msg"] = "奶吗",
					["inbound"] = false,
					["convo"] = "江城第一深情",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640794104,
					["from"] = "江城第一深情",
					["msg"] = "奶德",
					["inbound"] = true,
					["convo"] = "江城第一深情",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640795982,
					["from"] = "特变电工",
					["msg"] = "？",
					["inbound"] = false,
					["convo"] = "江城第一深情",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640795983,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "江城第一深情",
				}, -- [5]
				["info"] = {
				},
			},
			["风涧芯"] = {
				{
					["type"] = 1,
					["time"] = 1640274237,
					["from"] = "风涧芯",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640274281,
					["from"] = "特变电工",
					["msg"] = "是治疗吧",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640274317,
					["from"] = "风涧芯",
					["msg"] = "是",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640274386,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16732::::::::60:::::::::|h[勇气腿铠]|h|r|cff0070dd|Hitem:16728::::::::60:::::::::|h[光铸腿铠]|h|r勇气是我的 光铸是你的",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640274402,
					["from"] = "风涧芯",
					["msg"] = "哥，别担心....我只需治疗项链。。。",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640274405,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640274409,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640274412,
					["from"] = "风涧芯",
					["msg"] = "不用这么紧张",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640274427,
					["from"] = "特变电工",
					["msg"] = "。。。。。。。。。。",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640274471,
					["from"] = "风涧芯",
					["msg"] = "可以附2个吗。。。头腿都各来一个",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640274479,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640274482,
					["from"] = "风涧芯",
					["msg"] = "发错了",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640274514,
					["from"] = "风涧芯",
					["msg"] = "我去附个魔，1分钟",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640274522,
					["from"] = "特变电工",
					["msg"] = "队伍里说",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640274608,
					["from"] = "风涧芯",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640274611,
					["from"] = "风涧芯",
					["msg"] = "搞定了",
					["inbound"] = true,
					["convo"] = "风涧芯",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640280896,
					["from"] = "特变电工",
					["msg"] = "继续",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640280902,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "风涧芯",
				}, -- [18]
				["info"] = {
				},
			},
			["我给你跪下了"] = {
				{
					["type"] = 1,
					["time"] = 1640448601,
					["from"] = "特变电工",
					["msg"] = "STSM",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640448603,
					["from"] = "特变电工",
					["msg"] = "起飞吗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640448609,
					["from"] = "我给你跪下了",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640448721,
					["from"] = "我给你跪下了",
					["msg"] = "你这个本差啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640448910,
					["from"] = "特变电工",
					["msg"] = "腿",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640448922,
					["from"] = "我给你跪下了",
					["msg"] = "好 这把出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640448985,
					["from"] = "特变电工",
					["msg"] = "必须起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640451840,
					["from"] = "特变电工",
					["msg"] = "继续",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640451845,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640454724,
					["from"] = "特变电工",
					["msg"] = "你还没毕业么",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640454745,
					["from"] = "我给你跪下了",
					["msg"] = "正好刷腿",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640454753,
					["from"] = "特变电工",
					["msg"] = "你也差腿哦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640454758,
					["from"] = "特变电工",
					["msg"] = "T0.5很强",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640454758,
					["from"] = "我给你跪下了",
					["msg"] = "看咱俩谁先出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640454857,
					["from"] = "我给你跪下了",
					["msg"] = "我当时问你披风是以为你要披风 我想着可以让 哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640455753,
					["from"] = "特变电工",
					["msg"] = "队长给我",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640455768,
					["from"] = "特变电工",
					["msg"] = "队长给我",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640455790,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640455792,
					["from"] = "特变电工",
					["msg"] = "队长给我",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640455796,
					["from"] = "特变电工",
					["msg"] = "。。。。。。。。。。。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640458246,
					["from"] = "特变电工",
					["msg"] = "明天继续",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640458247,
					["from"] = "特变电工",
					["msg"] = "累了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640458248,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640458253,
					["from"] = "我给你跪下了",
					["msg"] = "11",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640458257,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640458258,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640458262,
					["from"] = "特变电工",
					["msg"] = "垃圾游戏啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640458263,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640458265,
					["from"] = "特变电工",
					["msg"] = "》。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640500219,
					["from"] = "特变电工",
					["msg"] = "起飞马",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640500345,
					["from"] = "特变电工",
					["msg"] = "起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640500347,
					["from"] = "特变电工",
					["msg"] = "人呢",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640500350,
					["from"] = "我给你跪下了",
					["msg"] = "。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640500354,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640500360,
					["from"] = "我给你跪下了",
					["msg"] = "刚没看见",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640500373,
					["from"] = "特变电工",
					["msg"] = "起飞起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640500375,
					["from"] = "特变电工",
					["msg"] = "进组",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640500424,
					["from"] = "我给你跪下了",
					["msg"] = "来了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640500456,
					["from"] = "我给你跪下了",
					["msg"] = "再组下",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640500535,
					["from"] = "特变电工",
					["msg"] = "你去过MC马",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640500542,
					["from"] = "特变电工",
					["msg"] = "晚上我找个MC起飞",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640500552,
					["from"] = "我给你跪下了",
					["msg"] = "没啊 没团缺Z",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640500563,
					["from"] = "我给你跪下了",
					["msg"] = "暂时不搞团了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640500567,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640500575,
					["from"] = "我给你跪下了",
					["msg"] = "先冲下均线",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640500577,
					["from"] = "我给你跪下了",
					["msg"] = "军衔",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640500587,
					["from"] = "特变电工",
					["msg"] = "不影响把",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640500605,
					["from"] = "我给你跪下了",
					["msg"] = "就怕团本坐牢",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640500622,
					["from"] = "特变电工",
					["msg"] = "你多少军衔了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640500626,
					["from"] = "我给你跪下了",
					["msg"] = "7",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640500638,
					["from"] = "特变电工",
					["msg"] = "还好。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640500655,
					["from"] = "特变电工",
					["msg"] = "我现在3",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1640500656,
					["from"] = "特变电工",
					["msg"] = ".。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1640500659,
					["from"] = "特变电工",
					["msg"] = "慢慢来",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1640500673,
					["from"] = "特变电工",
					["msg"] = "战场阿拉希或者战场速度块",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1640500676,
					["from"] = "特变电工",
					["msg"] = "荣誉多",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1640500684,
					["from"] = "我给你跪下了",
					["msg"] = "但是我菜啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1640500686,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1640500686,
					["from"] = "特变电工",
					["msg"] = "找人单挑",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1640500694,
					["from"] = "特变电工",
					["msg"] = "等我T0.5 我就去找人单挑",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1640500697,
					["from"] = "特变电工",
					["msg"] = "奥山也可以",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1640500702,
					["from"] = "特变电工",
					["msg"] = "一个380",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1640500704,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1640500708,
					["from"] = "我给你跪下了",
					["msg"] = "我要是厉害直接野外单吃一天",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1640500716,
					["from"] = "我给你跪下了",
					["msg"] = "这不没那实力",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1640500720,
					["from"] = "特变电工",
					["msg"] = "奥山全荣誉下来一场才吃3000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1640500731,
					["from"] = "我给你跪下了",
					["msg"] = "是的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1640500732,
					["from"] = "特变电工",
					["msg"] = "你单挑找人砍几个人就起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1640500751,
					["from"] = "我给你跪下了",
					["msg"] = "我很怕战士 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1640500754,
					["from"] = "特变电工",
					["msg"] = "我以前经常在奥山别人复活口砍人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1640500754,
					["from"] = "我给你跪下了",
					["msg"] = "不会打他",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1640500757,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1640500767,
					["from"] = "我给你跪下了",
					["msg"] = "两刀人没了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1640500767,
					["from"] = "特变电工",
					["msg"] = "你就砍猎人 治疗",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1640500824,
					["from"] = "我给你跪下了",
					["msg"] = "我就奥山跟着混 ",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1640500831,
					["from"] = "我给你跪下了",
					["msg"] = "一切看队友",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1640501154,
					["from"] = "特变电工",
					["msg"] = "拉人",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1640506249,
					["from"] = "特变电工",
					["msg"] = "通灵你毕业了没",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1640506253,
					["from"] = "我给你跪下了",
					["msg"] = "毕业了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1640506256,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1640506259,
					["from"] = "特变电工",
					["msg"] = "T0.5全毕业了啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1640506261,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈 你差啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1640506269,
					["from"] = "我给你跪下了",
					["msg"] = "没 再买个衣服",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [83]
				{
					["type"] = 1,
					["time"] = 1640506271,
					["from"] = "特变电工",
					["msg"] = "我通灵还没打",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [84]
				{
					["type"] = 1,
					["time"] = 1640506276,
					["from"] = "特变电工",
					["msg"] = "黑上",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [85]
				{
					["type"] = 1,
					["time"] = 1640506285,
					["from"] = "我给你跪下了",
					["msg"] = "是的 团多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [86]
				{
					["type"] = 1,
					["time"] = 1640506290,
					["from"] = "我给你跪下了",
					["msg"] = "最好弄",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [87]
				{
					["type"] = 1,
					["time"] = 1640506347,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [88]
				{
					["type"] = 1,
					["time"] = 1640507152,
					["from"] = "特变电工",
					["msg"] = "我去交灭火任务",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [89]
				{
					["type"] = 1,
					["time"] = 1640507159,
					["from"] = "特变电工",
					["msg"] = "特别远",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [90]
				{
					["type"] = 1,
					["time"] = 1640507175,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [91]
				{
					["type"] = 1,
					["time"] = 1640507244,
					["from"] = "我给你跪下了",
					["msg"] = "你有大马还好 我小马都不做那个",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [92]
				{
					["type"] = 1,
					["time"] = 1640507251,
					["from"] = "我给你跪下了",
					["msg"] = "等着别人灭",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [93]
				{
					["type"] = 1,
					["time"] = 1640507260,
					["from"] = "特变电工",
					["msg"] = "整一个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [94]
				{
					["type"] = 1,
					["time"] = 1640508540,
					["from"] = "特变电工",
					["msg"] = "我还就不信了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [95]
				{
					["type"] = 1,
					["time"] = 1640508545,
					["from"] = "特变电工",
					["msg"] = "我又去了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [96]
				{
					["type"] = 1,
					["time"] = 1640508548,
					["from"] = "特变电工",
					["msg"] = "一库一库",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [97]
				{
					["type"] = 1,
					["time"] = 1640508550,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [98]
				{
					["type"] = 1,
					["time"] = 1640508560,
					["from"] = "我给你跪下了",
					["msg"] = "等等我",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [99]
				{
					["type"] = 1,
					["time"] = 1640508569,
					["from"] = "特变电工",
					["msg"] = "？",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [100]
				{
					["type"] = 1,
					["time"] = 1640508575,
					["from"] = "特变电工",
					["msg"] = "你没需求了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [101]
				{
					["type"] = 1,
					["time"] = 1640508580,
					["from"] = "我给你跪下了",
					["msg"] = "我去看你手黑",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [102]
				{
					["type"] = 1,
					["time"] = 1640508582,
					["from"] = "特变电工",
					["msg"] = "就不耽误你时间了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [103]
				{
					["type"] = 1,
					["time"] = 1640508585,
					["from"] = "特变电工",
					["msg"] = "我们已经满了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [104]
				{
					["type"] = 1,
					["time"] = 1640508589,
					["from"] = "我给你跪下了",
					["msg"] = "好吧",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [105]
				{
					["type"] = 1,
					["time"] = 1640508597,
					["from"] = "我给你跪下了",
					["msg"] = "祝你出腿",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [106]
				{
					["type"] = 1,
					["time"] = 1640508609,
					["from"] = "特变电工",
					["msg"] = "等我T0.5出了 我们两个去奥山砍人刷荣誉",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [107]
				{
					["type"] = 1,
					["time"] = 1640508622,
					["from"] = "我给你跪下了",
					["msg"] = "我只能OB 砍人还是得你来",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [108]
				{
					["type"] = 1,
					["time"] = 1640511170,
					["from"] = "特变电工",
					["msg"] = "要出货了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [109]
				{
					["type"] = 1,
					["time"] = 1640511177,
					["from"] = "我给你跪下了",
					["msg"] = "我信了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [110]
				{
					["type"] = 1,
					["time"] = 1640511232,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16687::::::::60:::::::::|h[博学者护腿]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [111]
				{
					["type"] = 1,
					["time"] = 1640511234,
					["from"] = "特变电工",
					["msg"] = "#$%^&*!@#$%^",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [112]
				{
					["type"] = 1,
					["time"] = 1640511244,
					["from"] = "我给你跪下了",
					["msg"] = "下一把",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [113]
				{
					["type"] = 1,
					["time"] = 1640511253,
					["from"] = "我给你跪下了",
					["msg"] = "要卡死你",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [114]
				{
					["type"] = 1,
					["time"] = 1640511346,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [115]
				{
					["type"] = 1,
					["time"] = 1640511366,
					["from"] = "特变电工",
					["msg"] = "我把好运都用在了黑上了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [116]
				{
					["type"] = 1,
					["time"] = 1640511369,
					["from"] = "特变电工",
					["msg"] = "5把毕业",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [117]
				{
					["type"] = 1,
					["time"] = 1640511372,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [118]
				{
					["type"] = 1,
					["time"] = 1640511396,
					["from"] = "我给你跪下了",
					["msg"] = "快了 20把应该可以了 还差几把",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [119]
				{
					["type"] = 1,
					["time"] = 1640514067,
					["from"] = "特变电工",
					["msg"] = "我又要准备摸奖了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [120]
				{
					["type"] = 1,
					["time"] = 1640514069,
					["from"] = "特变电工",
					["msg"] = "兄弟们",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [121]
				{
					["type"] = 1,
					["time"] = 1640514087,
					["from"] = "我给你跪下了",
					["msg"] = "提前恭喜",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [122]
				{
					["type"] = 1,
					["time"] = 1640514087,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 瑞文戴尔男爵交战，（当前99%，5/5存活）",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [123]
				{
					["type"] = 1,
					["time"] = 1640514130,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 瑞文戴尔男爵的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [124]
				{
					["type"] = 1,
					["time"] = 1640514142,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16709::::::::60:::::::::|h[迅影短裤]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [125]
				{
					["type"] = 1,
					["time"] = 1640514145,
					["from"] = "特变电工",
					["msg"] = "擦#$%^&*",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [126]
				{
					["type"] = 1,
					["time"] = 1640514154,
					["from"] = "我给你跪下了",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [127]
				{
					["type"] = 1,
					["time"] = 1640514311,
					["from"] = "特变电工",
					["msg"] = "送走一个盗贼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [128]
				{
					["type"] = 1,
					["time"] = 1640514332,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈 其他所有职业都可以得到他们想要的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [129]
				{
					["type"] = 1,
					["time"] = 1640514337,
					["from"] = "我给你跪下了",
					["msg"] = "除了你",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [130]
				{
					["type"] = 1,
					["time"] = 1640514342,
					["from"] = "特变电工",
					["msg"] = "你见过战士的马",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [131]
				{
					["type"] = 1,
					["time"] = 1640514349,
					["from"] = "我给你跪下了",
					["msg"] = "好像没有",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [132]
				{
					["type"] = 1,
					["time"] = 1640514352,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [133]
				{
					["type"] = 1,
					["time"] = 1640514354,
					["from"] = "我给你跪下了",
					["msg"] = "我刷了十几次",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [134]
				{
					["type"] = 1,
					["time"] = 1640514360,
					["from"] = "特变电工",
					["msg"] = "这个BOSs到底出不出",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [135]
				{
					["type"] = 1,
					["time"] = 1640514361,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [136]
				{
					["type"] = 1,
					["time"] = 1640515637,
					["from"] = "特变电工",
					["msg"] = "阿拉希拉你出来",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [137]
				{
					["type"] = 1,
					["time"] = 1640515644,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [138]
				{
					["type"] = 1,
					["time"] = 1640515650,
					["from"] = "我给你跪下了",
					["msg"] = "不去了 我不会打",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [139]
				{
					["type"] = 1,
					["time"] = 1640515654,
					["from"] = "我给你跪下了",
					["msg"] = "你搞吧",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [140]
				{
					["type"] = 1,
					["time"] = 1640515656,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [141]
				{
					["type"] = 1,
					["time"] = 1640515657,
					["from"] = "特变电工",
					["msg"] = "好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [142]
				{
					["type"] = 1,
					["time"] = 1640515677,
					["from"] = "我给你跪下了",
					["msg"] = "不刷腿了？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [143]
				{
					["type"] = 1,
					["time"] = 1640515844,
					["from"] = "特变电工",
					["msg"] = "我在找MC",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [144]
				{
					["type"] = 1,
					["time"] = 1640515870,
					["from"] = "我给你跪下了",
					["msg"] = "拿个第一补贴",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [145]
				{
					["type"] = 1,
					["time"] = 1640515874,
					["from"] = "我给你跪下了",
					["msg"] = "加油",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [146]
				{
					["type"] = 1,
					["time"] = 1640515878,
					["from"] = "特变电工",
					["msg"] = "很简单",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [147]
				{
					["type"] = 1,
					["time"] = 1640515917,
					["from"] = "我给你跪下了",
					["msg"] = "确实 你这伤害很高",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [148]
				{
					["type"] = 1,
					["time"] = 1640515928,
					["from"] = "特变电工",
					["msg"] = "我打黑龙OT了第一次",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [149]
				{
					["type"] = 1,
					["time"] = 1640515929,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [150]
				{
					["type"] = 1,
					["time"] = 1640515933,
					["from"] = "特变电工",
					["msg"] = "差点被飞出去了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [151]
				{
					["type"] = 1,
					["time"] = 1640515958,
					["from"] = "我给你跪下了",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [152]
				{
					["type"] = 1,
					["time"] = 1640515982,
					["from"] = "特变电工",
					["msg"] = "我自己写的WA字符串 无脑跟着打",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [153]
				{
					["type"] = 1,
					["time"] = 1640516014,
					["from"] = "我给你跪下了",
					["msg"] = "还是盗贼简单 就一个技能",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [154]
				{
					["type"] = 1,
					["time"] = 1640519323,
					["from"] = "特变电工",
					["msg"] = "我去mc起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [155]
				{
					["type"] = 1,
					["time"] = 1640519327,
					["from"] = "我给你跪下了",
					["msg"] = "好的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [156]
				{
					["type"] = 1,
					["time"] = 1640537682,
					["from"] = "特变电工",
					["msg"] = "打完了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [157]
				{
					["type"] = 1,
					["time"] = 1640537689,
					["from"] = "特变电工",
					["msg"] = "1-8",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [158]
				{
					["type"] = 1,
					["time"] = 1640537697,
					["from"] = "我给你跪下了",
					["msg"] = "这么久",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [159]
				{
					["type"] = 1,
					["time"] = 1640537698,
					["from"] = "特变电工",
					["msg"] = "1-6我都是第一名 大幅领先",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [160]
				{
					["type"] = 1,
					["time"] = 1640537718,
					["from"] = "特变电工",
					["msg"] = "结果老7 我的坦开场暴毙 我也死了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [161]
				{
					["type"] = 1,
					["time"] = 1640537721,
					["from"] = "特变电工",
					["msg"] = "全程地板",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [162]
				{
					["type"] = 1,
					["time"] = 1640537726,
					["from"] = "我给你跪下了",
					["msg"] = "。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [163]
				{
					["type"] = 1,
					["time"] = 1640537746,
					["from"] = "特变电工",
					["msg"] = "太难了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [164]
				{
					["type"] = 1,
					["time"] = 1640537750,
					["from"] = "特变电工",
					["msg"] = "全程合剂",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [165]
				{
					["type"] = 1,
					["time"] = 1640537753,
					["from"] = "我给你跪下了",
					["msg"] = "时间太长了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [166]
				{
					["type"] = 1,
					["time"] = 1640537761,
					["from"] = "特变电工",
					["msg"] = "比之前麻烦多了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [167]
				{
					["type"] = 1,
					["time"] = 1640537772,
					["from"] = "我给你跪下了",
					["msg"] = "几点开打的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [168]
				{
					["type"] = 1,
					["time"] = 1640537777,
					["from"] = "特变电工",
					["msg"] = "8点",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [169]
				{
					["type"] = 1,
					["time"] = 1640537790,
					["from"] = "我给你跪下了",
					["msg"] = "5个小时了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [170]
				{
					["type"] = 1,
					["time"] = 1640537802,
					["from"] = "特变电工",
					["msg"] = "我继续斯坦索姆",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [171]
				{
					["type"] = 1,
					["time"] = 1640537807,
					["from"] = "特变电工",
					["msg"] = "!@#$%^",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [172]
				{
					["type"] = 1,
					["time"] = 1640537809,
					["from"] = "特变电工",
					["msg"] = "我就不行了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [173]
				{
					["type"] = 1,
					["time"] = 1640537820,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈 MC出你用的没",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [174]
				{
					["type"] = 1,
					["time"] = 1640537825,
					["from"] = "特变电工",
					["msg"] = "没",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [175]
				{
					["type"] = 1,
					["time"] = 1640537829,
					["from"] = "特变电工",
					["msg"] = "防战的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [176]
				{
					["type"] = 1,
					["time"] = 1640537832,
					["from"] = "特变电工",
					["msg"] = "出碧空了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [177]
				{
					["type"] = 1,
					["time"] = 1640537834,
					["from"] = "特变电工",
					["msg"] = "4000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [178]
				{
					["type"] = 1,
					["time"] = 1640537839,
					["from"] = "特变电工",
					["msg"] = "一个人分了352",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [179]
				{
					["type"] = 1,
					["time"] = 1640537903,
					["from"] = "特变电工",
					["msg"] = "只有一个人能灭火",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [180]
				{
					["type"] = 1,
					["time"] = 1640537940,
					["from"] = "我给你跪下了",
					["msg"] = "没人愿意做那个额 麻烦",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [181]
				{
					["type"] = 1,
					["time"] = 1640537949,
					["from"] = "我给你跪下了",
					["msg"] = "还好了 能分点钱",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [182]
				{
					["type"] = 1,
					["time"] = 1640537999,
					["from"] = "我给你跪下了",
					["msg"] = "你们灭过吗 还是一次过",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [183]
				{
					["type"] = 1,
					["time"] = 1640615249,
					["from"] = "特变电工",
					["msg"] = "马上开奖",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [184]
				{
					["type"] = 1,
					["time"] = 1640615251,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [185]
				{
					["type"] = 1,
					["time"] = 1640615253,
					["from"] = "特变电工",
					["msg"] = "第20次",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [186]
				{
					["type"] = 1,
					["time"] = 1640615275,
					["from"] = "我给你跪下了",
					["msg"] = "快摸",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [187]
				{
					["type"] = 1,
					["time"] = 1640615275,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 瑞文戴尔男爵交战，（当前94%，5/5存活）",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [188]
				{
					["type"] = 1,
					["time"] = 1640615318,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 瑞文戴尔男爵的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [189]
				{
					["type"] = 1,
					["time"] = 1640615343,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16687::::::::60:::::::::|h[博学者护腿]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [190]
				{
					["type"] = 1,
					["time"] = 1640615358,
					["from"] = "我给你跪下了",
					["msg"] = "这。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [191]
				{
					["type"] = 1,
					["time"] = 1640615362,
					["from"] = "我给你跪下了",
					["msg"] = "20次不出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [192]
				{
					["type"] = 1,
					["time"] = 1640617752,
					["from"] = "特变电工",
					["msg"] = "又要摸奖了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [193]
				{
					["type"] = 1,
					["time"] = 1640617754,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [194]
				{
					["type"] = 1,
					["time"] = 1640617864,
					["from"] = "我给你跪下了",
					["msg"] = "没事 马上了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [195]
				{
					["type"] = 1,
					["time"] = 1640617872,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [196]
				{
					["type"] = 1,
					["time"] = 1640617894,
					["from"] = "我给你跪下了",
					["msg"] = "再来20次 我觉得可以出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [197]
				{
					["type"] = 1,
					["time"] = 1640617894,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与普通 - 瑞文戴尔男爵交战，（当前87%，5/5存活）",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [198]
				{
					["type"] = 1,
					["time"] = 1640617935,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工已在普通 - 瑞文戴尔男爵的战斗中取得胜利！",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [199]
				{
					["type"] = 1,
					["time"] = 1640617942,
					["from"] = "特变电工",
					["msg"] = "|cff0070dd|Hitem:16728::::::::60:::::::::|h[光铸腿铠]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [200]
				{
					["type"] = 1,
					["time"] = 1640617958,
					["from"] = "我给你跪下了",
					["msg"] = "不亏 这个也不好出",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [201]
				{
					["type"] = 1,
					["time"] = 1640617961,
					["from"] = "我给你跪下了",
					["msg"] = "我只见过一次",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [202]
				{
					["type"] = 1,
					["time"] = 1640617966,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [203]
				{
					["type"] = 1,
					["time"] = 1640618060,
					["from"] = "特变电工",
					["msg"] = "我想删号",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [204]
				{
					["type"] = 1,
					["time"] = 1640618061,
					["from"] = "特变电工",
					["msg"] = "真的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [205]
				{
					["type"] = 1,
					["time"] = 1640618072,
					["from"] = "我给你跪下了",
					["msg"] = "耐心",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [206]
				{
					["type"] = 1,
					["time"] = 1640618084,
					["from"] = "我给你跪下了",
					["msg"] = "在刷他一个月又怎么样",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [207]
				{
					["type"] = 1,
					["time"] = 1640619925,
					["from"] = "我给你跪下了",
					["msg"] = "你还在斯坦索姆。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [208]
				{
					["type"] = 1,
					["time"] = 1640952464,
					["from"] = "特变电工",
					["msg"] = "我已经彻底毕业",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [209]
				{
					["type"] = 1,
					["time"] = 1640952481,
					["from"] = "我给你跪下了",
					["msg"] = "只差团本了？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [210]
				{
					["type"] = 1,
					["time"] = 1640952490,
					["from"] = "特变电工",
					["msg"] = "还有胡里奥",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [211]
				{
					["type"] = 1,
					["time"] = 1640952506,
					["from"] = "我给你跪下了",
					["msg"] = "那个好弄",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [212]
				{
					["type"] = 1,
					["time"] = 1640952510,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [213]
				{
					["type"] = 1,
					["time"] = 1640952523,
					["from"] = "特变电工",
					["msg"] = "我一把奥山砍人荣誉都有4000",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [214]
				{
					["type"] = 1,
					["time"] = 1640952532,
					["from"] = "特变电工",
					["msg"] = "找人单挑",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [215]
				{
					["type"] = 1,
					["time"] = 1640952536,
					["from"] = "特变电工",
					["msg"] = "一个300",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [216]
				{
					["type"] = 1,
					["time"] = 1640952542,
					["from"] = "特变电工",
					["msg"] = "一场砍10几个",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [217]
				{
					["type"] = 1,
					["time"] = 1640952557,
					["from"] = "我给你跪下了",
					["msg"] = "去哪砍",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [218]
				{
					["type"] = 1,
					["time"] = 1640952574,
					["from"] = "特变电工",
					["msg"] = "看时机",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [219]
				{
					["type"] = 1,
					["time"] = 1640952586,
					["from"] = "特变电工",
					["msg"] = "比如他们营地门口大树后面蹲",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [220]
				{
					["type"] = 1,
					["time"] = 1640952599,
					["from"] = "特变电工",
					["msg"] = "比如他们墓地前蹲复活的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [221]
				{
					["type"] = 1,
					["time"] = 1640952615,
					["from"] = "特变电工",
					["msg"] = "队列后面落单的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [222]
				{
					["type"] = 1,
					["time"] = 1640952631,
					["from"] = "我给你跪下了",
					["msg"] = "可以 一天能刷好多",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [223]
				{
					["type"] = 1,
					["time"] = 1640952643,
					["from"] = "特变电工",
					["msg"] = "我就无聊打打",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [224]
				{
					["type"] = 1,
					["time"] = 1640952684,
					["from"] = "我给你跪下了",
					["msg"] = "狂暴战有点脆感觉",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [225]
				{
					["type"] = 1,
					["time"] = 1640952692,
					["from"] = "我给你跪下了",
					["msg"] = "没有武器狠",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [226]
				{
					["type"] = 1,
					["time"] = 1640952884,
					["from"] = "我给你跪下了",
					["msg"] = "你0.5做到哪一步了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [227]
				{
					["type"] = 1,
					["time"] = 1640953066,
					["from"] = "特变电工",
					["msg"] = "刚做到脚",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [228]
				{
					["type"] = 1,
					["time"] = 1640953079,
					["from"] = "特变电工",
					["msg"] = "我等武器有了打武器战",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [229]
				{
					["type"] = 1,
					["time"] = 1640954218,
					["from"] = "特变电工",
					["msg"] = "&*!@#$%^&",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [230]
				{
					["type"] = 1,
					["time"] = 1640954222,
					["from"] = "特变电工",
					["msg"] = "不能打阿拉希和战歌",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [231]
				{
					["type"] = 1,
					["time"] = 1640954225,
					["from"] = "特变电工",
					["msg"] = "全是国家队",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [232]
				{
					["type"] = 1,
					["time"] = 1640954229,
					["from"] = "特变电工",
					["msg"] = "对面一群元帅",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [233]
				{
					["type"] = 1,
					["time"] = 1640954254,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈 是啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [234]
				{
					["type"] = 1,
					["time"] = 1640954259,
					["from"] = "特变电工",
					["msg"] = "我才法系",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [235]
				{
					["type"] = 1,
					["time"] = 1640954261,
					["from"] = "特变电工",
					["msg"] = "发i西安",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [236]
				{
					["type"] = 1,
					["time"] = 1640954264,
					["from"] = "特变电工",
					["msg"] = "发现",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [237]
				{
					["type"] = 1,
					["time"] = 1640954280,
					["from"] = "我给你跪下了",
					["msg"] = "他们冲军衔最后一周了大概 快14了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [238]
				{
					["type"] = 1,
					["time"] = 1640954357,
					["from"] = "特变电工",
					["msg"] = "我在战歌捣乱",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [239]
				{
					["type"] = 1,
					["time"] = 1640954368,
					["from"] = "特变电工",
					["msg"] = "拿他们棋子 放3楼",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [240]
				{
					["type"] = 1,
					["time"] = 1640954385,
					["from"] = "我给你跪下了",
					["msg"] = "战歌我去过一次 直接0荣誉出场了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [241]
				{
					["type"] = 1,
					["time"] = 1640954387,
					["from"] = "我给你跪下了",
					["msg"] = "哈哈",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [242]
				{
					["type"] = 1,
					["time"] = 1641016164,
					["from"] = "特变电工",
					["msg"] = "灰烬使者",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [243]
				{
					["type"] = 1,
					["time"] = 1641016169,
					["from"] = "特变电工",
					["msg"] = "灰烬公爵",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [244]
				{
					["type"] = 1,
					["time"] = 1641016169,
					["from"] = "我给你跪下了",
					["msg"] = "啥",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [245]
				{
					["type"] = 1,
					["time"] = 1641016174,
					["from"] = "特变电工",
					["msg"] = "我去做T0.5任务了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [246]
				{
					["type"] = 1,
					["time"] = 1641016184,
					["from"] = "我给你跪下了",
					["msg"] = "好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [247]
				{
					["type"] = 1,
					["time"] = 1641016194,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [248]
				{
					["type"] = 1,
					["time"] = 1641016199,
					["from"] = "特变电工",
					["msg"] = "你做到哪一步了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [249]
				{
					["type"] = 1,
					["time"] = 1641016204,
					["from"] = "我给你跪下了",
					["msg"] = "没做呢",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [250]
				{
					["type"] = 1,
					["time"] = 1641016215,
					["from"] = "特变电工",
					["msg"] = "黑上胸也出了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [251]
				{
					["type"] = 1,
					["time"] = 1641016221,
					["from"] = "我给你跪下了",
					["msg"] = "没 没去呢",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [252]
				{
					["type"] = 1,
					["time"] = 1641016266,
					["from"] = "我给你跪下了",
					["msg"] = "我看战士的4件套不猛啊好像",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [253]
				{
					["type"] = 1,
					["time"] = 1641016284,
					["from"] = "特变电工",
					["msg"] = "猛",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [254]
				{
					["type"] = 1,
					["time"] = 1641016298,
					["from"] = "特变电工",
					["msg"] = "|cffa335ee|Hitem:21995::::::::60:::::::::|h[英勇长靴]|h|r|cffa335ee|Hitem:21998::::::::60:::::::::|h[英勇护手]|h|r|cffa335ee|Hitem:21999::::::::60:::::::::|h[英勇头盔]|h|r|cffa335ee|Hitem:21997::::::::60:::::::::|h[英勇胸甲]|h|r",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [255]
				{
					["type"] = 1,
					["time"] = 1641016337,
					["from"] = "我给你跪下了",
					["msg"] = "单件可以 套装效果回血是PVP的吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [256]
				{
					["type"] = 1,
					["time"] = 1641016371,
					["from"] = "特变电工",
					["msg"] = "本来就i是PVP",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [257]
				{
					["type"] = 1,
					["time"] = 1641016376,
					["from"] = "特变电工",
					["msg"] = "PVE就一个鞋",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [258]
				{
					["type"] = 1,
					["time"] = 1641016380,
					["from"] = "特变电工",
					["msg"] = "我拿来砍人的",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [259]
				{
					["type"] = 1,
					["time"] = 1641016384,
					["from"] = "我给你跪下了",
					["msg"] = "比军装还猛吗",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [260]
				{
					["type"] = 1,
					["time"] = 1641016390,
					["from"] = "特变电工",
					["msg"] = "R10好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [261]
				{
					["type"] = 1,
					["time"] = 1641016397,
					["from"] = "特变电工",
					["msg"] = "没有R13好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [262]
				{
					["type"] = 1,
					["time"] = 1641016412,
					["from"] = "特变电工",
					["msg"] = ">r10 <r13",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [263]
				{
					["type"] = 1,
					["time"] = 1641016418,
					["from"] = "我给你跪下了",
					["msg"] = "那不刷个r13？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [264]
				{
					["type"] = 1,
					["time"] = 1641016423,
					["from"] = "特变电工",
					["msg"] = "慢慢来啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [265]
				{
					["type"] = 1,
					["time"] = 1641016430,
					["from"] = "特变电工",
					["msg"] = "我没啥时间",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [266]
				{
					["type"] = 1,
					["time"] = 1641016438,
					["from"] = "特变电工",
					["msg"] = "到时候直接TAQ T2.5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [267]
				{
					["type"] = 1,
					["time"] = 1641016442,
					["from"] = "我给你跪下了",
					["msg"] = "那也是 r13太肝了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [268]
				{
					["type"] = 1,
					["time"] = 1641016448,
					["from"] = "特变电工",
					["msg"] = "比R13好",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [269]
				{
					["type"] = 1,
					["time"] = 1641016486,
					["from"] = "我给你跪下了",
					["msg"] = "我算了算好像要很久我才能到r11",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [270]
				{
					["type"] = 1,
					["time"] = 1641016494,
					["from"] = "特变电工",
					["msg"] = "我军衔就打着玩",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [271]
				{
					["type"] = 1,
					["time"] = 1641016496,
					["from"] = "特变电工",
					["msg"] = "随缘",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [272]
				{
					["type"] = 1,
					["time"] = 1641016504,
					["from"] = "我给你跪下了",
					["msg"] = "擦 又不能放弃 不然之前白打",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [273]
				{
					["type"] = 1,
					["time"] = 1641016520,
					["from"] = "特变电工",
					["msg"] = "赌徒效应",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [274]
				{
					["type"] = 1,
					["time"] = 1641016523,
					["from"] = "特变电工",
					["msg"] = "你现在陷入了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [275]
				{
					["type"] = 1,
					["time"] = 1641016536,
					["from"] = "我给你跪下了",
					["msg"] = "哎",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [276]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为所有数据",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [277]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  959,521 (!@#.7, 5.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [278]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "2. |cfffff468Naq|r  945,715 (424.6, 5.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [279]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "3. |cfffff468别惹我|r  939,829 (423.3, 5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [280]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "4. |cffc69b6d追风中年|r  896,813 (496.3, 4.8%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [281]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "5. |cff3fc6ea宝石大哥|r  892,979 (788.7, 4.8%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [282]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "6. |cff3fc6ea银叶草丶|r  862,069 (701.9, 4.6%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [283]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "7. |cff3fc6ea吧唧|r  817,193 ($%^.6, 4.4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [284]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "8. |cffc69b6d芜湖小司马|r  805,527 (407.0, 4.3%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [285]
				{
					["type"] = 1,
					["time"] = 1641106627,
					["from"] = "特变电工",
					["msg"] = "9. |cffaad372夏虫不可语冰|r  796,424 (486.1, 4.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [286]
				{
					["type"] = 1,
					["time"] = 1641106637,
					["from"] = "特变电工",
					["msg"] = "10. |cff3fc6ea杰克信仰|r  773,080 (701.6, 4.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [287]
				{
					["type"] = 1,
					["time"] = 1641106686,
					["from"] = "特变电工",
					["msg"] = "轻松第一啊",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [288]
				{
					["type"] = 1,
					["time"] = 1641106688,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [289]
				{
					["type"] = 1,
					["time"] = 1641106795,
					["from"] = "我给你跪下了",
					["msg"] = "老几了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [290]
				{
					["type"] = 1,
					["time"] = 1641106810,
					["from"] = "特变电工",
					["msg"] = "出稳固 迅疾了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [291]
				{
					["type"] = 1,
					["time"] = 1641106812,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [292]
				{
					["type"] = 1,
					["time"] = 1641106814,
					["from"] = "特变电工",
					["msg"] = "5",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [293]
				{
					["type"] = 1,
					["time"] = 1641106838,
					["from"] = "我给你跪下了",
					["msg"] = "可以 直接拿下了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [294]
				{
					["type"] = 1,
					["time"] = 1641106847,
					["from"] = "特变电工",
					["msg"] = "我身上只有3600",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [295]
				{
					["type"] = 1,
					["time"] = 1641106887,
					["from"] = "我给你跪下了",
					["msg"] = "应该可以",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [296]
				{
					["type"] = 1,
					["time"] = 1641106900,
					["from"] = "特变电工",
					["msg"] = "我T0.5最后一步了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [297]
				{
					["type"] = 1,
					["time"] = 1641106924,
					["from"] = "我给你跪下了",
					["msg"] = "黑上？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [298]
				{
					["type"] = 1,
					["time"] = 1641106929,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [299]
				{
					["type"] = 1,
					["time"] = 1641106941,
					["from"] = "我给你跪下了",
					["msg"] = "牛 很快啊",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [300]
				{
					["type"] = 1,
					["time"] = 1641106953,
					["from"] = "特变电工",
					["msg"] = "可以去砍人了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [301]
				{
					["type"] = 1,
					["time"] = 1641106995,
					["from"] = "我给你跪下了",
					["msg"] = "起飞了",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [302]
				{
					["type"] = 1,
					["time"] = 1641106995,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工正在与40人 - 迦顿男爵交战，（当前95%，40/40存活）",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [303]
				{
					["type"] = 1,
					["time"] = 1641107175,
					["from"] = "特变电工",
					["msg"] = "<DBM> 特变电工在40人 - 迦顿男爵（49%）的战斗中灭团了。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [304]
				{
					["type"] = 1,
					["time"] = 1641109274,
					["from"] = "特变电工",
					["msg"] = "1700",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [305]
				{
					["type"] = 1,
					["time"] = 1641109288,
					["from"] = "我给你跪下了",
					["msg"] = "迅击？",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [306]
				{
					["type"] = 1,
					["time"] = 1641109291,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [307]
				{
					["type"] = 1,
					["time"] = 1641109292,
					["from"] = "特变电工",
					["msg"] = "我买了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [308]
				{
					["type"] = 1,
					["time"] = 1641109293,
					["from"] = "特变电工",
					["msg"] = "还可以",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [309]
				{
					["type"] = 1,
					["time"] = 1641109299,
					["from"] = "我给你跪下了",
					["msg"] = "还好",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [310]
				{
					["type"] = 1,
					["time"] = 1641109306,
					["from"] = "特变电工",
					["msg"] = "PVP也可以",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [311]
				{
					["type"] = 1,
					["time"] = 1641109311,
					["from"] = "我给你跪下了",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [312]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "Recount - 伤害输出为所有数据",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [313]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "1. |cffc69b6d特变电工|r  1,745,729 (432.2, 5.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [314]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "2. |cffc69b6d追风中年|r  1,672,742 (492.5, 5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [315]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "3. |cfffff468Naq|r  1,576,020 (393.5, 4.7%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [316]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "4. |cff3fc6ea宝石大哥|r  1,533,764 (676.3, 4.5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [317]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "5. |cff3fc6ea吧唧|r  1,531,380 (636.8, 4.5%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [318]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "6. |cffaad372夏虫不可语冰|r  1,478,549 (451.9, 4.4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [319]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "7. |cffc69b6d芜湖小司马|r  1,413,878 (377.6, 4.2%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [320]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "8. |cff3fc6ea杰克信仰|r  1,386,921 (618.2, 4.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [321]
				{
					["type"] = 1,
					["time"] = 1641115369,
					["from"] = "特变电工",
					["msg"] = "9. |cfffff468别惹我|r  1,385,105 (421.7, 4.1%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [322]
				{
					["type"] = 1,
					["time"] = 1641115379,
					["from"] = "特变电工",
					["msg"] = "10. |cfffff468骚气贼|r  1,362,430 (369.1, 4%)",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [323]
				{
					["type"] = 1,
					["time"] = 1641115379,
					["from"] = "特变电工",
					["msg"] = "1-9总伤害",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [324]
				{
					["type"] = 1,
					["time"] = 1641115407,
					["from"] = "我给你跪下了",
					["msg"] = "牛",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [325]
				{
					["type"] = 1,
					["time"] = 1641115413,
					["from"] = "我给你跪下了",
					["msg"] = "有点狠",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [326]
				{
					["type"] = 1,
					["time"] = 1641115424,
					["from"] = "特变电工",
					["msg"] = "后面都没吃药了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [327]
				{
					["type"] = 1,
					["time"] = 1641115501,
					["from"] = "我给你跪下了",
					["msg"] = "这伤害有点厉害",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [328]
				{
					["type"] = 1,
					["time"] = 1641115511,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [329]
				{
					["type"] = 1,
					["time"] = 1641115514,
					["from"] = "特变电工",
					["msg"] = "基本$%^作",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [330]
				{
					["type"] = 1,
					["time"] = 1641115521,
					["from"] = "特变电工",
					["msg"] = "都坐下",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [331]
				{
					["type"] = 1,
					["time"] = 1641115521,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [332]
				{
					["type"] = 1,
					["time"] = 1641115522,
					["from"] = "我给你跪下了",
					["msg"] = "主要现在第一阶段",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [333]
				{
					["type"] = 1,
					["time"] = 1641115531,
					["from"] = "我给你跪下了",
					["msg"] = "狂暴战第一可以的",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [334]
				{
					["type"] = 1,
					["time"] = 1641140308,
					["from"] = "特变电工",
					["msg"] = "我!@#$%^要吐了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [335]
				{
					["type"] = 1,
					["time"] = 1641140311,
					["from"] = "特变电工",
					["msg"] = "通灵",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [336]
				{
					["type"] = 1,
					["time"] = 1641229779,
					["from"] = "我给你跪下了",
					["msg"] = "还没睡",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [337]
				{
					["type"] = 1,
					["time"] = 1641229786,
					["from"] = "特变电工",
					["msg"] = "起飞了",
					["inbound"] = false,
					["convo"] = "我给你跪下了",
				}, -- [338]
				{
					["type"] = 1,
					["time"] = 1641229804,
					["from"] = "我给你跪下了",
					["msg"] = "。。。",
					["inbound"] = true,
					["convo"] = "我给你跪下了",
				}, -- [339]
				["info"] = {
				},
			},
			["社区送温暖"] = {
				{
					["type"] = 1,
					["time"] = 1640435153,
					["from"] = "社区送温暖",
					["msg"] = "最近新能源崩了啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640435263,
					["from"] = "特变电工",
					["msg"] = "是啊",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640435268,
					["from"] = "特变电工",
					["msg"] = "我還好",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640435281,
					["from"] = "特变电工",
					["msg"] = "股票漲漲跌跌很正常",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640435285,
					["from"] = "社区送温暖",
					["msg"] = "我之前减了一半还是有点伤",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640435343,
					["from"] = "社区送温暖",
					["msg"] = "看宁德时代像年前茅台一样在崩",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640435539,
					["from"] = "特变电工",
					["msg"] = "死不了人",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640435576,
					["from"] = "特变电工",
					["msg"] = "寧德市值明天超過茅臺",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640882285,
					["from"] = "特变电工",
					["msg"] = "亏惨",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640882293,
					["from"] = "特变电工",
					["msg"] = "2周亏60万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640882295,
					["from"] = "特变电工",
					["msg"] = "毫无压力",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640882328,
					["from"] = "社区送温暖",
					["msg"] = "我今天傻了，忘记清光伏了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640882368,
					["from"] = "社区送温暖",
					["msg"] = "睡过头了，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640882390,
					["from"] = "特变电工",
					["msg"] = "哈哈",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640882396,
					["from"] = "特变电工",
					["msg"] = "那应该快起飞了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640882403,
					["from"] = "社区送温暖",
					["msg"] = "感觉有的跌啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640882404,
					["from"] = "特变电工",
					["msg"] = "内心毫无波兰",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640882407,
					["from"] = "特变电工",
					["msg"] = "都不想看",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [18]
				{
					["type"] = 1,
					["time"] = 1640882419,
					["from"] = "特变电工",
					["msg"] = "你还好没清",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [19]
				{
					["type"] = 1,
					["time"] = 1640882422,
					["from"] = "特变电工",
					["msg"] = "运气是真的好",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [20]
				{
					["type"] = 1,
					["time"] = 1640882428,
					["from"] = "特变电工",
					["msg"] = "你看盘后发改委",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [21]
				{
					["type"] = 1,
					["time"] = 1640882440,
					["from"] = "特变电工",
					["msg"] = "重新提光伏了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [22]
				{
					["type"] = 1,
					["time"] = 1640882465,
					["from"] = "特变电工",
					["msg"] = "快洗完了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [23]
				{
					["type"] = 1,
					["time"] = 1640882471,
					["from"] = "社区送温暖",
					["msg"] = "今天都没起来",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [24]
				{
					["type"] = 1,
					["time"] = 1640882480,
					["from"] = "特变电工",
					["msg"] = "你坚持不住了 大多数散户也跟你一样了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [25]
				{
					["type"] = 1,
					["time"] = 1640882485,
					["from"] = "特变电工",
					["msg"] = "情绪到达了零界点了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [26]
				{
					["type"] = 1,
					["time"] = 1640882486,
					["from"] = "社区送温暖",
					["msg"] = "我分众传媒上赚的都贴光伏了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [27]
				{
					["type"] = 1,
					["time"] = 1640882490,
					["from"] = "特变电工",
					["msg"] = "随时起飞",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [28]
				{
					["type"] = 1,
					["time"] = 1640882508,
					["from"] = "社区送温暖",
					["msg"] = "最近元宇宙太变态了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [29]
				{
					["type"] = 1,
					["time"] = 1640882520,
					["from"] = "社区送温暖",
					["msg"] = "这段时间我便宜一倍多",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [30]
				{
					["type"] = 1,
					["time"] = 1640882590,
					["from"] = "社区送温暖",
					["msg"] = "那我拿到年30前一个礼拜卖，年后看时机在买回来",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [31]
				{
					["type"] = 1,
					["time"] = 1640882605,
					["from"] = "特变电工",
					["msg"] = "我从来不追热点",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [32]
				{
					["type"] = 1,
					["time"] = 1640882616,
					["from"] = "特变电工",
					["msg"] = "A股的元宇宙就是垃圾",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [33]
				{
					["type"] = 1,
					["time"] = 1640882622,
					["from"] = "特变电工",
					["msg"] = "我只买美股的",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [34]
				{
					["type"] = 1,
					["time"] = 1640882633,
					["from"] = "社区送温暖",
					["msg"] = "A股都是炒，一样的",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [35]
				{
					["type"] = 1,
					["time"] = 1640882640,
					["from"] = "社区送温暖",
					["msg"] = "什么基本面都没用",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [36]
				{
					["type"] = 1,
					["time"] = 1640882649,
					["from"] = "特变电工",
					["msg"] = "炒注定要亏钱",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [37]
				{
					["type"] = 1,
					["time"] = 1640882657,
					["from"] = "特变电工",
					["msg"] = "我要炒 要&*!@#$去美股赌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [38]
				{
					["type"] = 1,
					["time"] = 1640882668,
					["from"] = "特变电工",
					["msg"] = "怎么会在A股赌",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [39]
				{
					["type"] = 1,
					["time"] = 1640882674,
					["from"] = "特变电工",
					["msg"] = "期权赌不香吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [40]
				{
					["type"] = 1,
					["time"] = 1640882679,
					["from"] = "特变电工",
					["msg"] = "我一天赚200% 14万美元",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [41]
				{
					["type"] = 1,
					["time"] = 1640882682,
					["from"] = "社区送温暖",
					["msg"] = "反正我现在仓位不重，",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [42]
				{
					["type"] = 1,
					["time"] = 1640882683,
					["from"] = "特变电工",
					["msg"] = "我去打板",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [43]
				{
					["type"] = 1,
					["time"] = 1640882737,
					["from"] = "社区送温暖",
					["msg"] = "不过，最近基金还可以，三个月都正收益，虽然不高",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [44]
				{
					["type"] = 1,
					["time"] = 1640882762,
					["from"] = "特变电工",
					["msg"] = "明天最后一天",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [45]
				{
					["type"] = 1,
					["time"] = 1640882773,
					["from"] = "特变电工",
					["msg"] = "我今年从120% 回撤到70%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [46]
				{
					["type"] = 1,
					["time"] = 1640882780,
					["from"] = "特变电工",
					["msg"] = "收益160万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [47]
				{
					["type"] = 1,
					["time"] = 1640882783,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [48]
				{
					["type"] = 1,
					["time"] = 1640882811,
					["from"] = "社区送温暖",
					["msg"] = "我也准备搞长线了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [49]
				{
					["type"] = 1,
					["time"] = 1640882827,
					["from"] = "社区送温暖",
					["msg"] = "短线太考验心态了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [50]
				{
					["type"] = 1,
					["time"] = 1640882850,
					["from"] = "社区送温暖",
					["msg"] = "一次错前面几次连班赚的都赔光",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [51]
				{
					["type"] = 1,
					["time"] = 1640882867,
					["from"] = "特变电工",
					["msg"] = "短线胜率低于50%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [52]
				{
					["type"] = 1,
					["time"] = 1640882875,
					["from"] = "特变电工",
					["msg"] = "短线唯一的做法就是仍骰子",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [53]
				{
					["type"] = 1,
					["time"] = 1640882934,
					["from"] = "社区送温暖",
					["msg"] = "还是趴在低位，时间换金钱好",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [54]
				{
					["type"] = 1,
					["time"] = 1640883451,
					["from"] = "特变电工",
					["msg"] = "今晚中改可以",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [55]
				{
					["type"] = 1,
					["time"] = 1640883483,
					["from"] = "社区送温暖",
					["msg"] = "中概我买了100块快跌了10个点了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [56]
				{
					["type"] = 1,
					["time"] = 1640883520,
					["from"] = "社区送温暖",
					["msg"] = "想买的，不知道什么时候买",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [57]
				{
					["type"] = 1,
					["time"] = 1640883529,
					["from"] = "社区送温暖",
					["msg"] = "不太敢抄底",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [58]
				{
					["type"] = 1,
					["time"] = 1640883570,
					["from"] = "特变电工",
					["msg"] = "你开美股了吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [59]
				{
					["type"] = 1,
					["time"] = 1640883580,
					["from"] = "社区送温暖",
					["msg"] = "基金啊",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [60]
				{
					["type"] = 1,
					["time"] = 1640883583,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [61]
				{
					["type"] = 1,
					["time"] = 1640883670,
					["from"] = "特变电工",
					["msg"] = "开",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [62]
				{
					["type"] = 1,
					["time"] = 1640883843,
					["from"] = "社区送温暖",
					["msg"] = "不弄了，太多更加搞不好了",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [63]
				{
					["type"] = 1,
					["time"] = 1640960433,
					["from"] = "社区送温暖",
					["msg"] = "昨天睡过头没卖今天还真的大涨了- -",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [64]
				{
					["type"] = 1,
					["time"] = 1640960822,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [65]
				{
					["type"] = 1,
					["time"] = 1640960826,
					["from"] = "特变电工",
					["msg"] = "韭菜盒子",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [66]
				{
					["type"] = 1,
					["time"] = 1640960830,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [67]
				{
					["type"] = 1,
					["time"] = 1640960845,
					["from"] = "特变电工",
					["msg"] = "我说过了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [68]
				{
					["type"] = 1,
					["time"] = 1640960848,
					["from"] = "特变电工",
					["msg"] = "48",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [69]
				{
					["type"] = 1,
					["time"] = 1640960849,
					["from"] = "社区送温暖",
					["msg"] = "没卖，主要光伏本身就有盈利",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [70]
				{
					["type"] = 1,
					["time"] = 1640960858,
					["from"] = "特变电工",
					["msg"] = "今年结账了",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [71]
				{
					["type"] = 1,
					["time"] = 1640960863,
					["from"] = "社区送温暖",
					["msg"] = "之前高的时候有25个点盈利",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [72]
				{
					["type"] = 1,
					["time"] = 1640960864,
					["from"] = "特变电工",
					["msg"] = "收益70%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [73]
				{
					["type"] = 1,
					["time"] = 1640960870,
					["from"] = "特变电工",
					["msg"] = "170万",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [74]
				{
					["type"] = 1,
					["time"] = 1640960875,
					["from"] = "特变电工",
					["msg"] = "最高260万 120%",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [75]
				{
					["type"] = 1,
					["time"] = 1640960879,
					["from"] = "特变电工",
					["msg"] = "我没卖",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [76]
				{
					["type"] = 1,
					["time"] = 1640960882,
					["from"] = "特变电工",
					["msg"] = "一点也不候会",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [77]
				{
					["type"] = 1,
					["time"] = 1640960885,
					["from"] = "特变电工",
					["msg"] = "后悔",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [78]
				{
					["type"] = 1,
					["time"] = 1640960913,
					["from"] = "社区送温暖",
					["msg"] = "恩，我也准备把周期拉长",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [79]
				{
					["type"] = 1,
					["time"] = 1641059581,
					["from"] = "特变电工",
					["msg"] = "你在希利苏斯做T0.5吗",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [80]
				{
					["type"] = 1,
					["time"] = 1641059596,
					["from"] = "社区送温暖",
					["msg"] = "不是，双采。。",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [81]
				{
					["type"] = 1,
					["time"] = 1641059601,
					["from"] = "社区送温暖",
					["msg"] = "瞎玩玩",
					["inbound"] = true,
					["convo"] = "社区送温暖",
				}, -- [82]
				{
					["type"] = 1,
					["time"] = 1641059604,
					["from"] = "特变电工",
					["msg"] = "。",
					["inbound"] = false,
					["convo"] = "社区送温暖",
				}, -- [83]
				["info"] = {
				},
			},
			["麦子大叔"] = {
				{
					["type"] = 1,
					["time"] = 1640195312,
					["from"] = "特变电工",
					["msg"] = "我擦 MC几点开始打的哦",
					["inbound"] = false,
					["convo"] = "麦子大叔",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640195312,
					["from"] = "麦子大叔",
					["msg"] = "<DBM> 麦子大叔正在与40人 - 管理者埃克索图斯交战，（当前96%，35/40存活）",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640195325,
					["from"] = "麦子大叔",
					["msg"] = "9.",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640195332,
					["from"] = "特变电工",
					["msg"] = "是公会团吗",
					["inbound"] = false,
					["convo"] = "麦子大叔",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640195337,
					["from"] = "麦子大叔",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640195346,
					["from"] = "特变电工",
					["msg"] = "晚上9点开始的呀",
					["inbound"] = false,
					["convo"] = "麦子大叔",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640195384,
					["from"] = "麦子大叔",
					["msg"] = "1",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640195452,
					["from"] = "麦子大叔",
					["msg"] = "<DBM> 麦子大叔在40人 - 管理者埃克索图斯（91%）的战斗中灭团了。",
					["inbound"] = true,
					["convo"] = "麦子大叔",
				}, -- [8]
				["info"] = {
				},
			},
			["戒之在灶"] = {
				{
					["type"] = 1,
					["time"] = 1640612392,
					["from"] = "特变电工",
					["msg"] = "擦",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640612396,
					["from"] = "特变电工",
					["msg"] = "又跌了",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640612408,
					["from"] = "特变电工",
					["msg"] = "2周亏我60万",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641037647,
					["from"] = "特变电工",
					["msg"] = "组我下",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641037649,
					["from"] = "特变电工",
					["msg"] = "换个位面",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641037659,
					["from"] = "特变电工",
					["msg"] = "3Q",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641037671,
					["from"] = "戒之在灶",
					["msg"] = "我在战场 组到你了么",
					["inbound"] = true,
					["convo"] = "戒之在灶",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641037677,
					["from"] = "特变电工",
					["msg"] = "组到了",
					["inbound"] = false,
					["convo"] = "戒之在灶",
				}, -- [8]
				["info"] = {
				},
			},
			["灬鳯灬"] = {
				{
					["type"] = 1,
					["time"] = 1640021574,
					["from"] = "灬鳯灬",
					["msg"] = "500",
					["inbound"] = true,
					["convo"] = "灬鳯灬",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640021604,
					["from"] = "灬鳯灬",
					["msg"] = "刚出|cffa335ee|Hitem:11684::::::::60:::::::::|h[反对者]|h|r,需要的人走不过来。。",
					["inbound"] = true,
					["convo"] = "灬鳯灬",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640021625,
					["from"] = "特变电工",
					["msg"] = "没用",
					["inbound"] = false,
					["convo"] = "灬鳯灬",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640021633,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "灬鳯灬",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640021641,
					["from"] = "特变电工",
					["msg"] = "双刀起飞",
					["inbound"] = false,
					["convo"] = "灬鳯灬",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640021646,
					["from"] = "灬鳯灬",
					["msg"] = "也是",
					["inbound"] = true,
					["convo"] = "灬鳯灬",
				}, -- [6]
				["info"] = {
				},
			},
			["芜湖小司马"] = {
				{
					["type"] = 1,
					["time"] = 1641100999,
					["from"] = "特变电工",
					["msg"] = "做一个宏单独密",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1641101004,
					["from"] = "芜湖小司马",
					["msg"] = "M谁啊",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1641101008,
					["from"] = "特变电工",
					["msg"] = "只有3个骑士 我们是小拯救",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1641101009,
					["from"] = "特变电工",
					["msg"] = "我擦",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1641101013,
					["from"] = "特变电工",
					["msg"] = "|cfff48cba有内鬼啊|r",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1641101018,
					["from"] = "特变电工",
					["msg"] = "3队骑士",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1641101028,
					["from"] = "芜湖小司马",
					["msg"] = "哦了",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1641108908,
					["from"] = "芜湖小司马",
					["msg"] = "近战不打吗",
					["inbound"] = true,
					["convo"] = "芜湖小司马",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1641108997,
					["from"] = "特变电工",
					["msg"] = "可以",
					["inbound"] = false,
					["convo"] = "芜湖小司马",
				}, -- [9]
				["info"] = {
				},
			},
			["小养由基"] = {
				{
					["type"] = 1,
					["time"] = 1640880956,
					["from"] = "特变电工",
					["msg"] = "[附魔靴子 - 强效敏捷]代工多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640880976,
					["from"] = "小养由基",
					["msg"] = "4",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640880989,
					["from"] = "特变电工",
					["msg"] = "4G么",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640880996,
					["from"] = "小养由基",
					["msg"] = "嗯",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640881006,
					["from"] = "特变电工",
					["msg"] = "组我哈",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640881024,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易取消: 对方取消了交易。",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [6]
				{
					["type"] = 1,
					["time"] = 1640881035,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。 (收到)4g,|cff1eff00|Hitem:16203::::::::60:::::::::|h[强效不灭精华]|h|rx8",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [7]
				{
					["type"] = 1,
					["time"] = 1640881043,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。(交出)附魔靴子 - 强效敏捷",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [8]
				{
					["type"] = 1,
					["time"] = 1640881047,
					["from"] = "小养由基",
					["msg"] = "好了",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [9]
				{
					["type"] = 1,
					["time"] = 1640881049,
					["from"] = "特变电工",
					["msg"] = "谢谢",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [10]
				{
					["type"] = 1,
					["time"] = 1640881801,
					["from"] = "特变电工",
					["msg"] = "披风3敏捷多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [11]
				{
					["type"] = 1,
					["time"] = 1640881846,
					["from"] = "小养由基",
					["msg"] = "8",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [12]
				{
					["type"] = 1,
					["time"] = 1640881851,
					["from"] = "特变电工",
					["msg"] = "++",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [13]
				{
					["type"] = 1,
					["time"] = 1640881868,
					["from"] = "小养由基",
					["msg"] = "与[特变电工]交易成功。(交出)附魔披风 - 次级敏捷 (收到)8g",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [14]
				{
					["type"] = 1,
					["time"] = 1640881889,
					["from"] = "特变电工",
					["msg"] = "手15敏多少钱",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [15]
				{
					["type"] = 1,
					["time"] = 1640881974,
					["from"] = "小养由基",
					["msg"] = "手有151敏吗",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [16]
				{
					["type"] = 1,
					["time"] = 1640881982,
					["from"] = "特变电工",
					["msg"] = "好像TAQ开放",
					["inbound"] = false,
					["convo"] = "小养由基",
				}, -- [17]
				{
					["type"] = 1,
					["time"] = 1640881985,
					["from"] = "小养由基",
					["msg"] = "没有15没的",
					["inbound"] = true,
					["convo"] = "小养由基",
				}, -- [18]
				["info"] = {
				},
			},
			["宝宝你在哪"] = {
				{
					["type"] = 1,
					["time"] = 1640707967,
					["from"] = "宝宝你在哪",
					["msg"] = "你先看看MS的装备在决定",
					["inbound"] = true,
					["convo"] = "宝宝你在哪",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640707974,
					["from"] = "特变电工",
					["msg"] = "嗯",
					["inbound"] = false,
					["convo"] = "宝宝你在哪",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640707976,
					["from"] = "特变电工",
					["msg"] = "没注意。。",
					["inbound"] = false,
					["convo"] = "宝宝你在哪",
				}, -- [3]
				["info"] = {
				},
			},
			["无敌暗影箭"] = {
				{
					["type"] = 1,
					["time"] = 1640793163,
					["from"] = "特变电工",
					["msg"] = "3G求拉厄运",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [1]
				{
					["type"] = 1,
					["time"] = 1640793342,
					["from"] = "无敌暗影箭",
					["msg"] = "进组啊",
					["inbound"] = true,
					["convo"] = "无敌暗影箭",
				}, -- [2]
				{
					["type"] = 1,
					["time"] = 1640793478,
					["from"] = "特变电工",
					["msg"] = "。。",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [3]
				{
					["type"] = 1,
					["time"] = 1640793482,
					["from"] = "特变电工",
					["msg"] = "在组一下",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [4]
				{
					["type"] = 1,
					["time"] = 1640793485,
					["from"] = "特变电工",
					["msg"] = "刚才WC",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [5]
				{
					["type"] = 1,
					["time"] = 1640794570,
					["from"] = "特变电工",
					["msg"] = "飞机还有吗",
					["inbound"] = false,
					["convo"] = "无敌暗影箭",
				}, -- [6]
				["info"] = {
				},
			},
		},
	},
}
WIM3_ChatFilters = {
}
WIM3_Alias = nil
