
MyChatAlertDB = {
	["profileKeys"] = {
		["Javascript - 鱼人摩洛克"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["dedupTime"] = 1,
			["filterWords"] = {
				["5.寻求组队"] = {
				},
				["2.综合 - 洛克莫丹"] = {
				},
				["6.大脚世界频道"] = {
				},
			},
			["triggers"] = {
				["5.寻求组队"] = {
					"MC", -- [1]
					"黑龙", -- [2]
					"mc", -- [3]
					"黑上", -- [4]
					"1", -- [5]
					"2", -- [6]
				},
				["2.综合 - 洛克莫丹"] = {
				},
				["6.大脚世界频道"] = {
					"mc", -- [1]
					"MC", -- [2]
					"黑龙", -- [3]
					"黑上", -- [4]
					"1", -- [5]
					"2", -- [6]
				},
			},
		},
	},
}
