
weizPVPOptions = {
	["profileKeys"] = {
		["Javascript - 鱼人摩洛克"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["Options"] = {
				["Frames"] = {
					["Width"] = 225.9998931884766,
					["Y"] = -168.6109313964844,
					["X"] = 391.055419921875,
					["Header"] = {
						["Width"] = 225.9998931884766,
						["Y"] = -108.1109619140625,
						["Height"] = 25.99999046325684,
						["X"] = 391.055419921875,
					},
					["Height"] = 94.99998474121094,
				},
				["LDB"] = {
					["minimapPos"] = 252.0980676997841,
				},
			},
		},
	},
}
