
ARKINVDB = {
	["global"] = {
		["player"] = {
			["data"] = {
				["!ACCOUNT - 100"] = {
					["info"] = {
						["class"] = "ACCOUNT",
						["class_local"] = "Account",
						["faction_local"] = "",
						["name"] = "我的帳號",
						["faction"] = "",
						["proj"] = 2,
						["level"] = 1,
						["player_id"] = "!ACCOUNT - 100",
						["realm"] = "",
					},
				},
				["特變電工 - 玉石礦坑"] = {
					["info"] = {
						["guid"] = "Player-5301-0046B99E",
						["class"] = "WARRIOR",
						["player_id"] = "特變電工 - 玉石礦坑",
						["race"] = "Human",
						["proj"] = 2,
						["realm"] = "玉石礦坑",
						["isplayer"] = true,
						["money"] = 4688,
						["gender"] = 2,
						["itemlevel"] = 1,
						["name"] = "特變電工",
						["faction"] = "Alliance",
						["race_local"] = "人類",
						["level"] = 14,
						["class_local"] = "戰士",
						["faction_local"] = "聯盟",
					},
					["location"] = {
						{
							["slot_count"] = 40,
							["bag"] = {
								{
									["q"] = 0,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:4537::::::::15:::::::::|h[泰拉比姆香蕉]|h|r",
											["slot_id"] = 1,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [1]
										{
											["q"] = 1,
											["h"] = "|cffffffff|Hitem:6948::::::::15:::::::::|h[爐石]|h|r",
											["slot_id"] = 2,
											["sb"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [2]
										{
											["q"] = 2,
											["age"] = 27287580,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 3,
											["h"] = "|cff1eff00|Hitem:3103::::::::15:::::::::|h[寒脊之錘]|h|r",
											["bag_id"] = 1,
										}, -- [3]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:2681::::::::15:::::::::|h[烤野豬肉]|h|r",
											["slot_id"] = 4,
											["sb"] = 0,
											["count"] = 15,
											["loc_id"] = 1,
											["age"] = 27289785,
										}, -- [4]
										{
											["q"] = 1,
											["r"] = true,
											["age"] = 27289773,
											["h"] = "|cffffffff|Hitem:5998::::::::15:::::::::|h[格林戈·雷矛的訂單]|h|r",
											["slot_id"] = 5,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [5]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["age"] = 27289786,
											["h"] = "|cffffffff|Hitem:2679::::::::15:::::::::|h[燒烤狼肉]|h|r",
											["slot_id"] = 6,
											["sb"] = 0,
											["count"] = 5,
											["loc_id"] = 1,
										}, -- [6]
										{
											["q"] = 1,
											["age"] = 27289787,
											["h"] = "|cffffffff|Hitem:860::::::::15:::::::::|h[騎兵戰靴]|h|r",
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 7,
											["bag_id"] = 1,
										}, -- [7]
										{
											["q"] = 1,
											["age"] = 27287581,
											["h"] = "|cffffffff|Hitem:118::::::::15:::::::::|h[初級治療藥水]|h|r",
											["count"] = 4,
											["sb"] = 0,
											["slot_id"] = 8,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [8]
										{
											["q"] = 1,
											["age"] = 27289789,
											["h"] = "|cffffffff|Hitem:2249::::::::15:::::::::|h[民兵圓盾]|h|r",
											["count"] = 1,
											["sb"] = 3,
											["slot_id"] = 9,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [9]
										{
											["q"] = 1,
											["age"] = 27287468,
											["h"] = "|cffffffff|Hitem:117::::::::15:::::::::|h[硬肉乾]|h|r",
											["count"] = 2,
											["sb"] = 0,
											["slot_id"] = 10,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [10]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["loc_id"] = 1,
											["count"] = 3,
											["sb"] = 0,
											["slot_id"] = 11,
											["h"] = "|cffffffff|Hitem:1251::::::::15:::::::::|h[亞麻繃帶]|h|r",
											["age"] = 27289756,
										}, -- [11]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:2589::::::::15:::::::::|h[亞麻布]|h|r",
											["count"] = 20,
											["sb"] = 0,
											["slot_id"] = 12,
											["loc_id"] = 1,
											["age"] = 27287629,
										}, -- [12]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["age"] = 27289785,
											["h"] = "|cffffffff|Hitem:3220::::::::15:::::::::|h[血腸]|h|r",
											["count"] = 5,
											["sb"] = 0,
											["slot_id"] = 13,
											["loc_id"] = 1,
										}, -- [13]
										{
											["q"] = 1,
											["age"] = 27287558,
											["h"] = "|cffffffff|Hitem:2512::::::::15:::::::::|h[劣質箭]|h|r",
											["count"] = 149,
											["sb"] = 0,
											["slot_id"] = 14,
											["loc_id"] = 1,
											["bag_id"] = 1,
										}, -- [14]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:1251::::::::15:::::::::|h[亞麻繃帶]|h|r",
											["count"] = 2,
											["sb"] = 0,
											["slot_id"] = 15,
											["loc_id"] = 1,
											["age"] = 27287570,
										}, -- [15]
										{
											["q"] = 1,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:2589::::::::15:::::::::|h[亞麻布]|h|r",
											["count"] = 20,
											["sb"] = 0,
											["slot_id"] = 16,
											["loc_id"] = 1,
											["age"] = 27287583,
										}, -- [16]
									},
									["bag_id"] = 1,
									["loc_id"] = 1,
									["count"] = 16,
									["status"] = -3,
									["texture"] = "Interface\\Icons\\INV_Misc_Bag_07_Green",
								}, -- [1]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 1,
											["bag_id"] = 2,
											["age"] = 27289785,
											["h"] = "|cffffffff|Hitem:3679::::::::15:::::::::|h[食譜：血腸]|h|r",
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 1,
											["loc_id"] = 1,
										}, -- [1]
										{
											["q"] = 0,
											["bag_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 2,
											["loc_id"] = 1,
										}, -- [2]
										{
											["q"] = 0,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 3,
											["loc_id"] = 1,
											["bag_id"] = 2,
										}, -- [3]
										{
											["q"] = 0,
											["bag_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 4,
											["loc_id"] = 1,
										}, -- [4]
										{
											["q"] = 0,
											["bag_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 5,
											["loc_id"] = 1,
										}, -- [5]
										{
											["q"] = 0,
											["bag_id"] = 2,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 6,
											["loc_id"] = 1,
										}, -- [6]
									},
									["bag_id"] = 2,
									["h"] = "|cffffffff|Hitem:4238::::::::15:::::::::|h[亞麻包]|h|r",
									["count"] = 6,
									["status"] = -3,
									["empty"] = 5,
									["loc_id"] = 1,
									["texture"] = 133622,
								}, -- [2]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 0,
											["bag_id"] = 3,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 1,
											["loc_id"] = 1,
										}, -- [1]
										{
											["q"] = 1,
											["bag_id"] = 3,
											["age"] = 27289785,
											["h"] = "|cffffffff|Hitem:2677::::::::15:::::::::|h[豬排]|h|r",
											["count"] = 5,
											["sb"] = 0,
											["slot_id"] = 2,
											["loc_id"] = 1,
										}, -- [2]
										{
											["q"] = 0,
											["loc_id"] = 1,
											["slot_id"] = 3,
											["sb"] = 0,
											["count"] = 1,
											["bag_id"] = 3,
										}, -- [3]
										{
											["q"] = 0,
											["bag_id"] = 3,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = 1,
											["bag_id"] = 3,
											["loc_id"] = 1,
											["count"] = 20,
											["sb"] = 0,
											["slot_id"] = 5,
											["h"] = "|cffffffff|Hitem:2589::::::::15:::::::::|h[亞麻布]|h|r",
											["age"] = 27289719,
										}, -- [5]
										{
											["q"] = 0,
											["bag_id"] = 3,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 6,
										}, -- [6]
									},
									["bag_id"] = 3,
									["h"] = "|cffffffff|Hitem:4238::::::::15:::::::::|h[亞麻包]|h|r",
									["count"] = 6,
									["status"] = -3,
									["empty"] = 4,
									["loc_id"] = 1,
									["texture"] = 133622,
								}, -- [3]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 1,
											["bag_id"] = 4,
											["loc_id"] = 1,
											["count"] = 4,
											["sb"] = 0,
											["slot_id"] = 1,
											["h"] = "|cffffffff|Hitem:858::::::::15:::::::::|h[次級治療藥水]|h|r",
											["age"] = 27289721,
										}, -- [1]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 0,
											["bag_id"] = 4,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 4,
										}, -- [4]
										{
											["q"] = 1,
											["age"] = 27289774,
											["h"] = "|cffffffff|Hitem:2589::::::::15:::::::::|h[亞麻布]|h|r",
											["bag_id"] = 4,
											["loc_id"] = 1,
											["count"] = 11,
											["sb"] = 0,
											["slot_id"] = 5,
										}, -- [5]
										{
											["q"] = 0,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 4,
											["slot_id"] = 6,
										}, -- [6]
									},
									["bag_id"] = 4,
									["h"] = "|cffffffff|Hitem:4238::::::::15:::::::::|h[亞麻包]|h|r",
									["count"] = 6,
									["status"] = -3,
									["empty"] = 4,
									["loc_id"] = 1,
									["texture"] = 133622,
								}, -- [4]
								{
									["q"] = 1,
									["type"] = 1,
									["slot"] = {
										{
											["q"] = 0,
											["bag_id"] = 5,
											["loc_id"] = 1,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 1,
										}, -- [1]
										{
											["q"] = 0,
											["slot_id"] = 2,
											["sb"] = 0,
											["count"] = 1,
											["loc_id"] = 1,
											["bag_id"] = 5,
										}, -- [2]
										{
											["q"] = 0,
											["bag_id"] = 5,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 3,
											["loc_id"] = 1,
										}, -- [3]
										{
											["q"] = 0,
											["bag_id"] = 5,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 4,
											["loc_id"] = 1,
										}, -- [4]
										{
											["q"] = 0,
											["bag_id"] = 5,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 5,
											["loc_id"] = 1,
										}, -- [5]
										{
											["q"] = 0,
											["bag_id"] = 5,
											["count"] = 1,
											["sb"] = 0,
											["slot_id"] = 6,
											["loc_id"] = 1,
										}, -- [6]
									},
									["bag_id"] = 5,
									["h"] = "|cffffffff|Hitem:4238::::::::15:::::::::|h[亞麻包]|h|r",
									["count"] = 6,
									["status"] = -3,
									["empty"] = 6,
									["loc_id"] = 1,
									["texture"] = 133622,
								}, -- [5]
							},
						}, -- [1]
						{
							["slot_count"] = 32,
							["bag"] = {
								{
									["type"] = 3,
									["count"] = 32,
									["slot"] = {
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [1]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 2,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [2]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 3,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [3]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 4,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [4]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 5,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [5]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 6,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [6]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 7,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [7]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 8,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [8]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 9,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [9]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 10,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [10]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 11,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [11]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 12,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [12]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 13,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [13]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 14,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [14]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 15,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [15]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 16,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [16]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 17,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [17]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 18,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [18]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 19,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [19]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 20,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [20]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 21,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [21]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 22,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [22]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 23,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [23]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 24,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [24]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 25,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [25]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 26,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [26]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 27,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [27]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 28,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [28]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 29,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [29]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 30,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [30]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 31,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [31]
										{
											["q"] = -1,
											["loc_id"] = 2,
											["slot_id"] = 32,
											["sb"] = 0,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [32]
									},
									["status"] = -3,
									["empty"] = 32,
									["bag_id"] = 1,
									["loc_id"] = 2,
								}, -- [1]
							},
						}, -- [2]
						nil, -- [3]
						nil, -- [4]
						{
							["slot_count"] = 1,
							["bag"] = {
								{
									["type"] = 15,
									["count"] = 1,
									["slot"] = {
										{
											["q"] = 0,
											["loc_id"] = 5,
											["msg_id"] = 1,
											["att_id"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 1,
										}, -- [1]
									},
									["status"] = -3,
									["empty"] = 1,
									["bag_id"] = 1,
									["loc_id"] = 5,
								}, -- [1]
								{
									["type"] = 15,
									["status"] = -3,
									["bag_id"] = 2,
									["loc_id"] = 5,
								}, -- [2]
							},
						}, -- [5]
						{
							["slot_count"] = 19,
							["bag"] = {
								{
									["type"] = 14,
									["count"] = 19,
									["slot"] = {
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 1,
										}, -- [1]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 3,
										}, -- [3]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 4,
											["sb"] = 3,
											["count"] = 1,
											["bag_id"] = 1,
											["age"] = 27286025,
											["h"] = "|cffffffff|Hitem:3070::::::::15:::::::::|h[徽記披風]|h|r",
										}, -- [4]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 5,
											["sb"] = 3,
											["h"] = "|cffffffff|Hitem:3151::::::::15:::::::::|h[坦克駕駛員軍用外衣]|h|r",
											["age"] = 27289721,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [5]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 6,
											["sb"] = 0,
											["count"] = 1,
											["age"] = 27286171,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:2575::::::::15:::::::::|h[紅色亞麻襯衣]|h|r",
										}, -- [6]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 7,
										}, -- [7]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 8,
											["sb"] = 3,
											["h"] = "|cffffffff|Hitem:1182::::::::15:::::::::|h[黃銅護腕]|h|r",
											["age"] = 27287440,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [8]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 3,
											["h"] = "|cffffffff|Hitem:1360::::::::15:::::::::|h[暴風城鍊甲手套]|h|r",
											["age"] = 27287561,
											["bag_id"] = 1,
											["slot_id"] = 9,
										}, -- [9]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 10,
											["sb"] = 0,
											["h"] = "|cffffffff|Hitem:9758::::::::15:::::::::|h[軍校腰帶]|h|r",
											["age"] = 27289778,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [10]
										{
											["q"] = 0,
											["loc_id"] = 6,
											["slot_id"] = 11,
											["sb"] = 0,
											["count"] = 1,
											["age"] = 27289721,
											["bag_id"] = 1,
											["h"] = "|cff9d9d9d|Hitem:1735::::::::15:::::::::|h[用舊的鎖甲短褲]|h|r",
										}, -- [11]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 12,
											["sb"] = 0,
											["count"] = 1,
											["age"] = 27289721,
											["bag_id"] = 1,
											["h"] = "|cffffffff|Hitem:9759::::::::15:::::::::|h[軍校長靴]|h|r",
										}, -- [12]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 13,
										}, -- [13]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 14,
										}, -- [14]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 15,
										}, -- [15]
										{
											["q"] = -1,
											["loc_id"] = 6,
											["count"] = 1,
											["sb"] = 0,
											["bag_id"] = 1,
											["slot_id"] = 16,
										}, -- [16]
										{
											["q"] = 2,
											["loc_id"] = 6,
											["slot_id"] = 17,
											["sb"] = 3,
											["count"] = 1,
											["age"] = 27287506,
											["bag_id"] = 1,
											["h"] = "|cff1eff00|Hitem:6985::::::::15:::::::::|h[哈加德的劍]|h|r",
										}, -- [17]
										{
											["q"] = 2,
											["loc_id"] = 6,
											["slot_id"] = 18,
											["sb"] = 3,
											["count"] = 1,
											["age"] = 27289789,
											["bag_id"] = 1,
											["h"] = "|cff1eff00|Hitem:3160::::::::15:::::::::|h[鐵板圓盾]|h|r",
										}, -- [18]
										{
											["q"] = 1,
											["loc_id"] = 6,
											["slot_id"] = 19,
											["sb"] = 0,
											["h"] = "|cffffffff|Hitem:15807::::::::15:::::::::|h[輕弩]|h|r",
											["age"] = 27287558,
											["bag_id"] = 1,
											["count"] = 1,
										}, -- [19]
									},
									["status"] = -3,
									["empty"] = 8,
									["bag_id"] = 1,
									["loc_id"] = 6,
								}, -- [1]
							},
						}, -- [6]
						nil, -- [7]
						nil, -- [8]
						nil, -- [9]
						{
							["bag"] = {
								{
									["type"] = 20,
									["status"] = -3,
									["bag_id"] = 1,
									["loc_id"] = 10,
								}, -- [1]
							},
						}, -- [10]
						nil, -- [11]
						nil, -- [12]
						nil, -- [13]
						nil, -- [14]
						nil, -- [15]
						{
							["slot_count"] = 4,
							["bag"] = {
								{
									["type"] = 29,
									["count"] = 4,
									["slot"] = {
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 1,
											["sb"] = 3,
											["h"] = "reputation:72:友善:4690:6000:0:0:0",
											["bag_id"] = 1,
											["count"] = 7690,
										}, -- [1]
										{
											["q"] = 0,
											["h"] = "reputation:54:友善:626:6000:0:0:0",
											["count"] = 3626,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 2,
										}, -- [2]
										{
											["q"] = 0,
											["loc_id"] = 16,
											["slot_id"] = 3,
											["sb"] = 3,
											["h"] = "reputation:69:友善:318:6000:0:0:0",
											["bag_id"] = 1,
											["count"] = 3318,
										}, -- [3]
										{
											["q"] = 0,
											["h"] = "reputation:47:友善:1220:6000:0:0:0",
											["count"] = 4220,
											["sb"] = 3,
											["loc_id"] = 16,
											["bag_id"] = 1,
											["slot_id"] = 4,
										}, -- [4]
									},
									["status"] = -3,
									["bag_id"] = 1,
									["loc_id"] = 16,
								}, -- [1]
							},
						}, -- [16]
					},
				},
			},
			["version"] = 30961,
		},
		["version"] = 30961,
		["cache"] = {
			["default"] = {
				["1000:item:1081:0"] = "1!412",
				["1000:item:1504:0"] = "1!402",
				["1000:item:9749:0"] = "1!414",
				["1000:empty:0:1"] = "1!302",
				["1000:item:2249:1"] = "1!416",
				["1000:item:2691:1"] = "1!416",
				["1000:item:1509:0"] = "1!402",
				["1000:item:3160:1"] = "1!416",
				["1000:item:1498:0"] = "1!402",
				["1000:item:3171:0"] = "1!402",
				["1000:item:2447:0"] = "1!501",
				["1000:item:3173:0"] = "1!412",
				["1000:item:2635:0"] = "1!402",
				["1000:item:3174:0"] = "1!412",
				["1000:item:2646:0"] = "1!402",
				["1000:item:2672:0"] = "1!412",
				["1000:item:3170:0"] = "1!402",
				["1000:item:2777:0"] = "1!402",
				["1000:item:2679:0"] = "1!417",
				["1000:item:4814:0"] = "1!402",
				["1000:item:9758:0"] = "1!414",
				["1000:item:2677:0"] = "1!505",
				["1000:item:1179:0"] = "1!418",
				["1000:item:2218:1"] = "1!402",
				["1000:item:414:0"] = "1!417",
				["1000:item:1515:0"] = "1!402",
				["1000:item:2681:0"] = "1!417",
				["1000:item:2512:0"] = "1!421",
				["1000:item:1414:0"] = "1!402",
				["1000:item:2778:0"] = "1!402",
				["1000:item:2640:0"] = "1!411",
				["1000:item:2067:0"] = "1!414",
				["1000:item:2806:0"] = "1!411",
				["1000:item:1516:0"] = "1!402",
				["1000:item:769:0"] = "1!412",
				["1000:item:1502:0"] = "1!402",
				["1000:item:771:0"] = "1!402",
				["1000:item:6513:0"] = "1!414",
				["1000:item:3103:1"] = "1!402",
				["1000:item:3110:0"] = "1!411",
				["1000:item:5998:0"] = "1!411",
				["1000:item:3172:0"] = "1!412",
				["1000:item:6303:0"] = "1!505",
				["1000:item:860:1"] = "1!416",
				["1000:item:5465:0"] = "1!412",
				["1000:item:2648:0"] = "1!402",
				["1000:item:1415:0"] = "1!402",
				["1000:item:117:0"] = "1!417",
				["1000:item:5109:0"] = "1!414",
				["1000:item:11406:0"] = "1!402",
				["1000:item:3679:0"] = "1!409",
				["1000:item:2282:0"] = "1!414",
				["1000:item:858:0"] = "1!420",
				["1000:item:3167:0"] = "1!402",
				["1000:item:4537:0"] = "1!417",
				["1000:item:3220:0"] = "1!417",
				["1000:item:4566:0"] = "1!414",
				["1000:item:1506:0"] = "1!402",
				["1000:item:1499:0"] = "1!402",
				["1000:item:818:0"] = "1!513",
				["1000:item:6948:1"] = "1!403",
				["1000:item:2589:0"] = "1!502",
				["1000:item:118:0"] = "1!420",
				["1000:item:3169:0"] = "1!402",
				["1000:item:1251:0"] = "1!432",
			},
			["reputation"] = {
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "人類(玩家)",
				}, -- [1]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "獸人(玩家)",
				}, -- [2]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "矮人(玩家)",
				}, -- [3]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "夜精靈(玩家)",
				}, -- [4]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "不死族(玩家)",
				}, -- [5]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "牛頭人(玩家)",
				}, -- [6]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "生物",
				}, -- [7]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "地精(玩家)",
				}, -- [8]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "食人妖(玩家)",
				}, -- [9]
				nil, -- [10]
				nil, -- [11]
				nil, -- [12]
				nil, -- [13]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "怪物",
				}, -- [14]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "迪菲亞兄弟會",
				}, -- [15]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "河爪豺狼人",
				}, -- [16]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "赤脊山豺狼人",
				}, -- [17]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "暗皮豺狼人",
				}, -- [18]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "魚人",
				}, -- [19]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "不死族(天譴軍團)",
				}, -- [20]
				{
					["r"] = false,
					["d"] = "身為黑水強盜的大財主里維加茲，掌控這座繁榮的沿海城市。血帆冒險家們不共戴天的仇敵，同時也是熱砂公司的一部份。",
					["w"] = true,
					["n"] = "藏寶海灣",
				}, -- [21]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蜘蛛",
				}, -- [22]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "野豬",
				}, -- [23]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狼人",
				}, -- [24]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狗頭人",
				}, -- [25]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "血頂食人妖",
				}, -- [26]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "劈顱食人妖",
				}, -- [27]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "獵物",
				}, -- [28]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狼人",
				}, -- [29]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "叛變的迪菲亞盜賊",
				}, -- [30]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "友方",
				}, -- [31]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "石齶怪",
				}, -- [32]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "冰鬃食人妖",
				}, -- [33]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑石族獸人",
				}, -- [34]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Villian",
				}, -- [35]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "犧牲品",
				}, -- [36]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "熊",
				}, -- [37]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "巨魔",
				}, -- [38]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "庫森的雇傭兵",
				}, -- [39]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "衛隊",
				}, -- [40]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "荊棘谷地精",
				}, -- [41]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "迅猛龍",
				}, -- [42]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "石化蜥蜴",
				}, -- [43]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "綠龍",
				}, -- [44]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "失落者",
				}, -- [45]
				nil, -- [46]
				{
					["r"] = false,
					["d"] = "本座聯盟首都乃丹莫洛矮人之驕傲。國王麥格尼的家鄉。",
					["w"] = false,
					["n"] = "鐵爐堡",
				}, -- [47]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑鐵矮人",
				}, -- [48]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "暮色森林守夜人",
				}, -- [49]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "紅龍軍團",
				}, -- [50]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蘚皮豺狼人",
				}, -- [51]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "龍喉族獸人",
				}, -- [52]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "瘋狂地精",
				}, -- [53]
				{
					["r"] = false,
					["d"] = "諾姆瑞根早先的移民，現在離鄉背井居於鐵爐堡並與聯盟為伍。",
					["w"] = false,
					["n"] = "諾姆瑞根流亡者",
				}, -- [54]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "豹",
				}, -- [55]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "血色十字軍",
				}, -- [56]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "爛皮豺狼人",
				}, -- [57]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "猩猩",
				}, -- [58]
				{
					["r"] = false,
					["d"] = "瑟銀兄弟會的矮人們集中了最為卓越的工匠手藝。也愛好解開黑石山的神秘面紗。",
					["w"] = false,
					["n"] = "瑟銀兄弟會",
				}, -- [59]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "納迦(怪物)",
				}, -- [60]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "達拉然",
				}, -- [61]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "棄靈",
				}, -- [62]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Darkhowl",
				}, -- [63]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "劣魔",
				}, -- [64]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "熊怪",
				}, -- [65]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "部落友軍",
				}, -- [66]
				nil, -- [67]
				nil, -- [68]
				{
					["r"] = false,
					["d"] = "聯盟首都主要人口為夜精靈，位於泰達希爾島上，由月之女祭司泰蘭妲·語風所統治。",
					["w"] = false,
					["n"] = "達納蘇斯",
				}, -- [69]
				{
					["r"] = false,
					["d"] = "人類首要的犯罪集團。活動範圍於奧特蘭克山脈與希爾斯布萊德丘陵。",
					["w"] = false,
					["n"] = "辛迪加",
				}, -- [70]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "希爾斯布萊德民兵",
				}, -- [71]
				{
					["r"] = false,
					["d"] = "人類勢力的最後其中一座堡壘，這座聯盟首都由幼王安度因·烏瑞恩國王所治理。",
					["w"] = false,
					["n"] = "暴風城",
				}, -- [72]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "惡魔",
				}, -- [73]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "元素生物",
				}, -- [74]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "靈魂",
				}, -- [75]
				nil, -- [76]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "寶物",
				}, -- [77]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "泥嘴豺狼人",
				}, -- [78]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "希爾斯布萊德，南海鎮",
				}, -- [79]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑龍軍團",
				}, -- [80]
				nil, -- [81]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "枯木食人妖",
				}, -- [82]
				nil, -- [83]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "鋼鬃野豬人",
				}, -- [84]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "刺背野豬人",
				}, -- [85]
				nil, -- [86]
				{
					["r"] = false,
					["d"] = "這些嗜血的海盜船是公海裡許多商人的禍害。同時也是藏寶海灣不共戴天的仇敵。",
					["w"] = false,
					["n"] = "血帆海盜",
				}, -- [87]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑暗深淵",
				}, -- [88]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "龍蝦人",
				}, -- [89]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "科卡爾半人馬",
				}, -- [90]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "加拉克半人馬",
				}, -- [91]
				{
					["r"] = false,
					["d"] = "淒涼之地的南方地帶是半人馬的家園。瑪格拉姆半人馬之世仇。",
					["w"] = true,
					["n"] = "吉爾吉斯半人馬",
				}, -- [92]
				{
					["r"] = false,
					["d"] = "淒涼之地的東邊區塊是半人馬的家園。吉爾吉斯半人馬之世仇。",
					["w"] = true,
					["n"] = "瑪格拉姆半人馬",
				}, -- [93]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "瑪洛迪",
				}, -- [94]
				nil, -- [95]
				nil, -- [96]
				nil, -- [97]
				nil, -- [98]
				nil, -- [99]
				nil, -- [100]
				nil, -- [101]
				nil, -- [102]
				nil, -- [103]
				nil, -- [104]
				nil, -- [105]
				nil, -- [106]
				nil, -- [107]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "塞拉摩人類",
				}, -- [108]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "剃刀沼澤野豬人",
				}, -- [109]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "鋼鬃野豬人",
				}, -- [110]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "Quilboar, Deathshead",
				}, -- [111]
				nil, -- [112]
				nil, -- [113]
				nil, -- [114]
				nil, -- [115]
				nil, -- [116]
				nil, -- [117]
				nil, -- [118]
				nil, -- [119]
				nil, -- [120]
				nil, -- [121]
				nil, -- [122]
				nil, -- [123]
				nil, -- [124]
				nil, -- [125]
				nil, -- [126]
				nil, -- [127]
				{
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "敵人",
				}, -- [128]
				[575] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "未墮落的熊怪",
				},
				[369] = {
					["r"] = false,
					["d"] = "熱沙公司首都，同為哥布林最精良工程師、化學家和商人之都。",
					["w"] = true,
					["n"] = "加基森",
				},
				[869] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "加德納爾",
				},
				[750] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "薩弗隆火元素",
				},
				[893] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "惡齒食人妖",
				},
				[389] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "諾姆瑞根蟲",
				},
				[909] = {
					["r"] = false,
					["d"] = "行遍天下的馬戲團專門獻出奇異和非凡的表演。常出現在艾爾文森林與莫高雷。",
					["w"] = false,
					["n"] = "暗月馬戲團",
				},
				[790] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "聯盟精靈嚮導",
				},
				[671] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "螃蟹",
				},
				[679] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "訓練用假人",
				},
				[409] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "鷹身人",
				},
				[576] = {
					["r"] = false,
					["d"] = "身為最後一個尚未墮落的熊怪部族，木喉還在尋求保護心智的方法以終結同胞的受難。",
					["w"] = false,
					["n"] = "木喉要塞",
				},
				[148] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "小動物",
				},
				[429] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "火刃氏族",
				},
				[310] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蝙蝠",
				},
				[449] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "暗影蛛絲偷獵者",
				},
				[529] = {
					["r"] = false,
					["d"] = "專門保護艾澤拉斯免受天譴軍團威脅的組織。銀色黎明的大本營就在東瘟疫之地和西瘟疫之地。",
					["w"] = true,
					["n"] = "銀色黎明",
				},
				[168] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "奈瑟加德商隊",
				},
				[672] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "鱷魚",
				},
				[469] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "聯盟",
				},
				[950] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "ToWoW - Flag",
				},
				[577] = {
					["r"] = false,
					["d"] = "熱砂公司的哥布林經營這座貿易商埠區，就位在冬泉谷主要貿易道路的十字路口上。",
					["w"] = true,
					["n"] = "永望鎮",
				},
				[489] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑鐵酒吧哥布林老闆",
				},
				[609] = {
					["r"] = false,
					["d"] = "塞納里奧的德魯伊是大自然的守護神，將寧靜的月光林地當成自己的家。",
					["w"] = true,
					["n"] = "塞納里奧議會",
				},
				[509] = {
					["r"] = false,
					["d"] = "阿拉索聯軍想辦法替暴風城的保護人，收回阿拉希盆地所丟失的土地。",
					["w"] = false,
					["n"] = "阿拉索聯軍",
				},
				[649] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "管理者埃克索圖斯",
				},
				[919] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "RC Objects",
				},
				[673] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "土狼",
				},
				[689] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "黑龍軍團 - 誘餌",
				},
				[951] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "ToWoW - Flag Trigger Alliance (DND)",
				},
				[729] = {
					["r"] = false,
					["d"] = "霜狼氏族設法從奧特蘭克山谷驅逐雷矛遠征隊營地的矮人。",
					["w"] = false,
					["n"] = "霜狼氏族",
				},
				[311] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "泰坦",
				},
				[450] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "灼熱蜘蛛",
				},
				[531] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "青銅龍軍團",
				},
				[920] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "紅色",
				},
				[674] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "貓頭鷹",
				},
				[470] = {
					["r"] = false,
					["d"] = "隸屬於熱砂公司的一部份。這座哥布林城是中立的庇護所，專門給貧瘠之地從事貨物交易與服務的商人。",
					["w"] = true,
					["n"] = "棘齒城",
				},
				[849] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "部落精靈嚮導",
				},
				[730] = {
					["r"] = false,
					["d"] = "雷矛矮人以奧特蘭克山谷為家，因其在戰爭中受霜狼獸人所封鎖。",
					["w"] = false,
					["n"] = "雷矛衛隊",
				},
				[510] = {
					["r"] = false,
					["d"] = "污染者想幫部落尋求阿拉希盆地珍稀的資源。",
					["w"] = false,
					["n"] = "污染者",
				},
				[770] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "吉茲洛克的護身符",
				},
				[532] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "藍龍軍團",
				},
				[921] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "藍色",
				},
				[675] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蠍子",
				},
				[572] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "邪枝食人妖",
				},
				[1041] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "狂亂",
				},
				[890] = {
					["r"] = false,
					["d"] = "梣谷的強硬守衛者，於戰歌峽谷戰爭中遭戰歌偵查騎兵鎖死。",
					["w"] = false,
					["n"] = "銀翼要塞的戰士",
				},
				[771] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "吉茲洛克",
				},
				[2403] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "奪取旗幟 - 旗幟 - 聯盟",
				},
				[169] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "熱砂港",
				},
				[676] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "陸行鳥",
				},
				[471] = {
					["r"] = false,
					["d"] = "雖不屬於聯盟的一份子，鷹巢山上的矮人仍歡迎他們，並視部落為仇敵。",
					["w"] = false,
					["n"] = "蠻錘部族",
				},
				[809] = {
					["r"] = false,
					["d"] = "曾經強大一時的剩餘精靈居住在厄運之槌，在神秘領域裡卻仍保有智慧和博學見識。",
					["w"] = false,
					["n"] = "辛德拉",
				},
				[573] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "南海海盜",
				},
				[954] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "ToWoW - Flag Trigger Horde (DND)",
				},
				[589] = {
					["r"] = false,
					["d"] = "這個孤寂的夜精靈小團隊提升並訓練了冬泉谷區域的冬刃豹。",
					["w"] = true,
					["n"] = "冬刃豹訓練師",
				},
				[918] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "RC Enemies",
				},
				[917] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "鐵爐堡軍旅",
				},
				[916] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "異種攻擊者",
				},
				[189] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "聯盟",
				},
				[629] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "斷矛食人妖",
				},
				[511] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "巨人",
				},
				[329] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "工頭費蘇勒",
				},
				[677] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "烏龜",
				},
				[269] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "銀月倖存者",
				},
				[669] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "禿鷹",
				},
				[931] = {
					["r"] = false,
					["d"] = "This faction only exists to test the editing of faction names and descriptions...",
					["w"] = true,
					["n"] = "Test Faction (not a real faction)",
				},
				[915] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "克蘇恩軍隊",
				},
				[912] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "卡林多聯軍",
				},
				[209] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "奈瑟加德",
				},
				[910] = {
					["r"] = false,
					["d"] = "青銅龍軍團的後裔是時間的守護神，不把死敵放在眼中。",
					["w"] = false,
					["n"] = "諾茲多姆的子嗣",
				},
				[891] = {
					["r"] = false,
					["d"] = "",
					["w"] = false,
					["n"] = "聯盟部隊",
				},
				[829] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "巨魔(克羅卡斯)",
				},
				[769] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "吉茲洛克的假人",
				},
				[309] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "蠍子",
				},
				[749] = {
					["r"] = false,
					["d"] = "這些元素已經完成他們在艾薩拉東邊島的家。拉格納羅斯軍隊不共戴天的仇敵。",
					["w"] = true,
					["n"] = "海達希亞水元素",
				},
				[630] = {
					["r"] = false,
					["d"] = "",
					["w"] = false,
					["n"] = "暴掠龍訓練師",
				},
				[270] = {
					["r"] = false,
					["d"] = "食人妖已在尤亞姆巴島上努力招募幫手，對抗復活的血神，以及祖爾格拉布的阿塔萊祭司。",
					["w"] = false,
					["n"] = "贊達拉部族",
				},
				[249] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "異種蠍",
				},
				[229] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "哀嚎洞穴",
				},
				[789] = {
					["r"] = false,
					["d"] = "",
					["w"] = false,
					["n"] = "莫洛加",
				},
				[670] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "貓",
				},
				[678] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "風蛇",
				},
				[928] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "天譴入侵者",
				},
				[349] = {
					["r"] = false,
					["d"] = "這個小偷與刺客公會，只歡迎身懷非凡卓越本事的人加入。辛迪加的世仇。",
					["w"] = true,
					["n"] = "拉文霍德",
				},
				[2402] = {
					["r"] = false,
					["d"] = "",
					["w"] = true,
					["n"] = "奪取旗幟 - 旗幟 - 部落",
				},
			},
			["rule"] = {
				["1:4:2:0:1000:item:1179:0"] = false,
				["1:1:16:0:1000:item:2589:0"] = false,
				["1:1:2:3:1000:item:6948:1"] = false,
				["1:1:12:0:1000:item:2589:0"] = false,
				["1:4:5:0:1000:item:2589:0"] = false,
				["1:4:6:0:1000:item:1516:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:9:0:1000:item:414:0"] = false,
				["1:1:3:3:1000:item:3103:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:1:0:1000:item:4537:0"] = false,
				["1:5:2:0:1000:item:1414:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:7:0:1000:empty:0:1"] = false,
				["1:1:5:0:1000:item:5998:0"] = false,
				["1:1:5:0:1000:item:2806:0"] = false,
				["1:1:9:0:1000:item:3172:0"] = false,
				["1:5:3:0:1000:empty:0:1"] = false,
				["1:1:9:3:1000:item:3160:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:3:5:0:1000:item:2589:0"] = false,
				["1:2:6:0:1000:empty:0:1"] = false,
				["1:1:7:0:1000:item:6513:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:14:0:1000:item:2512:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:2:4:0:1000:item:3174:0"] = false,
				["1:1:6:0:1000:item:2067:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:3:3:0:1000:empty:0:1"] = false,
				["1:3:1:0:1000:item:771:0"] = false,
				["1:1:13:0:1000:empty:0:1"] = false,
				["1:3:3:3:1000:item:2691:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:3:6:0:1000:empty:0:1"] = false,
				["1:5:5:0:1000:item:1498:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:2:2:0:1000:item:3110:0"] = false,
				["1:2:5:0:1000:empty:0:1"] = false,
				["1:3:2:0:1000:item:1499:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:5:4:0:1000:empty:0:1"] = false,
				["1:5:2:0:1000:empty:0:1"] = false,
				["1:2:3:0:1000:item:6303:0"] = false,
				["1:5:6:0:1000:empty:0:1"] = false,
				["1:1:8:0:1000:item:118:0"] = false,
				["1:4:4:0:1000:empty:0:1"] = false,
				["1:1:9:3:1000:item:2249:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:15:0:1000:item:1251:0"] = false,
				["1:1:4:0:1000:item:2681:0"] = false,
				["1:5:1:2:1000:item:4566:0:0:0:0:0:0:1097:389484288:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:7:3:1000:item:860:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:4:2:0:1000:empty:0:1"] = false,
				["1:5:1:0:1000:item:1504:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:9:0:1000:empty:0:1"] = false,
				["1:3:4:0:1000:empty:0:1"] = false,
				["1:1:1:0:1000:item:2672:0"] = false,
				["1:4:1:0:1000:item:858:0"] = false,
				["1:3:4:0:1000:item:5109:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:5:2:0:1000:item:818:0"] = false,
				["1:2:1:0:1000:item:3679:0"] = false,
				["1:2:4:0:1000:item:1502:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:5:4:0:1000:item:1415:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:6:0:1000:item:2679:0"] = false,
				["1:5:6:0:1000:item:2635:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:2:1:3:1000:item:2218:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:5:6:0:1000:item:9758:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:1:0:1000:empty:0:1"] = false,
				["1:5:3:0:1000:item:2282:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:4:2:0:1000:item:4537:0"] = false,
				["1:1:13:0:1000:item:2648:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:4:6:0:1000:item:2777:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:2:3:0:1000:item:3170:0"] = false,
				["1:4:3:0:1000:item:1499:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:4:3:0:1000:item:2447:0"] = false,
				["1:3:6:0:1000:item:3167:0"] = false,
				["1:2:6:0:1000:item:2777:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:2:3:0:1000:empty:0:1"] = false,
				["1:3:6:0:1000:item:2646:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:3:3:0:1000:item:11406:0"] = false,
				["1:2:5:0:1000:item:1509:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:3:1:0:1000:empty:0:1"] = false,
				["1:1:7:0:1000:item:1515:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:3:2:0:1000:item:2677:0"] = false,
				["1:4:4:0:1000:item:2640:0"] = false,
				["1:5:5:0:1000:empty:0:1"] = false,
				["1:1:6:0:1000:item:769:0"] = false,
				["1:2:5:0:1000:item:5465:0"] = false,
				["1:2:1:0:1000:empty:0:1"] = false,
				["1:2:6:0:1000:item:1081:0"] = false,
				["1:2:1:0:1000:item:3173:0"] = false,
				["1:4:4:2:1000:item:9749:0:0:0:0:0:0:757:224856448:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:13:0:1000:item:3171:0"] = false,
				["1:4:3:0:1000:empty:0:1"] = false,
				["1:2:4:0:1000:empty:0:1"] = false,
				["1:3:1:0:1000:item:1506:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:5:1:0:1000:empty:0:1"] = false,
				["1:2:2:0:1000:item:4814:0"] = false,
				["1:4:6:0:1000:empty:0:1"] = false,
				["1:2:2:0:1000:empty:0:1"] = false,
				["1:4:5:0:1000:empty:0:1"] = false,
				["1:1:10:0:1000:item:117:0"] = false,
				["1:1:6:0:1000:empty:0:1"] = false,
				["1:3:2:0:1000:empty:0:1"] = false,
				["1:4:5:0:1000:item:2778:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0"] = false,
				["1:1:11:0:1000:item:1251:0"] = false,
				["1:3:4:0:1000:item:3169:0"] = false,
				["1:1:13:0:1000:item:3220:0"] = false,
			},
			["version"] = 30961,
		},
		["option"] = {
			["sort"] = {
				["method"] = {
					["data"] = {
						[9998] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								nil, -- [5]
								nil, -- [6]
								nil, -- [7]
								{
									["key"] = "slottype",
								}, -- [8]
								{
									["key"] = "expansion",
								}, -- [9]
								{
									["key"] = "itemstatlevel",
								}, -- [10]
								{
									["key"] = "id",
								}, -- [11]
								{
									["key"] = "itemuselevel",
								}, -- [12]
								{
									["key"] = "vendorprice",
								}, -- [13]
								{
									["key"] = "itemage",
								}, -- [14]
								{
									["key"] = "itemtype",
								}, -- [15]
							},
						},
						[9995] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								{
									["key"] = "slottype",
								}, -- [3]
								{
									["key"] = "expansion",
								}, -- [4]
								{
									["key"] = "itemstatlevel",
								}, -- [5]
								{
									["key"] = "id",
								}, -- [6]
								{
									["key"] = "itemuselevel",
								}, -- [7]
								{
									["key"] = "vendorprice",
								}, -- [8]
								{
									["key"] = "itemage",
								}, -- [9]
								{
									["key"] = "itemtype",
								}, -- [10]
								{
									["key"] = "category",
								}, -- [11]
								{
									["key"] = "location",
								}, -- [12]
								{
									["key"] = "name",
								}, -- [13]
								{
									["key"] = "count",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9999] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								{
									["key"] = "slottype",
								}, -- [3]
								{
									["key"] = "expansion",
								}, -- [4]
								{
									["key"] = "itemstatlevel",
								}, -- [5]
								{
									["key"] = "id",
								}, -- [6]
								{
									["key"] = "itemuselevel",
								}, -- [7]
								{
									["key"] = "vendorprice",
								}, -- [8]
								{
									["key"] = "itemage",
								}, -- [9]
								{
									["key"] = "itemtype",
								}, -- [10]
								{
									["key"] = "category",
								}, -- [11]
								{
									["key"] = "location",
								}, -- [12]
								{
									["key"] = "name",
								}, -- [13]
								{
									["key"] = "count",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9996] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								{
									["key"] = "slottype",
								}, -- [5]
								{
									["key"] = "expansion",
								}, -- [6]
								{
									["key"] = "itemstatlevel",
								}, -- [7]
								{
									["key"] = "id",
								}, -- [8]
								{
									["key"] = "itemuselevel",
								}, -- [9]
								{
									["key"] = "itemage",
								}, -- [10]
								{
									["key"] = "itemtype",
								}, -- [11]
								{
									["key"] = "category",
								}, -- [12]
								{
									["key"] = "location",
								}, -- [13]
								{
									["key"] = "name",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9993] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								{
									["key"] = "slottype",
								}, -- [3]
								{
									["key"] = "expansion",
								}, -- [4]
								{
									["key"] = "itemstatlevel",
								}, -- [5]
								{
									["key"] = "id",
								}, -- [6]
								{
									["key"] = "itemuselevel",
								}, -- [7]
								{
									["key"] = "vendorprice",
								}, -- [8]
								{
									["key"] = "itemage",
								}, -- [9]
								{
									["key"] = "itemtype",
								}, -- [10]
								{
									["key"] = "category",
								}, -- [11]
								{
									["key"] = "location",
								}, -- [12]
								{
									["key"] = "name",
								}, -- [13]
								{
									["key"] = "count",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9997] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								{
									["key"] = "slottype",
								}, -- [5]
								{
									["key"] = "expansion",
								}, -- [6]
								{
									["key"] = "itemstatlevel",
								}, -- [7]
								{
									["key"] = "id",
								}, -- [8]
								{
									["key"] = "itemuselevel",
								}, -- [9]
								{
									["key"] = "vendorprice",
								}, -- [10]
								{
									["key"] = "itemage",
								}, -- [11]
								{
									["key"] = "itemtype",
								}, -- [12]
								{
									["key"] = "category",
								}, -- [13]
								{
									["key"] = "location",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
						[9994] = {
							["order"] = {
								nil, -- [1]
								nil, -- [2]
								nil, -- [3]
								nil, -- [4]
								{
									["key"] = "slottype",
								}, -- [5]
								{
									["key"] = "expansion",
								}, -- [6]
								{
									["key"] = "itemstatlevel",
								}, -- [7]
								{
									["key"] = "id",
								}, -- [8]
								{
									["key"] = "itemuselevel",
								}, -- [9]
								{
									["key"] = "vendorprice",
								}, -- [10]
								{
									["key"] = "itemage",
								}, -- [11]
								{
									["key"] = "itemtype",
								}, -- [12]
								{
									["key"] = "category",
								}, -- [13]
								{
									["key"] = "location",
								}, -- [14]
								{
									["key"] = "quality",
								}, -- [15]
							},
						},
					},
				},
			},
			["restack"] = {
				["blizzard"] = false,
			},
			["tooltip"] = {
				["battlepet"] = {
					["enable"] = false,
				},
			},
			["profile"] = {
				["data"] = {
					[1000] = {
						["location"] = {
							{
								["anchor"] = {
									["b"] = 347.6671447753906,
									["t"] = 676.667236328125,
									["l"] = 1021.557189941406,
									["r"] = 1705.557250976563,
								},
								["container"] = {
									["height"] = 151,
									["width"] = 684,
								},
							}, -- [1]
							[3] = {
							},
						},
					},
					[9999] = {
						["location"] = {
							[3] = {
							},
						},
					},
				},
			},
			["design"] = {
				["data"] = {
					[9999] = {
					},
					[9998] = {
					},
					[9997] = {
						["bar"] = {
							["data"] = {
								{
									["sort"] = {
									},
									["name"] = {
										["text"] = "",
										["custom"] = 1,
										["colour"] = {
											["r"] = 1,
											["g"] = 1,
											["b"] = 1,
										},
									},
									["background"] = {
										["custom"] = 1,
										["colour"] = {
											["a"] = 0.4,
											["r"] = 0,
											["g"] = 0,
											["b"] = 0.4,
										},
									},
									["border"] = {
										["custom"] = 1,
										["colour"] = {
											["r"] = 0.3,
											["g"] = 0.3,
											["b"] = 0.3,
										},
									},
									["width"] = {
										["min"] = 0,
									},
								}, -- [1]
							},
						},
					},
				},
			},
			["updatetimer"] = {
				["EVENT_ARKINV_VAULT_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_QUEST_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_LDB_CURRENCY_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_TRANSMOG_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_VAULT_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_LDB_MOUNT_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_COLLECTION_CURRENCY_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_BAG_RESCAN_BUCKET"] = {
				},
				["EVENT_ARKINV_MAIL_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_LOCATION_SCANNED_BUCKET"] = {
				},
				["EVENT_ARKINV_COLLECTION_REPUTATION_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_INVENTORY_CHANGE_BUCKET"] = {
				},
				["EVENT_ARKINV_LDB_REPUTATION_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_AUCTION_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_AUCTION_UPDATE_MASSIVE_BUCKET"] = {
				},
				["EVENT_ARKINV_BAG_UPDATE_BUCKET"] = {
				},
				["EVENT_ARKINV_BAG_UPDATE_COOLDOWN_BUCKET"] = {
				},
				["EVENT_ARKINV_BANK_LEAVE_BUCKET"] = {
				},
				["EVENT_ARKINV_VOID_UPDATE_BUCKET"] = {
				},
			},
			["version"] = 30961,
			["transmog"] = {
				["enable"] = false,
			},
		},
	},
	["profileKeys"] = {
		["特變電工 - 玉石礦坑"] = "Default",
	},
}
