
AtlasLootClassicDB = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["global"] = {
		["__addonrevision"] = 3010003,
	},
	["profiles"] = {
		["急翔如溢 - 伊弗斯"] = {
			["GUI"] = {
				["selected"] = {
					nil, -- [1]
					"TheDeadmines", -- [2]
					nil, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["特變電工 - 玉石礦坑"] = {
			["GUI"] = {
				["selected"] = {
					nil, -- [1]
					"Ragefire", -- [2]
					nil, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["冰火倆重天 - 伊弗斯"] = {
		},
		["冰火兩重天 - 特雷姆斯"] = {
			["GUI"] = {
				["point"] = {
					nil, -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					2.777725458145142, -- [4]
					3.647319681476802e-05, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"Ragefire", -- [2]
					nil, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["特變電工 - 伊弗斯"] = {
		},
	},
}
