
DataStore_CraftsDB = {
	["profileKeys"] = {
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["global"] = {
		["Characters"] = {
			["Default.玉石礦坑.特變電工"] = {
				["lastUpdate"] = 1637387394,
				["Professions"] = {
					["急救"] = {
						["Categories"] = {
							"消耗品", -- [1]
						},
						["Crafts"] = {
							"0|消耗品", -- [1]
							"2|1251", -- [2]
						},
					},
					["烹飪"] = {
						["Categories"] = {
							"消耗品", -- [1]
						},
						["Crafts"] = {
							"0|消耗品", -- [1]
							"1|2681", -- [2]
							"1|6888", -- [3]
							"1|2679", -- [4]
						},
					},
				},
			},
			["Default.伊弗斯.特變電工"] = {
				["lastUpdate"] = 1683082308,
			},
		},
	},
}
DataStore_CraftsRefDB = {
	["profileKeys"] = {
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["global"] = {
		["Reagents"] = {
			[1251] = "2589,1",
			[2679] = "2672,1",
			[2681] = "769,1",
			[6888] = "6889,1|2678,1",
		},
	},
}
