
DataStore_AgendaDB = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["global"] = {
		["Characters"] = {
			["Default.玉石礦坑.特變電工"] = {
				["lastUpdate"] = 1637387395,
			},
			["Default.伊弗斯.特變電工"] = {
				["lastUpdate"] = 1684421290,
			},
			["Default.伊弗斯.冰火倆重天"] = {
				["lastUpdate"] = 1686389830,
			},
			["Default.伊弗斯.急翔如溢"] = {
				["lastUpdate"] = 1693019663,
			},
			["Default.特雷姆斯.冰火兩重天"] = {
				["lastUpdate"] = 1696396023,
			},
		},
	},
}
