
DataStore_AuctionsDB = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["global"] = {
		["Characters"] = {
			["Default.特雷姆斯.冰火兩重天"] = {
				["lastUpdate"] = 1696171753,
				["lastVisitDate"] = "2023/10/01 22:48",
			},
			["Default.玉石礦坑.特變電工"] = {
				["lastUpdate"] = 1637246139,
				["lastVisitDate"] = "2021/11/18 22:35",
			},
			["Default.伊弗斯.急翔如溢"] = {
				["lastUpdate"] = 1690897733,
				["lastVisitDate"] = "2023/08/01 21:48",
			},
		},
	},
}
