
DataStore_InventoryDB = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["global"] = {
		["Characters"] = {
			["Default.玉石礦坑.特變電工"] = {
				["Inventory"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					"|cffffffff|Hitem:2575::::::::15:::::::::|h[紅色亞麻襯衣]|h|r", -- [4]
					"|cffffffff|Hitem:3151::::::::15:::::::::|h[坦克駕駛員軍用外衣]|h|r", -- [5]
					"|cffffffff|Hitem:9758::::::::15:::::::::|h[軍校腰帶]|h|r", -- [6]
					"|cff9d9d9d|Hitem:1735::::::::15:::::::::|h[用舊的鎖甲短褲]|h|r", -- [7]
					"|cffffffff|Hitem:9759::::::::15:::::::::|h[軍校長靴]|h|r", -- [8]
					"|cffffffff|Hitem:1182::::::::15:::::::::|h[黃銅護腕]|h|r", -- [9]
					"|cffffffff|Hitem:1360::::::::15:::::::::|h[暴風城鍊甲手套]|h|r", -- [10]
					nil, -- [11]
					nil, -- [12]
					nil, -- [13]
					nil, -- [14]
					"|cffffffff|Hitem:3070::::::::15:::::::::|h[徽記披風]|h|r", -- [15]
					"|cff1eff00|Hitem:6985::::::::15:::::::::|h[哈加德的劍]|h|r", -- [16]
					"|cff1eff00|Hitem:3160::::::::15:::::::::|h[鐵板圓盾]|h|r", -- [17]
					"|cffffffff|Hitem:15807::::::::15:::::::::|h[輕弩]|h|r", -- [18]
				},
				["averageItemLvl"] = 11,
				["lastUpdate"] = 1637387394,
			},
			["Default.伊弗斯.特變電工"] = {
				["Inventory"] = {
					[7] = "|cffffffff|Hitem:48::::::::1:::::::::|h[]|h|r",
					[8] = "|cffffffff|Hitem:47::::::::1:::::::::|h[]|h|r",
					[18] = "|cffffffff|Hitem:2947::::::::1:::::::::|h[]|h|r",
					[4] = "|cffffffff|Hitem:49::::::::1:::::::::|h[]|h|r",
					[16] = "|cffffffff|Hitem:2092::::::::1:::::::::|h[]|h|r",
				},
				["lastUpdate"] = 1684421290,
			},
			["Default.伊弗斯.冰火倆重天"] = {
				["Inventory"] = {
					[7] = "|cff9d9d9d|Hitem:1395::::::::2:::::::::|h[学徒短裤]|h|r",
					[8] = "|cffffffff|Hitem:55::::::::2:::::::::|h[学徒之靴]|h|r",
					[10] = "|cffffffff|Hitem:3275::::::::2:::::::::|h[麻布手套]|h|r",
					[5] = "|cff9d9d9d|Hitem:1380::::::::2:::::::::|h[磨损的长袍]|h|r",
					[4] = "|cffffffff|Hitem:6096::::::::2:::::::::|h[学徒衬衣]|h|r",
					[16] = "|cffffffff|Hitem:35::::::::2:::::::::|h[弯曲的法杖]|h|r",
					[9] = "|cff9d9d9d|Hitem:3365::::::::2:::::::::|h[磨损的护腕]|h|r",
				},
				["averageItemLvl"] = 3,
				["lastUpdate"] = 1686390496,
			},
			["Default.伊弗斯.急翔如溢"] = {
				["Inventory"] = {
					nil, -- [1]
					nil, -- [2]
					"|cffffffff|Hitem:2913::::::::30:::::::::|h[]|h|r", -- [3]
					"|cffffffff|Hitem:6117::::::::30:::::::::|h[]|h|r", -- [4]
					"|cffffffff|Hitem:1273::::::::30:::::::::|h[]|h|r", -- [5]
					"|cffffffff|Hitem:11229::::::::30:::::::::|h[]|h|r", -- [6]
					"|cffffffff|Hitem:6386::::::::30:::::::::|h[]|h|r", -- [7]
					"|cffffffff|Hitem:1446::::::::30:::::::::|h[]|h|r", -- [8]
					"|cffffffff|Hitem:6722::::::::30:::::::::|h[]|h|r", -- [9]
					"|cffffffff|Hitem:1303::::::::30:::::::::|h[]|h|r", -- [10]
					"|cffffffff|Hitem:4998::::::::30:::::::::|h[]|h|r", -- [11]
					"|cffffffff|Hitem:1319::::::::30:::::::::|h[]|h|r", -- [12]
					nil, -- [13]
					nil, -- [14]
					"|cffffffff|Hitem:9812::::::97:1682566912:30:::::::::|h[]|h|r", -- [15]
					"|cffffffff|Hitem:5815::::::::30:::::::::|h[]|h|r", -- [16]
				},
				["lastUpdate"] = 1693019663,
			},
			["Default.特雷姆斯.冰火兩重天"] = {
				["Inventory"] = {
					"|cff1eff00|Hitem:7432::::::781:1415903104:46:::::::::|h[夜枭之微光兜帽]|h|r", -- [1]
					"|cff0070dd|Hitem:7673::::::::46:::::::::|h[塔瓦斯德的魔法项链]|h|r", -- [2]
					"|cff1eff00|Hitem:9912::::::1964:349329152:46:::::::::|h[冰霜惩戒之皇家披肩]|h|r", -- [3]
					"|cffffffff|Hitem:2575::::::::46:::::::::|h[红色亚麻衬衣]|h|r", -- [4]
					"|cff0070dd|Hitem:9415::::::::46:::::::::|h[格瑞姆洛克的部族法衣]|h|r", -- [5]
					"|cff1eff00|Hitem:14235::::::773:2047579264:46:::::::::|h[夜枭之灰丝束腰]|h|r", -- [6]
					"|cff0070dd|Hitem:9407::::::::46:::::::::|h[石纹护腿]|h|r", -- [7]
					"|cff1eff00|Hitem:15697::::::::46:::::::::|h[科多兽窃贼之靴]|h|r", -- [8]
					"|cff1eff00|Hitem:11469::::::::46:::::::::|h[血环护腕]|h|r", -- [9]
					"|cff1eff00|Hitem:3759::::::::46:::::::::|h[隐居先知手套]|h|r", -- [10]
					"|cff1eff00|Hitem:11983::::::1017:2114999168:46:::::::::|h[巨鲸之七彩戒指]|h|r", -- [11]
					"|cff1eff00|Hitem:4535::::::::46:::::::::|h[铁炉堡纪念之戒]|h|r", -- [12]
					nil, -- [13]
					nil, -- [14]
					"|cff1eff00|Hitem:4732::::::::46:::::::::|h[秘文披风]|h|r", -- [15]
					"|cff0070dd|Hitem:9517::::::::46:::::::::|h[苍穹手杖]|h|r", -- [16]
					nil, -- [17]
					"|cff1eff00|Hitem:5249::::::::46:::::::::|h[燃火魔杖]|h|r", -- [18]
				},
				["averageItemLvl"] = 38.92857142857143,
				["lastUpdate"] = 1696396023,
			},
		},
		["Guilds"] = {
			["Default.特雷姆斯.吃席第壹堂會"] = {
				["Members"] = {
					["猎灵王"] = {
						["averageItemLvl"] = 11,
					},
				},
			},
			["Default.伊弗斯.俺泽拉斯大陆一丨一丨一我的家"] = {
				["Members"] = {
					["急翔如溢"] = {
						["averageItemLvl"] = 19,
					},
				},
			},
			["Default.玉石礦坑.四濟帝國"] = {
				["Members"] = {
					["特變電工"] = {
						["averageItemLvl"] = 10,
					},
				},
			},
			["Default.特雷姆斯.啾啾家族"] = {
				["Members"] = {
					["刀鋒之舞"] = {
						["averageItemLvl"] = 7,
					},
					["白牧靈"] = {
						["averageItemLvl"] = 32,
					},
					["池田瑛紗"] = {
						["averageItemLvl"] = 46,
					},
					["白牧伊"] = {
						["averageItemLvl"] = 16,
					},
					["猎火"] = {
						["averageItemLvl"] = 3,
					},
					["無限火力"] = {
						["averageItemLvl"] = 10,
					},
					["守望先鋒"] = {
						["averageItemLvl"] = 6,
					},
					["夢回神話"] = {
						["averageItemLvl"] = 6,
					},
					["白牧瀧"] = {
						["averageItemLvl"] = 14,
					},
					["時空神話"] = {
						["averageItemLvl"] = 9,
					},
				},
			},
		},
	},
}
