
DataStore_MailsDB = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["global"] = {
		["Characters"] = {
			["Default.玉石礦坑.特變電工"] = {
				["lastUpdate"] = 1637258284,
				["lastVisitDate"] = "2021/11/19 01:58",
			},
			["Default.伊弗斯.急翔如溢"] = {
				["lastUpdate"] = 1690708730,
				["lastVisitDate"] = "2023/07/30 17:18",
			},
		},
	},
}
