
MEETINGHORN_DB = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
		["查理芒格 - 生命烈焰"] = "查理芒格 - 生命烈焰",
		["诺安蔡嵩松 - 生命烈焰"] = "诺安蔡嵩松 - 生命烈焰",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["红杉沈南鹏 - 生命烈焰"] = "红杉沈南鹏 - 生命烈焰",
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
	},
	["profiles"] = {
		["急翔如溢 - 伊弗斯"] = {
		},
		["查理芒格 - 生命烈焰"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -21.6666259765625,
					["x"] = 224.3331909179688,
					["scale"] = 1,
				},
			},
		},
		["诺安蔡嵩松 - 生命烈焰"] = {
		},
		["特變電工 - 伊弗斯"] = {
		},
		["冰火兩重天 - 特雷姆斯"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -15,
					["x"] = 96.11065673828125,
					["scale"] = 1,
				},
			},
		},
		["红杉沈南鹏 - 生命烈焰"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -76.666748046875,
					["x"] = 314.44384765625,
					["scale"] = 1,
				},
			},
		},
		["冰火倆重天 - 伊弗斯"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -3.3333740234375,
					["x"] = -4.999969482421875,
					["scale"] = 1,
				},
			},
		},
	},
}
