
MEETINGHORN_DB = {
	["profileKeys"] = {
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
	},
	["profiles"] = {
		["冰火倆重天 - 伊弗斯"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -3.3333740234375,
					["x"] = -4.999969482421875,
					["scale"] = 1,
				},
			},
		},
		["冰火兩重天 - 特雷姆斯"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -15,
					["x"] = 96.11065673828125,
					["scale"] = 1,
				},
			},
		},
		["特變電工 - 伊弗斯"] = {
		},
		["急翔如溢 - 伊弗斯"] = {
		},
	},
}
