
TomTomDB = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "Default",
		["查理芒格 - 生命烈焰"] = "Default",
		["特變電工 - 玉石礦坑"] = "Default",
		["诺安蔡嵩松 - 生命烈焰"] = "Default",
		["冰火倆重天 - 伊弗斯"] = "Default",
		["冰火兩重天 - 特雷姆斯"] = "Default",
		["红杉沈南鹏 - 生命烈焰"] = "Default",
		["特變電工 - 伊弗斯"] = "Default",
	},
	["profiles"] = {
		["Default"] = {
			["arrow"] = {
				["position"] = {
					"CENTER", -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					-11.11126708984375, -- [4]
					-289.4445495605469, -- [5]
				},
			},
			["block"] = {
				["position"] = {
					"TOPRIGHT", -- [1]
					nil, -- [2]
					"TOPRIGHT", -- [3]
					-50.00051879882813, -- [4]
					-202.2221984863281, -- [5]
				},
			},
		},
	},
}
TomTomWaypoints = nil
TomTomWaypointsM = {
	["profileKeys"] = {
		["急翔如溢 - 伊弗斯"] = "急翔如溢 - 伊弗斯",
		["查理芒格 - 生命烈焰"] = "查理芒格 - 生命烈焰",
		["特變電工 - 玉石礦坑"] = "特變電工 - 玉石礦坑",
		["诺安蔡嵩松 - 生命烈焰"] = "诺安蔡嵩松 - 生命烈焰",
		["冰火倆重天 - 伊弗斯"] = "冰火倆重天 - 伊弗斯",
		["冰火兩重天 - 特雷姆斯"] = "冰火兩重天 - 特雷姆斯",
		["红杉沈南鹏 - 生命烈焰"] = "红杉沈南鹏 - 生命烈焰",
		["特變電工 - 伊弗斯"] = "特變電工 - 伊弗斯",
	},
	["profiles"] = {
		["急翔如溢 - 伊弗斯"] = {
		},
		["查理芒格 - 生命烈焰"] = {
		},
		["特變電工 - 玉石礦坑"] = {
		},
		["诺安蔡嵩松 - 生命烈焰"] = {
		},
		["冰火倆重天 - 伊弗斯"] = {
		},
		["冰火兩重天 - 特雷姆斯"] = {
		},
		["红杉沈南鹏 - 生命烈焰"] = {
		},
		["特變電工 - 伊弗斯"] = {
		},
	},
}
