
DataStore_ReputationsDB = {
	["profileKeys"] = {
		["气不气菜鸡 - 鱼人摩洛克"] = "气不气菜鸡 - 鱼人摩洛克",
		["气不气菜鸡 - 黑龙费尔默"] = "气不气菜鸡 - 黑龙费尔默",
	},
	["global"] = {
		["Characters"] = {
			["Default.鱼人摩洛克.气不气菜鸡"] = {
				["lastUpdate"] = 1653123784,
				["Factions"] = {
					[8] = 4000,
					[6] = 500,
					[7] = 500,
					[5] = 500,
				},
			},
			["Default.黑龙费尔默.气不气菜鸡"] = {
				["lastUpdate"] = 1653200275,
				["Factions"] = {
					[8] = 500,
					[6] = 3100,
					[7] = 4000,
					[5] = 3100,
				},
			},
		},
	},
}
