
DataStore_SpellsDB = {
	["profileKeys"] = {
		["气不气菜鸡 - 黑龙费尔默"] = "气不气菜鸡 - 黑龙费尔默",
		["气不气菜鸡 - 鱼人摩洛克"] = "气不气菜鸡 - 鱼人摩洛克",
		["婷烂币 - 黑龙费尔默"] = "婷烂币 - 黑龙费尔默",
	},
	["global"] = {
		["Characters"] = {
			["Default.黑龙费尔默.气不气菜鸡"] = {
				["lastUpdate"] = 1657358757,
				["Spells"] = {
					["综合"] = {
						"107|被动", -- [1]
						"81|被动", -- [2]
						"6603|", -- [3]
					},
					["武器"] = {
						"2457|", -- [1]
						"78|等级 1", -- [2]
					},
				},
				["SpellTabs"] = {
					"综合", -- [1]
					"武器", -- [2]
				},
			},
			["Default.鱼人摩洛克.气不气菜鸡"] = {
				["lastUpdate"] = 1653123784,
				["SpellTabs"] = {
					"综合", -- [1]
					"武器", -- [2]
				},
			},
			["Default.黑龙费尔默.婷烂币"] = {
				["lastUpdate"] = 1657439399,
				["SpellTabs"] = {
					"综合", -- [1]
					"武器", -- [2]
				},
			},
		},
	},
}
